#Thu Jan 21 02:08:21 CST 2021
EXEL070=La version de l'image ROM est erron\u00E9e
EXEL079=\  -Xscmx<x>       r\u00E9gler la taille du nouveau cache de classe partag\u00E9 \u00E0 <x>
J9VM151=Impossible d'ouvrir la biblioth\u00E8que jimage
J9VM150=-Xscsoftmx n'est pas pris en compte en l'absence de -Xshareclasses
J9VM153=Basculement vers le lecteur jimage interne car la JVM ne peut pas utiliser la biblioth\u00E8que jimage
EXEL071=Nom de la classe principale introuvable
J9VM152=Impossible de consulter le symbole %s dans la biblioth\u00E8que jimage
EXEL072=Erreur de d\u00E9marrage de la VM \: M\u00E9moire insuffisante
J9VM155=Valeur incorrecte pour -Xpatch ; le chemin d'acc\u00E8s au correctif n'est pas indiqu\u00E9 dans la propri\u00E9t\u00E9 %s\=%s
EXEL073=Erreur interne de la VM \: Echec de la cr\u00E9ation de la VM Java
J9VM154=Valeur incorrecte pour -Xpatch ; la valeur de la propri\u00E9t\u00E9 %s n'est pas indiqu\u00E9e
EXEL074=
J9VM157=La classe %2$.*1$s(%3$s) ne peut pas acc\u00E9der \u00E0 la classe %5$.*4$s(%6$s) car le module %3$s ne lit pas le module %6$s
EXEL075=\  -Xquickstart    am\u00E9liorer le temps de d\u00E9marrage en diff\u00E9rant les optimisations
J9VM156=-XX\:SharedCacheHardLimit\= n'est pas pris en compte en l'absence de -Xshareclasses
EXEL076=JIT  - %s\n
J9VM159=Erreur \: le chemin d'acc\u00E8s aux modules doit \u00EAtre sp\u00E9cifi\u00E9 pour %s
EXEL077=\  -Xssi<x>        r\u00E9gler l'incr\u00E9ment de pile de l'unit\u00E9 d'ex\u00E9cution Java \u00E0 <x>
J9VM158=La classe %2$.*1$s(%3$s) ne peut pas acc\u00E9der \u00E0 la classe %5$.*4$s(%6$s) car le module %6$s n'exporte pas le package %7$s vers le module %3$s
EXEL078=\  -Xshareclasses[\:options]  Activer le partage de donn\u00E9es de classe (utiliser l'aide pour plus de d\u00E9tails)\n
J9VM149=%s n'est plus pris en charge. Veuillez ajouter les biblioth\u00E8ques/fichiers .jar n\u00E9cessaires au chemin d'acc\u00E8s aux classes.
EXEL068=Erreur interne de la VM \: Echec de l'initialisation de l'\u00E9l\u00E9ment de tableau pour %s
EXEL069=Image ROM introuvable
J9VM140=L'appelant n'est pas annot\u00E9 comme \u00E9tant @sun.reflect.CallerSensitive.
J9VM142=L'option de ligne de commande -Xrealtime n'est pas prise en charge dans cette version d'IBM SDK.
EXEL060=Erreur interne de la VM \: Echec de la cr\u00E9ation du tableau d'octets pour le nom de classe %s
J9VM141=m\u00E9thodes par d\u00E9faut conflictuelles pour '%2$.*1$s%4$.*3$s' dans %6$.*5$s \u00E0 partir des classes [%7$s]
EXEL061=Erreur interne de la VM \: Echec de la cr\u00E9ation de java/lang/String pour le nom de classe %s
J9VM144=trop de param\u00E8tres \: 255 + 1
EXEL062=Erreur VM interne \: M\u00E9moire insuffisante pour la conversion de la cha\u00EEne en caract\u00E8res UTF du nom de classe %s
J9VM143=L'option de ligne de commande %s n'est pas prise en charge dans cette version d'IBM SDK.
EXEL063=M\u00E9thode main() non impl\u00E9ment\u00E9e dans la classe %s
J9VM146=invokeinterface de la m\u00E9thode non publique '%4$.*3$s%6$.*5$s' dans %2$.*1$s
EXEL064=La m\u00E9thode main doit \u00EAtre d\u00E9clar\u00E9e en tant que m\u00E9thode 'public', 'static' et 'void'.
J9VM145=%s n'est pas pris en charge sous z/OS.
EXEL065=Erreur interne de la VM \: Echec de la cr\u00E9ation du tableau d'arguments
J9VM148=%s n'est plus pris en charge. Le m\u00E9canisme de d\u00E9rogation aux normes approuv\u00E9es n'est possible que par l'interm\u00E9diaire de modules extensibles (upgradable).
EXEL066=Erreur interne de la VM \: \: Echec de la cr\u00E9ation du tableau d'octets pour l'argument %s
J9VM147=Impossible de connecter l'unit\u00E9 d'ex\u00E9cution en cours
EXEL067=Erreur interne de la VM \: Echec de la cr\u00E9ation de java/lang/String pour l'argument %s
SMAP000=
EXEL090=\  -Xscmaxaot<x>   r\u00E9gler l'espace maximal du cache de classe partag\u00E9 autoris\u00E9 pour les donn\u00E9es AOT \u00E0 <x>
EXEL091=\n  -Xcheck[\:option[\:...]]  contr\u00F4le les v\u00E9rifications ; utilisez -Xcheck\:help pour plus de d\u00E9tails
EXEL092=\n  -Xdump[\:option,...]  utiliser des vidages de contr\u00F4le ; -Xdump\:help pour plus d'informations
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP005=
J9VM171=Tentative de fixer le champ d'instance final %2$.*1$s.%4$.*3$s \u00E0 partir de la m\u00E9thode "%6$.*5$s" qui n'est pas <init>
J9VM170=Tentative de fixer le champ statique final %2$.*1$s.%4$.*3$s \u00E0 partir de la m\u00E9thode "%6$.*5$s" qui n'est pas <clinit>
J9VM173=La classe %2$.*1$s et son h\u00F4te de nich\u00E9e %4$.*3$s doivent avoir le m\u00EAme package.
J9VM172=La classe %2$.*1$s et son h\u00F4te de nich\u00E9e %4$.*3$s doivent avoir le m\u00EAme chargeur de classes.
J9VM175=Impossible de charger la biblioth\u00E8que %1$s requise par le module \: %2$s
EXEL093=Les options suivantes contr\u00F4lent la configuration globale de la MV \:
J9VM174=La classe %2$.*1$s doit \u00EAtre revendiqu\u00E9e par son h\u00F4te de nich\u00E9e %4$.*3$s
EXEL094=\  -Xcompressedrefs            utiliser des r\u00E9f\u00E9rences de tas compress\u00E9es
J9VM177=La classe %2$.*1$s doit \u00EAtre capable de charger son h\u00F4te de nich\u00E9e %4$.*3$s.
EXEL095=\  -Xrealtime                    utilisation des extensions temps r\u00E9el
J9VM176=violation de contrainte de chargement lors de la red\u00E9finition de la m\u00E9thode "%2$.*1$s.%4$.*3$s%6$.*5$s" pendant la cr\u00E9ation de la classe "%18$.*17$s" \: le chargeur "%8$.*7$s@%9$x" de la classe "%11$.*10$s" et le chargeur "%13$.*12$s@%14$x" de la classe "%16$.*15$s" ont des types diff\u00E9rents pour la signature de m\u00E9thode
EXEL096=\  -Xgcpolicy\:metronome         activer des extensions temps r\u00E9el
J9VM179=Module est sans nom.
EXEL097=\  -Xrealtime                      activer le temps r\u00E9el souple
J9VM178=Module est null.
EXEL098=\  -Xgcpolicy\:metronome           activer le temps r\u00E9el souple
EXEL099=\  -Xrealtime -Xnortsj             activer le temps r\u00E9el souple
EXEL080=java version "%s"
EXEL081=java version "%1$s/%2$s"
J9VM160=Erreur \: des modules doivent \u00EAtre sp\u00E9cifi\u00E9s pour %s
J9VM162=\t\u00E0 %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s)
J9VM161=\t\u00E0 %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s\:%9$u)
J9VM164=\t\u00E0 %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s)
EXEL082=\  -Xlp<x>         r\u00E9gler la taille de grande page \u00E0 <x>
J9VM163=\t\u00E0 %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s\:%8$u)
EXEL083=Impossible d'ouvrir le fichier \: %s
J9VM166=\t\u00E0 %2$.*1$s.%4$.*3$s (%5$.*6$s)
EXEL084=Impossible de faire une copie de sauvegarde du fichier \: %s
J9VM165=\t\u00E0 %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
EXEL085=\nATTENTION \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nATTENTION \: Utilisez plut\u00F4t "-jxe <chemin>".\n
J9VM168=
EXEL086=\n  -Xtrace[\:option,...]  contr\u00F4le les traces ; utilisez -Xtrace\:help pour plus de d\u00E9tails
J9VM167=Les optimisations de la r\u00E9cup\u00E9ration de place pour l'\u00E9tat de repos de la JVM ne sont pas prises en charge
EXEL087=\  -Xjni\:<options>               fixer les options JNI
EXEL088=
J9VM169=
EXEL089=\  -Xscminaot<x>   r\u00E9gler l'espace minimal du cache de classe partag\u00E9 r\u00E9serv\u00E9 aux donn\u00E9es AOT \u00E0 <x>
J9VM117=-Xitsn n'est pas pris en compte en l'absence de -Xshareclasses
J9VM116=noLockword \:%.*s
J9VM119=-Xscmaxjit n'est pas pris en compte en l'absence de -Xshareclasses
J9VM118=-Xscminjit n'est pas pris en compte en l'absence de -Xshareclasses
J9VM111=Option lockword non valide sp\u00E9cifi\u00E9e \:%s
J9VM110=Mode lockword non valide sp\u00E9cifi\u00E9 \:%s
J9VM113=-----------------------------
J9VM112=Configuration lockword
J9VM115=lockword \:%.*s
J9VM114=Mode lockword\=%s
J9VM106=Les options info, warn, error, vital et config peuvent \u00EAtre combin\u00E9es \u00E0 l'aide d'une ',' par exemple \:\n
J9VM105=-Xsyslog\:config            Consigne les messages de configuration de la machine virtuelle Java.\n
J9VM108=-Xsyslog\:info,warn,error\n
J9VM107=-Xsyslog\:error,warn
J9VM109=Syst\u00E8me d'exploitation non pris en charge (%s) \: Windows XP ou une version plus r\u00E9cente est requis.
J9VM100=-Xsyslog\:all               Consigne tous les messages de la machine virtuelle Java.
J9VM102=-Xsyslog\:warn              Consigne les messages d'avertissement de la machine virtuelle Java.
J9VM101=-Xsyslog\:info              Consigne les messages d'information de la machine virtuelle Java.
J9VM104=-Xsyslog\:vital             Consigne les messages critiques de la machine virtuelle Java. Cette option est activ\u00E9e par d\u00E9faut.
J9VM103=-Xsyslog\:error             Consigne les messages d'erreur de la machine virtuelle Java. Cette option est activ\u00E9e par d\u00E9faut.
J9VM139=
J9VM138=
J9VM131=Arr\u00EAt en cours du processus utilisant CEE3AB2() avec fin anormale %1$u, motif %2$u, nettoyage %3$u.
J9VM130=L'application a repris son ex\u00E9cution apr\u00E8s le traitement d'une condition irr\u00E9cup\u00E9rable et a ill\u00E9galement effectu\u00E9 un retour ou un rappel dans Java (code JIT)
J9VM133=La taille ulimit dure pour la m\u00E9moire syst\u00E8me est r\u00E9gl\u00E9e \u00E0 %d ; il se peut que les vidages syst\u00E8me soient tronqu\u00E9s.
J9VM132=Mode de mot de verrouillage sp\u00E9cifi\u00E9 non valide ; java/lang/Class et java/lang/String ne peuvent pas comporter de mots de verrouillage lorsque -Xtenant est pr\u00E9sent \: %s
J9VM135=Le param\u00E8tre /proc/sys/kernel/core_pattern "%s" indique que les vidages core doivent \u00EAtre dirig\u00E9s vers un programme externe. La JVM n'est peut-\u00EAtre pas en mesure de localiser les vidages core et de les renommer.
J9VM134=L'option syst\u00E8me fullcore est mise \u00E0 FALSE ; il se peut que les vidages syst\u00E8me soient tronqu\u00E9s.
J9VM137=La classe %2$.*1$s comporte des valeurs par d\u00E9faut conflictuelles pour la m\u00E9thode %4$.*3$s%6$.*5$s
J9VM136=Le r\u00E9glage /proc/sys/kernel/core_pattern "%s" sp\u00E9cifie une cha\u00EEne de format pour le renommage des vidages core. La JVM n'est peut-\u00EAtre pas en mesure de localiser les vidages core et de les renommer.
J9VM128=Espace de tas Java
J9VM127=La taille initiale du sous-allocateur 32 bits ne peut pas \u00EAtre r\u00E9gl\u00E9e \u00E0 z\u00E9ro.
J9VM129=L'application a repris son ex\u00E9cution apr\u00E8s le traitement d'une condition irr\u00E9cup\u00E9rable et a ill\u00E9galement effectu\u00E9 un retour ou un rappel dans Java
J9VM120=-Xscminjitdata n'est pas pris en compte en l'absence de -Xshareclasses
J9VM122=Echec de l'obtention de la plage d'adresses user32.dll requise pour -Xprotectcontiguous.
J9VM121=-Xscmaxjitdata n'est pas pris en compte en l'absence de -Xshareclasses
J9VM124=Impossible de d\u00E9finir la classe %.*s ; '%.*s' est un package de syst\u00E8me prot\u00E9g\u00E9
J9VM123=Tentative d'ex\u00E9cution sur un processeur non pris en charge, la machine virtuelle Java va prendre fin.
J9VM126=La taille d'engagement du sous-allocateur 32 bits ne peut pas \u00EAtre r\u00E9gl\u00E9e \u00E0 z\u00E9ro.
J9VM125=La taille d'engagement du sous-allocateur 32 bits est sup\u00E9rieure \u00E0 la taille initiale. Taille d'engagement \= %1$u, taille initiale \= %2$u.
SHRC802=Cache rempli \u00E0 %1$d%% \n
SHRC803=Activer au d\u00E9marrage la protection de m\u00E9moire des pages partiellement remplies.
SHRC804=La machine virtuelle Java a activ\u00E9 au d\u00E9marrage la protection des pages partielles du cache partag\u00E9, car le cache existant a \u00E9t\u00E9 cr\u00E9\u00E9 avec la protection des pages partielles activ\u00E9e au d\u00E9marrage.
SHRC805=La machine virtuelle Java n'a pas activ\u00E9 au d\u00E9marrage la protection des pages partiellement remplies du cache partag\u00E9.
SHRC800=Le cache partag\u00E9 est satur\u00E9. L'espace de donn\u00E9es AOT/JIT r\u00E9serv\u00E9 minimal et l'espace de donn\u00E9es AOT/JIT autoris\u00E9 maximal ainsi que la limite softmx ne peuvent plus \u00EAtre ajust\u00E9s.
SHRC801=Octets softmx                       %*c\= %d
SHRC806=Le cache partag\u00E9 persistant \u00E0 r\u00E9f\u00E9rences compress\u00E9es "%1$s" a \u00E9t\u00E9 d\u00E9truit. Utilisez l'option -Xnocompressedrefs si vous voulez d\u00E9truire un cache \u00E0 r\u00E9f\u00E9rences non compress\u00E9es.
SHRC807=Le cache partag\u00E9 persistant \u00E0 r\u00E9f\u00E9rences non compress\u00E9es "%1$s" a \u00E9t\u00E9 d\u00E9truit. Utilisez l'option -Xcompressedrefs si vous voulez d\u00E9truire un cache \u00E0 r\u00E9f\u00E9rences compress\u00E9es.
SHRC808=Le cache partag\u00E9 \u00E0 r\u00E9f\u00E9rences compress\u00E9es "%s" est d\u00E9truit. Utilisez l'option -Xnocompressedrefs si vous voulez d\u00E9truire un cache \u00E0 r\u00E9f\u00E9rences non compress\u00E9es.
SHRC809=Le cache partag\u00E9 \u00E0 r\u00E9f\u00E9rences non compress\u00E9es "%s" est d\u00E9truit. Utilisez l'option -Xcompressedrefs si vous voulez d\u00E9truire un cache \u00E0 r\u00E9f\u00E9rences compress\u00E9es.
DUMP001=Ev\u00E9nement de vidage non reconnu \: ...%s
DUMP000=Option de vidage non reconnue \: -Xdump\:%s
DUMP003=Agent de vidage non reconnu \: %s
DUMP002=Jeton non reconnu \: %%%1$c
DUMP012=Erreur dans le vidage %1$s \: %2$s
DUMP011=Le vidage %1$s a cr\u00E9\u00E9 le processus %2$d
DUMP014=Action de machine virtuelle non reconnue \: ...%s
DUMP013=Ev\u00E9nement de vidage trait\u00E9 "%1$s", d\u00E9tails "%3$.*2$s".
DUMP010=Vidage %1$s \u00E9crit dans %2$s
SHRC824=SUGGEST. DEMARRAGE - OPTIONS EN DETAIL \: %1$zu DATA1 \: %2$zu DATA2 \: %3$zu
DUMP009=Le vidage %s est indisponible
SHRC825=\t startuphint       Affiche seulement les types sugg\u00E9r\u00E9s au d\u00E9marrage dans le cache partag\u00E9.
DUMP008=utilisation de '%s'
SHRC826=Octets sugg\u00E9r\u00E9s au d\u00E9marrage                  %*c\= %d
SHRC827=\# Suggestions au d\u00E9marrage                    %*c\= %d
SHRC820=D\u00E9sactiver la mise en cache des classes charg\u00E9es par le chargeur de classes d'amor\u00E7age.
DUMP005=Outil externe manquant
SHRC821=D\u00E9sactiver la mise en cache des classes charg\u00E9es par les chargeurs de classes autres que d'amor\u00E7age. Cette option active \u00E9galement l'option "nonfatal".
DUMP004=Nom de fichier manquant
SHRC822=Ne pas d\u00E9marrer le cache partag\u00E9 si une erreur se produit.
DUMP007=JVM demandant un vidage %1$s en utilisant '%2$s'
SHRC823=%1$d \: 0x%2$p CLE SUGGEST. DEMARRAGE \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
DUMP006=Traitement de l'\u00E9v\u00E9nement de vidage "%1$s", d\u00E9tails "%3$.*2$s" - Veuillez patienter.
SHRC828=Le chemin de r\u00E9pertoire du cache partag\u00E9 est trop long.
SHRC829=Impossible d'utiliser le r\u00E9pertoire de base de l'utilisateur comme r\u00E9pertoire de cache partag\u00E9 par d\u00E9faut. Impossible d'obtenir le r\u00E9pertoire de base. D\u00E9signez un autre r\u00E9pertoire via la variable d'environnement "HOME" ou l'option de ligne de commande "cacheDir\=", ou bien corrigez le r\u00E9pertoire de base dans l'entr\u00E9e du fichier de mots de passe.
DUMP023=La pr\u00E9paration du tas demand\u00E9 n'a pas \u00E9t\u00E9 ex\u00E9cut\u00E9e, car l'acc\u00E8s exclusif n'a pas \u00E9t\u00E9 demand\u00E9 ou n'a pas pu \u00EAtre obtenu.
DUMP022=Le compactage du tas demand\u00E9 n'a pas \u00E9t\u00E9 ex\u00E9cut\u00E9, car l'acc\u00E8s exclusif n'a pas \u00E9t\u00E9 demand\u00E9 ou n'a pas pu \u00EAtre obtenu.
DUMP025=Echec IEATDUMP pour DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=Plusieurs vidages de tas ont \u00E9t\u00E9 demand\u00E9s, mais %%id est absent dans l'\u00E9tiquette du fichier \: les vidages vont \u00EAtre remplac\u00E9s
DUMP021=Le vidage de tas demand\u00E9 n'a pas \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9, car aucun acc\u00E8s exclusif n'a \u00E9t\u00E9 demand\u00E9 ou n'a pu \u00EAtre obtenu.
DUMP020=Le vidage %s a \u00E9t\u00E9 \u00E9crit
SHRC813=Le nombre total d'octets non stock\u00E9s en raison de la valeur de -Xscsoftmx est %u. Le nombre d'octets AOT non stock\u00E9s en raison de la valeur de -Xscmaxaot est %u. Le nombre d'octets JIT non stock\u00E9s en raison de la valeur de -Xscmaxjitdata est %u.
SHRC814=\t stale           Imprime toutes les entr\u00E9es p\u00E9rim\u00E9es dans le cache partag\u00E9.
DUMP019=Machine virtuelle Java demandant un vidage %s
SHRC815=Octets p\u00E9rim\u00E9s                     %*c\= %u
SHRC816=La valeur de %s est sup\u00E9rieure \u00E0 la taille du cache partag\u00E9 ; une valeur \u00E9gale \u00E0 la taille du cache partag\u00E9 lui a donc \u00E9t\u00E9 attribu\u00E9e
DUMP016=Abandon en cours \: Impossible de cr\u00E9er le fichier (%s)
SHRC810=L'instantan\u00E9 du cache partag\u00E9 \u00E0 r\u00E9f\u00E9rences compress\u00E9es "%s" est d\u00E9truit. Utilisez l'option -Xnocompressedrefs si vous voulez d\u00E9truire un instantan\u00E9 de cache \u00E0 r\u00E9f\u00E9rences non compress\u00E9es.
DUMP015=Abandon en cours \: Impossible d'ouvrir ou de lire (%s)
SHRC811=L'instantan\u00E9 du cache partag\u00E9 \u00E0 r\u00E9f\u00E9rences non compress\u00E9es "%s" est d\u00E9truit. Utilisez l'option -Xcompressedrefs si vous voulez d\u00E9truire un instantan\u00E9 de cache \u00E0 r\u00E9f\u00E9rences compress\u00E9es.
DUMP018=L'\u00E9v\u00E9nement demand\u00E9 n'est pas disponible \: lancez l'ex\u00E9cution avec l'option -Xdump\:dynamic
SHRC812=Fonction                             \= %s
DUMP017=Abandon en cours \: Impossible de compresser le fichier (%s)
SHRC817=La valeur de %s est sup\u00E9rieure \u00E0 la taille du cache partag\u00E9 ; une valeur illimit\u00E9e lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC818=Le nombre total d'octets non stock\u00E9s en raison de la valeur de la limite de taille souple du cache partag\u00E9 est %u. Le nombre d'octets AOT non stock\u00E9s en raison de la valeur de -Xscmaxaot est %u. Le nombre d'octets JIT non stock\u00E9s en raison de la valeur de -Xscmaxjitdata est %u.
SHRC819=Impossible de d\u00E9marrer le cache partag\u00E9. Le cache partag\u00E9 existant a \u00E9t\u00E9 cr\u00E9\u00E9 par une g\u00E9n\u00E9ration JVM diff\u00E9rente et ne correspond pas \u00E0 la machine virtuelle Java actuelle.
SHRC840=Impossible de d\u00E9marrer le cache partag\u00E9.
SHRC841=Indiquez le num\u00E9ro de couche sup\u00E9rieure. Cr\u00E9ez une couche de cache partag\u00E9 si la couche indiqu\u00E9e n'existe pas.
SHRC846=\nStatistiques actuelles pour la couche sup\u00E9rieure du cache "%s" \: \n
SHRC847=couche de cache                         %*.c\= %d
SHRC848=\nStatistiques actuelles pour toutes les couches du cache "%s" \: \n
J9VM191=%2$.*1$s n'est pas visible
SHRC849=Imprimez le r\u00E9capitulatif des statistiques de cache \u00E0 partir de la couche sup\u00E9rieure uniquement. Utilisez printTopLayerStats\=help pour afficher les options disponibles.
J9VM190=%2$.*1$s est une superclasse. Il ne peut pas s'agir d'une interface.
SHRC842=Cr\u00E9ez une nouvelle couche de cache partag\u00E9.
J9VM193=Depuis l'introduction de Java 13, les options -Xverify\:none et -noverify ont \u00E9t\u00E9 d\u00E9pr\u00E9ci\u00E9es. Leur retrait d\u00E9finitif \u00E9tant pr\u00E9vu dans une \u00E9dition future, elles risquent de ne plus \u00EAtre accept\u00E9es.
SHRC843=Le num\u00E9ro de couche %d d\u00E9tect\u00E9 pour "%s" n'est pas valide. Le num\u00E9ro de couche doit \u00EAtre inf\u00E9rieur \u00E0 %d.
J9VM192=%2$.*1$s n'est pas une interface
SHRC844=Le num\u00E9ro de couche %d n'est pas valide. La couche sup\u00E9rieure existante est %d. Le nouveau num\u00E9ro de couche doit \u00EAtre %d.
J9VM195=Matrice de package null.
SHRC845=Ne v\u00E9rifiez pas l'espace disque libre avant de cr\u00E9er un cache persistant.
J9VM194=Relation de chargement de classe non valide pour l'enfant \: %2$.*1$s, parent \: %4$.*3$s
J9VM197=%1$s n'est pas pris en charge avec %2$s.
J9VM196=Cha\u00EEne de package null.
J9VM199=la classe %2$.*1$s ne peut pas h\u00E9riter des valeurs de son interface parente scell\u00E9e.
J9VM198=la classe %2$.*1$s ne peut pas h\u00E9riter des valeurs de sa classe parente scell\u00E9e.
SHRC830=Impossible d'utiliser le r\u00E9pertoire de base de l'utilisateur comme r\u00E9pertoire de cache partag\u00E9 par d\u00E9faut. Le chemin est trop long. Impossible d'obtenir le r\u00E9pertoire de base. D\u00E9signez un autre r\u00E9pertoire via la variable d'environnement "HOME" ou l'option de ligne de commande "cacheDir\=", ou bien corrigez le r\u00E9pertoire de base dans l'entr\u00E9e du fichier de mots de passe.
SHRC835=V\u00E9rifier les horodatages des fichiers jar/zip d'URL \u00E0 chaque chargement de classe autre que d'amor\u00E7age.
SHRC836=D\u00E9truire toutes les couches de cache partag\u00E9 ayant le m\u00EAme nom (utiliser le param\u00E8tre de nom ou la valeur par d\u00E9faut)
SHRC837=Echec de l'allocation d'un descripteur de cache
J9VM180=Nom de module non valide.
SHRC838=Impossible de d\u00E9marrer le cache partag\u00E9. La modification d'un cache partag\u00E9 de couche inf\u00E9rieure a \u00E9t\u00E9 d\u00E9tect\u00E9e. ID de cache unique attendu \: %s
SHRC831=Impossible d'utiliser le r\u00E9pertoire de base de l'utilisateur comme r\u00E9pertoire de cache partag\u00E9 par d\u00E9faut. Il fait partie d'un syst\u00E8me de fichiers r\u00E9seau (NFS). Impossible d'obtenir le r\u00E9pertoire de base. D\u00E9signez un autre r\u00E9pertoire via la variable d'environnement "HOME" ou l'option de ligne de commande "cacheDir\=", ou bien corrigez le r\u00E9pertoire de base dans l'entr\u00E9e du fichier de mots de passe.
J9VM182=Seul un chargeur de classes d'amor\u00E7age ou de plateforme peut d\u00E9finir le package java ou java.*.
SHRC832=Impossible d'utiliser le r\u00E9pertoire de base de l'utilisateur comme r\u00E9pertoire de cache partag\u00E9 par d\u00E9faut. Code d'erreur \: %1$d.
J9VM181=Seul un chargeur de classes d'amor\u00E7age peut d\u00E9finir le module java.base.
SHRC833=Impossible d'allouer la m\u00E9moire native n\u00E9cessaire \u00E0 l'obtention du r\u00E9pertoire du cache partag\u00E9.
J9VM184=classe incorrecte \: %2$.*1$s \: le champ d'instance Qtype n'est pas un type valeur
SHRC834=Minimiser le contr\u00F4le des horodatages sur les fichiers jar/zip d'URL.
J9VM183=Le membre de nich\u00E9e %2$.*1$s doit \u00EAtre capable de charger l'h\u00F4te de nich\u00E9e %4$.*3$s
J9VM186=type d'objet incorrect \: %2$.*1$s \: l'objet sur la pile n'est pas un type valeur
J9VM185=classe incorrecte \: %2$.*1$s \: classref n'est pas un type valeur
J9VM188=Echec de la cr\u00E9ation d'une unit\u00E9 d'ex\u00E9cution \: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 0x%4$x
J9VM187=type d'objet incorrect \: %2$.*1$s \: l'objet synchronis\u00E9 est un type valeur
SHRC839=Impossible de d\u00E9marrer le cache partag\u00E9. Une erreur s'est produite lors de l'obtention de l'ID unique d'un cache de pr\u00E9requis de couche inf\u00E9rieure.
J9VM189=La superclasse %2$.*1$s est finale. Il n'est pas possible de l'\u00E9tendre.
SHRC850=Options disponibles pour -Xshareclasses\:%1$s<options>. Utilisez '+' pour sp\u00E9cifier plusieurs options. Exemple \: %2$saot+url \n
SHRC851=D\u00E9sactive la v\u00E9rification d'horodatage lors de la recherche de classes dans le cache partag\u00E9. Les classes obsol\u00E8tes peuvent \u00EAtre charg\u00E9es \u00E0 partir du cache partag\u00E9.
SHRC852=La couche sup\u00E9rieure (couche %d) du cache est d\u00E9truite. La modification de la couche %d du cache partag\u00E9 a \u00E9t\u00E9 d\u00E9tect\u00E9e. L'ID unique de cache attendu est %s, alors que l'ID actuel est %s.
SHRC853=Fonctionnalit\u00E9s du processeur                   \= %s
VRFY007=m\u00E9thode de type final remplac\u00E9e
VRFY008=index de tableau non entier
VRFY009=tableau de type non compatible
SHRC761=Impossible de d\u00E9finir les droits d'acc\u00E8s de groupe comme demand\u00E9 par la sous-option 'groupAccess' sur le fichier d'images instantan\u00E9es du cache partag\u00E9.
VRFY000=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC762=Erreur d'obtention des statistiques du fichier du cache de classe partag\u00E9 lors de la v\u00E9rification de ses droits d'acc\u00E8s de groupe.
VRFY001=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s
SHRC763=Toutes les sous-options de classes partag\u00E9es ne doivent pas comporter au total plus de %u caract\u00E8res.
VRFY002=s\u00E9quence bytecode non valide
SHRC764=Impossible de cr\u00E9er les %1$d octets de m\u00E9moirepartag\u00E9e demand\u00E9e \n \tLa taille est ajust\u00E9e \u00E0 la m\u00E9moire partag\u00E9e maximale autoris\u00E9e (%2$d octets) \n \t(Pour augmenter la m\u00E9moire partag\u00E9e disponible, modifiez la valeur du param\u00E8tre syst\u00E8me SHMMAX) \n \t Si -Xscdmx est utilis\u00E9, la zone d'attribut de d\u00E9bogage est ajust\u00E9e \n \t proportionnellement \u00E0 son ratio d'origine \u00E0 la valeur -Xscmx.
VRFY003=classe ne contient pas de donn\u00E9es de pr\u00E9-v\u00E9rification
VRFY004=l'extension de jsr a rencontr\u00E9 un trop grand nombre de jsr
VRFY005=variable locale de type non compatible
VRFY006=nouvelle taille de tableau non entier
SHRC760=Impossible de d\u00E9finir les droits d'acc\u00E8s de groupe comme demand\u00E9 par la sous-option 'groupAccess' sur le fichier de contr\u00F4le de m\u00E9moire partag\u00E9e associ\u00E9 \u00E0 un cache de classe partag\u00E9.
SHRC769=La machine virtuelle Java a activ\u00E9 la protection des pages partielles du cache partag\u00E9, car le cache existant a \u00E9t\u00E9 cr\u00E9\u00E9 avec la protection des pages partielles activ\u00E9e.
SHRC765=La protection des pages de m\u00E9moire contenant des donn\u00E9es d'ex\u00E9cution, des donn\u00E9es en lecture-\u00E9criture et des pages partiellement remplies est correctement activ\u00E9e
SHRC766=La protection des pages de m\u00E9moire contenant des donn\u00E9es d'ex\u00E9cution et des pages partiellement remplies est correctement activ\u00E9e
SHRC767=La protection des pages de m\u00E9moire contenant des donn\u00E9es d'ex\u00E9cution et des donn\u00E9es en lecture-\u00E9criture est correctement activ\u00E9e
SHRC768=La protection des pages de m\u00E9moire contenant des donn\u00E9es d'ex\u00E9cution est correctement activ\u00E9e
VRFY018=nombre maximum de piles d\u00E9pass\u00E9
VRFY019=\u00E9chec chargement de classe
VRFY010=plusieurs jsr utilisant un seul return
SHRC750=Aucune m\u00E9thode AOT ne correspond aux sp\u00E9cifications de m\u00E9thode
VRFY011=param\u00E8tre lookupswitch non entier
SHRC751=Echec de l'analyse syntaxique des sp\u00E9cifications de m\u00E9thode. Pas plus de %d sp\u00E9cifications de m\u00E9thode autoris\u00E9es.
VRFY012=forme de la pile incoh\u00E9rente
SHRC752=Echec de l'analyse syntaxique des sp\u00E9cifications de m\u00E9thode
VRFY013=violation de contrainte de chargement de classe
SHRC753=Echec de l'obtention du mutex de cache en \u00E9criture
VRFY014=bytecode retourn\u00E9 incompatible avec le type retourn\u00E9
VRFY015=return multiples pour un m\u00EAme jsr
VRFY016=param\u00E8tre de d\u00E9calage du bytecode non entier
VRFY017=<init> n'appelle pas ce <init> ni super <init>
SHRC758=Impossible de d\u00E9finir les droits d'acc\u00E8s de groupe comme demand\u00E9 par la sous-option 'groupAccess' sur la m\u00E9moire partag\u00E9e avec shmid\=%d associ\u00E9e \u00E0 un cache de classe partag\u00E9.
SHRC759=Impossible de d\u00E9finir les droits d'acc\u00E8s de groupe comme demand\u00E9 par la sous-option 'groupAccess' sur le fichier de contr\u00F4le de s\u00E9maphore associ\u00E9 \u00E0 un cache de classe partag\u00E9.
SHRC754=La re-cr\u00E9ation d'un fichier de contr\u00F4le de m\u00E9moire partag\u00E9e n'est pas autoris\u00E9e.
SHRC755=\t invalidatedaot Affiche uniquement les types aot invalid\u00E9s dans le cache partag\u00E9.
SHRC756=Impossible de d\u00E9finir les droits d'acc\u00E8s de groupe sur le fichier de cache partag\u00E9 comme demand\u00E9 par la sous-option 'groupAccess'.
VRFY020=arguments appel\u00E9s de type non compatible
SHRC757=Impossible de d\u00E9finir les droits d'acc\u00E8s de groupe comme demand\u00E9 par la sous-option 'groupAccess' sur le jeu de s\u00E9maphores avec semid\=%d associ\u00E9 \u00E0 un cache de classe partag\u00E9.
SHRC783=L'espace de donn\u00E9es JIT autoris\u00E9 maximal ne doit pas \u00EAtre sup\u00E9rieur \u00E0 la limite softmx de %u octets d\u00E9finie pour l'utilisation du cache partag\u00E9.
SHRC300=Le cache de classe partag\u00E9 est utilis\u00E9 par une autre machine virtuelle. Impossible d'augmenter la m\u00E9moire du cache imbriqu\u00E9.
SHRC784=Impossible de d\u00E9finir l'espace de donn\u00E9es AOT et/ou JIT r\u00E9serv\u00E9 minimal demand\u00E9. La limite softmx d\u00E9finie pour l'utilisation du cache partag\u00E9 ou la taille totale du cache n'est pas suffisante.
SHRC301=Impossible d'augmenter la taille du cache imbriqu\u00E9 "%s". Echec de l'allocation d'un nouveau supercache pour les suggestions
SHRC785=Le nombre d'octets AOT r\u00E9serv\u00E9 minimal est r\u00E9gl\u00E9 \u00E0 %d.
SHRC302=Impossible d'augmenter la taille du cache imbriqu\u00E9 "%s". Echec de l'allocation d'un bloc pour les suggestions
SHRC786=Le nombre d'octets AOT autoris\u00E9 maximal est r\u00E9gl\u00E9 \u00E0 %d.
SHRC780=La taille de l'espace AOT maximal ne doit pas \u00EAtre inf\u00E9rieure au nombre d'octets AOT (%d) d\u00E9j\u00E0 stock\u00E9s dans le cache.
SHRC781=L'espace AOT autoris\u00E9 maximal ne doit pas \u00EAtre sup\u00E9rieur \u00E0 la limite softmx de %u octets d\u00E9finie pour l'utilisation du cache partag\u00E9.
SHRC782=La taille de l'espace de donn\u00E9es JIT maximal ne doit pas \u00EAtre inf\u00E9rieure au nombre d'octets JIT (%d) d\u00E9j\u00E0 stock\u00E9s dans le cache.
SHRC307=\tROMMETHOD \: %2$.*1$s Signature \: %4$.*3$s Adresse \: 0x%5$p
SHRC308=Echec de la s\u00E9rialisation du cache "%s". Echec de la mise \u00E0 jour des d\u00E9calages Classe ROM dans les m\u00E9thodes AOT.
SHRC309=Les options "grow" et "readonly" ne peuvent pas \u00EAtre utilis\u00E9es ensemble.
SHRC303=Echec de la cr\u00E9ation du cache imbriqu\u00E9 "%s"
SHRC787=Le nombre d'octets de donn\u00E9es JIT r\u00E9serv\u00E9 minimal est r\u00E9gl\u00E9 \u00E0 %d.
SHRC304=Echec du remplacement du cache "%s"
SHRC788=Le nombre d'octets de donn\u00E9es JIT autoris\u00E9 maximal est r\u00E9gl\u00E9 \u00E0 %d.
SHRC305=Impossible d'allouer de la m\u00E9moire pour la table de recherche des suggestions (hints) dans SH_ClasspathManagerImpl2
SHRC789=La taille softmx (en nombre d'octets) est r\u00E9gl\u00E9e \u00E0 %u.
SHRC306=\ Signature \: %2$.*1$s Adresse \: 0x%3$p
SHRC772=La limite softmx d\u00E9finie pour l'utilisation du cache partag\u00E9 "%s" est atteinte. Utilisez l'option "%s" pour augmenter la limite softmx.
SHRC773=L'espace n\u00E9cessaire pour les donn\u00E9es AOT dans le cache partag\u00E9 "%s" est satur\u00E9.
SHRC774=L'espace n\u00E9cessaire pour les donn\u00E9es JIT dans le cache partag\u00E9 "%s" est satur\u00E9.
SHRC775=La limite softmx d\u00E9finie pour l'utilisation du cache partag\u00E9 est sup\u00E9rieure \u00E0 la taille totale du cache de %u octets. Elle sera ramen\u00E9e \u00E0 la taille totale du cache.
SHRC770=La machine virtuelle Java a d\u00E9sactiv\u00E9 la protection des pages partiellement remplies. Si '-Xshareclasses\:mprotect\=onfind' est sp\u00E9cifi\u00E9, il est \u00E9galement ignor\u00E9.
SHRC771=Activer la protection de m\u00E9moire des pages partiellement remplies. Sous z/OS, elle est \u00E9quivalente \u00E0 'partialpagesonstartup'.
SHRC776=La limite softmx d\u00E9finie pour l'utilisation du cache partag\u00E9 est inf\u00E9rieure au nombre de %u octets d\u00E9j\u00E0 utilis\u00E9s dans le cache partag\u00E9.
SHRC777=La limite softmx d\u00E9finie pour l'utilisation du cache partag\u00E9 est inf\u00E9rieure \u00E0 la valeur minimale possible de %u octets.
SHRC778=L'espace AOT r\u00E9serv\u00E9 minimal ne doit pas \u00EAtre sup\u00E9rieur \u00E0 l'espace AOT autoris\u00E9 maximal.
SHRC779=L'espace de donn\u00E9es JIT r\u00E9serv\u00E9 minimal ne doit pas \u00EAtre sup\u00E9rieur \u00E0 l'espace de donn\u00E9es JIT autoris\u00E9 maximal.
SHRC321=Correction d'erreur \: fermeture des s\u00E9maphores de m\u00E9moire partag\u00E9s.
SHRC322=Echec de l'initialisation des s\u00E9maphores du cache de classe partag\u00E9. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC323=ERREUR \: Echec lors de l'entr\u00E9e du mutex pour l'en-t\u00EAte du cache de classe partag\u00E9. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC324=ERREUR \: Echec lors de la sortie du mutex pour l'en-t\u00EAte du cache de classe partag\u00E9. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC320=Correction d'erreur \: destruction des s\u00E9maphores de m\u00E9moire partag\u00E9s.
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex n'a pas pu obtenir le mutex de la table de hachage (code de retour %d).
SHRC325=Echec de l'envoi du verrou de l'en-t\u00EAte du cache de classe partag\u00E9 au cours de l'initialisation. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC326=Echec de l'envoi du verrou utilisateur du cache de classe partag\u00E9 au cours de l'initialisation. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9. Si le cache partag\u00E9 pose des probl\u00E8mes, il peut \u00EAtre n\u00E9cessaire de le d\u00E9truire et de le recr\u00E9er.
SHRC327=Echec de l'appel de SH_OSCachesysv\:\:acquireWriteLock() \u00E0 j9shsem_wait avec l'erreur %d.
SHRC328=System V IPC a signal\u00E9 l'erreur '%s'
VERB032=espace cache de classe partag\u00E9 min r\u00E9serv\u00E9 pour les donn\u00E9es JIT
SHRC310=Le cache persistant ne peut pas se trouver dans un syst\u00E8me de fichiers r\u00E9seau. S\u00E9lectionnez un r\u00E9pertoire de cache diff\u00E9rent.
SHRC794=Ajustez l'espace maximal du cache de classe partag\u00E9 autoris\u00E9 pour les donn\u00E9es JIT \u00E0 <taille>.
VERB033=espace cache de classe partag\u00E9 max autoris\u00E9 pour les donn\u00E9es JIT
SHRC311=Erreur lors de la lib\u00E9ration du verrou en \u00E9criture de la connexion au fichier de cache de classe partag\u00E9.
SHRC795=La somme du nombre de %d octets de donn\u00E9es AOT r\u00E9serv\u00E9 minimal et du nombre de %d octets de donn\u00E9es JIT r\u00E9serv\u00E9 minimal ne doit pas sup\u00E9rieure au nombre de %d octets softmx.
VERB034=taille de grande page pour le cache de code JIT
SHRC312=Erreur de lib\u00E9ration du verrou en \u00E9criture pour l'en-t\u00EAte du fichier de cache de classe partag\u00E9.
SHRC796=L'espace AOT r\u00E9serv\u00E9 minimal ne doit pas \u00EAtre sup\u00E9rieur \u00E0 la limite softmx de %d d\u00E9finie pour l'utilisation du cache partag\u00E9.
VERB035=tailles de grande page disponibles pour le cache de code JIT \:
SHRC313=Echec de la cr\u00E9ation du mutex jclCacheMutex dans shrinit
SHRC797=L'espace de donn\u00E9es JIT r\u00E9serv\u00E9 minimal ne doit pas \u00EAtre sup\u00E9rieur \u00E0 la limite softmx de %d d\u00E9finie pour l'utilisation du cache partag\u00E9.
VERB036=taille initiale des m\u00E9tadonn\u00E9es des r\u00E9f\u00E9rences compress\u00E9es
SHRC790=Ajustez la taille softmx du cache \u00E0 <taille>.
VERB037=taille du cache de classe partag\u00E9
SHRC791=Ajustez l'espace minimal du cache de classe partag\u00E9 r\u00E9serv\u00E9 aux donn\u00E9es AOT \u00E0 <taille>.
VERB038=taille maximale souple du cache des classes partag\u00E9
SHRC792=Ajustez l'espace maximal du cache de classe partag\u00E9 autoris\u00E9 pour les donn\u00E9es AOT \u00E0 <taille>.
SHRC793=Ajustez l'espace minimal du cache de classe partag\u00E9 r\u00E9serv\u00E9 aux donn\u00E9es JIT \u00E0 <taille>.
SHRC318=Correction d'erreur \: destruction de la m\u00E9moire partag\u00E9e.
SHRC319=Correction d'erreur \: fermeture de la m\u00E9moire partag\u00E9e.
SHRC314=Impossible d'allouer de la m\u00E9moire pour la table de recherche des suggestions (hints) dans SH_Manager
SHRC798=L'espace AOT autoris\u00E9 maximal ne doit pas \u00EAtre sup\u00E9rieur \u00E0 la limite softmx de %d d\u00E9finie pour l'utilisation du cache partag\u00E9.
SHRC315=Impossible d'initialiser les segments de m\u00E9moire de classe du cachelet.
SHRC799=L'espace de donn\u00E9es JIT autoris\u00E9 maximal ne doit pas \u00EAtre sup\u00E9rieur \u00E0 la limite softmx de %d d\u00E9finie pour l'utilisation du cache partag\u00E9.
VERB030=cache de classe partag\u00E9 max autoris\u00E9 pour JIT
SHRC316=Impossible de s\u00E9rialiser le cache, car aucune unit\u00E9 d'ex\u00E9cution de MV n'est en cours.
VERB031=espace cache de classe partag\u00E9 r\u00E9serv\u00E9 pour les attributs de d\u00E9bogage des classes
SHRC317=Imprime le nom du fichier cache de classe partag\u00E9 qui sera utilis\u00E9.
VRFY029=returnAddress non valide pour l'instruction ret
VRFY021=objet d\u00E9clench\u00E9 ne peut pas \u00EAtre d\u00E9clench\u00E9
SHRC343=Classe %1$s trouv\u00E9e dans le cache pour l'ID chargeur de classe %2$d avec l'URL %4$.*3$s.
VRFY022=sous-routines doivent \u00EAtre r\u00E9analys\u00E9es pour chaque jsr
SHRC344=Classe %1$s non trouv\u00E9e dans le cache pour l'ID chargeur de classe %2$d avec l'URL %4$.*3$s.
VRFY023=param\u00E8tre tableswitch non entier
SHRC345=Classe %1$s trouv\u00E9e dans le cache pour l'ID chargeur de classe %2$d avec le jeton %4$.*3$s.
VRFY024=les arguments sont de type non compatible
SHRC346=Classe %1$s non trouv\u00E9e dans le cache pour l'ID chargeur de classe %2$d avec le jeton %4$.*3$s.
VRFY025=acc\u00E8s incorrect \u00E0 des donn\u00E9es prot\u00E9g\u00E9es
VRFY026=EOF inattendu
SHRC340=Echec de la v\u00E9rification du contr\u00F4le de redondance cyclique (CRC) du cache partag\u00E9. CRC stock\u00E9 %1$x, CRC calcul\u00E9 %2$x
VRFY027=r\u00E9cepteur incompatible avec la classe d\u00E9clarante
SHRC341=Classe %1$s trouv\u00E9e dans le cache partag\u00E9 pour l'ID de chargeur de classe %2$d.
VRFY028=dimension incorrecte
SHRC342=Classe %1$s non trouv\u00E9e dans le cache partag\u00E9 pour l'ID de chargeur de classe %2$d.
SHRC347=Classe stock\u00E9e %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec l'URL %5$.*4$s (index %6$d).
SHRC348=Echec du stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec l'URL %5$.*4$s (index %6$d).
VRFY030=type incorrect sur la pile
SHRC349=Classe stock\u00E9e %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec l'URL %5$.*4$s.
VRFY031=tentative d'ex\u00E9cuter iinc sur une variable non enti\u00E8re
J2SE000=\n
VRFY032=r\u00E9cepteur incorrect pour <init>
SHRC332=Protection de pages activ\u00E9e pour le cache
VRFY033=champ de type non compatible
SHRC333=Protection de page de m\u00E9moire par d\u00E9faut activ\u00E9e pour le cache
VRFY034=PC cible non valide
SHRC334=Echec de la correction d'erreur \: impossible de d\u00E9truire la m\u00E9moire partag\u00E9e.
VRFY035=aucune erreur
SHRC335=Echec de la correction d'erreur \: impossible de d\u00E9truire le s\u00E9maphore partag\u00E9.
VRFY036=pile en sous capacit\u00E9
VRFY037=objet non initialis\u00E9 pendant un branchement en arri\u00E8re
VRFY038=invokespecial sur une cible non valide
SHRC330=SH_CompositeCacheImpl\:\:runExitCode n'a pas pu obtenir le mutex de zone d'\u00E9criture (code de retour %d).
VRFY039=bytecode inconnu
SHRC331=S\u00E9maphore acquis diff\u00E9rent de celui utilis\u00E9 pr\u00E9c\u00E9demment avec ce cache.
SHRC336=Code d'erreur au niveau du port \= %1$d
VRFY040=le v\u00E9rificateur n'a pas pu allouer de m\u00E9moire native
SHRC337=Message d'erreur de la plateforme \: %1$s
SHRC338=Code d'erreur au niveau du port \= %1$d
VRFY041=invokespecial d'un initialiseur incorrect
VRFY042=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s, pc\=%8$u ; type diff\u00E9rent, l'argument %9$d dans la signature %11$.*10$s.%13$.*12$s\:%15$.*14$s ne correspond pas
SHRC339=Message d'erreur de la plateforme \: %1$s
VERB007=taille de pile d'unit\u00E9s d'ex\u00E9cution du syst\u00E8me d'exploitation
VERB008=taille initiale de pile des unit\u00E9s d'ex\u00E9cution Java
VERB009=incr\u00E9ment de pile des unit\u00E9s d'ex\u00E9cution Java
SHRC360=Donn\u00E9es d'octet non trouv\u00E9es pour la cl\u00E9 %.*s dans le cache partag\u00E9...
SHRC365=Active le stockage des informations de d\u00E9bogage de classe dans la classe partag\u00E9e.
EXEL109=\  -XX\:ShareClassesEnableBCI   cr\u00E9er le cache de classe partag\u00E9 avec le support d'instrumentation de bytecode
SHRC366=debug enabled      \= true
VERB000=Pile d\u00E9taill\u00E9e \: "%2$.*1$s" a utilis\u00E9 %3$zd/%4$zd octets sur les piles Java/C
SHRC367=debug enabled      \= false
VERB001=
SHRC368=Arr\u00EAt d'un cache de classe partag\u00E9 activ\u00E9 pour le d\u00E9bogage.
VERB002=Pile d\u00E9taill\u00E9e \: L'utilisation maximale des piles Java/C \u00E9tait de  %1$zd/%2$zd octets
SHRC361=Erreur lors de la connexion \u00E0 la m\u00E9moire partag\u00E9e au cours de l'ouverture/la cr\u00E9ation.
VERB003=Erreur \: Le nombre de fichiers associ\u00E9 \u00E0 -Xverbosegclog doit \u00EAtre positif
SHRC362=Impossible d'allouer de la m\u00E9moire pour ClasspathItem
VERB004=Erreur \: Le nombre de cycles associ\u00E9 \u00E0 -Xverbosegclog doit \u00EAtre positif
SHRC363=Impossible d'allouer une API pour les classes partag\u00E9es dans shrinit
VERB005=Erreur \: Nom de fichier manquant pour -Xverbosegclog
SHRC364=Echec de l'appel de SH_OSCachesysv\:\:acquireWriteLock() \u00E0 j9shsem_wait sur semid %d avec l'erreur %d.
VERB006=Echec de l'initialisation
EXEL112=\  -Xscsoftmx<x>       r\u00E9gler la taille maximale souple du nouveau cache de classe partag\u00E9 \u00E0 <x>
EXEL113=\  -Xscmx<x>       r\u00E9gler la taille (ou la taille maximale souple si l'option -XX\:SharedCacheHardLimit\= est pr\u00E9sente) du nouveau cache de classe partag\u00E9 \u00E0 <x>
EXEL114=\  -XX\:SharedCacheHardLimit\=<x>   r\u00E9gler la taille du nouveau cache de classe partag\u00E9 \u00E0 <x>
EXEL115=\  -XX\:+ShareAnonymousClasses   activer le stockage et la recherche de classes anonymes dans le cache de classe partag\u00E9
SHRC369=-Xnolinenumbers    \= true
EXEL116=\  -XX\:-ShareAnonymousClasses   d\u00E9sactiver le stockage et la recherche de classes anonymes dans le cache de classe partag\u00E9
EXEL117=\  -XX\:+ShareUnsafeClasses   activer le stockage et la recherche de classes non s\u00E9curis\u00E9es non anonymes dans le cache de classe partag\u00E9
EXEL118=\  -XX\:-ShareUnsafeClasses   d\u00E9sactiver le stockage et la recherche de classes non s\u00E9curis\u00E9es non anonymes dans le cache de classe partag\u00E9
EXEL119=\  -XX\:+UseGCStartupHints   activer le stockage et la recherche de suggestions de r\u00E9cup\u00E9ration de place au d\u00E9marrage dans le cache de classe partag\u00E9
EXEL110=\  -XX\:ShareClassesDisableBCI   cr\u00E9er le cache de classe partag\u00E9 sans le support d'instrumentation de bytecode
EXEL111=\  -XX\:+StoreIntermediateClassfile   stocker les donn\u00E9es de classes brutes \u00E0 utiliser pendant la re-transformation
SHRC354=Code AOT non trouv\u00E9 pour ROMMethod 0x%1$p dans le cache partag\u00E9.
SHRC355=Code AOT stock\u00E9 pour ROMMethod 0x%1$p dans le cache partag\u00E9.
SHRC356=Echec du stockage du code AOT non trouv\u00E9 pour ROMMethod 0x%1$p dans le cache partag\u00E9.
SHRC357=Donn\u00E9es d'octet stock\u00E9e pour la cl\u00E9 %.*s dans le cache partag\u00E9.
SHRC350=Echec du stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec l'URL %5$.*4$s.
SHRC351=Classe stock\u00E9e %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec le jeton %5$.*4$s.
SHRC352=Echec du stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID de chargeur de classe %3$d avec le jeton %5$.*4$s.
SHRC353=Code AOT trouv\u00E9 pour ROMMethod 0x%1$p dans le cache partag\u00E9.
EXEL101=\n  -Xhealthcenter  active l'agent Health Center
EXEL102=
EXEL103=\  -Xscdmx<x>      r\u00E9gler la taille de la zone d'attribut de d\u00E9bogage du cache de classe partag\u00E9 \u00E0 <x>
EXEL104=\  -Xscminjit<x>  r\u00E9gler l'espace minimal du cache de classe partag\u00E9 r\u00E9serv\u00E9 aux donn\u00E9es JIT \u00E0 <x>
SHRC358=Echec du stockage des donn\u00E9es d'octet pour la cl\u00E9 %.*s dans le cache partag\u00E9.
EXEL105=\  -Xscmaxjit<x>   r\u00E9gler l'espace maximal du cache de classe partag\u00E9 autoris\u00E9 pour les donn\u00E9es JIT \u00E0 <x>
SHRC359=Donn\u00E9es d'octet trouv\u00E9es pour la cl\u00E9 %.*s dans le cache partag\u00E9...
EXEL106=\  -Xscminjitdata<x>   r\u00E9gler l'espace minimal du cache de classe partag\u00E9 r\u00E9serv\u00E9 aux donn\u00E9es JIT \u00E0 <x>
EXEL107=\  -Xscmaxjitdata<x>   r\u00E9gler l'espace maximal du cache de classe partag\u00E9 autoris\u00E9 pour les donn\u00E9es JIT \u00E0 <x>
EXEL108=\  -Xzero\:nosharebootzip   ne pas partager les caches d'entr\u00E9es de fichier .jar d'amor\u00E7age dans le cache de classe partag\u00E9
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj  activer le temps r\u00E9el souple
VERB029=cache de classe partag\u00E9 min r\u00E9serv\u00E9 pour JIT
SHRC380=%% utilis\u00E9 dans la zone de d\u00E9bogage des classes             %*c\= %u%%
SHRC381=Octets LineNumberTable de la classe         %*c\= %u
SHRC382=Octets LocalVariableTable de la zone de d\u00E9bogage des classes %*c\= %u\n
VERB021=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (type de fichier non pris en charge)
SHRC387=octets disponibles                          %*c\= %d
VERB022=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (type de fichier inconnu)
SHRC388=Octets ROMClass                      %*c\= %d
VERB023=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (erreur inconnue)
SHRC389=Octets de m\u00E9tadonn\u00E9es                      %*c\= %d
VERB024=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (rom.classes manquant pour JXE)
VERB025=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (en-t\u00EAte d'image JXE corrompu)
SHRC383=\nadresse de base                        %*c\= 0x%p
VERB026=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (endian JXE oppos\u00E9 non pris en charge)
SHRC384=adresse de fin                         %*c\= 0x%p
VERB027=Pile d\u00E9taill\u00E9e \: L'unit\u00E9 d'ex\u00E9cution en cours d'ex\u00E9cution "%2$.*1$s" utilise %3$zd/%4$zd octets sur les piles Java/C
SHRC385=pointeur d'allocation                  %*c\= 0x%p\n
VERB028=Pile d\u00E9taill\u00E9e \: Impossible d'imprimer les informations de la pile pour les unit\u00E9s d'ex\u00E9cution actuellement en cours d'ex\u00E9cution
SHRC386=taille du cache                          %*c\= %d
VERB020=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (fichier corrompu)
VERB018=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (\u00E9chec E-S fichier)
VERB019=Entr\u00E9e de chemin d'acc\u00E8s aux classes non valide \: %s (\u00E9chec lecture fichier)
SHRC370=-Xnolinenumbers    \= false
SHRC371=Zip cache bytes    \= %d
VERB010=taille maximale de pile des unit\u00E9s d'ex\u00E9cution Java
SHRC376=%1$d \: 0x%2$p CACHE ZIP \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC377=La valeur -Xscdmx de %u octets est sup\u00E9rieure \u00E0 %u octets de l'espace disponible. Une valeur de %u octets sera utilis\u00E9e pour -Xscdmx \u00E0 la place.
VERB011=taille de pile des unit\u00E9s d'ex\u00E9cution Java
VERB012=incr\u00E9ment de segment des classes RAM
SHRC378=\nOptions de ligne de commande associ\u00E9es \:\n
VERB013=incr\u00E9ment de segment des classes ROM
SHRC379=Taille de la zone de d\u00E9bogage des classes               %*c\= %u
VERB014=m\u00E9moire maximale
SHRC372=\# Zip caches       \= %d
VERB015=taille du cache de classe partag\u00E9
SHRC373=JIT data bytes     \= %d
SHRC374=Cache cr\u00E9\u00E9 avec \:
VERB016=cache de classe partag\u00E9 min r\u00E9serv\u00E9 pour AOT
SHRC375=Le nom du cache est trop long lorsque le nom d'utilisateur est inclus. Il reste %d octets dans ce tampon, et votre nom d'utilisateur fait %d octets.
VERB017=cache de classe partag\u00E9 max autoris\u00E9 pour AOT
EXEL120=\  -XX\:-UseGCStartupHints   d\u00E9sactiver le stockage et la recherche de suggestions de r\u00E9cup\u00E9ration de place au d\u00E9marrage dans le cache de classe partag\u00E9
EXEL121=\  -XX\:+PortableSharedCache   activer la fonctionnalit\u00E9 qui tente de maximiser la portabilit\u00E9 du cache partag\u00E9 entre machines
EXEL122=\  -XX\:-PortableShareCache   d\u00E9sactiver la fonctionnalit\u00E9 qui tente de maximiser la portabilit\u00E9 du cache partag\u00E9 entre machines
SHRC390=%% utilis\u00E9 de m\u00E9tadonn\u00E9es                     %*c\= %d%%
SHRC391=\# ROMClasses                        %*c\= %d
SHRC392=\# Chemins de classe                        %*c\= %d
SHRC393=\# Adresses URL                              %*c\= %d
SHRC398=\# M\u00E9thodes AOT                       %*c\= %d
SHRC399=Octets de donn\u00E9es                          %*c\= %d
SHRC394=\# Jetons                            %*c\= %d
SHRC395=\# Classes p\u00E9rim\u00E9es                     %*c\= %d
SHRC396=%% classes p\u00E9rim\u00E9es                     %*c\= %d%%\n
SHRC397=Octets AOT                           %*c\= %d
CFRE100=trop de dimensions demand\u00E9es dans le bytecode de multianewarray
CFRE101=d\u00E9calage hors plage dans le bytecode de switch
CFRE102=signature de champ non valide
CFRE103=Une m\u00E9thode abstract ne doit pas \u00EAtre private, static, final, native, synchronized ou strict
CFRE104=Un champ ne peut \u00EAtre que public, private ou protected
CFRE110=constante incompatible pour le champ
CFRE111=UTF8 incorrectement form\u00E9
CFRE112=VM ne prend pas en charge la v\u00E9rification dynamique
CFRE113=EOF inattendu
CFRE114=nom de champ non valide
CFRE115=dimensions de tableau > 255
CFRE105=superClass doit \u00EAtre une classe
CFRE106=m\u00E9thode en double
CFRE107=d\u00E9calage hors plage dans le bytecode de jump
CFRE108=index de la m\u00E9thode de la m\u00E9thode englobante doit faire r\u00E9f\u00E9rence \u00E0 un nom et un type
CFRE109=signature de m\u00E9thode non valide
CFRE141=method_info comporte plus d'un attribut RuntimeInvisibleParameterAnnotations ou RuntimeVisibleParameterAnnotations
CFRE142=La classe comporte plus d'un attribut RuntimeInvisibleAnnotations ou RuntimeVisibleAnnotations
CFRE143=Plusieurs attributs NestMate
CFRE144=Un membre de l'attribut nest d'un h\u00F4te de nich\u00E9e doit \u00EAtre une classe constante
CFRE145=L'h\u00F4te de nich\u00E9e doit \u00EAtre une classe constante
CFRE146=La m\u00E9thode <clinit> n'est pas statique
CFRE147=La m\u00E9thode <clinit> a une signature non conforme
CFRE148=L'interface ne peut pas avoir de m\u00E9thode nomm\u00E9e <init>
CFRE140=method_info comporte plus d'un attribut AnnotationDefault
CFRE138=L'attribut Classfile fait r\u00E9f\u00E9rence \u00E0 une entr\u00E9e de pool de constantes inexistante
CFRE139=La classe comporte plus d'un attribut SourceDebugExtension
CFRE152=module-info n'est pas une classe car le drapeau d'acc\u00E8s ACC_MODULE est lev\u00E9
CFRE153=Entr\u00E9e de pool de constantes non valide dans les fichiers de classe dont la version est ant\u00E9rieure \u00E0 la version 55.0
CFRE154=Les bytecodes ldc et ldc_2 doivent faire r\u00E9f\u00E9rence \u00E0 une constante ou \u00E0 une entr\u00E9e Constant_Dynamic
CFRE155=Le bytecode ldc2_w doit faire r\u00E9f\u00E9rence \u00E0 une constante ou \u00E0 une entr\u00E9e Constant_Dynamic
CFRE156=Les entr\u00E9es Constant_Dynamic r\u00E9f\u00E9renc\u00E9es par les bytecodes de ldc et ldc_w ne doivent pas retourner de valeur 'long' ou 'double'
CFRE157=Les entr\u00E9es Constant_Dynamic r\u00E9f\u00E9renc\u00E9es par le bytecode de ldc2_w doivent retourner une valeur 'long' ou 'double'
CFRE158=Entr\u00E9e de pool de constantes non valide dans les fichiers de classe dont la version est ant\u00E9rieure \u00E0 la version 49.0
CFRE159=Entr\u00E9e de pool de constantes non valide dans les fichiers de classe dont la version est ant\u00E9rieure \u00E0 la version 51.0
CFRE150=Etiquette de constante 20 inconnue dans le fichier de classe
CFRE151=Entr\u00E9e de pool de constantes non valide dans les fichiers de classe dont la version est ant\u00E9rieure \u00E0 la version 53.0
CFRE149=Etiquette de constante 19 inconnue dans le fichier de classe
CFRE120=les codes d'op\u00E9ration jsr et jsr_w ne sont pas valides dans les fichiers de classe dont la version >\= 51.0
CFRE121=nom de champ non conforme
CFRE122=La classe doit \u00EAtre soit publique, soit module
CFRE123=Les constantes MethodHandle doivent faire r\u00E9f\u00E9rence \u00E0 un champ ou une m\u00E9thode
CFRE124=la balise de valeur de l'\u00E9l\u00E9ment d'annotation n'est pas valide
CFRE125=Le bytecode invokedynamic doit r\u00E9f\u00E9rencer une entr\u00E9e de pool de constantes InvokeDynamic
CFRE126=Valeurs non nulles dans les emplacements r\u00E9serv\u00E9s du bytecode de invokedynamic
CFRE116=le bytecode d'invoke doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment Methodref
CFRE117=champ ne peut \u00EAtre que final ou volatile
CFRE118=octets exc\u00E9dentaires apr\u00E8s fin de fichier (EOF)
CFRE119=plusieurs attributs SourceFile
CFRE130=plusieurs attributs BootstrapMethods
CFRE131=L'attribut BootstrapMethods requis par invokedynamic est absent ou trop petit
CFRE132=type_annotation target_type non reconnu
CFRE133=La m\u00E9thode comporte deux attributs MethodParameters
CFRE134=Le param\u00E8tre de m\u00E9thode a une option non valide.
CFRE135=Le nom du param\u00E8tre de la m\u00E9thode n'est pas UTF8
CFRE136=modificateurs non autoris\u00E9s pour la m\u00E9thode de l'interface
CFRE137=La classe comporte plus d'un attribut RuntimeVisibleTypeAnnotations ou RuntimeInvisibleTypeAnnotations
CFRE127=L'index de m\u00E9thode d'amorce doit faire r\u00E9f\u00E9rence \u00E0 une entr\u00E9e de pool de constantes MethodHandle
CFRE128=Signature methodtype non valide
CFRE129=entr\u00E9e de pool de constantes non valide dans les fichiers de classe dont la version est ant\u00E9rieure \u00E0 la version 51.0
CFRE163=Le fichier de classe est une version de pr\u00E9sentation, mais sa version principale n'est pas la bonne ou l'aper\u00E7u n'est pas activ\u00E9.
CFRE164=L'index dans LocalVariableTable n'est pas compris dans la plage admise
CFRE165=L'index dans LocalVariableTypeTable n'est pas compris dans la plage admise
CFRE166=Les entr\u00E9es en double dans LocalVariableTypeTable ne sont pas admises
CFRE167=plusieurs attributs Record
CFRE168=Les classes Record ne peuvent pas \u00EAtre abstraites
CFRE169=Le nom Record doit \u00EAtre une cha\u00EEne
CFRE160=Entr\u00E9e de pool de constantes non valide dans les fichiers de classe dont la version est ant\u00E9rieure \u00E0 la version 55.0
CFRE161=Les arguments de BootstrapMethod (%1$d) contiennent une entr\u00E9e constantpool non valide \u00E0 l'index (\#%2$u) du type (%3$u) ; class\=%5$.*4$s, offset\=%6$u
CFRE162=Les types valeur sont seulement activ\u00E9s avec l'option -XX\:+EnableValhalla
SHRC703=Impossible d'ouvrir le fichier d'images instantan\u00E9es du cache partag\u00E9 "%s"
SHRC704=Code d'erreur au niveau du port \= %1$d
SHRC705=Message d'erreur de la plateforme \: %1$s
SHRC706=Impossible d'acqu\u00E9rir le verrou de fichier sur le fichier d'images instantan\u00E9es du cache partag\u00E9
SHRC700=L'instantan\u00E9 du cache partag\u00E9 non persistant "%s" a \u00E9t\u00E9 cr\u00E9\u00E9
SHRC701=Impossible de cr\u00E9er un instantan\u00E9 du cache partag\u00E9 non persistant "%s"
SHRC702=Impossible d'obtenir un r\u00E9pertoire pour l'instantan\u00E9 du cache partag\u00E9
SHRC707=Impossible d'acqu\u00E9rir l'exclusion mutuelle (mutex) du cache "%s"
SHRC708=Impossible de tronquer le fichier d'images instantan\u00E9es du cache partag\u00E9 non persistant existant "%s"
SHRC709=La machine virtuelle Java cr\u00E9e un instantan\u00E9 du cache partag\u00E9 non persistant "%s", mais un fichier d'images instantan\u00E9es "%s" existe d\u00E9j\u00E0 et il sera \u00E9cras\u00E9
CFRE174=plusieurs attributs PermittedSubclasses
CFRE175=les classes finales ne peuvent pas \u00EAtre scell\u00E9es
CFRE176=le nom PermittedSubclasses doit \u00EAtre une cha\u00EEne
CFRE177=l'entr\u00E9e de classe PermittedSubclasses n'est pas un type de classe
CFRE178=Les classes scell\u00E9es doivent avoir au moins une sous-classe permise
CFRE170=Le nom RecordComponent doit \u00EAtre une cha\u00EEne
CFRE171=Le descripteur RecordComponent doit \u00EAtre une cha\u00EEne
CFRE172=Record est implicitement final
CFRE173=L'entr\u00E9e LocalVariableTypeTable ne correspond \u00E0 aucune entr\u00E9e LocalVariableTable
SHRC720=La re-cr\u00E9ation d'un fichier de contr\u00F4le de m\u00E9moire partag\u00E9e n'est pas autoris\u00E9e lors de la cr\u00E9ation d'un instantan\u00E9 du cache
SHRC725=La taille du fichier d'images instantan\u00E9es du cache partag\u00E9 non persistant "%s" n'est pas valide. Elle est de %lld octets. La taille valide d'un fichier d'images instantan\u00E9es est comprise entre %d et %lld octets.
SHRC726=Le cache partag\u00E9 non persistant "%s" existe d\u00E9j\u00E0. Il ne peut pas \u00EAtre restaur\u00E9 \u00E0 partir de l'instantan\u00E9.
SHRC727=Une erreur s'est produite lors de la cr\u00E9ation du nouveau cache partag\u00E9 non persistant
SHRC728=Impossible de lire le fichier d'images instantan\u00E9es du cache partag\u00E9 non persistant "%s"
SHRC721=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der au fichier d'images instantan\u00E9es du cache partag\u00E9 non persistant "%s". Pour ouvrir le fichier, utilisez la sous-option 'groupAccess'.
SHRC722=La machine virtuelle Java n'autorise pas l'acc\u00E8s au fichier d'images instantan\u00E9es du cache partag\u00E9 "%s" parce que l'ID utilisateur et l'ID groupe du processus JVM sont diff\u00E9rents de ceux du propri\u00E9taire du fichier d'images instantan\u00E9es de cache partag\u00E9 et que l'ID utilisateur du processus JVM n'appartient pas au groupe du propri\u00E9taire du fichier d'images instantan\u00E9es du cache partag\u00E9.
SHRC723=La machine virtuelle Java n'a pas pu v\u00E9rifier les autorisations du fichier d'images instantan\u00E9es du cache partag\u00E9 "%s"
SHRC724=Le fichier d'images instantan\u00E9es du cache partag\u00E9 "%s" n'existe pas
SHRC729=L'instantan\u00E9 a \u00E9t\u00E9 cr\u00E9\u00E9 par une g\u00E9n\u00E9ration JVM diff\u00E9rente et ne correspond pas \u00E0 la machine virtuelle Java actuelle
SHRC714=Aucun instantan\u00E9 de cache partag\u00E9 n'est disponible
SHRC715=Ancienne g\u00E9n\u00E9ration de l'instantan\u00E9 du cache partag\u00E9 "%s" supprim\u00E9e
SHRC716=Impossible de supprimer l'ancienne g\u00E9n\u00E9ration de l'instantan\u00E9 du cache partag\u00E9 "%s"
SHRC717=Impossible de supprimer la g\u00E9n\u00E9ration actuelle de l'instantan\u00E9 du cache partag\u00E9 "%s"
SHRC710=Impossible d'\u00E9crire dans le fichier d'images instantan\u00E9es du cache partag\u00E9 non persistant "%s"
SHRC711=Impossible de repositionner le d\u00E9calage du descripteur de fichier dans le fichier d'images instantan\u00E9es du cache partag\u00E9 non persistant "%s"
SHRC712=Tentative de destruction de tous les instantan\u00E9s de cache partag\u00E9 dans cacheDir "%s"
SHRC713=Impossible d'obtenir la longueur du fichier d'images instantan\u00E9es du cache partag\u00E9 "%s"
SHRC718=L'instantan\u00E9 du cache partag\u00E9 n'existe pas
SHRC719=L'instantan\u00E9 du cache partag\u00E9 "%s" est d\u00E9truit
SHRC740=Syntaxe \: %s{<sp\u00E9cification_m\u00E9thode>[,<sp\u00E9cification_m\u00E9thode>]}
SHRC741=Le format de <sp\u00E9cification_m\u00E9thode> est [\!]{*|[*]<nompackage/nomclasse>[*]}[.{*|[*]<nomm\u00E9thode>[*]}[({*|[*]<param\u00E8tres>[*]})]], par exemple \:\n\n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC742=IMPORTANT \: Vous pouvez indiquer plusieurs sp\u00E9cifications de m\u00E9thode s\u00E9par\u00E9es par des virgules. Si une valeur d'option contient des virgules, elle doit \u00EAtre entre accolades. \n\tIl peut \u00EAtre n\u00E9cessaire de mettre les options entre guillemets pour emp\u00EAcher l'interpr\u00E9teur de commandes d'intercepter et de fragmenter les lignes de commande s\u00E9par\u00E9es par des virgules, par exemple \: \n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" ou\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC747=Echec d'invalidation des m\u00E9thodes AOT
SHRC748=Echec de revalidation des m\u00E9thodes AOT
SHRC749=Echec de recherche des m\u00E9thodes AOT
SHRC743=Sp\u00E9cification(s) de m\u00E9thode non valide(s) pour l'option "%s"
SHRC744=%d m\u00E9thode(s) AOT invalid\u00E9e(s)
SHRC745=%d m\u00E9thode(s) AOT revalid\u00E9e(s)
SHRC746=%d m\u00E9thode(s) AOT trouv\u00E9e(s)
SHRC730=La machine virtuelle Java a cr\u00E9\u00E9 un cache partag\u00E9 avec l'option '-Xshareclasses\:restrictClasspaths'. Les appels JVM suivants ne pourront pas stocker les chemins d'acc\u00E8s aux classes dans le cache partag\u00E9
SHRC731=La machine virtuelle Java a ignor\u00E9 l'option '-Xshareclasses\:restrictClasspaths' car le cache partag\u00E9 existant a \u00E9t\u00E9 cr\u00E9\u00E9 sans l'option '-Xshareclasses\:restrictClasspaths'
SHRC736=Invalidez les m\u00E9thodes AOT correspondant aux sp\u00E9cifications de la m\u00E9thode.
SHRC737=Revalidez les m\u00E9thodes AOT correspondant aux sp\u00E9cifications de la m\u00E9thode.
SHRC738=Affichez les m\u00E9thodes AOT correspondant aux sp\u00E9cifications de la m\u00E9thode.\n\t<sp\u00E9cification_m\u00E9thode> est d\u00E9finie comme suit \: [\!]{*|[*]<nompackage/nomclasse>[*]}[.{*|[*]<nomm\u00E9thode>[*]}[({*|[*]<param\u00E8tres>[*]})]].
SHRC739=NON VALIDE
SHRC732=La machine virtuelle Java peut stocker les chemins d'acc\u00E8s aux classes dans le cache partag\u00E9 cr\u00E9\u00E9 avec l'option '-Xshareclasses\:restrictClasspaths'
SHRC733=La machine virtuelle Java ne peut pas stocker les chemins d'acc\u00E8s aux classes dans le cache partag\u00E9 cr\u00E9\u00E9, car le cache a \u00E9t\u00E9 cr\u00E9\u00E9 avec l'option '-Xshareclasses\:restrictClasspaths'
SHRC734=Imprimez le nom du fichier d'images instantan\u00E9es de classes partag\u00E9es qui sera utilis\u00E9.
SHRC735=Utilisez une machine virtuelle Java %d bits pour effectuer l'op\u00E9ration demand\u00E9e sur le cache partag\u00E9 %d bits "%s" car la machine virtuelle Java %d bits ne peut pas v\u00E9rifier que la m\u00E9moire partag\u00E9e a \u00E9t\u00E9 cr\u00E9\u00E9e par la machine virtuelle Java
SHRC640=La machine virtuelle Java utilise le cache de classe partag\u00E9 existant en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic), mais le cache n'effectuait pas la cr\u00E9ation dans ce mode. L'utilisation du cache dans ce mode peut avoir une incidence sur les performances.
SHRC641=La machine virtuelle Java tente d'utiliser le cache de classe partag\u00E9 existant en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic), mais le cache n'effectuait pas la cr\u00E9ation dans ce mode. Dans ce cas, l'option mprotect\=diagnostic est ignor\u00E9e sous z/OS.
SHRC642=La machine virtuelle Java a cr\u00E9\u00E9 le cache de classe partag\u00E9 en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic). L'utilisation du cache dans ce mode peut avoir une incidence sur les performances.
SHRC643=La machine virtuelle Java s'est connect\u00E9e au cache de classe partag\u00E9 cr\u00E9\u00E9 en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic). L'utilisation du cache dans ce mode peut avoir une incidence sur les performances.
SHRC648=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der au jeu de s\u00E9maphores associ\u00E9 au cache de classe partag\u00E9 non persistant existant. Pour la connexion au cache de classe partag\u00E9 non persistant, utilisez la sous-option 'groupAccess'.
SHRC649=La machine virtuelle Java n'autorise pas l'acc\u00E8s au jeu de s\u00E9maphores du cache partag\u00E9 cr\u00E9\u00E9 et poss\u00E9d\u00E9 par un autre utilisateur ne faisant pas partie de son groupe.
J9CL030=Impossible d'allouer de la m\u00E9moire pour les donn\u00E9es natives de locataire
J9CL031=Impossible d'enregistrer dbgwrapper.dll comme biblioth\u00E8que d'amor\u00E7age. Code d'erreur \= %zu
J9CL032=%1$d \: Impossible d'extraire des infos %2$s.
SHRC644=La machine virtuelle Java s'est connect\u00E9e au cache de classe partag\u00E9 cr\u00E9\u00E9 en mode diagnostic mprotect (avec l'option -Xshareclasses\:mprotect\=diagnostic). L'option -Xshareclasses\:mprotect\=none sera ignor\u00E9e.
SHRC645=Activer le mode diagnostic mprotect
SHRC646=La machine virtuelle Java n'a pas pu v\u00E9rifier les autorisations du jeu de s\u00E9maphores associ\u00E9 au cache partag\u00E9.
SHRC647=L'ID utilisateur effectif du processus d\u00E9tect\u00E9 par la machine virtuelle Java est le propri\u00E9taire et non le cr\u00E9ateur du jeu de s\u00E9maphores associ\u00E9 au cache partag\u00E9. La machine virtuelle Java ne se connectera pas au cache partag\u00E9 pour emp\u00EAcher l'acc\u00E8s non intentionnel au cache partag\u00E9.
J9CL037=Impossible d'extraire des informations de syntaxe UC JVM lorsque -XX\:-EnableCPUMonitor a \u00E9t\u00E9 sp\u00E9cifi\u00E9.
J9CL038=Erreur lors de l'extraction d'informations de syntaxe UC JVM.
J9CL039=Horodatage non valide lors de l'extraction d'informations de syntaxe UC JVM.
J9CL033=Impossible d'enregistrer %s comme biblioth\u00E8que d'amor\u00E7age. Code d'erreur \= %zu
J9CL034=%1$d \: Echec lors de l'extraction d'infos %2$s. %3$s
J9CL035=Invokespecial requis par les m\u00E9thodes d'interface priv\u00E9e
J9CL036=violation de contrainte de chargement \: %2$.*1$s non visible \u00E0 partir de %4$.*3$s
J9CL019=Impossible d'allouer le tampon SIOCGIFCONF
SHRC630=Espace satur\u00E9 pour le stockage de donn\u00E9es non AOT/non JIT, telles que des classes, dans le cache partag\u00E9 "%s".
SHRC631=L'espace r\u00E9serv\u00E9 pour les donn\u00E9es AOT dans le cache partag\u00E9 "%s" est satur\u00E9. Utilisez -Xscminaot pour augmenter l'espace r\u00E9serv\u00E9 pour les donn\u00E9es AOT.
SHRC632=L'espace r\u00E9serv\u00E9 pour les donn\u00E9es JIT dans le cache partag\u00E9 "%s" est satur\u00E9. Utilisez -Xscminjitdata pour augmenter l'espace r\u00E9serv\u00E9 pour les donn\u00E9es JIT.
SHRC637=La sous-option -Xshareclasses\:cacheRetransformed est incompatible avec un cache partag\u00E9 existant activ\u00E9 par BCI.
SHRC638=La cr\u00E9ation d'un cache avec l'option cacheRetransformed force le mode disableBCI.
SHRC639=Seules les options de l'utilitaire de cache partag\u00E9 peuvent \u00EAtre utilis\u00E9es en combinaison avec -Xmt. Placez les autres options de cache partag\u00E9 dans le fichier javad.options.
J9CL020=M\u00E9moire insuffisante pour lire les donn\u00E9es d'environnement local
J9CL021=M\u00E9moire insuffisante pour cr\u00E9er la liste d'index
SHRC633=L'option "-XX\:+StoreIntermediateClassfile" a \u00E9t\u00E9 sp\u00E9cifi\u00E9e, mais le cache existant n'a pas \u00E9t\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de l'option "-XX\:+StoreIntermediateClassfile".
SHRC634=L'option "-XX\:-StoreIntermediateClassfile" a \u00E9t\u00E9 sp\u00E9cifi\u00E9e, mais le cache existant a \u00E9t\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de l'option "-XX\:+StoreIntermediateClassfile".
SHRC635=Stocker le fichier de classe interm\u00E9diaire \= true
SHRC636=La sous-option "disableBCI" est incompatible avec le cache partag\u00E9 existant activ\u00E9 par BCI.
J9CL026=Impossible d'allouer de la m\u00E9moire pour le contenu post HTTP
J9CL027=Erreur de lecture du fichier zip
J9CL028=Erreur interne lors de la lecture du fichier zip, code d'erreur %d
J9CL029=caract\u00E8res incorrectement form\u00E9s/non mappables trouv\u00E9s
J9CL022=M\u00E9moire insuffisante pour lister les magasins d'enregistrements
J9CL023=M\u00E9moire insuffisante pour lire l'enregistrement
J9CL024=M\u00E9moire satur\u00E9e
J9CL025=Impossible d'allouer de la m\u00E9moire pour les en-t\u00EAtes de r\u00E9ponse HTTP
SHRC662=Correction d'erreur \: un jeu de s\u00E9maphores d\u00E9truit est associ\u00E9 \u00E0 un cache de classe partag\u00E9.
SHRC663=Correction d'erreur \: un jeu de s\u00E9maphores d\u00E9truit portant l'id\=%d est associ\u00E9 \u00E0 un cache de classe partag\u00E9.
SHRC664=Echec de la correction d'erreur \: impossible de d\u00E9truire le jeu de s\u00E9maphores avec semid\=%d associ\u00E9 \u00E0 un cache de classe partag\u00E9. Seul le cr\u00E9ateur, le propri\u00E9taire ou un utilisateur dot\u00E9 des privil\u00E8ges d'administration peut d\u00E9truire le jeu de s\u00E9maphores.
SHRC665=Echec de la correction d'erreur \: impossible de d\u00E9truire le jeu de s\u00E9maphores avec semid\=%d associ\u00E9 \u00E0 un cache de classe partag\u00E9.
SHRC660=La machine virtuelle Java n'a pas pu associer l'ID du jeu de s\u00E9maphores id\=%d avec le cache de classe partag\u00E9.
SHRC661=La machine virtuelle Java n'a pas pu associer l'ID de la m\u00E9moire partag\u00E9e id\=%d avec le cache de classe partag\u00E9.
SHRC666=Correction d'erreur \: une m\u00E9moire partag\u00E9e d\u00E9truite est associ\u00E9e \u00E0 un cache de classe partag\u00E9.
SHRC667=Correction d'erreur \: une m\u00E9moire partag\u00E9e d\u00E9truite portant l'id\=%d est associ\u00E9e \u00E0 un cache de classe partag\u00E9.
SHRC668=Echec de la correction d'erreur \: impossible de d\u00E9truire la m\u00E9moire partag\u00E9e avec shmid\=%d associ\u00E9e \u00E0 un cache de classe partag\u00E9. Seul le cr\u00E9ateur, le propri\u00E9taire ou un utilisateur dot\u00E9 des privil\u00E8ges d'administration peut d\u00E9truire la m\u00E9moire partag\u00E9e.
SHRC669=Echec de la correction d'erreur \: impossible de d\u00E9truire la m\u00E9moire partag\u00E9e avec shmid\=%d associ\u00E9e \u00E0 un cache de classe partag\u00E9.
SHRC651=L'ID utilisateur effectif du processus d\u00E9tect\u00E9 par la machine virtuelle Java est le propri\u00E9taire et non le cr\u00E9ateur de la m\u00E9moire partag\u00E9e associ\u00E9e au cache partag\u00E9. La machine virtuelle Java ne se connectera pas au cache partag\u00E9 pour emp\u00EAcher l'acc\u00E8s non intentionnel au cache partag\u00E9.
SHRC652=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der \u00E0 la m\u00E9moire partag\u00E9e associ\u00E9e au cache de classe partag\u00E9 non persistant. Pour la connexion au cache de classe partag\u00E9 non persistant, utilisez la sous-option 'groupAccess'.
SHRC653=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der \u00E0 la m\u00E9moire partag\u00E9e associ\u00E9e au cache de classe partag\u00E9 non persistant. Pour la connexion au cache de classe partag\u00E9 non persistant, utilisez les sous-options 'groupAccess' et 'readonly'.
SHRC654=La machine virtuelle Java n'autorise pas l'acc\u00E8s \u00E0 la r\u00E9gion de m\u00E9moire partag\u00E9e du cache partag\u00E9 cr\u00E9\u00E9 et poss\u00E9d\u00E9 par un autre utilisateur ne faisant pas partie de son groupe.
SHRC650=La machine virtuelle Java n'a pas pu v\u00E9rifier les autorisations de la m\u00E9moire partag\u00E9e associ\u00E9e au cache partag\u00E9.
SHRC659=Une erreur s'est produite lors de l'ouverture de la m\u00E9moire partag\u00E9e
J9CL040=Impossible d'allouer de la m\u00E9moire pour la nouvelle r\u00E9f\u00E9rence globale JNI
J9CL041=La classe d'h\u00F4te %2$.*1$s et la classe anonyme %4$.*3$s sont dans des packages diff\u00E9rents
J9CL042=Le membre de nich\u00E9e %2$.*1$s dans %4$.*3$s d\u00E9clare un h\u00F4te de nich\u00E9e diff\u00E9rent, %6$.*5$s
SHRC655=Le cache est accessible pour l'utilisateur en cours \= %s
SHRC656=La machine virtuelle Java n'est pas configur\u00E9e pour acc\u00E9der au fichier de cache partag\u00E9. Pour la connexion au cache de classe partag\u00E9, utilisez la sous-option 'groupAccess'.
SHRC657=La machine virtuelle Java n'autorise pas l'acc\u00E8s au fichier de cache partag\u00E9 parce que l'ID d'utilisateur et de groupe du processus JVM sont diff\u00E9rents de ceux du propri\u00E9taire du fichier de cache partag\u00E9 et que l'ID utilisateur du processus JVM n'appartient pas au groupe du propri\u00E9taire du fichier de cache partag\u00E9.
SHRC658=La machine virtuelle Java n'a pas pu v\u00E9rifier les autorisations du fichier de cache partag\u00E9.
SHRC200=\ Succ\u00E8s de la recherche de %2$.*1$s.
SHRC684=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Impossible de verrouiller le fichier de contr\u00F4le.
DUMP034=L'utilisateur a demand\u00E9 un vidage %1$s en utilisant '%2$s' via %3$s
SHRC201=\ Succ\u00E8s du remplacement de %2$.*1$s.
SHRC685=Une erreur s'est produite lors de l'ouverture de la m\u00E9moire partag\u00E9e. Impossible de verrouiller le fichier de contr\u00F4le.
DUMP033=La machine virtuelle Java a demand\u00E9 un vidage %1$s \u00E0 la suite d'un \u00E9v\u00E9nement
SHRC202=Echec de l'initialisation des pools dans le gestionnaire de classes partag\u00E9es
SHRC686=Impossible de d\u00E9marrer le cache de classe partag\u00E9. Continuez sans l'utiliser car -Xshareclasses\:nonfatal est sp\u00E9cifi\u00E9
DUMP036=Filtre -Xdump non valide ou manquant
SHRC203=Impossible de cr\u00E9er la table de hachage dans le gestionnaires de classes partag\u00E9es
SHRC687=Impossible de cr\u00E9er un nouveau cache de classe partag\u00E9 lors de l'ex\u00E9cution de l'option -Xshareclasses\:readonly
DUMP035=L'utilisateur a demand\u00E9 un vidage %1$s via %2$s
SHRC680=Echec de la correction d'erreur \: impossible de supprimer le fichier de contr\u00F4le du jeu de s\u00E9maphores %s associ\u00E9 au cache de classe partag\u00E9.
DUMP030=Impossible d'\u00E9crire le vidage dans le fichier %s \: %s
SHRC681=Limite syst\u00E8me du nombre maximal de s\u00E9maphores ou nombre maximal de s\u00E9maphores \u00E0 l'\u00E9chelle du syst\u00E8me atteint.
SHRC682=Limite syst\u00E8me du nombre maximal de r\u00E9gions de m\u00E9moire partag\u00E9e ou limite \u00E0 l'\u00E9chelle du syst\u00E8me de la m\u00E9moire allou\u00E9e aux r\u00E9gions de m\u00E9moire partag\u00E9e atteinte.
DUMP032=La machine virtuelle Java a demand\u00E9 un vidage %1$s en utilisant '%2$s' en r\u00E9ponse \u00E0 un \u00E9v\u00E9nement
SHRC683=Limite syst\u00E8me du nombre total de fichiers ouverts atteinte.
DUMP031=Le vidage de tas demand\u00E9 n'a pas \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9, car le verrou exclusif VM n'a pas \u00E9t\u00E9 demand\u00E9. Ajoutez request\=exclusive+prepwalk+compact \u00E0 l'option de ligne de commande -Xdump\:heap\:.
SHRC208=Impossible d'allouer de la m\u00E9moire pour pool d'\u00E9l\u00E9ments de la table de hachage dans CompiledMethodManagerImpl
SHRC209=Active la sortie d\u00E9taill\u00E9e des donn\u00E9es de type octet
SHRC204=Impossible de cr\u00E9er le mutex de table de hachage dans le gestionnaire de classes partag\u00E9es
SHRC688=Les chemins d'acc\u00E8s aux classes ne peuvent \u00EAtre ajout\u00E9s que via la premi\u00E8re initialisation du cache par la machine virtuelle Java.
DUMP027=Le vidage de tas demand\u00E9 n'a pas \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9, car un autre composant d\u00E9tient le verrou exclusif VM.
SHRC205=Echec de cr\u00E9ation d'\u00E9l\u00E9ment de table de hachage dans CompiledMethodManagerImpl
SHRC689=Permet \u00E0 une machine virtuelle Java de stocker les chemins d'acc\u00E8s aux classes dans le cache cr\u00E9\u00E9 avec l'option "restrictClasspaths".
DUMP026=IEATDUMP Le nom d\u00E9passe la longueur maximale. Le nom par d\u00E9faut est utilis\u00E9.
SHRC206=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de la table de hachage dans CompiledMethodManagerImpl
DUMP029=La demande pour prepwalk ou compact avant de cr\u00E9er un vidage syst\u00E8me sera ignor\u00E9e, car le verrou excessif VM n'a pas \u00E9t\u00E9 demand\u00E9.
SHRC207=Impossible d'entrer le mutex de table de hachage CompiledMethodManager
DUMP028=Le verrou exclusif VM n'a pas pu \u00EAtre obtenu avant de cr\u00E9er le vidage syst\u00E8me.
SHRC673=Echec de la destruction du jeu de s\u00E9maphores avec semid\=%d associ\u00E9 \u00E0 un cache de classe partag\u00E9.
DUMP045=Le nombre d'options de vidage (dump), y compris les options appliqu\u00E9es par d\u00E9faut, doit \u00EAtre inf\u00E9rieur \u00E0 %d.
SHRC674=L'utilisateur n'est pas autoris\u00E9 \u00E0 d\u00E9truire la m\u00E9moire partag\u00E9e avec shmid\=%d. Seul le cr\u00E9ateur, le propri\u00E9taire ou un utilisateur dot\u00E9 des privil\u00E8ges d'administration peut d\u00E9truire la m\u00E9moire partag\u00E9e.
DUMP044=Valeur de %s r\u00E9serv\u00E9e ou non valide
SHRC675=Echec de la destruction de la m\u00E9moire partag\u00E9e associ\u00E9e \u00E0 un cache de classe partag\u00E9.
DUMP047=La machine virtuelle est en cours d'arr\u00EAt. Raison \: Inconnue
SHRC676=Echec de la destruction de la m\u00E9moire partag\u00E9e avec shmid\=%d associ\u00E9e \u00E0 un cache de classe partag\u00E9.
DUMP046=La machine virtuelle est en cours d'arr\u00EAt. Raison \: %2$.*1$s
DUMP041=Utilisation incorrecte de -Xdump msg_filter
SHRC670=Correction d'erreur \: tentative d'utilisation de la m\u00E9moire partag\u00E9e en mode lecture seule si la r\u00E9gion de m\u00E9moire partag\u00E9e existe, en r\u00E9ponse \u00E0 l'option "-Xshareclasses\:nonfatal".
DUMP040=Vidage %1$s \u00E9crit dans les ensembles de donn\u00E9es \u00E0 l'aide du mod\u00E8le de nom %2$s
SHRC671=L'utilisateur n'est pas autoris\u00E9 \u00E0 d\u00E9truire le jeu de s\u00E9maphores avec semid\=%d. Seul le cr\u00E9ateur, le propri\u00E9taire ou un utilisateur dot\u00E9 des privil\u00E8ges d'administration peut d\u00E9truire le jeu de s\u00E9maphores.
DUMP043=%s n'est pas pris en charge sur cette plateforme
SHRC672=Echec de la destruction du jeu de s\u00E9maphores associ\u00E9 \u00E0 un cache de classe partag\u00E9.
DUMP042=Signal abandonn\u00E9 re\u00E7u pendant l'ex\u00E9cution sur la pile Java. Les agents de vidage de la machine virtuelle Java n'ont pas pu s'ex\u00E9cuter.
SHRC677=Code d'erreur au niveau du port \= %1$d
DUMP038=Le vidage d'instantan\u00E9 n'est pas \u00E9crit, car le tra\u00E7age s'effectue dans un fichier \: %1$s
SHRC678=Message d'erreur de la plateforme \: %1$s
DUMP037=Erreur dans le vidage %1$s \: %2$s a \u00E9chou\u00E9, code d'erreur \: %3$d
SHRC679=Echec de la correction d'erreur \: impossible de supprimer le fichier de contr\u00F4le du jeu de s\u00E9maphores %s associ\u00E9 au cache de classe partag\u00E9.
DUMP039=Traitement de l'\u00E9v\u00E9nement de vidage "%1$s", d\u00E9tails "%3$.*2$s" \u00E0 %4$s - Veuillez patienter.
J9CL008=Valeur de d\u00E9lai en nanosecondes hors intervalle
J9CL009=Unit\u00E9 d'ex\u00E9cution d\u00E9j\u00E0 lanc\u00E9e
SHRC222=Les caches de classe partag\u00E9s persistants ne peuvent pas \u00EAtre cr\u00E9\u00E9s/utilis\u00E9s car le mappage de m\u00E9moire ne prend pas en charge les fonctions requises
SHRC223=Impossible de cr\u00E9er/utiliser des caches de classe partag\u00E9s persistants, car le verrouillage de fichiers n'est pas pris en charge
SHRC224=M\u00E9moire insuffisante pour la copie locale du nom du cache
SHRC225=Erreur d'obtention du chemin du fichier de cache
SHRC220=Code d'erreur au niveau du port \= %1$d
SHRC221=Message d'erreur de la plateforme \: %1$s
J9CL010=Impossible d'allouer JNIEnv
SHRC226=Erreur lors de l'ouverture du fichier de cache de classe partag\u00E9
SHRC227=Erreur lors de l'acquisition du verrou d'\u00E9criture de l'en-t\u00EAte du fichier de cache de classe partag\u00E9
SHRC228=Erreur lors de la mise \u00E0 jour de l'heure de la derni\u00E8re connexion au cache de classe partag\u00E9
SHRC229=Erreur \: en-t\u00EAte non valide dans le fichier de cache de classe partag\u00E9
J9CL015=Echec de la cr\u00E9ation d'une trace de pile (sans doute, \u00E0 cause d'un manque de m\u00E9moire du syst\u00E8me d'exploitation)
J9CL016=impossible de cr\u00E9er une entr\u00E9e de chemin d'acc\u00E8s aux classes
J9CL017=impossible d'allouer de la m\u00E9moire pour la ressource de fuseau horaire
J9CL018=impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de fuseau horaire
J9CL011=Echec du processus de traitement en parall\u00E8le pour l'unit\u00E9 d'ex\u00E9cution syst\u00E8me
J9CL012=
J9CL013=Echec de l'allocation du moniteur syst\u00E8me
J9CL014=Argument de ligne de commande JCL non valide
SHRC690=Restreindre le nombre de chemins d'acc\u00E8s aux classes                  \= true
SHRC211=Recherche de donn\u00E9es de type octet pour la cl\u00E9 %.*s dans le cache partag\u00E9...
SHRC695=Restaurer un nouveau cache partag\u00E9 non persistant \u00E0 partir d'un instantan\u00E9
SHRC212=Enregistrement de donn\u00E9es de type octet pour la cl\u00E9 %.*s dans le cache partag\u00E9...
SHRC696=Les sous-options "%s" et "%s" sont incompatibles. La sous-option "%s" est ignor\u00E9e
SHRC213=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de la table de hachage dans ByteDataManagerImpl
SHRC697=Impossible d'obtenir un r\u00E9pertoire pour le cache partag\u00E9
SHRC214=Impossible d'entrer le mutex de table de hachage ByteDataManager
SHRC698=Le cache partag\u00E9 non persistant "%s" a \u00E9t\u00E9 restaur\u00E9 \u00E0 partir de l'instantan\u00E9
SHRC691=Restreindre le nombre de chemins d'acc\u00E8s aux classes                  \= false
SHRC692=Cr\u00E9er un instantan\u00E9 d'un cache partag\u00E9 non persistant existant
SHRC693=D\u00E9truire l'instantan\u00E9 d'un cache partag\u00E9 (utiliser le param\u00E8tre de nom ou la valeur par d\u00E9faut)
SHRC210=[Sortie d\u00E9taill\u00E9e des donn\u00E9es de type octet -Xshareclasses activ\u00E9e]
SHRC694=D\u00E9truire tous les instantan\u00E9s de cache partag\u00E9
SHRC219=[Acc\u00E8s de groupe -Xshareclasses pour les nouveaux caches activ\u00E9]
SHRC215=Cr\u00E9er un cache de classe partag\u00E9 persistant
SHRC699=Impossible de restaurer le cache partag\u00E9 non persistant "%s" \u00E0 partir de l'instantan\u00E9
SHRC216=Cr\u00E9er un cache de classe partag\u00E9 non persistant
SHRC217=[Cache non volatile -Xshareclasses activ\u00E9]
SHRC218=[Cache non volatile -Xshareclasses d\u00E9sactiv\u00E9]
J9CL004=Version de biblioth\u00E8que de classes incompatible \: v%1$i attendue pour JCL, v%2$i identifi\u00E9e
J9CL005=Version de biblioth\u00E8que de classes incompatible \: machine virtuelle v%1$i requise, v%2$i identifi\u00E9e
J9CL006=Aucune donn\u00E9e de pr\u00E9-v\u00E9rification pour java/lang/Object
J9CL007=La valeur du d\u00E9lai est n\u00E9gative
J9CL000=Biblioth\u00E8que de classe incompatible
J9CL001=Tentative d'ex\u00E9cution avec -jcl\:%s
J9CL002=Classes issues d'une biblioth\u00E8que non-J9 ou de JXE r\u00E9duit de fa\u00E7on incorrecte
J9CL003=Version de biblioth\u00E8que de classes incompatible \: JCL %1$x, VM %2$x
SHRC244=Erreur lors de l'obtention de la longueur du fichier de cache de classe partag\u00E9
SHRC245=Erreur lors du mappage du fichier de cache de classe partag\u00E9
SHRC246=Cache non volatile des classes partag\u00E9es %1$s attach\u00E9
SHRC247=Erreur \: l'identificateur de l'en-t\u00EAte du fichier de cache de classe partag\u00E9 n'est pas valide
SHRC240=Erreur \: impossible d'acqu\u00E9rir le verrou en \u00E9criture de la connexion au fichier de cache de classe partag\u00E9
SHRC241=Erreur \: Impossible de supprimer le fichier de cache de classe partag\u00E9
SHRC242=Erreur lors de la mise \u00E0 jour de l'heure de la derni\u00E8re d\u00E9connexion du fichier de cache de classe partag\u00E9
SHRC243=Erreur lors de la lib\u00E9ration du verrou en lecture de la connexion au fichier de cache de classe partag\u00E9
SHRC248=Erreur \: la version de l'en-t\u00EAte du fichier de cache de classe partag\u00E9 n'est pas validee
SHRC249=Erreur \: le niveau de modification de l'en-t\u00EAte du fichier de cache de classe partag\u00E9 n'est pas valide
SHRC233=Erreur lors de la cr\u00E9ation de l'en-t\u00EAte du fichier de cache de classe partag\u00E9
SHRC234=Erreur lors de l'acquisition du verrou en lecture de la connexion au fichier de cache de classe partag\u00E9
SHRC235=Erreur lors de la lib\u00E9ration du verrou en lecture de la connexion au fichier de cache de classe partag\u00E9
SHRC236=Cache persistant des classes partag\u00E9es %1$s cr\u00E9\u00E9
SHRC230=Erreur lors de l'initialisation de l'en-t\u00EAte des donn\u00E9es du cache partag\u00E9
SHRC231=Erreur lors de la d\u00E9finition de la longueur du fichier de cache de classe partag\u00E9
SHRC232=Impossible de cr\u00E9er un cache en mode de lecture seule
SHRC237=Cache persistant des classes partag\u00E9es %1$s ouvert
SHRC238=Erreur \: le cache de classe partag\u00E9 n'est pas connect\u00E9
SHRC239=Erreur \: impossible d'acqu\u00E9rir le verrou en \u00E9criture de l'en-t\u00EAte du fichier de cache de classe partag\u00E9
SHRC260=Echec de la cr\u00E9ation du pool dans ByteDataManager
SHRC261=Activer la sortie prolixe pour les donn\u00E9es internes de type cha\u00EEne
SHRC266=[-Xshareclasses mise en cache des classes retransform\u00E9es activ\u00E9e]
SHRC267=D\u00E9sactiver la mise en cache de classes figurant dans le chemin d'acc\u00E8s aux classes d'amor\u00E7age
SHRC268=[-Xshareclasses mise en cache des entr\u00E9es retransform\u00E9es d\u00E9sactiv\u00E9e]
SHRC269=Le syst\u00E8me ne prend pas en charge la protection des pages de m\u00E9moire
SHRC262=Octets de donn\u00E9es         \= %d
SHRC263=Activer les pages pour la sortie prolixe de CompositeCache
SHRC264=Ne pas arrondir les zones de cache aux limites des pages
SHRC265=Mettre en cache les classes retransform\u00E9es \u00E0 l'aide de JVMTI
EXEL013=\  -Xmn<x>         r\u00E9gler la taille de l'espace des nouveaux objets \u00E0 <x>
EXEL014=\  -Xmn<x>         r\u00E9gler la taille initiale/maximale de l'espace des nouveaux objets \u00E0 <x>
EXEL015=\  -Xmns<x>        r\u00E9gler la taille initiale de l'espace des nouveaux objets \u00E0 <x>
EXEL016=\  -Xmnx<x>         r\u00E9gler la taille maximum de l'espace des nouveaux objets \u00E0 <x>
EXEL017=\  -Xmo<x>         r\u00E9gler la taille de l'espace des anciens objets \u00E0 <x>
EXEL018=\  -Xmo<x>         r\u00E9gler la taille initiale/maximale de l'espace des anciens objets \u00E0 <x>
EXEL019=\  -Xmos<x>        r\u00E9gler la taille initiale de l'espace des anciens objets \u00E0 <x>
EXEL010=Les valeurs suivies de "k" (kilo) ou de "m" (m\u00E9ga) seront trait\u00E9es en cons\u00E9quence.\n
EXEL011=\  -Xmca<x>        r\u00E9gler l'incr\u00E9ment de segment de classe RAM \u00E0 <x>
EXEL012=\  -Xmco<x>        r\u00E9gler l'incr\u00E9ment de segment de classe ROM \u00E0 <x>
SHRC250=Le cache ne peut \u00EAtre ouvert en lecture seule, car il n'a pas encore \u00E9t\u00E9 initialis\u00E9
SHRC255=Erreur de mise \u00E0 jour de l'heure de la derni\u00E8re d\u00E9connexion du fichier de cache de classe partag\u00E9 lors de l'arr\u00EAt de la JVM
SHRC256=Le cache partag\u00E9 persistant "%1$s" a \u00E9t\u00E9 d\u00E9truit
SHRC257=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e dans Manager
SHRC258=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans Manager
SHRC251=N'effectuez pas l'auto-suppression des caches \u00E0 partir d'ID de g\u00E9n\u00E9ration diff\u00E9rents
SHRC252=Erreur lors de la recherche dans le fichier de cache de classe partag\u00E9
SHRC253=Erreur lors de l'\u00E9criture de l'en-t\u00EAte du fichier de cache de classe partag\u00E9
SHRC254=Erreur lors de la d\u00E9finition de la longueur du fichier de cache de classe partag\u00E9
EXEL002=\  -Xbootclasspath/p\:<chemin>  ajouter <chemin> au d\u00E9but du chemin des classes d'amor\u00E7age
EXEL003=\  -Xbootclasspath/a\:<chemin>  ajouter <chemin> \u00E0 la fin du chemin des classes d'amor\u00E7age
EXEL004=\n  -Xrun<library>[\:options]  charge la biblioth\u00E8que d'agents native\n                            (obsol\u00E8te ; utiliser -agentlib)\n
EXEL005=\  -Xint           ex\u00E9cuter en mode interpr\u00E9t\u00E9 uniquement (\u00E9quivalent de -Xnojit -Xnoaot)
SHRC259=Impossible d'entrer le mutex de table de hachage Manager
EXEL006=\  -Xnojit         d\u00E9sactiver le compilateur JIT
EXEL007=\  -Xnoaot         ne pas ex\u00E9cuter le code pr\u00E9compil\u00E9
EXEL008=\  -Xfuture        activer les contr\u00F4les les plus stricts pour anticiper le comportement par d\u00E9faut
EXEL009=\nLes arguments des options suivantes sont exprim\u00E9s en octets.
EXEL000=Les options suivantes ne sont pas standard et pourront changer sans pr\u00E9avis.\n
EXEL001=\  -Xbootclasspath\:<chemin>    r\u00E9gler le chemin des classes d'amor\u00E7age sur <chemin>
SHRC280=Cr\u00E9ation d'une liste de tous les caches dans cacheDir %s
SHRC281=Tentative de destruction de tous les caches dans cacheDir %s
SHRC282=La taille de page du syst\u00E8me d'exploitation est incompatible avec ce cache. Tentative de recr\u00E9ation du cache.
SHRC283=Ouvrez le cache avec des droits en lecture seule
SHRC288=ID de m\u00E9moire partag\u00E9e   \= %d
SHRC289=Ne pas d\u00E9tecter lorsqu'un cache se trouve dans un syst\u00E8me de fichiers r\u00E9seau distant.
SHRC284=Impossible de cr\u00E9er un cache en mode de lecture seule
SHRC285=Cache persistant de classes partag\u00E9es %1$s ouvert en lecture seule
SHRC286=Cache de classe partag\u00E9 %1$s ouvert en lecture seule
SHRC287=Le cache persistant ne peut pas se trouver dans un syst\u00E8me de fichiers r\u00E9seau. S\u00E9lectionnez  "nonpersistent" ou un r\u00E9pertoire de caches diff\u00E9rent.
EXEL035=\  -Xminf<x>       pourcentage minimal de tas libre apr\u00E8s r\u00E9cup\u00E9ration de place
EXEL036=\  -Xmaxf<x>       pourcentage maximal de tas libre apr\u00E8s r\u00E9cup\u00E9ration de place
EXEL037=\nLes arguments des options suivantes sont exprim\u00E9s en tant que nombres d\u00E9cimaux.\n
EXEL038=\  -Xgcthreads<x>                r\u00E9gler le nombre d'unit\u00E9s d'ex\u00E9cution de r\u00E9cup\u00E9ration de place
EXEL039=\  -Xnoclassgc                   d\u00E9sactiver le d\u00E9chargement de classe dynamique
EXEL030=\  -Xss<x>         r\u00E9gler la taille de pile de l'unit\u00E9 d'ex\u00E9cution \u00E0 <x>
EXEL031=\  -Xmine<x>       r\u00E9gler la taille minimale pour l'expansion du tas \u00E0 <x>
EXEL032=\  -Xmaxe<x>       r\u00E9gler la taille maximale pour l'expansion du tas \u00E0 <x>
EXEL033=\nLes arguments des options suivantes sont exprim\u00E9s sous forme de d\u00E9cimaux entre 0 et 1.
EXEL034=Une valeur de 0.3 repr\u00E9sente une demande de 30%%\n
SHRC270=Configurer la protection des pages de m\u00E9moire cache
SHRC271=Sous-option non reconnue pour l'option mprotect\=
SHRC272=Protection de page de m\u00E9moire compl\u00E8te activ\u00E9e pour le cache
SHRC277=Pour ex\u00E9cuter l'utilitaire "%s" sur un cache partag\u00E9 non persistant "%s", vous devez \u00E9galement utiliser la sous-option "nonpersistent"
SHRC278=L'utilitaire "%s" ne peut pas fonctionner sur un cache de classes incompatible "%s". Utilisez une JVM du niveau correct.
SHRC279=Recr\u00E9er le cache partag\u00E9 au d\u00E9marrage
SHRC273=Protection de page de m\u00E9moire par d\u00E9faut activ\u00E9e pour le cache
SHRC274=Protection de page de m\u00E9moire d\u00E9sactiv\u00E9e pour le cache
SHRC275=D\u00E9finir l'emplacement des fichiers de cache JVM
SHRC276=Pour ex\u00E9cuter l'utilitaire "%s" sur le cache de classes persistant "%s", n'utilisez pas la sous-option "nonpersistent"
EXEL024=\  -Xmx<x>         r\u00E9gler la taille maximale de m\u00E9moire \u00E0 <x>
EXEL025=\  -Xmr<x>         r\u00E9gler la taille de l'ensemble m\u00E9moris\u00E9 \u00E0 <x>
EXEL026=\  -Xmrx<x>        r\u00E9gler la taille maximale de l'ensemble m\u00E9moris\u00E9 \u00E0 <x>
EXEL027=\  -Xmso<x>        r\u00E9gler la taille de pile de l'unit\u00E9 d'ex\u00E9cution du syst\u00E8me d'exploitation \u00E0 <x>
EXEL028=\  -Xiss<x>        r\u00E9gler la taille initiale de pile de l'unit\u00E9 d'ex\u00E9cution Java \u00E0 <x>
EXEL029=\  -Xss<x>        r\u00E9gler la taille maximale de pile de l'unit\u00E9 d'ex\u00E9cution Java \u00E0 <x>
EXEL020=\  -Xmox<x>        r\u00E9gler la taille maximum de l'espace des anciens objets \u00E0 <x>
EXEL021=\  -Xmoi<x>        r\u00E9gler l'incr\u00E9ment de l'espace des anciens objets \u00E0 <x>
EXEL022=\  -Xms<x>         r\u00E9gler la taille de l'espace des anciens objets \u00E0 <x>
EXEL023=\  -Xms<x>         r\u00E9gler la taille initiale de m\u00E9moire \u00E0 <x>
EXEL057=
EXEL058=Erreur interne de la VM \: M\u00E9moire insuffisante
EXEL059=Erreur interne de la VM \: Classe java/lang/String introuvable
EXEL050=\  -Xrdbginfo\:<h\u00F4te>\:<port>      activer le serveur d'informations de d\u00E9bogage distant
EXEL051=\nATTENTION \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nAVERTISSEMENT \: Utilisez "-classpath <chemin>" ou "-cp <chemin>".
EXEL052=\nATTENTION \: L'argument de ligne de commande "%s" est obsol\u00E8te.\nAVERTISSEMENT \: Utilisez plut\u00F4t l'argument -X.
EXEL053=
EXEL054=
EXEL055=Cible \: %s
EXEL056=
SHRC291=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ROMClassResourceManager
SHRC292=Impossible d'entrer le mutex de table de hachage ROMClassResourceManager
SHRC293=Impossible d'allouer de la m\u00E9moire pour le pool d'\u00E9l\u00E9ments de table de hachage dans ROMClassResourceManager
SHRC294=%1$d\: 0x%2$p CHARARRAY \: \u00E0 0x%3$p.
SHRC290=Echec de la cr\u00E9ation de la nouvelle table de hachage dans ROMClassResourceManager
SHRC299=Le cache de classe partag\u00E9 "%s" n'a pas \u00E9t\u00E9 cr\u00E9\u00E9 avec l'option imbriqu\u00E9e. Impossible d'augmenter la m\u00E9moire du cache.
SHRC295=D\u00E9sactivez la d\u00E9pendance sur CORE_MMAP sur AIX
SHRC296=L'ex\u00E9cution avec l'option "noCoreMmap" signifie qu'il est peu probable qu'IBM pourra vous aider \u00E0 diagnostiquer un plantage, dans la mesure o\u00F9 les donn\u00E9es des classes seront absentes des vidages syst\u00E8me.
SHRC297=Pour pouvoir utiliser des caches de classe partag\u00E9s persistants sur AIX, affectez \u00E0 la variable d'environnement CORE_MMAP la valeur "yes"
SHRC298=Pour ex\u00E9cuter l'utilitaire "%s" sur le cache de classes persistant "%s", utilisez la sous-option "persistent".
EXEL046=\  -Xlp                          activer le support des grandes pages
EXEL047=\n  -Xdbg\:<options>               activer les options standard JDWP de d\u00E9bogage
EXEL048=\  -Xrunjdwp\:<options>               activer les options standard JDWP de d\u00E9bogage
EXEL049=\  -Xdbginfo\:<chemin fichier symboles>  activer le serveur d'informations de d\u00E9bogage
EXEL040=\  -Xclassgc                     activer le d\u00E9chargement de classe dynamique
EXEL041=\  -Xalwaysclassgc               activer le d\u00E9chargement de classe dynamique \u00E0 chaque r\u00E9cup\u00E9ration de place
EXEL042=\  -Xnocompactexplicitgc         d\u00E9sactiver le compactage lors d'une r\u00E9cup\u00E9ration de place syst\u00E8me
EXEL043=\  -Xcompactexplicitgc           activer le compactage \u00E0 chaque r\u00E9cup\u00E9ration de place syst\u00E8me
EXEL044=\  -Xcompactgc                   activer le compactage
EXEL045=\  -Xnocompactgc                 d\u00E9sactiver le compactage
SHRC192=La valeur de -Xscmaxaot est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur illimit\u00E9e lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC193=%1$d \: 0x%2$p AOT \: %4$.*3$s
SHRC194=\tpour ROMClass %2$.*1$s \u00E0 0x%3$p.
SHRC195=Activer la sortie d\u00E9taill\u00E9e pour AOT
SHRC190=La valeur de -Xscminaot ne doit pas \u00EAtre sup\u00E9rieure \u00E0 la valeur de -Xscmaxaot
SHRC191=La valeur de -Xscminaot est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur \u00E9gale \u00E0 celle de -Xscmx lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC196=[Sortie d\u00E9taill\u00E9e AOT -Xshareclasses activ\u00E9e]
SHRC197=Recherche du code AOT pour ROMMethod 0x%1$p dans le cache partag\u00E9...
SHRC198=Enregistrement du code AOT pour ROMMethod 0x%1$p dans le cache partag\u00E9...
SHRC199=\ Succ\u00E8s de l'enregistrement de %2$.*1$s.
TRCE020=D\u00E9passement du temps imparti lors de l'arr\u00EAt du moteur de trace.
JNCK097=\tadvice         affiche un conseil
JNCK098=Erreur JNI dans %1$s \: l'argument \#%2$d attend %3$s %4$s ; l'argument r\u00E9el est %5$s %6$s
JNCK095=Erreur JNI dans la valeur retourn\u00E9e \: le type de retour est une r\u00E9f\u00E9rence, mais la valeur (0x%1$p) n'est pas une r\u00E9f\u00E9rence d'objet valide. Son type est \: %2$s
JNCK096=\twarn           affiche des avertissements
JNCK099=Erreur JNI dans %1$s \: l'argument \#%2$d n\u00E9cessite un type non tableau
JNCK090=Avertissement d\u00E9tect\u00E9 dans le cadre du gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
JNCK093=Erreur JNI dans %s \: La m\u00E9thode n'est pas un constructeur
JNCK094=Erreur JNI dans %1$s \: Les donn\u00E9es point\u00E9es par l'argument \#%2$d ont \u00E9t\u00E9 modifi\u00E9es pendant l'ex\u00E9cution de %3$s. Les donn\u00E9es ont probablement \u00E9t\u00E9 modifi\u00E9es par un autre processus ou par un appel imbriqu\u00E9. Le r\u00E9sultat de %4$s peut \u00EAtre incorrect et la VM peut devenir instable
JNCK091=Information d\u00E9tect\u00E9e dans le cadre du gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
JNCK092=\tvalist         v\u00E9rifier la r\u00E9utilisation de va_list
JNCK086=Avertissement JNI dans %1$s \: L'argument \#%2$d n'est pas une ressource java/nio/Buffer. %3$s renverra un code erreur
JNCK087=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas une ressource java/lang/reflect/Method ou java/lang/reflect/Constructor
JNCK084=Avertissement d\u00E9tect\u00E9 dans JNI_OnLoad, biblioth\u00E8que %.*s\n
JNCK085=Conseil d\u00E9tect\u00E9 dans JNI_OnLoad, biblioth\u00E8que %.*s\n
JNCK088=Avertissement JNI dans %1$s \: Argument \#%2$d est une r\u00E9f\u00E9rence faible (weak). Une r\u00E9f\u00E9rence faible (weak) peut devenir NULL \u00E0 tout moment. La r\u00E9f\u00E9rence doit \u00EAtre promue en utilisant NewLocalRef ou NewGlobalRef et doit \u00EAtre compar\u00E9e \u00E0 NULL avant l'appel \u00E0 %3$s
JNCK089=Erreur d\u00E9tect\u00E9e dans le cadre du gestionnaire d'un \u00E9v\u00E9nement JVMPI ou JVMTI\n
CFRE020=d\u00E9but de PC du gestionnaire d'exception non valide
CFRE021=champ en double
CFRE022=thisClass doit \u00EAtre une classe
CFRE023=pool de constantes vide
CFRE024=nom de classe doit \u00EAtre une cha\u00EEne
CFRE025=champ contient deux attributs ConstantValue
CFRE026=type de bytecode de newarray non reconnu
CFRE027=Le bytecode de multianewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe array
CFRE017=plusieurs attributs StackMap/StackMapTable
CFRE018=classe interne doit \u00EAtre une classe
CFRE019=d\u00E9but de PC de variable locale non valide
CFRE031=exception \u00E9mise doit \u00EAtre une classe
CFRE032=superclass de l'interface doit \u00EAtre java.lang.Object
CFRE033=plage de gestionnaire d'exception est vide
CFRE034=bytecode incomplet
CFRE035=Le bytecode de new doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE036=La cible n'est pas une instruction dans le bytecode de jump
CFRE037=temp contient un type incorrect
CFRE038=La m\u00E9thode contient deux attributs Exceptions
CFRE030=superclass null
CFRE028=Le bytecode ldc* doit faire r\u00E9f\u00E9rence \u00E0 une constante
CFRE029=Le bytecode de multianewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE000=%1$s; classe\=%3$.*2$s, m\u00E9thode\=%5$.*4$s%7$.*6$s, pc\=%8$u
CFRE001=%1$s; classe\=%3$.*2$s, d\u00E9calage\=%4$u
CFRE002=nom de m\u00E9thode non valide
CFRE003=version majeure incorrecte
CFRE004=bytecode inconnu
CFRE005=interface en double
CFRE010=nombre n\u00E9gatif de paires correspondance/d\u00E9calage dans le bytecode de lookupswitch
CFRE011=bytecode de anewarray doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE012=constante doit \u00EAtre une valeur
CFRE013=longueur du PC de variable locale non valide
CFRE014=attribut de code indiqu\u00E9 pour une m\u00E9thode abstraite ou native
CFRE015=les interfaces doivent \u00EAtre des classes
CFRE016=L'index de la variable locale est hors plage dans un incr\u00E9ment
CFRE006=attribut StackMap/StackMapTable non valide
CFRE007=signature de champ non valide
CFRE008=haut < bas dans le bytecode de tableswitch
CFRE009=un champ interface doit \u00EAtre d\u00E9clar\u00E9 comme \: public, static et final
CFRE064=descripteur doit \u00EAtre une cha\u00EEne de type UTF8
CFRE065=attributs de m\u00E9thode englobante multiples
CFRE066=plusieurs attributs InnerClasses
CFRE067=balise d'entr\u00E9e de pool de constantes inconnue
CFRE068=nom de classe non valide
CFRE069=longueur d'attribut sup\u00E9rieure aux donn\u00E9es d'attribut
CFRE060=Le PC de fin du gestionnaire d'exception n'est pas une instruction ni la fin du tableau de bytecodes
CFRE061=nom doit \u00EAtre une cha\u00EEne de type UTF8
CFRE062=nombre maximum de variables locales inf\u00E9rieur \u00E0 la taille des arguments
CFRE063=le bytecode d'invoke appelle une m\u00E9thode non valide
JNCK039=Erreur JNI dans %1$s \: L'argument \#%2$d est NULL
JNCK037=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence locale. Son type est \: %4$s
JNCK038=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence d'objet valide. Son type est \: %4$s\n
JNCK031=Erreur JNI dans %1$s \: L'argument \#%2$d est NULL
JNCK032=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un jobjectArray
JNCK030=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e tandis que le GC est d\u00E9sactiv\u00E9 (elle a probablement \u00E9t\u00E9 appel\u00E9e \u00E0 partir d'un \u00E9v\u00E9nement JVMPI ou JVMTI)
JNCK035=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence globale. Son type est \: %4$s
JNCK036=Erreur JNI dans %1$s \: L'argument \#%2$d (0x%3$p) n'est pas une r\u00E9f\u00E9rence globale faible (weak). Son type est \: %4$s
JNCK033=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un jarray
JNCK034=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas un %3$s
CFRE075=signature de variable locale non valide
CFRE076=magic number incorrect
CFRE077=les interfaces doivent \u00EAtre de type abstract
CFRE078=index de la classe de la m\u00E9thode englobante doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE079=PC du gestionnaire d'exception non valide
CFRE070=PC de num\u00E9ro de ligne non valide
CFRE071=tableau de bytecode est vide
CFRE072=entr\u00E9es non tri\u00E9es dans le bytecode de lookupswitch
CFRE073=attribut StackMap/StackMapTable trouv\u00E9 hors de l'attribut Code
CFRE074=aucun attribut Code indiqu\u00E9
JNCK028=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e quand une exception est en instance
JNCK029=Erreur JNI dans %s \: Cette fonction ne peut \u00EAtre appel\u00E9e \u00E0 l'int\u00E9rieur d'une section critique
JNCK026=Erreur JNI dans %s \: JNIEnv ne semble pas \u00EAtre une unit\u00E9 d'ex\u00E9cution valide, ou la m\u00E9moire a \u00E9t\u00E9 corrompue, ou il ne s'agit pas d'une machine virtuelle J9
JNCK027=Erreur JNI dans %s \: JNIEnv n'est pas l'\u00E9l\u00E9ment JNIEnv pour l'unit\u00E9 d'ex\u00E9cution active
JNCK020=r\u00E9f\u00E9rence du d\u00E9bogueur
JNCK021=r\u00E9f\u00E9rence locale dans une autre unit\u00E9 d'ex\u00E9cution
JNCK024=Erreur JNI d\u00E9tect\u00E9e. Abandon du traitement.
JNCK025=Utilisez -Xcheck\:jni\:nonfatal pour poursuivre le traitement en cas d'erreurs.
JNCK022=r\u00E9f\u00E9rence locale lib\u00E9r\u00E9e
JNCK023=Erreur JNI d\u00E9tect\u00E9e. Poursuite du traitement...
CFRE042=taille du tableau de bytecode > 65535
CFRE043=Le bytecode ne peut pas \u00EAtre 'wide'
CFRE044=l'emplacement r\u00E9serv\u00E9 du bytecode d'invokeinterface n'est pas \u00E9gal \u00E0 z\u00E9ro
CFRE045=L'index du pool de constantes est hors plage
CFRE046=remplissage de bytecode de switch incorrect
CFRE047=La classe d'interface doit uniquement \u00EAtre \: public, abstract ou annotation
CFRE048=L'index de la variable locale est hors plage dans le stockage (store)
CFRE049=Le bytecode de checkcast doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE040=longueur d'attribut inf\u00E9rieure aux donn\u00E9es d'attribut
CFRE041=version mineure incorrecte
JNCK017=r\u00E9f\u00E9rence locale
JNCK018=r\u00E9f\u00E9rence globale
JNCK015=\thelp           imprimer cet \u00E9cran
JNCK016=NULL
JNCK019=r\u00E9f\u00E9rence globale faible (weak)
CFRE039=L'index de la variable locale est hors plage dans le chargement (load)
JNCK010=\tnonfatal       ne pas quitter lorsque des erreurs sont d\u00E9tect\u00E9es
JNCK013=\tnovalist       ne pas v\u00E9rifier la r\u00E9utilisation de va_list
JNCK014=\tpedantic       effectuer des v\u00E9rifications plus pouss\u00E9es (mais plus longues)
JNCK011=\tnowarn         ne pas afficher les avertissements
JNCK012=\tnoadvice       ne pas afficher de conseil
CFRE053=m\u00E9thode contient plus de 255 emplacements d'argument
CFRE054=le bytecode de champ doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment Fieldref
CFRE055=fin de PC du gestionnaire d'exception non valide
CFRE056=nombre d'arguments de bytecode d'invokeinterface incorrect
CFRE057=type du gestionnaire d'exception doit \u00EAtre une classe
CFRE058=L'index de la variable locale est hors plage dans le retour de la sous-routine
CFRE059=PC du gestionnaire d'exception n'est pas une instruction
CFRE050=La m\u00E9thode de l'interface doit \u00EAtre d\u00E9clar\u00E9e public et abstract
CFRE051=constante cha\u00EEne doit \u00EAtre une cha\u00EEne
CFRE052=classe externe doit \u00EAtre une classe
JNCK006=\tall            v\u00E9rifier les classes d'application et syst\u00E8me
JNCK007=\tverbose        tracer certaines fonctions et activit\u00E9s JNI
JNCK004=jnichk - Utilitaire de v\u00E9rification JNI pour J9, version %s
JNCK005=Syntaxe \: -Xcheck\:jni\:[option[,option[,...]]]
JNCK008=\ttrace          tracer toutes les fonctions JNI
JNCK009=\tnobounds       ne pas effectuer de v\u00E9rification de bornes sur les cha\u00EEnes et les tableaux
JNCK002=Utilitaire de v\u00E9rification JNI \: impossible d'ancrer l'\u00E9v\u00E9nement
JNCK003=Utilitaire de v\u00E9rification JNI \: impossible d'allouer un espace de stockage local de machine virtuelle
JNCK000=-Xcheck\:jni\: Option non identifi\u00E9e --> '%s'
JNCK001=Utilitaire de v\u00E9rification JNI install\u00E9. Utilisez -Xcheck\:jni\:help
JNCK082=Conseil d\u00E9tect\u00E9 dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
JNCK083=Erreur d\u00E9tect\u00E9e dans JNI_OnLoad, biblioth\u00E8que %.*s\n
JNCK080=Erreur d\u00E9tect\u00E9e dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
JNCK081=Avertissement d\u00E9tect\u00E9 dans le cadre ext\u00E9rieur d'une unit\u00E9 d'ex\u00E9cution connect\u00E9e\n
SHRC604=R\u00E9server <taille> octets d'espace cache pour les donn\u00E9es de classes brutes
TRCE009=Erreur d'\u00E9criture dans le fichier snap
SHRC605=La taille de m\u00E9moire pour "%s" est trop grande ou sp\u00E9cifi\u00E9e dans une unit\u00E9 autre que 'k','M' ou 'G'.
TRCE008=Erreur lors de la recherche dans le fichier de trace \: %s
SHRC606=Ajoutez des suggestions JIT non fonctionnelles aux m\u00E9thodes \u00E0 des fins de test ; \u00E0 utiliser avec -Xint et un cache pr\u00E9-rempli.
SHRC607=%1$s donn\u00E9es jointes stock\u00E9es %2$s pour  %8$.*7$s.%4$.*3$s%6$.*5$s
SHRC600=La zone de donn\u00E9es de classes brutes est endommag\u00E9e car le stockage de %u octets d\u00E9passe l'espace disponible de la zone disponible ('d\u00E9but d'espace disponible'\=%p, 'fin d'espace disponible'\=%p).
SHRC601=Taille de la zone de donn\u00E9es de classes brutes    %*c\= %lu
SHRC602=%% utilis\u00E9 de la zone de donn\u00E9es de classes brutes      %*c\= %lu%%
SHRC603=Octets de donn\u00E9es de classes brutes utilis\u00E9s     %*c\= %lu
JNCK075=Erreur jnichk interne dans %1$s \: Descripteur 0x%2$x non identifi\u00E9
TRCE001=Erreur lors du traitement de l'option de trace \: -Xtrace\:%s
JNCK076=Erreur jnichk interne dans %s \: M\u00E9moire satur\u00E9e
TRCE000=Option de trace non reconnue \: -Xtrace\:%s
JNCK073=Conseil JNI dans %1$s \: JNI_ABORT a \u00E9t\u00E9 indiqu\u00E9 mais n'a pas \u00E9t\u00E9 trait\u00E9 en raison de la modification des donn\u00E9es.\n(Donn\u00E9es d'origine \: CRC\=0x%2$x, nouvelles donn\u00E9es \: CRC\=0x%3$x).\nPuisque %4$s a renvoy\u00E9 le contenu r\u00E9el du tableau, les modifications ne seront pas annul\u00E9es. Il se peut que ce ne soit pas l'objectif vis\u00E9.
TRCE003=Erreur lors du traitement de l'option de trace, d\u00E9tail \: %s
JNCK074=Conseil JNI dans %s \: le tampon semble ne pas \u00EAtre modifi\u00E9. Utilisez JNI_ABORT au lieu du mode 0.
TRCE002=Erreur lors du traitement de l'option de trace \: -Xtrace\:%s\=%s
TRCE005=Erreur d'\u00E9criture d'en-t\u00EAte dans le fichier de trace \: %s
SHRC608=%1$s donn\u00E9es jointes trouv\u00E9es %2$s pour %8$.*7$s.%4$.*3$s%6$.*5$s
JNCK079=Conseil d\u00E9tect\u00E9 dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE004=Erreur d'ouverture du fichier de trace \: %s
SHRC609=%1$s donn\u00E9es jointes mises \u00E0 jour %2$s pour %8$.*7$s.%4$.*3$s%6$.*5$s
TRCE007=Erreur d'ouverture de la prochaine g\u00E9n\u00E9ration de fichier de trace \: %s
JNCK077=Erreur d\u00E9tect\u00E9e dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE006=Erreur d'\u00E9criture de %d octets dans le fichier de trace \: %s cr \: %d
JNCK078=Avertissement d\u00E9tect\u00E9 dans %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK071=Avertissement JNI \: La m\u00E9moire situ\u00E9e \u00E0 0x%1$p acquise par %2$s n'a pas \u00E9t\u00E9 lib\u00E9r\u00E9e avant le retour depuis le code natif. Il s'agit probablement d'une fuite de m\u00E9moire.
JNCK072=Conseil JNI dans %1$s \: JNI_COMMIT a \u00E9t\u00E9 indiqu\u00E9 mais ne sera pas pris en compte.\nPuisque %2$s a renvoy\u00E9 le contenu r\u00E9el du tableau, le tampon ne sera plus valide apr\u00E8s cet appel. Il se peut que ce ne soit pas l'objectif vis\u00E9.
TRCE010=Incident d'allocation de m\u00E9moire native ; reprise des param\u00E8tres de trace nodynamic.
JNCK070=Avertissement JNI dans %1$s \: Donn\u00E9es de tableau originales modifi\u00E9es entre %2$s et %3$s.\n(Donn\u00E9es d'origine \: CRC\=0x%4$x, nouvelles donn\u00E9es \: CRC\=0x%5$x).\nDu fait que %6$s a renvoy\u00E9 une copie du contenu du tableau, le nouveau contenu sera perdu.
TRCE019=Initialisation incorrecte du moteur de trace ; CR \= %d
JNCK064=Avertissement JNI dans %1$s \: la capacit\u00E9 du pool de r\u00E9f\u00E9rences globales faibles (weak) a augment\u00E9 automatiquement de %2$d \u00E0 %3$d.\nCela peut indiquer une fuite de m\u00E9moire.
TRCE012=Impossible d'ouvrir le fichier de compteur de trace %s ; compteurs redirig\u00E9s vers stderr.
JNCK065=Avertissement JNI dans %1$s \: la capacit\u00E9 du cadre de r\u00E9f\u00E9rences locales a augment\u00E9 automatiquement de %2$d \u00E0 %3$d. %4$d r\u00E9f\u00E9rences sont utilis\u00E9es.\nUtilisez EnsureLocalCapacity ou PushLocalFrame pour augmenter explicitement la capacit\u00E9 du cadre.
TRCE011=Module non configur\u00E9 pour la trace \: %s
JNCK062=Erreur JNI dans %s \: Cette fonction ne doit pas \u00EAtre appel\u00E9e \u00E0 l'int\u00E9rieur d'une section critique
TRCE014=Echec de l'initialisation du moteur de trace ; trace non activ\u00E9e
JNCK063=Avertissement JNI dans %1$s \: Passage automatique de la capacit\u00E9 du pool de r\u00E9f\u00E9rences globales de %2$d \u00E0 %3$d.\nIl peut s'agit d'un indicateur de perte de m\u00E9moire.
TRCE013=Consignation des informations de comptage de trace dans %s
TRCE016=Stockage pour RasGlobalStorage non disponible ; trace non activ\u00E9e
JNCK068=Avertissement JNI dans %1$s \: D\u00E9but ou index hors intervalle (%2$d >\= %3$d)
JNCK069=Avertissement JNI dans %1$s \: Fin hors intervalle (%2$d + %3$d > %4$d)
TRCE015=Erreur d'enregistrement de l'abonn\u00E9 d'\u00E9criture de trace
TRCE018=Impossible d'allouer une cl\u00E9 de m\u00E9moire locale d'unit\u00E9 d'ex\u00E9cution UTE
JNCK066=Avertissement JNI dans %1$s \: Index ou d\u00E9but n\u00E9gatif (%2$d) indiqu\u00E9
TRCE017=Impossible d'allouer une cl\u00E9 de m\u00E9moire locale d'unit\u00E9 d'ex\u00E9cution RAS
JNCK067=Avertissement JNI dans %1$s \: Longueur n\u00E9gative de r\u00E9gion (%2$d) indiqu\u00E9e
CFRE086=m\u00E9thode contient deux attributs Code
CFRE087=le bytecode de m\u00E9thode d'interface doit r\u00E9f\u00E9rencer un \u00E9l\u00E9ment InterfaceMethodref
CFRE088=nom de variable locale doit \u00EAtre une cha\u00EEne
CFRE089=nom et type attendus
JNCK060=Avertissement JNI dans %1$s \: L'argument \#%2$d est une signature de m\u00E9thode incorrectement form\u00E9e ("%3$s")
JNCK061=Avertissement JNI dans %1$s \: L'argument \#%2$d est une signature de champ incorrectement form\u00E9e ("%3$s")
SHRC620=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. Le fichier de contr\u00F4le est endommag\u00E9.
CFRE080=signature de m\u00E9thode non valide
SHRC621=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. Non concordance d'ID m\u00E9moire partag\u00E9e.
CFRE081=fichier source doit \u00EAtre de type UTF8
CFRE082=la m\u00E9thode <init> ne doit pas \u00EAtre static, final, synchronized, native ou abstract
CFRE083=la classe est \u00E0 la fois abstract et final
CFRE084=aucune erreur
CFRE085=nom interne doit \u00EAtre une cha\u00EEne
SHRC626=Impossible d'obtenir les statistiques du cache partag\u00E9 car aucun cache partag\u00E9 valide n'existe.
SHRC627=La re-cr\u00E9ation d'un fichier de contr\u00F4le de m\u00E9moire partag\u00E9e n'est pas autoris\u00E9e lors de l'ex\u00E9cution en mode lecture seule.
SHRC628=Le fichier de contr\u00F4le de m\u00E9moire partag\u00E9e n'est pas lisible.
JNCK059=Avertissement JNI dans %1$s \: L'argument \#%2$d est un identificateur incorrectement form\u00E9 ("%3$s")
SHRC629=Le fichier de contr\u00F4le de m\u00E9moire partag\u00E9e est en lecture seule.
SHRC622=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. Non concordance de cl\u00E9 de m\u00E9moire partag\u00E9e.
SHRC623=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. La recherche d'ID groupe a \u00E9chou\u00E9.
SHRC624=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. La recherche d'ID utilisateur a \u00E9chou\u00E9.
SHRC625=Erreur lors de l'ouverture de la r\u00E9gion de m\u00E9moire partag\u00E9e. La recherche de la taille de m\u00E9moire partag\u00E9e a \u00E9chou\u00E9.
JNCK053=Erreur JNI \: La section critique doit \u00EAtre lib\u00E9r\u00E9e avant le retour de la fonction
JNCK054=Erreur JNI dans %1$s \: Option de mode %2$d non identifi\u00E9e
JNCK051=Erreur VM interne dans %1$s \: Les octets transmis %2$p sont de taille inf\u00E9rieure aux octets de r\u00E9f\u00E9rence JNI %3$p
JNCK052=Erreur JNI dans %1$s \: La classe %3$.*2$s est obsol\u00E8te
JNCK057=Erreur JNI dans %1$s \: N'utilisez pas %2$s pour lib\u00E9rer la m\u00E9moire 0x%3$p acquise \u00E0 l'aide de %4$s
JNCK058=Avertissement JNI dans %1$s \: Apr\u00E8s avoir appel\u00E9 %2$s et avant d'appeler %3$s, recherchez les exceptions \u00E0 l'aide de ExceptionCheck, ExceptionClear ou ExceptionOccurred
JNCK055=Erreur JNI dans %1$s \: Le pointeur 0x%2$p n'a \u00E9t\u00E9 renvoy\u00E9 par aucune fonction JNI ou a d\u00E9j\u00E0 \u00E9t\u00E9 lib\u00E9r\u00E9
JNCK056=Erreur JNI dans %1$s \: 0x%2$p de m\u00E9moire re\u00E7u de l'objet 0x%3$p ; lib\u00E9ration de 0x%4$p
CFRE097=entr\u00E9e de classe interne en double dans l'attribut InnerClasses
CFRE098=signature de la variable locale doit \u00EAtre une cha\u00EEne
CFRE099=modificateurs de m\u00E9thode non autoris\u00E9s
JNCK050=Erreur JNI dans %s \: PopLocalFrame appel\u00E9 sans cadre local sur la pile
CFRE090=bytecode de new ne peut pas cr\u00E9er des tableaux
CFRE091=Le PC de d\u00E9but du gestionnaire d'exception n'est pas une instruction
SHRC610=D\u00E9sactivez le support d'instrumentation de byte-code.
CFRE092=signature non valide
CFRE093=m\u00E9thode ne peut \u00EAtre que public, private ou protected
CFRE094=bytecode de instanceof doit faire r\u00E9f\u00E9rence \u00E0 une classe
CFRE095=annotations doivent \u00EAtre des interfaces
CFRE096=La cible n'est pas une instruction dans le bytecode de switch
SHRC615=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Non concordance de cl\u00E9 s\u00E9maphore.
SHRC616=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Non concordance du nombre de s\u00E9maphores dans le jeu de s\u00E9maphores.
SHRC617=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Marqueur de s\u00E9maphore introuvable dans le jeu de s\u00E9maphores
JNCK048=Erreur JNI dans %s \: R\u00E9cepteur non \u00E9ligible
SHRC618=Le fichier de contr\u00F4le de s\u00E9maphore n'est pas lisible.
JNCK049=Erreur JNI dans %s \: r\u00E9utilisation de va_list d\u00E9tect\u00E9e
SHRC611=La sous-option "disableBCI" est sp\u00E9cifi\u00E9e, mais le cache existant a \u00E9t\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de la sous-option "enableBCI".
SHRC612=Cl\u00E9 de stockage (0-15) artificiellement d\u00E9finie sur z/OS \u00E0 des fins de test.
SHRC613=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Le fichier de contr\u00F4le est endommag\u00E9.
SHRC614=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore. Non concordance d'ID s\u00E9maphore.
JNCK042=Erreur JNI dans %1$s \: L'argument \#%2$d n'est pas une sous-classe de %3$s
JNCK043=Erreur JNI dans %1$s \: Argument \#%2$d ; %3$s introuvable
JNCK040=Erreur JNI dans %1$s \: L'argument \#%2$d se trouve hors intervalle pour un %3$s (0x%4$x < 0x%5$x)
JNCK041=Erreur JNI dans %1$s \: L'argument \#%2$d se trouve hors intervalle pour un %3$s (0x%4$x > 0x%5$x)
SHRC619=Le fichier de contr\u00F4le de s\u00E9maphore est en lecture seule.
JNCK046=Erreur JNI dans %1$s \: Le type de retour ('%2$c') de la m\u00E9thode est erron\u00E9
JNCK047=Erreur JNI dans %s \: Argument clazz incorrect
JNCK044=Erreur JNI dans %s \: La m\u00E9thode est statique
JNCK045=Erreur JNI dans %s \: La m\u00E9thode n'est pas statique
SHRC520=\t classpath   Affiche uniquement les types de chemin d'acc\u00E8s aux classes dans le cache partag\u00E9.
SHRC521=\t url               Affiche uniquement les types d'URL dans le cache partag\u00E9.
SHRC522=\t token           Affiche uniquement les types de jeton dans le cache partag\u00E9.
SHRC527=\t zipcache Affiche uniquement les types zipcache dans le cache partag\u00E9.
SHRC528=\t extra           Affiche tous les types priv\u00E9s suivants dans le cache partag\u00E9.
SHRC529=\t orphan         Affiche uniquement les types orphelins dans le cache partag\u00E9.
SHRC523=\t romclass     Affiche uniquement les types de classe rom dans le cache partag\u00E9.
SHRC524=\t rommethod   Affiche uniquement les types de m\u00E9thode rom dans le cache partag\u00E9.
SHRC525=\t aot               Affiche uniquement les types aot dans le cache partag\u00E9.
SHRC526=\t jitprofile Affiche uniquement les types de profil jit dans le cache partag\u00E9.
SHRC510=D\u00E9sactiver la cr\u00E9ation de vidages de caches endommag\u00E9s
SHRC511=Valeur non conforme pour l'option d'initialisation du cache composite. La valeur de ccInitComplete est %lu
SHRC516=R\u00E9pertoriez tous les \u00E9l\u00E9ments du cache par d\u00E9faut. Utilisez printallstats\=help pour afficher les options disponibles.
SHRC517=Sous-option non reconnue pour l'option printallstats\=. Utilisez printallstats\=help pour afficher les options disponibles.
SHRC518=Options disponibles pour -Xshareclasses\:printAllStats\=<options>. Utilisez '+' pour sp\u00E9cifier plusieurs options. Exemple \: printallstats\=aot+url \n
SHRC519=\t all               Affiche tous les types suivants dans le cache partag\u00E9.
SHRC512=aucune donn\u00E9e en cache
SHRC513=D\u00E9finir des autorisations de type Unix pour la cr\u00E9ation de r\u00E9pertoires cache
SHRC514=Valeur non valide pour l'option cacheDirPerm. Celle-ci doit correspondre \u00E0 une autorisation de type Unix sur la plage 0700 - 0777 ou 1700 - 1777 (en repr\u00E9sentation octale).
SHRC515=Echec de l'obtention du r\u00E9pertoire cache par d\u00E9faut.
SHRC541=%1$d \: 0x%2$p AUXILIAIRE \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC542=%1$d \: 0x%2$p POOL \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC543=%1$d \: 0x%2$p AOTDATA \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC544=%1$d \: 0x%2$p VM \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC540=%1$d \: 0x%2$p INCONNU \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC549=-Xshareclasses\:checkStringTableReset peut \u00E9chouer. La table de cha\u00EEnes n'est pas assez grande. Sa taille doit \u00EAtre sup\u00E9rieure \u00E0 la taille de page du syst\u00E8me d'exploitation. Taille de la table \= %d, taille de page \= %d
SHRC545=%1$d \: 0x%2$p CHAINE ROM \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC546=%1$d \: 0x%2$p INUTILISE1 \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC547=Impossible d'allouer de la m\u00E9moire pour chaque matrice de caract\u00E8res dans shrinit
SHRC548=Forcer la r\u00E9initialisation de la table de cha\u00EEnes lorsqu'elle est endommag\u00E9e.
SHRC530=\t jithint       Affiche uniquement les types jithint dans le cache partag\u00E9.
SHRC531=\t aotch           Affiche uniquement les types aotch dans le cache partag\u00E9.
SHRC532=\t aotthunk     Affiche uniquement les types aotthunk dans le cache partag\u00E9.
SHRC533=\t aotdata       Affiche uniquement les types aotdata dans le cache partag\u00E9.
SHRC538=%1$d \: 0x%2$p AOTCH \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC539=%1$d \: 0x%2$p AOTTHUNK \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC534=\t jcl               Affiche uniquement les types jcl dans le cache partag\u00E9.
SHRC535=\t bytedata     Affiche tous les autres types de donn\u00E9es d'octets dans le cache partag\u00E9.
SHRC536=%1$d \: 0x%2$p JITHINT \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC537=%1$d \: 0x%2$p JCL \: %4$.*3$s Adresse \: 0x%5$p Taille \: %6$d
SHRC563=Ouverture d'un cache Realtime qui n'est pas compatible avec cette machine virtuelle Java ; utilisez l'option -Xrealtime de la machine virtuelle Java pour acc\u00E9der \u00E0 ce cache
SHRC564=[cache partag\u00E9 interinvit\u00E9 -Xshareclasses activ\u00E9]
SHRC565=Cr\u00E9er un cache de classe partag\u00E9 interinvit\u00E9
SHRC566=L'identificateur de l'en-t\u00EAte du cache de classe partag\u00E9 interinvit\u00E9 n'est pas valide
SHRC560=Le nom du cache interne n'est pas correct.
SHRC561=Echec de l'initialisation du cache de classe partag\u00E9 ; l'espace disponible dans le syst\u00E8me de fichiers n'est pas suffisant. Espace disque libre disponible en octets \= %lld, octets demand\u00E9s \= %lld.
SHRC562=Donn\u00E9es endommag\u00E9es lues pour l'en-t\u00EAte de l'entr\u00E9e du cache 0x%p (longueur d'\u00E9l\u00E9ment non valide de %u octets)
SHRC567=Cache interinvit\u00E9 de classes partag\u00E9es %1$s ouvert en lecture seule
SHRC568=Cache interinvit\u00E9 des classes partag\u00E9es %1$s ouvert
SHRC569=Cache interinvit\u00E9 des classes partag\u00E9es %1$s cr\u00E9\u00E9
SHRC552=Impossible d'allouer la taille de bloc demand\u00E9e pour le cache "%s". Octets disponibles \= %d, octets demand\u00E9s \= %d
SHRC553=Le cache contient uniquement des classes avec des num\u00E9ros de ligne
SHRC554=Le cache contient uniquement des classes sans num\u00E9ro de ligne
SHRC555=Le cache contient des classes avec des num\u00E9ros de ligne et des classes sans num\u00E9ro de ligne
SHRC550=L'option d'ex\u00E9cution ROUND_TO_PAGE_SIZE est manquante. -Xshareclasses\:checkStringTableReset requiert que la table de cha\u00EEnes soit arrondie en fonction de la taille de page.
SHRC551=Le cache "%s" est plein. Echec de l'allocation de la taille de bloc %d.
SHRC556=Affichez le r\u00E9capitulatif des statistiques de cache. Utilisez printstats\=help pour afficher les options disponibles.
SHRC557=Sous-option non reconnue pour l'option printstats\=. Utilisez printstats\=help pour afficher les options disponibles.
SHRC558=Options disponibles pour -Xshareclasses\:printStats\=<options>. Utilisez '+' pour sp\u00E9cifier plusieurs options. Exemple \: printstats\=aot+url \n
SHRC559=Echec de la cr\u00E9ation d'un r\u00E9pertoire "%s" pour le cache de classe partag\u00E9
SHRC580=Erreur lors de la lib\u00E9ration du verrou en lecture de la connexion au cache de classe partag\u00E9 interinvit\u00E9
SHRC101=\tIndex %1$d dans le chemin d'acc\u00E8s aux classes 0x%2$p
SHRC585=Erreur lors de l'acquisition du verrou d'\u00E9criture de l'en-t\u00EAte de cache de classe partag\u00E9 interinvit\u00E9
SHRC102=\tURL 0x%p
SHRC586=Erreur \: en-t\u00EAte non valide dans le cache de classe partag\u00E9 interinvit\u00E9
SHRC103=\tJeton 0x%p
SHRC587=Erreur lors de la mise \u00E0 jour de l'heure de la derni\u00E8re connexion du cache de classe partag\u00E9 interinvit\u00E9
SHRC104=%1$d \: 0x%2$p CLASSPATH
SHRC588=Erreur lors de la lib\u00E9ration du verrou en lecture de l'en-t\u00EAte de cache de classe partag\u00E9 interinvit\u00E9
SHRC581=Erreur de mappage dans l'objet partag\u00E9 interinvit\u00E9
SHRC582=Erreur \: Impossible de supprimer le cache de classe partag\u00E9 interinvit\u00E9
SHRC583=Erreur de mise \u00E0 jour de l'heure de la derni\u00E8re d\u00E9connexion du cache de classe partag\u00E9 interinvit\u00E9
SHRC100=%1$d \: 0x%2$p ROMCLASS \: %4$.*3$s \u00E0 0x%5$p.
SHRC584=Erreur lors de l'acquisition du verrou en lecture de la connexion au cache de classe partag\u00E9 interinvit\u00E9
SHRC109=\!STALE\!
SHRC105=%1$d \: 0x%2$p URL
SHRC589=Cr\u00E9ez le cache \u00E0 l'aide du support d'instrumentation de byte-code.
SHRC106=%1$d \: 0x%2$p TOKEN
SHRC107=\t%.*s
SHRC108=\t%.*s
SHRC574=Le cache partag\u00E9 interinvit\u00E9 ne peut pas se trouver dans un syst\u00E8me de fichiers r\u00E9seau. S\u00E9lectionnez  "nonpersistent" ou un r\u00E9pertoire de caches diff\u00E9rent.
SHRC575=Erreur lors de l'acquisition de l'en-t\u00EAte dans le cache de classe partag\u00E9 interinvit\u00E9
SHRC576=Le cache partag\u00E9 interinvit\u00E9 ne peut \u00EAtre ouvert en lecture seule, car il n'a pas encore \u00E9t\u00E9 initialis\u00E9
SHRC577=Impossible de cr\u00E9er un cache partag\u00E9 interinvit\u00E9 en mode lecture seule
SHRC570=Le cache partag\u00E9 interinvit\u00E9 "%1$s" a \u00E9t\u00E9 d\u00E9truit
SHRC571=Cache interinvit\u00E9 des classes partag\u00E9es %1$s attach\u00E9
SHRC572=Sp\u00E9cification cible incorrecte trouv\u00E9e. La cible sp\u00E9cifi\u00E9e dans l'en-t\u00EAte de cache est %s, mais %s est attendu.
SHRC573=L'option de ligne de commande "-Xshareclasses\:%s" n\u00E9cessite "-Xvirt"
SHRC578=Erreur lors de la cr\u00E9ation de l'en-t\u00EAte dans le cache de classe partag\u00E9 interinvit\u00E9
SHRC579=Erreur d'initialisation de l'en-t\u00EAte des donn\u00E9es du cache partag\u00E9 interinvit\u00E9
SHRC123=%% classes p\u00E9rim\u00E9es                    \= %1$d%%\n
SHRC124=Cache rempli \u00E0 %1$d%%\n
SHRC125=Impossible d'allouer de la m\u00E9moire pour le tampon de cha\u00EEnes dans SH_CacheMap
SHRC126=Demande d'ajout d'un trop grand nombre d'\u00E9l\u00E9ments dans ClasspathItem
SHRC120=Nombres d'URL             \= %d
SHRC121=Nombre de jetons           \= %d
SHRC122=Nombre de classes p\u00E9rim\u00E9es    \= %d
SHRC127=SH_CompositeCache\:\:enterMutex a \u00E9chou\u00E9 avec le code de retour %d. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9.
SHRC128=Echec de SH_CompositeCache\:\:exitMutex avec le code retour %d. Avertissement \: le cache est peut-\u00EAtre endommag\u00E9.
SHRC129=Tentative d'attribution de la valeur -1 \u00E0 readerCount
SHRC590=La sous-option "enableBCI" a \u00E9t\u00E9 sp\u00E9cifi\u00E9e, mais le cache existant n'a pas \u00E9t\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de la sous-option "enableBCI".
SHRC591=%1$d \: 0x%2$p JITHINT \: %4$.*3$s
SHRC112=pointeur d'allocation \= 0x%p\n
SHRC596=Effectuez des v\u00E9rifications suppl\u00E9mentaires lors du stockage et de l'allocation des donn\u00E9es de classe non concordantes
SHRC113=taille de cache         \= %d
SHRC597=La valeur -Xshareclasses\:rcdSize\=%u octets est sup\u00E9rieure \u00E0 %u octets de l'espace disponible ; la valeur -Xshareclasses\:rcdSize\=%u est utilis\u00E9e \u00E0 la place.
SHRC114=octets disponibles         \= %d
SHRC598=La zone de donn\u00E9es de classes brutes est endommag\u00E9e car la taille de %lu est sup\u00E9rieure \u00E0 la taille totale du cache de %lu.
SHRC115=octets ROMClass     \= %d
SHRC599=L'espace disponible de la zone de donn\u00E9es de classes brutes est endommag\u00E9e ('d\u00E9but d'espace disponible'\=%p, 'fin d'espace disponible'\=%p, 'taille disponible'\=%lu octets)
SHRC592=BCI activ\u00E9        \= true
SHRC593=BCI activ\u00E9         \= false
SHRC110=\nadresse de base           \= 0x%p
SHRC594=La sous-option -Xshareclasses\:cacheRetransformed est incompatible avec un cache partag\u00E9 cr\u00E9\u00E9 \u00E0 l'aide de la sous-option enableBCI
SHRC111=adresse de fin            \= 0x%p
SHRC595=Les options de lignes de commande "%s" et "%s" sont incompatibles
SHRC116=octets de m\u00E9tadonn\u00E9es     \= %d
SHRC117=%% m\u00E9tadonn\u00E9es utilis\u00E9es      \= %1$d%%\n
SHRC118=Nombre de classes ROM      \= %d
SHRC119=Nombre de chemins d'acc\u00E8s aux classes       \= %d
J9TI006=Renoncer aux fonctions \u00E9tendues de capabilities_ptr.
J9TI007=Obtenir toutes les fonctions \u00E9tendues disponibles via capabilities_ptr.
J9TI004=Retourner via capabilities_ptr les fonctions \u00E9tendues disponibles actuellement.
SHRC140=taille \:\t%1$d\t\t\t%2$d\n
J9TI005=Ajouter les nouvelles fonctions \u00E9tendues \u00E0 partir de capabilities_ptr.
J9TI008=Indique le d\u00E9but d'une phase de compilation JIT. (Non prot\u00E9g\u00E9 contre les rappels)
J9TI009=Indique la fin d'une phase de compilation JIT. (Non prot\u00E9g\u00E9 contre les rappels)
SHRC145=Recherche de la classe %1$s dans le cache partag\u00E9 pour l'ID chargeur de  classe %2$d d'URL %4$.*3$s...
SHRC146=Recherche de la classe %1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %2$d de jeton %4$.*3$s...
VMUT001=(unit\u00E9 d'ex\u00E9cution sans nom)
SHRC147=Caract\u00E8re %.*s incorrect pour le nom de cache
VMUT000=(m\u00E9moire insuffisante)
SHRC148=Autoriser l'acc\u00E8s de groupe \u00E0 la m\u00E9moire cache (valeur par d\u00E9faut \: user)
VMUT003=Fichier des options introuvable
SHRC141=octets diff\u00E9rents \:
VMUT002=(erreur d'acc\u00E8s)
SHRC142=\t\u00E0 0x%1$p\t\t%2$x \!\= %3$x
VMUT005=Option trop \u00E9lev\u00E9e \: '%s'
SHRC143=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %3$d d'URL %5$.*4$s...
VMUT004=Option incorrectement form\u00E9e \: '%s'
SHRC144=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur  de classe %3$d de jeton %5$.*4$s...
SHRC149=Active la sortie d\u00E9taill\u00E9e pour find/store
J9TI002=Agent_OnLoad introuvable dans la biblioth\u00E8que %s
J9TI003=Echec de Agent_OnLoad pour la biblioth\u00E8que %s
J9TI000=M\u00E9moire insuffisante lors de la tentative de chargement de la biblioth\u00E8que d'agents %s
J9TI001=La biblioth\u00E8que d'agents %1$s n'a pas pu \u00EAtre ouverte (%2$s)
J9TI017=Contr\u00F4le diverses options de la VM et de la compilation.
J9TI018=D\u00E9finit une m\u00E9thode pour la notification s\u00E9lective d'entr\u00E9e et de sortie.
J9TI015=Demande un dump de JLM (Java Lock Monitor).
J9TI016=Autorisation de la mise en ligne en pr\u00E9sence d'\u00E9v\u00E9nements de m\u00E9thode d'entr\u00E9e/sortie (cela peut \u00EAtre \u00E0 l'origine de la g\u00E9n\u00E9ration non fiable de rapport d'entr\u00E9e/sortie)
J9TI019=D\u00E9finit le mode de notification pour les \u00E9v\u00E9nements \u00E9tendus, autorisant la s\u00E9lectivit\u00E9 au niveau du processus
SHRC134=Impossible de cr\u00E9er le pool dans SH_ROMClassManagerImpl
VMUT010=Valeur d'option incorrectement form\u00E9e ; l'option "%1$s%3$.*2$s" contient des caract\u00E8res de fin "%4$s" qui ont \u00E9t\u00E9 ignor\u00E9s.
SHRC135=Impossible de cr\u00E9er la table de hachage dans SH_ROMClassManagerImpl
SHRC136=Impossible de cr\u00E9er le moniteur dans SH_ROMClassManagerImpl
VMUT012=%2$.*1$s n'est pas une superinterface directe de %4$.*3$s.
VMUT011=Allocation de m\u00E9moire impossible pour le tableau d'options de ligne de commande
SHRC137=MODE SANS ECHEC \: Avertissement \: Diff\u00E9rences entre ROMClass %.*s et l'\u00E9l\u00E9ment ROMClass du cache
SHRC130=Tentative d'allocation alors qu'un engagement est toujours en instance
VMUT014=La classe de r\u00E9cepteur %2$.*1$s doit correspondre \u00E0 la classe actuelle ou un sous-type de l'interface %4$.*3$s
SHRC131=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e dans ROMClassManagerImpl
VMUT013=Fichier d'options %s non valide
SHRC132=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ROMClassManagerImpl
SHRC133=Impossible d'entrer le mutex de table de hachage ROMClassManager
VMUT007=Valeur malform\u00E9e pour JAVA_TOOL_OPTIONSS
VMUT006=Option incorrectement form\u00E9e %s d\u00E9tect\u00E9e dans -Xoptionsfile
VMUT009=Valeur incorrectement form\u00E9e pour -Xservice
VMUT008=Valeur incorrectement form\u00E9e pour IBM_JAVA_OPTIONS
SHRC138=Plusieurs \u00E9l\u00E9ments ROMClass orphelins trouv\u00E9s pour %.*s
SHRC139=\n\tROMClass en cours de stockage\tROMClass dans le cache
J9TI010=Entr\u00E9e de m\u00E9thode comprenant des informations \u00E9tendues sur le type de m\u00E9thode.
J9TI013=Autorise les rappels pour les allocations instrumentables (celles non report\u00E9es par VMObjectAlloc).
J9TI014=Contr\u00F4le JLM (Java Lock Monitor) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI011=Ajouter une option -Xtrace dynamique
J9TI012=Ajouter une option -Xdump dynamique
SHRC160=L'attente du mutex de cr\u00E9ation lors de l'ouverture du s\u00E9maphore a expir\u00E9
SHRC161=L'attente du mutex de cr\u00E9ation lors de la cr\u00E9ation de la m\u00E9moire partag\u00E9e a expir\u00E9
SHRC162=L'attente du mutex de cr\u00E9ation lors de l'ouverture de la m\u00E9moire partag\u00E9e a expir\u00E9
SHRC167=D\u00E9sactive le partage de classes
SHRC168=Nombre total d'octets de classes partag\u00E9es lus \= %1$lld. Nombre total d'octets enregistr\u00E9s \= %2$d
SHRC169=Modification d\u00E9tect\u00E9e dans %2$.*1$s...\n \t...a marqu\u00E9 %3$d classes en cache comme \u00E9tant p\u00E9rim\u00E9es
SHRC163=[Sortie d\u00E9taill\u00E9e -Xshareclasses activ\u00E9e]
SHRC164=[Sortie d'E-S d\u00E9taill\u00E9e -Xshareclasses activ\u00E9e]
SHRC165=[Sortie d\u00E9taill\u00E9e de l'API auxiliaire -Xshareclasses activ\u00E9e]
SHRC166=Attach\u00E9 au cache "%1$s", taille \= %2$d octets
SHRC150=Active la sortie d\u00E9taill\u00E9e pour l'API auxiliaire
SHRC151=Supprime tous les messages
SHRC156=Erreur de copie du nom du groupe dans le nom de cache
SHRC157=Impossible d'allouer les %1$d octets de m\u00E9moire partag\u00E9e demand\u00E9s \n \tLa m\u00E9moire partag\u00E9e maximale autoris\u00E9e a \u00E9t\u00E9 allou\u00E9e (%2$d octets) \n \t(Pour augmenter la m\u00E9moire partag\u00E9e disponible, modifiez la valeur du param\u00E8tre syst\u00E8me SHMMAX)
SHRC158=Cache de classe partag\u00E9 "%1$s" cr\u00E9\u00E9
SHRC159=Cache de classe partag\u00E9 "%1$s" ouvert
SHRC152=JVM est toujours d\u00E9marr\u00E9e ind\u00E9pendamment des erreurs/avertissements
SHRC153=Sp\u00E9cifiez le nom du cache partag\u00E9\n \t(Utilisez la variable %%g pour ins\u00E9rer le nom de groupe, %%u pour ins\u00E9rer le nom d'utilisateur)
SHRC154=Caract\u00E8re d'\u00E9chappement %.*s non valide pour le nom du cache
SHRC155=Erreur de copie du nom d'utilisateur dans le nom de cache
SHRC181=Impossible d'entrer le mutex de table de hachage ScopeManagerImpl
SHRC182=Impossible de cr\u00E9er le moniteur dans ScopeManagerImpl
SHRC183=Impossible de cr\u00E9er la table de hachage dans ScopeManagerImpl
SHRC184=\tPartition %.*s
SHRC180=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage dans ScopeManagerImpl
SHRC189=Nombre de m\u00E9thodes AOT       \= %d
SHRC185=\tModContext %.*s
SHRC186=\tPartition %.*s dans ModContext %.*s
SHRC187=D\u00E9sactive la sauvegarde de donn\u00E9es AOT dans le cache partag\u00E9
SHRC188=Octets AOT          \= %d
SHRC170=Sp\u00E9cifiez le nom du cache partag\u00E9\n \t(Utilisez la variable %%u pour ins\u00E9rer le nom d'utilisateur)
SHRC171=z/OS ne peut pas cr\u00E9er un cache de la taille demand\u00E9e \: v\u00E9rifier vos param\u00E8tres syst\u00E8me z/OS BPXPRMxx
SHRC172=Les restrictions du syst\u00E8me d'exploitation font qu'il n'est pas possible de cr\u00E9er le cache de taille demand\u00E9e
SHRC173=D\u00E9finit le r\u00E9pertoire des fichiers de contr\u00F4le JVM (avanc\u00E9)
SHRC178=L'option noIncrementalUpdates est ignor\u00E9e du fait de l'utilisation de l'option singleJVM.
SHRC179=Le segment ROMClass est endommag\u00E9. Erreur de lecture du ROMClass \u00E0 0x%p
SHRC174=Activer les optimisations pour l'utilisation d'une unique JVM
SHRC175=Conserver le cache apr\u00E8s le red\u00E9marrage (Win uniquement)
SHRC176=R\u00E9adressage d'invariant de cha\u00EEne activ\u00E9
SHRC177=Impossible d'ex\u00E9cuter le mode sans \u00E9chec du fait de l'utilisation de l'option singleJVM
SHRC082=Impossible de cr\u00E9er identifiedMutex dans SH_ClasspathManagerImpl2
J9VM039=-Xscmx n'est pas pris en compte en l'absence de -Xshareclasses
SHRC083=Impossible d'allouer de la m\u00E9moire pour le tableau identifiedClasspaths dans SH_ClasspathManagerImpl2
SHRC084=Impossible d'allouer de la m\u00E9moire pour l'\u00E9l\u00E9ment de liste li\u00E9e
SHRC085=Impossible d'allouer de la m\u00E9moire pour l'en-t\u00EAte d'\u00E9l\u00E9ment de liste li\u00E9e
SHRC080=Impossible d'allouer de la m\u00E9moire pour l'entr\u00E9e de table de hachage
SHRC081=Impossible de cr\u00E9er cpeTableMutex dans SH_ClasspathManagerImpl2
SHRC086=Impossible d'entrer le mutex de la table de hachage ClasspathManager
SHRC087=Echec de MarkStale lors de ClasspathManager\:\:update()
SHRC088=Impossible de cr\u00E9er un cache en tant que ROMImageSegment dans SH_CacheMap
SHRC089=Impossible de cr\u00E9er le mutex d'actualisation dans SH_CacheMap
J9TI060=Cr\u00E9e un abonnement aux enregistrements GC prolixes
J9TI061=Annule un abonnement aux enregistrements GC prolixes
J9VM030=UTF8 non valide dans la fonction JNI
J9VM031=La classe %2$.*1$s obligatoire doit r\u00E9sider dans le chemin des classes d'amor\u00E7age mais figure dans le chemin des classes d'application dans %4$.*3$s
J9TI064=La fonction d'initialisation d'agent %s a \u00E9chou\u00E9 pour la biblioth\u00E8que %s ; code retour \: %d
CDRT000=Impossible de localiser la mappe de pile JIT - abandon de la machine virtuelle en cours
J9VM032=Erreur irr\u00E9m\u00E9diable \: impossible de charger %1$s \: %2$s
J9TI065=Fonction d'initialisation d'agent %s introuvable dans la biblioth\u00E8que %s
J9VM033=Erreur irr\u00E9m\u00E9diable \: \u00E9chec de l'initialisation de %s
J9TI062=Extrait le pointeur J9VMThread \u00E0 partir d'un jthread
CDRT002=PC d\u00E9faillant \: %1$p (d\u00E9calage %2$p), m\u00E9ta-donn\u00E9es \= %3$p
J9VM034=JVMRI requiert un moteur de trace ex\u00E9cut\u00E9 avec l'option -Xtrace
J9TI063=Extrait le pointeur J9Method \u00E0 partir d'un JMethodID
CDRT001=M\u00E9thode \: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
J9VM035=Impossible d'allouer OutOfMemoryError
J9VM036=division par z\u00E9ro
J9VM037=Echec de l'allocation du moniteur
J9TI066=Cr\u00E9e un abonnement aux points de trace de la VM
J9VM038=-Xthr \: option non identifi\u00E9e --> '%s'
J9TI067=Annule un abonnement aux points de trace de la VM
SHRC071=L'option de ligne de commande "%s" requiert une sous-option
J9VM028=\t\u00E0 %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
SHRC072=Option de ligne de commande "%s" non reconnue
J9VM029=\tat (m\u00E9thode inconnue)
SHRC073=Stockage de la classe %2$.*1$s dans le cache partag\u00E9 pour l'ID chargeur de classe %3$d d'URL %5$.*4$s (index %6$d)...
SHRC074=\ R\u00E9ussite.
SHRC070=Mises \u00E0 jour incr\u00E9mentielles d\u00E9sactiv\u00E9es
SHRC079=Impossible de cr\u00E9er la table de hachage dans SH_ClasspathManagerImpl2
SHRC075=\ Echec.
SHRC076=Recherche de la classe %1$s dans le cache partag\u00E9 de l'ID chargeur de classe %2$d...
SHRC077=Impossible de cr\u00E9er le pool linkedListImpl dans SH_ClasspathManagerImpl2
SHRC078=Impossible de cr\u00E9er le pool linkedListHdr dans SH_ClasspathManagerImpl2
J9VM020=Recherche effectu\u00E9e dans %.*s
J9VM021=M\u00E9moire satur\u00E9e pour la mappe de pile de l'interpr\u00E9teur - arr\u00EAt de la machine virtuelle en cours
J9VM022=Echec de la mappe de pile, r\u00E9sultat \= %p - arr\u00EAt de la machine virtuelle en cours
J9VM023=Ceci indique que soit JAVA_HOME est incorrect, soit les biblioth\u00E8ques de classe ne sont pas install\u00E9es
J9VM024=Exception dans l'unit\u00E9 d'ex\u00E9cution "%.*s"
J9VM025=\t\u00E0 %2$.*1$s.%4$.*3$s (m\u00E9thode native)
J9VM026=\t\u00E0 %2$.*1$s.%4$.*3$s (source inconnue)
J9VM027=\t\u00E0 %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM050=-Xjni \: option non identifi\u00E9e --> '%s'
J9VM051=Syntaxe \:\n
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] d\u00E9finit la taille maximale du tableau mis en cache\n
J9VM053=Option incorrectement form\u00E9e %s d\u00E9tect\u00E9e dans -Xoptionsfile
J9VM054=Echec de la cr\u00E9ation d'une unit\u00E9 d'ex\u00E9cution \: retVal %1$zd, errno %2$zd
J9VM055=Erreur irr\u00E9m\u00E9diable \: Version majeure de JXE est diff\u00E9rente de %d
J9VM056=Version sup\u00E9rieure
J9VM057=Taille maximale de la m\u00E9moire cache du moniteur d\u00E9pass\u00E9e
J9VM058=-Xscminaot n'est pas pris en compte en l'absence de -Xshareclasses
J9VM059=-Xscmaxaot n'est pas pris en compte en l'absence de -Xshareclasses
SHRC093=Fin inattendue d\u00E9tect\u00E9e pour une autre JVM lors de la mise \u00E0 jour
SHRC094=El\u00E9ment orphelin trouv\u00E9 mais ROMClass local transmis \u00E0 addROMClassToCache
SHRC095=Les tentatives d'appel de markStale sur les \u00E9l\u00E9ments de cache partag\u00E9 ont \u00E9chou\u00E9
SHRC096=Le cache partag\u00E9 "%s" est satur\u00E9. Utilisez -Xscmx pour d\u00E9finir la taille du cache.
SHRC090=Impossible d'obtenir le mutex de cache dans le d\u00E9marrage SH_CacheMap
SHRC091=Lecture de donn\u00E9es corrompues pour l'\u00E9l\u00E9ment 0x%p (type de donn\u00E9es non valide)
SHRC092=Echec ADD lors de la lecture du cache
SHRC097=Le cache partag\u00E9 "%s" est corrompu. Aucune nouvelle JVM ne sera autoris\u00E9e \u00E0 se connecter au cache.\n \tLes JVM existantes pourront continuer \u00E0 fonctionner, mais ne pourront pas mettre \u00E0 jour le cache.
SHRC098=\nStatistiques actuelles du cache "%s" \: \n
SHRC099=%1$d \: 0x%2$p ORPHAN \: %4$.*3$s \u00E0 0x%5$p.
JITM031=La valeur de '%s' n'est pas correcte
JITM032=L'option '%1$s' n'est pas compl\u00E8te ; le param\u00E8tre '%2$s' doit \u00EAtre sp\u00E9cifi\u00E9.
J9VM040=d\u00E9passement de la capacit\u00E9 de pile du syst\u00E8me d'exploitation
JITM030=La valeur %s indiqu\u00E9e est trop \u00E9lev\u00E9e
J9VM041=nombre d'arguments incorrect
JITM035=La taille de grande page %1$zu%2$s n'est pas une taille de page prise en charge pour le cache de code JIT ; %3$zu%4$s %5$s utilis\u00E9 \u00E0 la place.
J9VM042=Configuration de l'utilisation des unit\u00E9s d'ex\u00E9cution
JITM036=La taille de grande page %1$zu%2$s %3$s n'est pas une taille de page prise en charge pour le cache de code JIT ; %4$zu%5$s utilis\u00E9 \u00E0 la place.
J9VM043=-----------------------
JITM033=Des virgules suppl\u00E9mentaires sont d\u00E9tect\u00E9es dans l'option '-Xlp' ; elles sont ignor\u00E9es
J9VM044=Moniteurs de syst\u00E8me \u00E0 trois niveaux pris en charge
JITM034=La taille de grande page %1$zu%2$s n'est pas une taille de page prise en charge pour le cache de code JIT ; %3$zu%4$s utilis\u00E9 \u00E0 la place.
J9VM045=Moniteurs de syst\u00E8me \u00E0 trois niveaux non pris en charge
J9VM046=JLM pris en charge
J9VM047=JLM non pris en charge
JITM037=La taille de grande page %1$zu%2$s %3$s n'est pas une taille de page prise en charge pour le cache de code JIT ; %4$zu%5$s %6$s utilis\u00E9 \u00E0 la place.
J9VM048=Dur\u00E9es de conservation JLM prises en charge
J9VM049=Dur\u00E9es de conservation JLM non prises en charge
J9TI028=Rapporte la fin d'un dump RAS.
J9TI029=Interroge la configuration de l'agent de vidage RAS.
JITM019=Non concordance de la fonction Concurrent Scavenge. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI026=D\u00E9clenche un dump en utilisant la configuration RAS donn\u00E9e.
J9TI027=Rapporte le d\u00E9but d'un dump RAS.
J9RI019=jvmri->InjectOutOfMemory non pris en charge.
J9RI017=Impossible d'allouer l'agent de nettoyage dans jvmri->SetOutOfMemoryHook, fonction non enregistr\u00E9e.
J9RI018=jvmri->NotifySignal \: \u00E9mission du signal %d.
JITM020=Non concordance de la fonction de barri\u00E8re de lecture logicielle. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
JITM021=Non concordance de la fonction TM. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
JITM024=Non concordance de Compressedrefs Shift. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI020=Obtient l'ID processus du SE \u00E0 partir d'un jthread
J9RI015=jvmri->RunDumpRoutine \: componentId hors limites.
JITM025=Le cache de classe partag\u00E9 est trop gros pour que le JIT puisse correctement encoder les positions (offsets). Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI021=Obtient des informations \u00E9tendues du cadre.
J9RI016=jvmri->SetOutOfMemoryHook appel\u00E9 avec rappel vide, fonction non enregistr\u00E9e.
JITM022=Non concordance de mot de verrouillage. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9RI013=jvmri->ReleaseRasInfo \: structure ayant un champ de type non pris en charge.
JITM023=Non concordance de taille d'arraylet. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9RI014=jvmri->RunDumpRoutine \: r\u00E9cup\u00E9ration de donn\u00E9es de composant impossible.
JITM028=La configuration syst\u00E8me ne prend pas en charge le param\u00E8tre '%.*s' dans l'option '-Xlp'
J9TI024=Sortie de m\u00E9thode sans valeur retourn\u00E9e.
J9RI011=L'un des champs de type de la structure RasInfo n'est pas pris en charge.
JITM029=%s doit \u00EAtre suivi d'une valeur num\u00E9rique
J9TI025=Autoriser l'interface JNI directe pour les \u00E9v\u00E9nements d'entr\u00E9e et de sortie de m\u00E9thode (cela peut \u00EAtre \u00E0 l'origine de la g\u00E9n\u00E9ration non fiable de rapport d'entr\u00E9e/sortie)
J9RI012=jvmri->ReleaseRasInfo appel\u00E9 avec structure RasInfo vide.
JITM026=Probl\u00E8me inconnu. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI022=Obtient des informations \u00E9tendues du cadre pour toutes les traces de la pile.
JITM027=Echec d'allocation de m\u00E9moire par JIT
J9TI023=Obtient des informations \u00E9tendues du cadre pour une liste de processus.
J9RI010=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
J9TI039=D\u00E9truit un cache partag\u00E9 nomm\u00E9.
JITM008=Echec de la validation de l'en-t\u00EAte AOT ; bit de sant\u00E9 de d\u00E9but de l'option de fonction alt\u00E9r\u00E9. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI037=Obtient la m\u00E9moire totale utilis\u00E9e pour le tas.
JITM009=Echec de la validation de l'en-t\u00EAte AOT ; bit de sant\u00E9 de fin de l'option de fonction alt\u00E9r\u00E9. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI038=Ex\u00E9cute une it\u00E9ration sur les caches partag\u00E9s.
J9RI008=jvmri->GetRasInfo \: r\u00E9cup\u00E9ration de composants impossible.
J9RI009=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
J9RI006=jvmri->GetRasInfo appel\u00E9 avec structure RasInfo vide.
J9RI007=jvmri->GetRasInfo \: allocation de m\u00E9moire impossible.
JITM010=Discordance de la fonction SMP. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
JITM013=Discordance de la fonction de d\u00E9sactivation des pi\u00E8ges. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI031=Annule l'\u00E9v\u00E9nement asynchrone sur un ou tous les processus
J9RI004=jvmri->DynamicVerbosegc non pris en charge.
JITM014=Discordance de la fonction de pr\u00E9extraction de TLH. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI032=Indique qu'un processus a trait\u00E9 l'\u00E9v\u00E9nement asynchrone
J9RI005=jvmri->GetComponentDataArea \: composant %s sans dataArea sous cette machine virtuelle.
JITM011=Discordance de la fonction de r\u00E9f\u00E9rences compress\u00E9es. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9RI002=jvmri->DumpRegister appel\u00E9 avec rappel vide, fonction non enregistr\u00E9e.
JITM012=Discordance de la fonction DFP. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI030=Signale l'\u00E9v\u00E9nement asynchrone sur un ou tous les processus
J9RI003=Impossible d'allouer l'agent de nettoyage dans jvmri->DumpRegister, fonction non enregistr\u00E9e.
JITM017=Discordance de la fonction de SIMD activ\u00E9. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI035=Cycle de r\u00E9cup\u00E9ration de place termin\u00E9.
J9RI000=jvmri->CreateThread \: impossible d'allouer la m\u00E9moire des arguments d'unit\u00E9 d'allocation
JITM018=Discordance de la fonction de compilation asynchrone. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI036=Obtient la m\u00E9moire actuellement libre dans le tas.
J9RI001=Erreur interne lors de la suppression de l'agent de nettoyage dans jvmri->DumpDeregister, il se peut que la fonction ne soit pas d\u00E9senregistr\u00E9e.
JITM015=Discordance de la fonction de trampoline de m\u00E9thode. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI033=R\u00E9initialise les options de vidage de la machine virtuelle.
JITM016=Discordance de la fonction d'HCR activ\u00E9. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI034=Cycle de r\u00E9cup\u00E9ration de place d\u00E9marr\u00E9.
J9VM017=Allocation de m\u00E9moire impossible pour le tableau d'options de ligne de commande
J9VM018=Allocation de m\u00E9moire impossible pour le pool de tables de chargement de biblioth\u00E8que partag\u00E9e
J9VM019=Erreur irr\u00E9m\u00E9diable \: Impossible de trouver et d'initialiser la classe requise %.*s
J9TI048=Obtient les m\u00E9tadonn\u00E9es de trace qui peuvent \u00EAtre utilis\u00E9es avec le formateur pour traiter les tampons de trace de processus
J9TI049=Retourne les noms de classe, de m\u00E9thode et de package d'un groupe de pointeurs de m\u00E9thode RAM
JITM002=Erreur de stockage du code AOT dans le cache de classe partag\u00E9. Endommagement possible du cache de classe partag\u00E9. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9TI042=Signale les balises automatiques du nouvel objet allou\u00E9 et sa classe.
JITM003=Echec de l'initialisation de l'ex\u00E9cution de AOT. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9VM010=Echec de l'initialisation de %s
J9TI043=Signale uniquement le chargement de classe pour les classes array.
JITM000=Mat\u00E9riel non pris en charge [%d].
J9VM011=Impossible de charger %1$s \: %2$s
J9TI040=Ajouter la fonction \u00E9tendue can_autotag_objects.
JITM001=Espace insuffisant pour le code AOT dans le cache de classe partag\u00E9. Nouveau code AOT non g\u00E9n\u00E9r\u00E9.
J9VM012=Impossible de d\u00E9charger %1$s \: %2$s
J9TI041=Signale l'\u00E9v\u00E9nement de changement de nom du ou des objets (d\u00E9placement ou suppression).
JITM006=Le code AOT dans le cache de classe partag\u00E9 ne peut pas \u00EAtre ex\u00E9cut\u00E9 avec la politique de r\u00E9cup\u00E9ration de place actuelle. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9VM013=Erreur d'initialisation dans la fonction %1$s(%2$d) \: %3$s
J9TI046=Annule un abonnement aux enregistrements de trace externes
JITM007=Le code AOT du cache de classe partag\u00E9 ne peut pas \u00EAtre ex\u00E9cut\u00E9 avec les param\u00E8tres JVMPI ou JVMTI en cours. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9VM014=Erreur d'arr\u00EAt dans la fonction %1$s(%2$d) \: %3$s
J9TI047=Tous les enregistrements de trace en cours d'utilisation sont bascul\u00E9s et envoy\u00E9s aux abonn\u00E9s aux traces
JITM004=Le code AOT du cache de classe partag\u00E9 ne peut pas s'ex\u00E9cuter sur ce processeur. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9VM015=Erreur d'initialisation de la biblioth\u00E8que %1$s(%2$d) \: %3$s
J9TI044=Supprimer toutes les balises d'objet.
JITM005=Le code AOT du cache de classe partag\u00E9 ne peut pas \u00EAtre ex\u00E9cut\u00E9 dans la version JVM actuelle. Le code AOT est ignor\u00E9 dans le cache de classe partag\u00E9.
J9VM016=Erreur d'arr\u00EAt de la biblioth\u00E8que %1$s(%2$d) \: %3$s
J9TI045=Cr\u00E9e un abonnement aux enregistrements de trace externes
MECK001=Option -Xcheck\:memory non reconnue \: %s
J9VM006=Option de ligne de commande non valide \: %s
MECK000=Une erreur s'est produite lors de l'initialisation de l'utilitaire -Xcheck\:memory
J9VM007=Option de ligne de commande non identifi\u00E9e \: %s
J9VM008=J9VMDllMain introuvable
J9TI059=Obtenir la quantit\u00E9 de m\u00E9moire native utilis\u00E9e par la machine virtuelle Java, d\u00E9compos\u00E9e en cat\u00E9gories de m\u00E9moire.
MECK002=Une erreur s'est produite lors de la cr\u00E9ation de la structure de donn\u00E9es du site d'appel. Les informations de site d'appel ne seront pas affich\u00E9es
J9VM009=Echec de J9VMDllMain
J9TI050=Obtient un code de hachage du moniteur d'un objet.
J9TI053=D\u00E9finit les options de journal VM.
J9TI054=Demande un vidage JLM (Java Lock Monitor) avec un sp\u00E9cificateur de format.
J9VM000=Valeur incorrectement form\u00E9e pour IBM_JAVA_OPTIONS
J9TI051=Efface l'option per-method pour l'entr\u00E9e s\u00E9lective et quitte la notification.
J9VM001=Valeur incorrectement form\u00E9e pour -Xservice
J9TI052=Interroge les options de journal VM en cours.
J9VM002=Fichier des options introuvable
J9TI057=Conversion de la cha\u00EEne native des options de journal de la machine virtuelle Java impossible.
J9VM003=Compilateur JIT "%s" introuvable. L'interpr\u00E9teur va \u00EAtre utilis\u00E9.
J9TI058=D\u00E9finition des options de journal de la machine virtuelle Java impossible.
J9VM004=Impossible de charger la biblioth\u00E8que requise par \: %s
J9TI055=Allocation de tampon impossible pour les options de journalisation de la machine virtuelle Java.
J9VM005=Valeur non valide pour la variable d'environnement \: %s
J9TI056=Impossible d'interroger les options de journalisation de la machine virtuelle Java.
PORT033=Impossible de d\u00E9tecter un hyperviseur pris en charge.
PORT032=L'op\u00E9ration li\u00E9e \u00E0 l'hyperviseur a \u00E9chou\u00E9.
PORT031=La condition LE %s%i, qui correspond \u00E0 un signal POSIX \u00E9mis par le logiciel, a \u00E9t\u00E9 re\u00E7ue
PORT030=Le param\u00E8tre %s "%s" indique que le vidage core doit \u00EAtre dirig\u00E9 vers un programme externe.  Tentative de renommage du processus core ou core.%d.\n
PORT037=N'est pas en cours d'ex\u00E9cution sur un hyperviseur.
PORT036=Code retour inattendu g\u00E9n\u00E9r\u00E9 par le service CSRSI sur z/OS
PORT035=__malloc31 n'a pas r\u00E9ussi \u00E0 allouer de tampon sous z/OS
PORT034=Tentative de connexion de la m\u00E9moire partag\u00E9e cr\u00E9\u00E9e dans la cl\u00E9 de protection m\u00E9moire %lu, mais ex\u00E9cution en cours dans la cl\u00E9 %lu.
PORT039=Echec de la mise \u00E0 jour de HYPFS
PORT038=Valeur incorrectement form\u00E9e pour IBM_JAVA_HYPERVISOR_SETTINGS
PORT022=Ajout de .X&DS au mod\u00E8le de vidage sp\u00E9cifi\u00E9 par l'utilisateur pour permettre les vidages multiparties.
PORT021=Vous avez ouvert un s\u00E9maphore partag\u00E9 System V p\u00E9rim\u00E9 \: file\:%1$s semid\:%2$d
PORT020=Vous avez ouvert une m\u00E9moire partag\u00E9e System V p\u00E9rim\u00E9e \: file\:%1$s shmid\:%2$d
PORT026=Le fichier sp\u00E9cifi\u00E9 est un r\u00E9pertoire
PORT025=Type de verrou non valide pour l'op\u00E9ration de verrouillage du fichier. lockFlags \: %1$d
PORT024=IEATDUMP a \u00E9chou\u00E9, car il a \u00E9t\u00E9 impossible d'allouer le jeu de donn\u00E9es de vidage (v\u00E9rifiez l'espace disque et les autorisations de champ).
PORT023=IEATDUMP a \u00E9chou\u00E9, car le mod\u00E8le de vidage sp\u00E9cifi\u00E9 par l'utilisateur \u00E9tait trop long. Nouvelle tentative de vidage en utilisant le mod\u00E8le par d\u00E9faut.
PORT029=Identificateur non valide. Identificateur du fichier \: %1$d.
PORT028=mmap a \u00E9chou\u00E9 en raison d'options de mappage non valides.
PORT027=mmap a \u00E9chou\u00E9 en raison d'un param\u00E8tre de protection de la m\u00E9moire non valide.
PORT011=Impossible d'allouer de la m\u00E9moire lors d'une tentative de chargement d'une biblioth\u00E8que partag\u00E9e
PORT010=Le droit de chargement de la biblioth\u00E8que partag\u00E9e n'a pas \u00E9t\u00E9 accord\u00E9
PORT015=Impossible de r\u00E9soudre les r\u00E9f\u00E9rences de biblioth\u00E8que partag\u00E9e - une biblioth\u00E8que partag\u00E9e pr\u00E9requise peut manquer
PORT014=Echec de chargement de la dll car elle est introuvable
PORT013=Erreur lors du chargement de la biblioth\u00E8que partag\u00E9e - la table dll est introuvable
PORT012=Erreur lors du chargement de la biblioth\u00E8que partag\u00E9e en raison du bit PACE en cours de d\u00E9finition
PORT019=Impossible de cr\u00E9er le r\u00E9pertoire %s.  Les classes partag\u00E9es seront d\u00E9sactiv\u00E9es jusqu'\u00E0 la cr\u00E9ation de ce r\u00E9pertoire.
PORT018=Echec de l'op\u00E9ration \: %1$d (\u00E9chec de %2$s \: %3$d)
PORT017=Echec de l'op\u00E9ration \: %d
PORT016=Erreur interne %i
PORT000=
ZIPS000=Impossible d'ouvrir %1$s (%2$s)
ZIPS001=Impossible d'ouvrir %s (export manquant)
PORT009=La biblioth\u00E8que partag\u00E9e sp\u00E9cifi\u00E9e est introuvable
PORT004=Echec de la r\u00E9solution de symboles
PORT003=Impossible de charger le module d\u00E9pendant %s
PORT002=Erreur inconnue lors du chargement de la biblioth\u00E8que partag\u00E9e
PORT001=Echec d'allocation de m\u00E9moire lors d'une tentative d'\u00E9criture dans un fichier.
PORT008=L'architecture du module n'est pas correcte
J9RI022=JVMRI en cours d'initialisation ne peut pas allouer de moniteur dump jvri
PORT007=Le module sp\u00E9cifi\u00E9 n'est pas un module
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister et TraceListener ne sont plus pris en charge. Utilisez les nouvelles versions dans JVMRAS_VERSION_1_5
PORT006=Le format du module n'est pas correct
J9RI020=jvmri->CreateThread \: impossible d'allouer un moniteur priv\u00E9
PORT005=Impossible de charger la biblioth\u00E8que partag\u00E9e
J9RI021=jvmri->RunDumpRoutine n'est pas pris en charge.
J9VM070=\u00E9puisement de la m\u00E9moire native au cours de la liaison de m\u00E9thode native %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM071=tentative de liaison r\u00E9cursive de la m\u00E9thode native %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM072=m\u00E9moire native \u00E9puis\u00E9e
J9VM073=La classe %2$.*1$s acc\u00E8de sans autorisation au membre %3$s de la classe %5$.*4$s
J9VM074=La classe %2$.*1$s acc\u00E8de sans autorisation \u00E0 %3$s dans la classe %5$.*4$s+
J9VM075=op\u00E9ration interdite sur l'unit\u00E9 d'ex\u00E9cution eventron
J9VM076=m\u00E9moire native \u00E9puis\u00E9e lors de l'allocation de l'entr\u00E9e de liste pour l'objet finalisable ou r\u00E9f\u00E9rence
J9VM077=Remarque \: -Xdfpbd n'a aucun impact dans cette version de Java
J9VM078=Valeur incorrectement form\u00E9e pour JAVA_TOOL_OPTIONS
J9VM079=triggerOneOffDump(%1$s) n\u00E9cessite %2$s
J9VM060=runNamedDump(%1$s) requiert %2$s
J9VM061=insertDumpAgent requiert %s
J9VM062=removeDumpAgent requiert %s
J9VM063=seekDumpAgent requiert %s
J9VM064=setDumpOption requiert %s
J9VM065=cet objet n'est pas une instance de la classe d\u00E9clarante
J9VM066=type d'argument non concordant
J9VM067=-Xshareclasses non activ\u00E9, option -Xzero\:sharezip ignor\u00E9e
J9VM068=-Xshareclasses non activ\u00E9, option -Xzero\:sharestring ignor\u00E9e
J9VM069=violation de contrainte de chargement \: le chargeur "%2$.*1$s@%3$x" a lanc\u00E9 pr\u00E9alablement le chargement pour un type diff\u00E9rent portant le nom "%5$.*4$s" d\u00E9fini par le chargeur "%7$.*6$s@%8$x"
SHRC500=La zone de d\u00E9bogage est endommag\u00E9e vu que l'adresse plancher %p d'espace disponible est sup\u00E9rieure \u00E0 son adresse plafond %p
SHRC505=La zone de d\u00E9bogage est endommag\u00E9e vu que la diff\u00E9rence entre l'adresse plafond %p de l'espace libre moins l'adresse plancher %p d\u00E9passe la taille de la r\u00E9gion de d\u00E9bogage de %lu octets
SHRC506=La zone de d\u00E9bogage est endommag\u00E9e vu que la taille de %lu est sup\u00E9rieure \u00E0 la taille totale du cache de %u stock\u00E9e dans l'en-t\u00EAte du cache
J9VM090=R\u00E9ponse lente \u00E0 la demande r\u00E9seau (%d secs), v\u00E9rifiez la configuration IP DNS
SHRC507=Effectuer des v\u00E9rifications suppl\u00E9mentaires lors du stockage et de l'allocation des donn\u00E9es de d\u00E9bogage de classes
J9VM091=Verrous de rotation adaptatifs (adaptative-spinning) pris en charge
SHRC508=S\u00E9maphore acquis diff\u00E9rent de celui utilis\u00E9 pr\u00E9c\u00E9demment avec ce cache. ancien semid\=%d, nouveau semid\=%d
J9VM092=Verrous de rotation adaptatifs (adaptative-spinning) non pris en charge
SHRC501=La zone de d\u00E9bogage est endommag\u00E9e vu que l'adresse plancher %p de 'donn\u00E9es de table de num\u00E9ros de ligne' est sup\u00E9rieure \u00E0 son adresse plafond %p
J9VM093=Cette version de Java n\u00E9cessite un processeur (UC) prenant en charge les extensions SSE2 ou sup\u00E9rieures.  Consultez la rubrique relative aux environnements pris en charge dans le manuel IBM Java User Guide pour obtenir des d\u00E9tails.
SHRC502=La zone de d\u00E9bogage est endommag\u00E9e vu que l'adresse plancher %p de 'donn\u00E9es de table de variable locale' est sup\u00E9rieure \u00E0 son adresse plafond %p
J9VM094=L'unit\u00E9 d'ex\u00E9cution "%s" est toujours en vie apr\u00E8s l'ex\u00E9cution des crochets d'arr\u00EAt.
SHRC503=La zone de d\u00E9bogage est endommag\u00E9e vu que le stockage des %d octets de 'table de num\u00E9ros de ligne' et des %d octets de 'table de variable locale' d\u00E9boucherait sur une adresse plafond de %p pour les 'donn\u00E9es de table de num\u00E9ros de ligne' sup\u00E9rieure \u00E0 la nouvelle adresse plancher de %p pour les 'donn\u00E9es de table de variable locale'
J9VM095=violation de contrainte de chargement lors de la r\u00E9solution de la m\u00E9thode "%2$.*1$s.%4$.*3$s%6$.*5$s" \: le chargeur "%8$.*7$s@%9$x" de la classe "%11$.*10$s" et le chargeur "%13$.*12$s@%14$x" de la classe "%16$.*15$s" ont des types diff\u00E9rents pour la signature de m\u00E9thode
SHRC504=Le d\u00E9but des donn\u00E9es de cache est Null. D\u00E9but des donn\u00E9es \: %p
J9VM096=-Xscdmx n'est pas pris en compte en l'absence de -Xshareclasses
J9VM097=\nSyntaxe \:\n
J9VM098=-Xsyslog\:help              Imprime l'aide -Xsyslog de la machine virtuelle Java.
J9VM099=-Xsyslog\:none              D\u00E9sactive les options de journal de la machine virtuelle Java sp\u00E9cifi\u00E9es pr\u00E9c\u00E9demment, y compris les valeurs par d\u00E9faut.
SHRC509=Cr\u00E9er un cache d'une g\u00E9n\u00E9ration plus vieux que la g\u00E9n\u00E9ration actuelle.
PORT040=Echec de la lecture \u00E0 partir de HYPFS
PORT044=Echec de l'allocation de m\u00E9moire lors de l'extraction des informations sur l'hyperviseur.
PORT043=%1$d \: Echec lors de l'extraction d'infos %2$s.
PORT042=Impossible de lire /proc/sysinfo
PORT041=HYPFS non mont\u00E9
J9VM080=queryVmDump n\u00E9cessite %s
J9VM081=Valeur d'option incorrectement form\u00E9e ; l'option "%1$s%3$.*2$s" contient des caract\u00E8res de fin "%4$s" qui ont \u00E9t\u00E9 ignor\u00E9s
J9VM082=Impossible de passer au processeur IFA - probl\u00E8me "extattr +a lib%s.so"
J9VM083=Erreur de basculement vers le processeur IFA ; cr \: %08x
J9VM084=Erreur IFA \: code de retour inattendu %08x du service de commutation IFA
J9VM085=Option incorrectement form\u00E9e \: '%s'
PORT048=Impossible de cr\u00E9er le vidage syst\u00E8me car un fichier non standard "%s" existe d\u00E9j\u00E0 avec le m\u00EAme nom que le fichier pr\u00E9vu pour ce vidage syst\u00E8me
J9VM086=Option \u00E0 valeur trop grande \: '%s'
PORT047=M\u00E9moire tampon insuffisante lors d'une tentative de chargement d'une biblioth\u00E8que partag\u00E9e
J9VM087=resetDumpOption n\u00E9cessite %s
PORT046=L'ex\u00E9cutable n'a pas pu \u00EAtre ouvert
J9VM088=Avertissement \: syscorepath n'a pas \u00E9t\u00E9 configur\u00E9, ce qui peut emp\u00EAcher la g\u00E9n\u00E9ration d'un fichier core syst\u00E8me (si un est n\u00E9cessaire).\n\t\tConsultez les instructions d'installation WebSphere Real Time pour configurer correctement les param\u00E8tres de configuration syscorepath.\n\t\tREMARQUE \: syscorepath doit \u00EAtre configur\u00E9 chaque fois que la machine est d\u00E9marr\u00E9e.
PORT045=Echec de l'allocation de m\u00E9moire lors de l'extraction des informations syst\u00E8me.
J9VM089=Avertissement \: impossible de v\u00E9rifier les param\u00E8tres syscorepath en utilisant sysconfig \: %s.
SHRC400=Octets du cache zip                     %*c\= %d
SHRC401=\# Caches zip                        %*c\= %d
SHRC406=adresse de d\u00E9but des m\u00E9tadonn\u00E9es              %*c\= 0x%p
SHRC407=options d'ex\u00E9cution                       %*.c\= 0x%.16llX
SHRC408=g\u00E9n\u00E9ration du cache                    %*.c\= %d\n
SHRC409=octets du code AOT                      %*c\= %d
SHRC402=Octets de donn\u00E9es JIT                      %*c\= %d
SHRC403=Octets utilis\u00E9s dans la zone de d\u00E9bogage des classes         %*c\= %u
SHRC404=Impossible d'obtenir un r\u00E9pertoire pour le cache
SHRC405=Impossible de cr\u00E9er un r\u00E9pertoire pour le cache
SHRC420=\# Entr\u00E9es de donn\u00E9es AOT                  %*c\= %d
SHRC421=\# Hi\u00E9rarchie de classes AOT               %*c\= %d
SHRC422=\# Thunks AOT                        %*c\= %d
SHRC423=\# Suggestions JIT                          %*c\= %d
SHRC428=Ancienne g\u00E9n\u00E9ration du cache de classe partag\u00E9 "%s" supprim\u00E9e
SHRC429=Impossible de supprimer l'ancienne g\u00E9n\u00E9ration du cache de classe partag\u00E9 "%s"
SHRC424=\# Profils JIT                      %*c\= %d
SHRC425=\# Objets Java                      %*c\= %d
SHRC426=\# Entr\u00E9es JCL                       %*c\= %d
SHRC427=Modificateur utilis\u00E9 pour imprimer les statistiques d\u00E9taill\u00E9es du cache
SHRC410=octets de donn\u00E9es AOT                      %*c\= %d
SHRC411=octets de la hi\u00E9rarchie de classes AOT         %*c\= %d
SHRC412=octets thunk AOT                     %*c\= %d
SHRC417=octets de donn\u00E9es JCL                      %*c\= %d
SHRC418=octets de donn\u00E9es Byte                     %*c\= %d
SHRC419=octets LocalVariableTable de la classe      %*c\= %u
SHRC413=octets suggestion (hint) JIT                      %*c\= %d
SHRC414=octets profil JIT                   %*c\= %d
SHRC415=octets Java Object                   %*c\= %d
SHRC416=octets ReadWrite                     %*c\= %d
SHRC442=Le cache partag\u00E9 "%s" est corrompu. Le code d'endommagement est %d. La valeur d'endommagement est 0x%p. Aucune nouvelle JVM ne sera autoris\u00E9e \u00E0 se connecter au cache.\n \tLes JVM existantes pourront continuer \u00E0 fonctionner, mais ne pourront pas mettre \u00E0 jour le cache.
SHRC443=Le contr\u00F4le CRC du cache est incorrect car il indique un cache endommag\u00E9. Contr\u00F4le CRC du cache endommag\u00E9 \: 0x%x.
SHRC444=Donn\u00E9es endommag\u00E9es lues pour l'en-t\u00EAte de l'entr\u00E9e du cache 0x%p (longueur d'\u00E9l\u00E9ment non valide)
SHRC445=La taille du cache est trop petite pour \u00EAtre utile. Taille du cache non valide \: 0x%x.
SHRC440=La valeur de -XscminJIT est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur \u00E9gale \u00E0 celle de -Xscmx lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC441=La valeur de -XscmaxJIT est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur illimit\u00E9e lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC446=Echec de l'acquisition du verrou en \u00E9criture de l'en-t\u00EAte au cours du d\u00E9marrage du cache avec le code d'erreur \: %d.
SHRC447=L'identificateur de l'en-t\u00EAte du cache n'est pas valide. L'adresse de la cha\u00EEne d'identificateur se trouve dans l'en-t\u00EAte du cache \: 0x%p.
SHRC448=Le champ de taille du cache n'est pas valide dans l'en-t\u00EAte du cache. La taille du cache dans l'en-t\u00EAte du cache est de \: 0x%x.
SHRC449=Le remplissage est diff\u00E9rent de z\u00E9ro. Les octets de remplissage dans l'en-t\u00EAte du cache sont de \: %u.
SHRC431=%1$d \: 0x%2$p JITPROFILE \: %4$.*3$s
SHRC432=\ Signature \: %2$.*1$s Adresse \: 0x%3$p
SHRC433=\tpour ROMClass %2$.*1$s \u00E0 0x%3$p.
SHRC434=La valeur\=%d transmise par l'option -Xitsn est hors de la plage de valeurs de nombre premier prise en charge par la machine virtuelle. Plage prise en charge \= 0 - %u
SHRC430=Impossible de supprimer la g\u00E9n\u00E9ration actuelle du cache de classe partag\u00E9 "%s"
SHRC439=La valeur de -XscminJIT ne doit pas \u00EAtre sup\u00E9rieure \u00E0 la valeur de -XscmaxJIT
SHRC435=-Xitsn%2$u utilise %1$u octets de m\u00E9moire, ce qui d\u00E9passe la taille du cache de classe partag\u00E9 de %3$u octets
SHRC436=Erreur lors de l'acquisition du verrou d'\u00E9criture de l'en-t\u00EAte du fichier de cache de classe partag\u00E9
SHRC437=Erreur lors de la lib\u00E9ration du verrou en lecture de l'en-t\u00EAte de fichier du cache de classe partag\u00E9
SHRC438=D\u00E9sactiver le stockage des donn\u00E9es JIT dans le cache partag\u00E9
JNCK101=Erreur de JNI dans  %1$s \: l'argument \#%2$d est cens\u00E9 \u00EAtre statique, mais un ID de champ non statique a \u00E9t\u00E9 pass\u00E9 \u00E0 JNI
JNCK102=Erreur de JNI dans  %1$s \: l'argument \#%2$d est cens\u00E9 \u00EAtre non statique, mais un ID de champ statique a \u00E9t\u00E9 pass\u00E9 \u00E0 JNI
JNCK100=Conseil JNI dans %1$s \: cette fonction ne peut pas \u00EAtre utilis\u00E9e avec des objets condens\u00E9s. Utilisez %2$s \u00E0 la place
SHRC464=Active la sortie d\u00E9taill\u00E9e des donn\u00E9es JIT
SHRC465=[Sortie d\u00E9taill\u00E9e des donn\u00E9es JIT -Xshareclasses activ\u00E9e]
SHRC466=%1$s donn\u00E9es jointes trouv\u00E9es pour %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC467=Echec de recherche de %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s.%6$.*5$s, raison \:%2$s
SHRC460=D\u00E9sactiver le stockage des donn\u00E9es JIT dans le cache partag\u00E9
SHRC461=La valeur de -Xscminjitdata ne devrait pas \u00EAtre sup\u00E9rieure \u00E0 la valeur de -Xscmaxjitdata
SHRC462=La valeur de -Xscminjitdata est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur \u00E9gale \u00E0 celle de -Xscmx lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC463=La valeur de -Xscmaxjitdata est sup\u00E9rieure \u00E0 celle de -Xscmx, une valeur illimit\u00E9e lui a donc \u00E9t\u00E9 attribu\u00E9e
SHRC468=%1$s donn\u00E9es jointes stock\u00E9es pour %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC469=Echec du stockage de 1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
J9GC084=La r\u00E9solution de l'horloge du syst\u00E8me d'exploitation ne semble pas prendre en charge le temps de pause cible demand\u00E9.  Substitution \u00E0 l'aide de l'option de ligne de commande -Xgc\:overrideHiresTimerCheck
J9GC083=Echec de l'initialisation ; la location multiple ne prend en charge que  -Xgcpolicy\:balanced
J9GC086=Echec de l'instanciation des m\u00E9tadonn\u00E9es des r\u00E9f\u00E9rences compress\u00E9es ; %1$zu%2$s demand\u00E9
J9GC085=taille initiale des m\u00E9tadonn\u00E9es des r\u00E9f\u00E9rences compress\u00E9es
J9GC088=La taille de page de %1$zu%2$s demand\u00E9e pour le tas des objets n'a pas pu \u00EAtre satisfaite ; la taille %3$zu%4$s est utilis\u00E9e \u00E0 la place.
J9GC087=Impossible de satisfaire la taille de tas %1$zu%2$s avec la taille de page %3$zu%4$s. La taille du tas peut \u00EAtre sp\u00E9cifi\u00E9e avec -Xmx
J9GC089=L'option -Xgc\:preferredHeapBase n'est pas prise en charge sur z/OS.
SHRC453=Dresser la liste de tous les \u00E9l\u00E9ments du cache, y compris les classes orphelines
SHRC454=D\u00E9sactiver la v\u00E9rification si l'ID s\u00E9maphore SysV en cours est identique \u00E0 l'ID s\u00E9maphore SysV mis en cache
SHRC455=Forcer la v\u00E9rification de la table de cha\u00EEnes au d\u00E9marrage
SHRC456=Forcer la reconnaissance d'un changement d'ID de g\u00E9n\u00E9ration de la machine virtuelle
SHRC450=Le champ de longueur des donn\u00E9es dans l'en-t\u00EAte du cache n'est pas valide. La longueur des donn\u00E9es dans l'en-t\u00EAte du cache est de \: %u.
SHRC451=Le champ de d\u00E9but des donn\u00E9es dans l'en-t\u00EAte du cache n'est pas valide. L'adresse de d\u00E9but des donn\u00E9es dans l'en-t\u00EAte du cache est \: 0x%p.
SHRC452=D\u00E9sactiver la protection de m\u00E9moire de la zone en lecture/\u00E9criture (table de cha\u00EEnes)
SHRC457=Nom du cache non valide, le nom du cache "%.*s" contient uniquement un blanc ou est vide
SHRC458=D\u00E9sactive le partage des classes sans d\u00E9sactiver les API de l'utilitaire
SHRC459=D\u00E9sactive le partage des classes et les API de l'utilitaire
SHRC480=trop de mises \u00E0 jour lors de la lecture
SHRC481=le cache est endommag\u00E9
J9GC071=La valeur de '%s' n'est pas correcte
J9GC070=Echec du d\u00E9marrage du r\u00E9cup\u00E9rateur de place
SHRC002=en cours d'utilisation
SHRC486=Espace r\u00E9serv\u00E9 pour les octets de donn\u00E9es JIT    %*c\= %d
SHRC003=heure de la derni\u00E8re d\u00E9connexion
SHRC487=Espace maximal pour les octets de donn\u00E9es JIT    %*c\= %d
SHRC004=Impossible de d\u00E9truire le cache "%s"
SHRC488=Le total des valeurs -Xscminaot et -Xscminjitdata ne doit pas \u00EAtre sup\u00E9rieur \u00E0 la taille du cache disponible
SHRC005=Aucun cache de classe partag\u00E9 disponible
SHRC489=Si le cache ouvert est d\u00E9sign\u00E9 comme endommag\u00E9, d\u00E9clenche un \u00E9v\u00E9nement de vidage du cache
SHRC482=l'adresse n'est pas dans le cache
SHRC483=\u00E9chec de l'actualisation du cache
SHRC000=Cache partag\u00E9
SHRC484=Espace r\u00E9serv\u00E9 pour les octets AOT        %*c\= %d
SHRC001=ID m\u00E9moire partag\u00E9e du syst\u00E8me d'exploitation
SHRC485=Espace maximal pour les octets AOT         %*c\= %d
J9GC069=Echec de l'initialisation de l'unit\u00E9 d'ex\u00E9cution Finalize
SHRC006=Lors des %1$d derni\u00E8res minutes, %2$d caches ont expir\u00E9
SHRC007=Impossible de retirer le cache de classe partag\u00E9 "%s"
SHRC008=Cache partag\u00E9 cr\u00E9\u00E9 \: %1$s taille \: %2$d octets
SHRC009=Cache partag\u00E9 ouvert \: %1$s taille \: %2$d octets
J9GC062=La valeur %s doit \u00EAtre une puissance de deux
J9GC061=taille maximale espace m\u00E9moire sectoris\u00E9e
J9GC064=Echec d'allocation de l'espace des anciens objets
J9GC063=Impossible d'ouvrir le fichier '%s' en \u00E9criture
J9GC066=La g\u00E9om\u00E9trie m\u00E9moire n\u00E9cessaire au tas divis\u00E9 n'a pas pu \u00EAtre allou\u00E9e
J9GC065=Echec de l'allocation de l'espace des nouveaux objets
J9GC068=ScopedMemory.join/joinAndEnter interrompu
J9GC067=Echec de l'instanciation du tas divis\u00E9 \: %1$s (nouvelle taille %2$zu%3$s, ancienne taille %4$zu%5$s)
SHRC470=%1$s donn\u00E9es jointes mises \u00E0 jour pour %7$.*6$s.%3$.*2$s%5$.*4$s
J9GC080=La configuration syst\u00E8me ne prend pas en charge le param\u00E8tre '%.*s' dans l'option '-Xlp'
J9GC082=La taille demand\u00E9e pour la taille de page %1$s %2$zu%3$s%4$s n'est pas une taille prise en charge ; %5$zu%6$s%7$s utilis\u00E9 \u00E0 la place
J9GC081=Des virgules suppl\u00E9mentaires sont d\u00E9tect\u00E9es dans l'option '-Xlp' ; elles sont ignor\u00E9es
SHRC475=aucune donn\u00E9e n'existe
SHRC476=les donn\u00E9es existent d\u00E9j\u00E0
SHRC477=plus d'espace dans le cache pour %d octets
SHRC478=taille des donn\u00E9es %d plus grande que la taille disponible %d
SHRC471=Echec de la mise \u00E0 jour de %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
SHRC472=aucun acc\u00E8s \u00E0 la ressource
SHRC473=\u00E9chec de enterWriteMutex
SHRC474=\u00E9chec de enterReadMutex
SHRC479=\u00E9chec de l'allocation de m\u00E9moire de %d octets
J9GC073=La taille de grande page %1$zu%2$s %3$s n'est pas une taille de page prise en charge, %4$zu%5$s utilis\u00E9 \u00E0 la place.
J9GC072=La taille de grande page %1$zu%2$s n'est pas une taille de page prise en charge ; %3$zu%4$s %5$s utilis\u00E9 \u00E0 la place.
J9GC075=Une erreur s'est produite lors de l'analyse syntaxique de l'option '-Xlp'
J9GC074=La taille de grande page %1$zu%2$s %3$s n'est pas une taille de page prise en charge, %4$zu%5$s %6$s utilis\u00E9 \u00E0 la place.
J9GC077=La configuration syst\u00E8me ne prend pas en charge la taille de grande page %1$zu%2$s %3$s demand\u00E9e
J9GC076=La configuration syst\u00E8me ne prend pas en charge la taille de grande page %1$zu%2$s demand\u00E9e
J9GC079=L'option '%1$s' n'est pas compl\u00E8te ; le param\u00E8tre '%2$s' doit \u00EAtre sp\u00E9cifi\u00E9.
J9GC078='%1$s' n'est pas sp\u00E9cifi\u00E9 comme premier param\u00E8tre dans l'option '%2$s'
SHRC024=erreur de d\u00E9connexion de la m\u00E9moire partag\u00E9e
SHRC025=erreur de connexion de la m\u00E9moire partag\u00E9e
SHRC026=Impossible de cr\u00E9er un cache de la taille demand\u00E9e \: v\u00E9rifiez vos param\u00E8tres SHMMAX et SHMMIN
SHRC027=Nom du cache partag\u00E9 trop long
SHRC020=Une erreur s'est produite lors de l'ouverture du s\u00E9maphore
SHRC021=Un code d'erreur inconnu a \u00E9t\u00E9 retourn\u00E9
SHRC022=Erreur lors de la cr\u00E9ation de la r\u00E9gion de m\u00E9moire partag\u00E9e
SHRC023=Le cache n'existe pas
J9GC048=incr\u00E9ment de l'espace des anciens objets
J9GC047=taille maximale de l'espace des anciens objets
J9GC049=taille de l'ensemble m\u00E9moris\u00E9
SHRC028=Acc\u00E8s refus\u00E9
SHRC029=M\u00E9moire insuffisante sur le syst\u00E8me
J9GC040=Option inconnue \: %s
J9GC042=La somme de %1$s et %2$s est trop petite pour %3$s
J9GC041=Type fvtest inconnu \: %s
J9GC044=taille maximale de l'espace des nouveaux objets
J9GC043=taille initiale de l'espace des nouveaux objets
J9GC046=taille initiale de l'espace des anciens objets
J9GC045=taille initiale de m\u00E9moire
SHRC490=Force la reconnaissance d'un cache de classe partag\u00E9 endommag\u00E9
SHRC491=Echec du stockage de %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
SHRC492=Echec de la mise \u00E0 jour de %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
J9GC060=taille espace m\u00E9moire p\u00E9renne
SHRC013=Echec du retrait de la m\u00E9moire du cache partag\u00E9 "%s"
SHRC497=Placeholder, not used
SHRC014=Echec de la suppression du s\u00E9maphore du cache "%s"
SHRC498=Placeholder, not used
SHRC015=Erreur du cache de classe partag\u00E9 \: option non valide
SHRC499=Placeholder, not used
SHRC016=Erreur du cache de classe partag\u00E9 \:
SHRC493=Impossible de trouver %1$s donn\u00E9es jointes pour %8$.*7$s.%4$.*3$s%6$.*5$s, raison \:%2$s
SHRC010=Le cache partag\u00E9 "%s" est d\u00E9truit
SHRC494=Impossible de trouver %1$s donn\u00E9es rattach\u00E9es pour l'adresse 0x%2$p \: motif \: %3$s
SHRC011=Erreur \: Impossible d'ouvrir le cache de classe partag\u00E9
SHRC495=Echec du stockage de %1$s donn\u00E9es rattach\u00E9es pour l'adresse 0x%2$p \: motif \: %3$s
SHRC012=Impossible de retirer le cache partag\u00E9 "%s" \: des machines JVM y sont encore connect\u00E9es
SHRC496=Echec de la mise \u00E0 jour de %1$s donn\u00E9es rattach\u00E9es pour l'adresse 0x%2$p \: motif \: %3$s
J9GC059=-Xgcpolicy\:metronome n'est pas autoris\u00E9 sans l'option -Xrealtime
J9GC058=Echec de l'allocation de l'espace m\u00E9moire p\u00E9renne
SHRC017=Code d'erreur \: %d
SHRC018=impossible d'allouer de la m\u00E9moire
SHRC019=longueur demand\u00E9e trop faible
J9GC051=incr\u00E9ment de segment des classes RAM
J9GC050=m\u00E9moire maximale souple
J9GC053=m\u00E9moire maximale
J9GC052=incr\u00E9ment de segment des classes ROM
J9GC055=taille de grande page
J9GC054=La taille de grande page %1$zu%2$s n'est pas une taille de page prise en charge, %3$zu%4$s utilis\u00E9 \u00E0 la place.
J9GC057=%1$s ne doit pas \u00EAtre sup\u00E9rieur \u00E0 %2$s
J9GC056=tailles de grande page disponibles \:
SHRC040=Indiquer le nom d'un cache partag\u00E9
SHRC041=D\u00E9truire le cache partag\u00E9 (utiliser le param\u00E8tre de nom ou la valeur par d\u00E9faut)
SHRC046=Afficher tous les caches partag\u00E9s et leurs statistiques
SHRC047=Afficher le r\u00E9capitulatif des statistiques de cache
SHRC048=Dresser la liste de tous les \u00E9l\u00E9ments du cache
SHRC049=Mode d\u00E9bogage v\u00E9rifiant tout le bytecode entrant
SHRC042=D\u00E9truire tous les caches partag\u00E9s
SHRC043=Activer le partage de bytecode modifi\u00E9\n \t<modContext> est un descripteur utilisateur qui d\u00E9crit le type de modification\n \tLes machines JVM qui utilisent le m\u00EAme <modContext> doivent utiliser les m\u00EAmes modifications
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC045=D\u00E9truire les caches inutilis\u00E9s pendant <t> minutes
J9GC026=-Xverbosegclog n'a pas r\u00E9ussi \u00E0 allouer des structures internes
J9GC025=Somme de %1$s et %2$s
J9GC028=Option trop \u00E9lev\u00E9e \: '%s'
J9GC027=Option incorrectement form\u00E9e \: '%s'
J9GC029=Erreur d'option \: '%s'
J9GC020=Taille de %s trop grande pour le tas
J9GC022=La somme de %1$s et de %2$s est trop \u00E9lev\u00E9e pour %3$s
J9GC021=La taille de %1$s doit \u00EAtre \u00E9gale \u00E0 %2$s
J9GC024=La somme de %1$s et de %2$s est trop \u00E9lev\u00E9e pour le tas
J9GC023=La somme de %1$s et de %2$s doit \u00EAtre \u00E9gale \u00E0 %3$s
SHRC030=Le cache de classe partag\u00E9 que vous tentez de connecter a un en-t\u00EAte non valide.
SHRC035=Mise en cache locale des chemins d'acc\u00E8s aux classes d\u00E9sactiv\u00E9e
SHRC036=R\u00E9duction des conflits de stockages concurrents d\u00E9sactiv\u00E9e
SHRC037=Mises \u00E0 jour incr\u00E9mentielles d\u00E9sactiv\u00E9es
SHRC038=Syntaxe \:\n\njava -Xshareclasses[\:option,...]\n\n Les options valides incluses (avec un bref r\u00E9sum\u00E9) sont \:\n\n
SHRC031=La version de JVM du cache de classe partag\u00E9 auquel vous tentez de vous connecter est incompatible.
SHRC032=Le niveau de modification du cache de classe partag\u00E9 auquel vous tentez de vous connecter est erron\u00E9.
SHRC033=Verrouillage des tables de hachage locales d\u00E9sactiv\u00E9
SHRC034=V\u00E9rification de l'horodatage d\u00E9sactiv\u00E9e
J9GC037=%1$s n'est pas pris en charge avec des valeurs autres que %2$zu
J9GC036=La valeur de %1$s doit \u00EAtre sup\u00E9rieure \u00E0 %2$zu
J9GC039=*** %1$s obsol\u00E8te \: pr\u00E9f\u00E9rez %2$s ***
J9GC038=La valeur %s indiqu\u00E9e est trop \u00E9lev\u00E9e
SHRC039=Afficher l'aide partag\u00E9e g\u00E9n\u00E9rale
J9GC031='%1$s' et '%2$s' sont incompatibles
J9GC030=La valeur %1$s de %2$.2f doit \u00EAtre au moins %3$s inf\u00E9rieure \u00E0 la valeur %4$s de %5$.2f
J9GC033=La valeur de %1$s doit \u00EAtre comprise entre %2$.2f et %3$.2f (inclus)
J9GC032=La configuration syst\u00E8me ne prend pas en charge l'option '%s'
J9GC035=%s doit \u00EAtre suivi d'une valeur num\u00E9rique
J9GC034=La valeur de %1$s doit \u00EAtre comprise de %2$zu \u00E0 %3$zu
SHRC060=Impossible d'allouer de la m\u00E9moire pour le tampon de cha\u00EEnes dans shrinit\:\:hookFindSharedClass
SHRC061=Le nom de cache ne doit pas d\u00E9passer 64 caract\u00E8res. Cache non cr\u00E9\u00E9.
SHRC062=Erreur lors de la copie du nom d'utilisateur dans le nom de cache par d\u00E9faut
SHRC063=Impossible d'allouer de la m\u00E9moire pour sharedClassConfig dans shrinit
SHRC068=Mise en cache locale des chemins d'acc\u00E8s aux classes d\u00E9sactiv\u00E9e
SHRC069=R\u00E9duction des conflits de stockages concurrents d\u00E9sactiv\u00E9e
SHRC064=Impossible de cr\u00E9er configMonitor dans shrinit
SHRC065=Impossible d'allouer le pool dans shrinit
SHRC066=Verrouillage des tables de hachage locales d\u00E9sactiv\u00E9
SHRC067=V\u00E9rification de l'horodatage d\u00E9sactiv\u00E9e
J9GC004=Echec de l'instanciation du r\u00E9cup\u00E9rateur de place global
J9GC003=Echec de l'instanciation du r\u00E9partiteur de t\u00E2ches
J9GC006=Echec de l'initialisation, m\u00E9moire insuffisante
J9GC005=Echec de l'initialisation
J9GC008=Echec de l'initialisation des extensions de module
J9GC007=Echec de l'initialisation, impossible d'analyser la syntaxe de la ligne de commande
J9GC009=Echec de l'initialisation du mutex pour les statistiques du r\u00E9cup\u00E9rateur de place
J9GC000=Erreur interne, m\u00E9moire satur\u00E9e
J9GC002=Echec de l'instanciation du tas. %1$zu%2$s demand\u00E9
J9GC001=Echec de l'instanciation du tas
SHRC050=Activer la sortie prolixe
SHRC051=D\u00E9sactiver les mises \u00E0 jour dynamiques
SHRC052=D\u00E9sactiver la mise en cache locale des chemins d'acc\u00E8s aux classes
SHRC057=Param\u00E8tres erron\u00E9s pour l'option d'expiration
SHRC058=Impossible d'allouer de la m\u00E9moire pour ClasspathItem dans shrinit\:\:hookStoreSharedClass
SHRC059=Impossible d'allouer de la m\u00E9moire pour ClasspathItem dans shrinit\:\:hookFindSharedClass
SHRC053=D\u00E9sactiver le verrouillage local de table de hachage
SHRC054=D\u00E9sactiver l'algorithme permettant de r\u00E9duire les conflits de stockage
SHRC055=D\u00E9sactiver les mises \u00E0 jour incr\u00E9mentielles de cache
SHRC056=Option de ligne de commande "%s" non reconnue
J9GC015=Echec de l'allocation de l'espace m\u00E9moire par d\u00E9faut
J9GC014=Echec de l'allocation des segments de m\u00E9moire des classes de la machine virtuelle
J9GC017=Taille de %1$s trop petite, taille minimale requise \: %2$zu %3$so
J9GC016=Echec de l'allocation du segment des objets survivants dans l'espace m\u00E9moire par d\u00E9faut
J9GC019=Taille de %1$s trop grande pour %2$s
J9GC018=Taille de %1$s trop petite pour %2$s
J9GC011=Echec de l'initialisation du pool d'espaces m\u00E9moire
J9GC010=Echec de l'initialisation de la gestion de la finalisation
J9GC013=Echec de l'allocation des segments de m\u00E9moire des objets de la machine virtuelle
J9GC012=Echec de l'allocation des segments de m\u00E9moire de la machine virtuelle
