#Thu Jan 21 02:08:19 CST 2021
EXEL070=A vers\u00E3o da imagem de ROM \u00E9 incorreta
EXEL079=\  -Xscmx<x>       configura o tamanho do novo cache de classe compartilhado para <x>
J9VM151=Falha ao abrir a biblioteca jimage
J9VM150=-Xscsoftmx ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM153=Alternando para o leitor interno de jimage porque a JVM n\u00E3o pode usar a biblioteca jimage
EXEL071=Falha em localizar o nome de classe principal
J9VM152=Falha ao consultar o s\u00EDmbolo %s na biblioteca jimage
EXEL072=Erro de inicializa\u00E7\u00E3o da VM\: Sem mem\u00F3ria
J9VM155=Valor ruim para -Xpatch; o caminho da corre\u00E7\u00E3o n\u00E3o foi especificado na propriedade %s\=%s
EXEL073=Erro interno da VM\: Falha em criar Java VM
J9VM154=Valor ruim para -Xpatch; o valor da propriedade %s n\u00E3o foi especificado
EXEL074=
J9VM157=A classe %2$.*1$s(%3$s) n\u00E3o pode acessar a classe %5$.*4$s(%6$s) porque o m\u00F3dulo %3$s n\u00E3o l\u00EA o m\u00F3dulo %6$s
EXEL075=\  -Xquickstart    aumenta o tempo de inicializa\u00E7\u00E3o retardando otimiza\u00E7\u00F5es
J9VM156=-XX\:SharedCacheHardLimit\= ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
EXEL076=JIT  - %s\n
J9VM159=Erro\: %s requer a especifica\u00E7\u00E3o do caminho do m\u00F3dulo
EXEL077=\  -Xssi<x>        configura o incremento da pilha de encadeamento java para <x>
J9VM158=A classe %2$.*1$s(%3$s) n\u00E3o pode acessar a classe %5$.*4$s(%6$s) porque o m\u00F3dulo %6$s n\u00E3o exporta o pacote %7$s para o m\u00F3dulo %3$s
EXEL078=\  -Xshareclasses[\:options]  Ativa o compartilhamento de dados da classe (utilize a ajuda para obter detalhes)\n
J9VM149=%s n\u00E3o \u00E9 mais suportado. Inclua os arquivos jar/bibliotecas necess\u00E1rios para o caminho de classe.
EXEL068=Erro interno da VM\: Falha em configurar o elemento da matriz para %s
EXEL069=Falha em localizar imagem de ROM
J9VM140=O respons\u00E1vel pela chamada n\u00E3o est\u00E1 anotado como @sun.reflect.CallerSensitive.
J9VM142=A op\u00E7\u00E3o da linha de comandos -Xrealtime n\u00E3o \u00E9 suportada nesta vers\u00E3o do IBM SDK
EXEL060=Erro interno da VM\: Falha em criar matriz de byte para o nome de classe %s
J9VM141=m\u00E9todos padr\u00E3o em conflito para '%2$.*1$s%4$.*3$s' em %6$.*5$s a partir das classes [%7$s]
EXEL061=Erro interno da VM\: Falha em criar java/lang/String para o nome de classe %s
J9VM144=par\u00E2metros em excesso\: 255 + 1
EXEL062=Erro interno da VM\: Falta de mem\u00F3ria ao converter a sequ\u00EAncia em caracteres UTF para o nome de classe %s
J9VM143=A op\u00E7\u00E3o da linha de comandos %s n\u00E3o \u00E9 suportada nesta vers\u00E3o do IBM SDK
EXEL063=A classe %s n\u00E3o implementa main()
J9VM146=invokeinterface de m\u00E9todo n\u00E3o publico '%4$.*3$s%6$.*5$s' in %2$.*1$s
EXEL064=O m\u00E9todo main deve ser declarado public, static e void.
J9VM145=%s n\u00E3o \u00E9 suportado no z/OS.
EXEL065=Erro interno da VM\: Falha em criar matriz de argumento
J9VM148=%s n\u00E3o \u00E9 mais suportado. O mecanismo de substitui\u00E7\u00E3o de padr\u00F5es endossados \u00E9 suportado apenas por meio de m\u00F3dulos atualiz\u00E1veis.
EXEL066=Erro interno da VM\: Falha em criar matriz de byte para o argumento %s
J9VM147=N\u00E3o \u00E9 poss\u00EDvel anexar o encadeamento atual
EXEL067=Erro interno da VM\: Falha em criarjava/lang/String para o argumento %s
SMAP000=
EXEL090=\  -Xscmaxaot<x>   configura espa\u00E7o m\u00E1x. reservado de cache compartilhado para dados AOT como <x>
EXEL091=\n  -Xcheck[\:op\u00E7\u00E3o[\:...]]  controla utiliza\u00E7\u00E3o de verifica\u00E7\u00E3o -Xcheck\:help para obter detalhes adicionais
EXEL092=\n  -Xdump[\:op\u00E7\u00E3o,...]  controla dumps, use -Xdump\:help para obter detalhes adicionais
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP005=
J9VM171=Tentativa de configurar o campo final de inst\u00E2ncia %2$.*1$s.%4$.*3$s do m\u00E9todo "%6$.*5$s" que n\u00E3o \u00E9 <init>
J9VM170=Tentativa de configurar o campo final est\u00E1tico %2$.*1$s.%4$.*3$s do m\u00E9todo "%6$.*5$s" que n\u00E3o \u00E9 <clinit>
J9VM173=A classe %2$.*1$s e seu host de aninhamento %4$.*3$s devem possuir o mesmo pacote.
J9VM172=A classe %2$.*1$s e seu host de aninhamento %4$.*3$s devem possuir o mesmo carregador de classes.
J9VM175=Falha ao carregar a biblioteca %1$s requerida pelo m\u00F3dulo\: %2$s
EXEL093=As seguintes op\u00E7\u00F5es controlam a configura\u00E7\u00E3o global da VM\:
J9VM174=A classe %2$.*1$s deve ser solicitada por seu host de aninhamento %4$.*3$s
EXEL094=\  -Xcompressedrefs              usar refer\u00EAncias de heap compactadas
J9VM177=A classe %2$.*1$s deve conseguir carregar seu host de aninhamento %4$.*3$s.
EXEL095=\  -Xrealtime                    ativar extens\u00F5es do realtime
J9VM176=carregando a viola\u00E7\u00E3o de restri\u00E7\u00E3o ao substituir o m\u00E9todo "%2$.*1$s.%4$.*3$s%6$.*5$s" durante a cria\u00E7\u00E3o da classe "%18$.*17$s"\: o carregador "%8$.*7$s@%9$x" da classe "%11$.*10$s" e o carregador "%13$.*12$s@%14$x" da classe "%16$.*15$s" possuem tipos diferentes para a assinatura de m\u00E9todo
EXEL096=\  -Xgcpolicy\:metronome          ativar extens\u00F5es do realtime
J9VM179=O m\u00F3dulo n\u00E3o foi nomeado.
EXEL097=\  -Xrealtime                    ativar realtime tempor\u00E1rio
J9VM178=O m\u00F3dulo \u00E9 nulo.
EXEL098=\  -Xgcpolicy\:metronome          ativar realtime tempor\u00E1rio
EXEL099=\  -Xrealtime -Xnortsj           ativar realtime tempor\u00E1rio
EXEL080=vers\u00E3o de java "%s"
EXEL081=vers\u00E3o de java "%1$s/%2$s"
J9VM160=Erro\: %s requer que sejam especificados m\u00F3dulos
J9VM162=\tem %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s)
J9VM161=\tem %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s\:%9$u)
J9VM164=\tem %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s)
EXEL082=\  -Xlp<x>         configura tamanho de p\u00E1gina grande como <x>
J9VM163=\tem %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s\:%8$u)
EXEL083=N\u00E3o foi poss\u00EDvel abrir o arquivo\: %s
J9VM166=\tem %2$.*1$s.%4$.*3$s (%5$.*6$s)
EXEL084=N\u00E3o \u00E9 poss\u00EDvel fazer uma c\u00F3pia de backup do arquivo\: %s
J9VM165=\tem %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
EXEL085=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize ent\u00E3o "-jxe <caminho>".\n
J9VM168=
EXEL086=\n  -Xtrace[\:op\u00E7\u00E3o,...]  controle de rastreio, utilize -Xtrace\:help para obter detalhes adicionais
J9VM167=As otimiza\u00E7\u00F5es GC em estado inativo n\u00E3o s\u00E3o suportadas
EXEL087=\  -Xjni\:<op\u00E7\u00F5es>               define op\u00E7\u00F5es JNI
EXEL088=
J9VM169=
EXEL089=\  -Xscminaot<x>   configura espa\u00E7o m\u00EDn. reservado de cache compartilhado para dados AOT como <x>
J9VM117=-Xitsn ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM116=noLockword\:%.*s
J9VM119=-Xscmaxjit ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM118=-Xscminjit ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM111=Op\u00E7\u00E3o de palavra de bloqueio inv\u00E1lida especificada\:%s
J9VM110=Modo de palavra de bloqueio inv\u00E1lido especificado\:%s
J9VM113=-----------------------------
J9VM112=Configura\u00E7\u00E3o de Palavra de Bloqueio
J9VM115=palavra de bloqueio\:%.*s
J9VM114=Modo de Palavra de Bloqueio\=%s
J9VM106=As op\u00E7\u00F5es de info, warn, error, vital e config podem ser combinadas com uma ",", por exemplo\:\n
J9VM105=-Xsyslog\:config            Registrar as mensagens de configura\u00E7\u00E3o da JVM.\n
J9VM108=-Xsyslog\:info,warn,error\n
J9VM107=-Xsyslog\:error,warn
J9VM109=Sistema operacional n\u00E3o suportado (%s)\: o Windows XP ou mais recente \u00E9 necess\u00E1rio.
J9VM100=-Xsyslog\:all               Registrar todas as mensagens da JVM.
J9VM102=-Xsyslog\:warn              Registrar as mensagens de aviso da JVM.
J9VM101=-Xsyslog\:info              Registrar todas as mensagens informativas da JVM.
J9VM104=-Xsyslog\:vital             Registrar as mensagens vitais da JVM. Este \u00E9 ligado por padr\u00E3o.
J9VM103=-Xsyslog\:error             Registrar as mensagens de erro da JVM. Este \u00E9 ligado por padr\u00E3o.
J9VM139=
J9VM138=
J9VM131=Finalizar processo usando o CEE3AB2() com encerramento de forma anormal %1$u, motivo %2$u, limpeza %3$u.
J9VM130=O aplicativo voltou a operar ap\u00F3s a manipula\u00E7\u00E3o de uma condi\u00E7\u00E3o irrecuper\u00E1vel e retornou ilegalmente, ou foi chamado de volta, em Java (c\u00F3digo JIT'ed)
J9VM133=O tamanho bruto do n\u00FAcleo ilimitado do sistema \u00E9 configurado para %d, os dumps do sistema podem estar  truncados.
J9VM132=Modo de palavra de bloqueio inv\u00E1lido especificado, java/lang/Class e java/lang/String n\u00E3o podem ter palavras de bloqueio quando o -Xtenant est\u00E1 presente\: %s
J9VM135=A configura\u00E7\u00E3o de /proc/sys/kernel/core_pattern "%s" especifica que os core dumps devem ser canalizados para um programa externo. O A JVM pode ser incapaz de localizar core dumps e renome\u00E1-los.
J9VM134=A op\u00E7\u00E3o de n\u00FAcleo completo do sistema \u00E9 configurada para FALSE, os dumps do sistema podem estar truncados.
J9VM137=A classe %2$.*1$s tem padr\u00F5es conflitantes para o m\u00E9todo %4$.*3$s%6$.*5$s
J9VM136=A configura\u00E7\u00E3o /proc/sys/kernel/core_pattern "%s" especifica uma sequ\u00EAncia de formata\u00E7\u00F5es para renomear core dumps. O A JVM pode ser incapaz de localizar core dumps e renome\u00E1-los.
J9VM128=Espa\u00E7o de heap Java
J9VM127=O tamanho inicial do subalocador de 32 bits n\u00E3o pode ser configurado para zero.
J9VM129=O aplicativo voltou a operar ap\u00F3s a manipula\u00E7\u00E3o de uma condi\u00E7\u00E3o irrecuper\u00E1vel e retornou ilegalmente, ou foi chamado de volta, em Java
J9VM120=-Xscminjitdata ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM122=Falha ao obter a varia\u00E7\u00E3o de endere\u00E7os de user32.dll necess\u00E1ria para -Xprotectcontiguous.
J9VM121=-Xscmaxjitdata ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM124=N\u00E3o \u00E9 poss\u00EDvel definir a classe %.*s - '%.*s' \u00E9 um pacote do sistema protegido
J9VM123=Tentando executar em um processador n\u00E3o suportado, JVM ser\u00E1 encerrado.
J9VM126=O tamanho confirmado do subalocador de 32 bits n\u00E3o pode ser configurado para zero.
J9VM125=O tamanho confirmado do subalocador de 32 bits \u00E9 maior que o tamanho inicial. Tamanho confirmado \= %1$u, tamanho inicial \= %2$u.
SHRC802=O cache possui %1$d%% de soft cheio\n
SHRC803=Ative a prote\u00E7\u00E3o de mem\u00F3ria de p\u00E1ginas parcialmente preenchidas na inicializa\u00E7\u00E3o.
SHRC804=A JVM ativou a prote\u00E7\u00E3o de p\u00E1gina parcial do cache compartilhado na inicializa\u00E7\u00E3o, uma vez que o cache compartilhado existente foi criado com a prote\u00E7\u00E3o de p\u00E1gina parcial ativada na inicializa\u00E7\u00E3o.
SHRC805=A JVM n\u00E3o foi ativada, protegendo as p\u00E1ginas parcialmente preenchidas do cache compartilhado na inicializa\u00E7\u00E3o.
SHRC800=O cache compartilhado est\u00E1 cheio. O espa\u00E7o m\u00EDnimo reservado e m\u00E1ximo permitido para dados AOT/JIT e o limite de softmx n\u00E3o podem mais ser ajustados.
SHRC801=Bytes de softmx                       %*c\= %d
SHRC806=O cache compartilhado persistente de refer\u00EAncias compactadas "%1$s" foi destru\u00EDdo. Use a op\u00E7\u00E3o -Xnocompressedrefs se voc\u00EA desejar destruir um cache de refer\u00EAncias n\u00E3o compactadas.
SHRC807=O cache compartilhado persistente de refer\u00EAncias n\u00E3o compactadas "%1$s" foi destru\u00EDdo. Use a op\u00E7\u00E3o -Xcompressedrefs se voc\u00EA desejar destruir um cache de refer\u00EAncias compactadas.
SHRC808=O cache compartilhado de refer\u00EAncias compactadas "%s" \u00E9 destru\u00EDdo. Use a op\u00E7\u00E3o -Xnocompressedrefs se voc\u00EA desejar destruir um cache de refer\u00EAncias n\u00E3o compactadas.
SHRC809=O cache compartilhado de refer\u00EAncias n\u00E3o compactadas "%s" \u00E9 destru\u00EDdo. Use a op\u00E7\u00E3o -Xcompressedrefs se voc\u00EA desejar destruir um cache de refer\u00EAncias compactadas.
DUMP001=Evento de dump n\u00E3o reconhecido\: ...%s
DUMP000=Op\u00E7\u00E3o de dump n\u00E3o reconhecida\: -Xdump\:%s
DUMP003=Agente de dump n\u00E3o reconhecido\: %s
DUMP002=Token n\u00E3o reconhecido\: %%%1$c
DUMP012=Erro no dump %1$s\: %2$s
DUMP011=O dump %1$s criou o processo %2$d
DUMP014=A\u00E7\u00E3o de VM n\u00E3o reconhecida\: ...%s
DUMP013=Evento de dump processado "%1$s", detalhe "%3$.*2$s".
DUMP010=%1$s dump gravado em %2$s
SHRC824=STARTUP HINTS DETAIL Sinaliza\u00E7\u00F5es\: %1$zu DATA1\: %2$zu DATA2\: %3$zu
DUMP009=Dump %s n\u00E3o dispon\u00EDvel
SHRC825=\t startuphint       Imprime somente tipos de sugest\u00F5es de inicializa\u00E7\u00E3o no cache compartilhado.
DUMP008=usando '%s'
SHRC826=Bytes de sugest\u00E3o de inicializa\u00E7\u00E3o %*c\= %d
SHRC827=\# Sugest\u00F5es de inicializa\u00E7\u00E3o %*c\= %d
SHRC820=Desative o armazenamento em cache das classes carregadas pelo carregador de classes de autoinicializa\u00E7\u00E3o.
DUMP005=Ferramenta externa ausente
SHRC821=Desative o armazenamento em cache de classes carregadas pelos carregadores de classes n\u00E3o autoinicializa\u00E7\u00E3o. Essa op\u00E7\u00E3o tamb\u00E9m ativa a op\u00E7\u00E3o "n\u00E3o fatal".
DUMP004=Nome de arquivo ausente
SHRC822=N\u00E3o inicie o cache compartilhado se ocorrer um erro.
DUMP007=JVM Solicitando dump %1$s utilizando '%2$s'
SHRC823=%1$d\: 0x%2$p STARTUP HINTS KEY\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
DUMP006=Processando o evento de dump "%1$s", detalhe "%3$.*2$s" - aguarde.
SHRC828=O caminho do diret\u00F3rio de cache compartilhado \u00E9 muito longo.
SHRC829=Falha ao usar a p\u00E1gina inicial do usu\u00E1rio como o diret\u00F3rio de cache compartilhado padr\u00E3o. N\u00E3o \u00E9 poss\u00EDvel obter diret\u00F3rio inicial. Selecione outro diret\u00F3rio por meio da vari\u00E1vel de ambiente "HOME" ou a op\u00E7\u00E3o da linha de comandos "cacheDir\=", ou corrija o diret\u00F3rio inicial na entrada de arquivo de senha.
DUMP023=A prepara\u00E7\u00E3o de heap solicitada n\u00E3o foi executada porque o acesso exclusive n\u00E3o foi solicitado ou n\u00E3o p\u00F4de ser obtido.
DUMP022=A compacta\u00E7\u00E3o de heap solicitada n\u00E3o foi executada porque o acesso exclusive n\u00E3o foi solicitado ou n\u00E3o p\u00F4de ser obtido.
DUMP025=Falha de IEATDUMP para DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=V\u00E1rios dumps do heap foram solicitados mas %%id est\u00E1 ausente no r\u00F3tulo do arquivo\: os dumps ser\u00E3o sobrescritos
DUMP021=O heapdump solicitado n\u00E3o foi produzido porque o acesso exclusive n\u00E3o foi solicitado e n\u00E3o p\u00F4de ser obtido.
DUMP020=O dump %s foi gravado
SHRC813=Total de bytes n\u00E3o armazenados devido \u00E0 configura\u00E7\u00E3o de -Xscsoftmx ser %u. Bytes AOT n\u00E3o armazenados devido \u00E0 configura\u00E7\u00E3o de -Xscmaxaot ser %u. Bytes JIT n\u00E3o armazenados devido \u00E0 configura\u00E7\u00E3o de -Xscmaxjitdata ser %u.
SHRC814=\t stale           Imprime todas as entradas antigas no cache compartilhado.
DUMP019=JVM solicitando dump %s
SHRC815=bytes antigos                        %*c\= %u
SHRC816=O valor %s \u00E9 maior do que o tamanho do cache compartilhado, portanto ele foi configurado para se igualar ao tamanho de cache compartilhado.
DUMP016=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel criar o arquivo (%s)
SHRC810=A captura instant\u00E2nea do cache compartilhado de refer\u00EAncias compactadas "%s" \u00E9 destru\u00EDdo. Use a op\u00E7\u00E3o -Xnocompressedrefs se voc\u00EA desejar destruir uma captura instant\u00E2nea de cache de refer\u00EAncias n\u00E3o compactadas.
DUMP015=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel abrir ou ler (%s)
SHRC811=A captura instant\u00E2nea do cache compartilhado de refer\u00EAncias n\u00E3o compactadas "%s" foi destru\u00EDda. Use a op\u00E7\u00E3o -Xcompressedrefs se voc\u00EA desejar destruir uma captura instant\u00E2nea de cache de refer\u00EAncias compactadas.
DUMP018=O evento solicitado n\u00E3o est\u00E1 dispon\u00EDvel\: execute com o sinalizador -Xdump\:dynamic
SHRC812=Recurso                              \= %s
DUMP017=Interrompendo\: N\u00E3o \u00E9 poss\u00EDvel compactar o arquivo (%s)
SHRC817=O valor %s \u00E9 maior do que o tamanho do cache compartilhado, portanto ele foi configurado como ilimitado
SHRC818=Total de bytes n\u00E3o armazenados devido \u00E0 configura\u00E7\u00E3o de m\u00E1ximo aproximado de cache compartilhado ser %u. Os bytes AOT n\u00E3o armazenados devido \u00E0 configura\u00E7\u00E3o de -Xscmaxaot ser %u. Os bytes JIT n\u00E3o armazenados devido \u00E0 configura\u00E7\u00E3o de -Xscmaxjitdata ser %u.
SHRC819=Falha ao iniciar o cache compartilhado. O cache existente compartilhado foi criado por uma constru\u00E7\u00E3o JVM diferente e n\u00E3o corresponde \u00E0 JVM em execu\u00E7\u00E3o.
SHRC840=Falha ao iniciar o cache compartilhado.
SHRC841=Especifique o n\u00FAmero da camada superior. Crie uma nova camada de cache compartilhado se a camada especificada n\u00E3o existir.
SHRC846=\nEstat\u00EDsticas atuais para a camada superior do cache "%s"\: \n
SHRC847=camada de cache                     %*.c\= %d
SHRC848=\nEstat\u00EDsticas atuais para todas as camadas do cache "%s"\: \n
J9VM191=%2$.*1$s n\u00E3o \u00E9 vis\u00EDvel
SHRC849=Imprima o resumo das estat\u00EDsticas de cache apenas da camada superior. Use printTopLayerStats\=help para ver as op\u00E7\u00F5es dispon\u00EDveis.
J9VM190=Superclasse %2$.*1$s n\u00E3o pode ser uma interface
SHRC842=Crie uma nova camada de cache compartilhado.
J9VM193=Como o Java 13 -Xverify\:none e -noverify foram descontinuados para remo\u00E7\u00E3o, eles podem n\u00E3o ser op\u00E7\u00F5es aceitas no futuro.
SHRC843=N\u00FAmero de camada %d inv\u00E1lido encontrado para "%s". O n\u00FAmero da camada deve ser menor que %d.
J9VM192=%2$.*1$s n\u00E3o \u00E9 uma interface
SHRC844=N\u00FAmero de camada %d inv\u00E1lido. A camada superior existente \u00E9 %d. O n\u00FAmero da nova camada deve ser %d.
J9VM195=A matriz do pacote \u00E9 nula.
SHRC845=N\u00E3o verifique o espa\u00E7o livre em disco antes de criar um cache persistente.
J9VM194=Relacionamento de carregamento de classe inv\u00E1lido para o filho\: %2$.*1$s, pai\: %4$.*3$s
J9VM197=%1$s n\u00E3o \u00E9 suportado com %2$s.
J9VM196=A sequ\u00EAncia do pacote \u00E9 nula.
J9VM199=N\u00E3o \u00E9 permitido que a classe %2$.*1$s herde de sua super interface selada.
J9VM198=N\u00E3o \u00E9 permitido que a classe %2$.*1$s herde de sua super classe selada.
SHRC830=Falha ao usar a p\u00E1gina inicial do usu\u00E1rio como o diret\u00F3rio de cache compartilhado padr\u00E3o. O caminho \u00E9 muito longo\: N\u00E3o \u00E9 poss\u00EDvel obter diret\u00F3rio inicial. Selecione outro diret\u00F3rio por meio da vari\u00E1vel de ambiente "HOME" ou a op\u00E7\u00E3o da linha de comandos "cacheDir\=", ou corrija o diret\u00F3rio inicial na entrada de arquivo de senha.
SHRC835=Verifique os registros de data e hora do arquivo jar/zip da URL de n\u00E3o autoinicializa\u00E7\u00E3o em cada carregamento de classe.
SHRC836=Destruir todas as camadas de cache compartilhado com o mesmo nome (use o par\u00E2metro name ou o padr\u00E3o)
SHRC837=Falha ao alocar um descritor de cache
J9VM180=O nome do m\u00F3dulo \u00E9 inv\u00E1lido.
SHRC838=Falha ao iniciar o cache compartilhado. Foi detectada uma modifica\u00E7\u00E3o no cache compartilhado da camada inferior. O ID exclusivo de cache esperado \u00E9 %s
SHRC831=Falha ao usar a p\u00E1gina inicial do usu\u00E1rio como o diret\u00F3rio de cache compartilhado padr\u00E3o. Ele est\u00E1 em um Network File System. N\u00E3o \u00E9 poss\u00EDvel obter diret\u00F3rio inicial. Selecione outro diret\u00F3rio por meio da vari\u00E1vel de ambiente "HOME" ou a op\u00E7\u00E3o da linha de comandos "cacheDir\=", ou corrija o diret\u00F3rio inicial na entrada de arquivo de senha.
J9VM182=Somente o carregador de classe de autoinicializa\u00E7\u00E3o ou de plataforma pode definir o pacote java ou java.*.
SHRC832=Falha ao usar a p\u00E1gina inicial do usu\u00E1rio como o diret\u00F3rio de cache compartilhado padr\u00E3o. O c\u00F3digo de erro \u00E9 %1$d.
J9VM181=Somente o carregador de classe de autoinicializa\u00E7\u00E3o pode definir o m\u00F3dulo java.base.
SHRC833=Falha ao alocar a mem\u00F3ria nativa necess\u00E1ria para obter o diret\u00F3rio de cache compartilhado.
J9VM184=Classe inv\u00E1lida %2$.*1$s\: o campo de inst\u00E2ncia Qtype n\u00E3o \u00E9 um tipo de valor
SHRC834=Minimize a verifica\u00E7\u00E3o de registro de data e hora nos arquivos jar/zip da URL.
J9VM183=O membro aninhado %2$.*1$s deve ser capaz de carregar o host aninhado %4$.*3$s
J9VM186=Tipo de objeto inv\u00E1lido %2$.*1$s\: o objeto na pilha n\u00E3o \u00E9 um tipo de valor
J9VM185=Classe inv\u00E1lida %2$.*1$s\: classref n\u00E3o \u00E9 um tipo de valor
J9VM188=Falha ao criar um encadeamento\: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 0x%4$x
J9VM187=Tipo de objeto inv\u00E1lido %2$.*1$s\: o objeto que est\u00E1 sincronizado \u00E9 um tipo de valor
SHRC839=Falha ao iniciar o cache compartilhado. Ocorreu um erro ao obter o ID exclusivo de um cache de pr\u00E9-requisito de camada inferior.
J9VM189=Superclasse final %2$.*1$s n\u00E3o pode ser estendido
SHRC850=Op\u00E7\u00F5es dispon\u00EDveis para -Xshareclasses\:%1$s<options>. O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es. Ou seja, %2$saot+url \n
SHRC851=Desativa a verifica\u00E7\u00E3o do registro de data e hora ao localizar classes no cache compartilhado. Classes obsoletas podem ser carregadas no cache compartilhado.
SHRC852=A camada superior (camada %d) do cache est\u00E1 destru\u00EDda. Foi detectada uma modifica\u00E7\u00E3o na camada %d do cache compartilhado. O ID exclusivo de cache esperado \u00E9 %s, o ID exclusivo de cache atual \u00E9 %s.
SHRC853=Recursos do Processador \= %s
VRFY007=m\u00E9todo final substitu\u00EDdo
VRFY008=\u00EDndice de matriz n\u00E3o inteiro
VRFY009=matriz de tipo n\u00E3o compat\u00EDvel
SHRC761=Falha ao configurar a permiss\u00E3o de acesso do grupo conforme solicitado pela subp\u00E7\u00E3o 'groupAccess' no arquivo de captura instant\u00E2nea de cache compartilhada.
VRFY000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC762=Erro ao obter estat\u00EDsticas do arquivo de cache de classe compartilhada ao verificar a permiss\u00E3o de acesso de seu grupo.
VRFY001=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s
SHRC763=Todas as subop\u00E7\u00F5es de classes compartilhadas no total n\u00E3o devem ter mais que %u caracteres.
VRFY002=seq\u00FC\u00EAncia de bytecode inv\u00E1lida
SHRC764=N\u00E3o \u00E9 poss\u00EDvel criar mem\u00F3ria compartilhada com tamanho de %1$d bytes conforme solicitado \n \tAjustado para o m\u00E1ximo permitido de mem\u00F3ria compartilhada (%2$d bytes) \n \t(Para aumentar a mem\u00F3ria compartilhada dispon\u00EDvel, modifique o valor SHMMAX do sistema) \n \t Se -Xscdmx for usado, a \u00E1rea do atributo de depura\u00E7\u00E3o ser\u00E1 ajustada proporcionalmente \n \t de acordo com sua propor\u00E7\u00E3o original para o valor -Xscmx.
VRFY003=a classe n\u00E3o cont\u00E9m dados de pr\u00E9-verifica\u00E7\u00E3o
VRFY004=jsr em seq\u00FC\u00EAncia encontrou excessivos jsrs
VRFY005=tipo local n\u00E3o compat\u00EDvel
VRFY006=tamanho de nova matriz n\u00E3o inteiro
SHRC760=Falha ao configurar a permiss\u00E3o de acesso do grupo conforme solicitado pela subp\u00E7\u00E3o 'groupAccess' no arquivo de controle de mem\u00F3ria compartilhada associado ao cache de classe compartilhada.
SHRC769=A JVM ativou a prote\u00E7\u00E3o de p\u00E1gina parcial do cache compartilhado, j\u00E1 que o cache compartilhado existente foi criado com a prote\u00E7\u00E3o de p\u00E1gina parcial ativada.
SHRC765=A prote\u00E7\u00E3o da p\u00E1gina de mem\u00F3ria nos dados de tempo de execu\u00E7\u00E3o, os dados de leitura/grava\u00E7\u00E3o da sequ\u00EAncia e as p\u00E1ginas parcialmente preenchidas s\u00E3o ativas com sucesso
SHRC766=A prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria em dados de tempo de execu\u00E7\u00E3o e p\u00E1ginas parcialmente preenchidas \u00E9 ativada com \u00EAxito
SHRC767=A prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria em dados de tempo de execu\u00E7\u00E3o e dados de leitura/grava\u00E7\u00E3o de sequ\u00EAncia \u00E9 ativada com \u00EAxito
SHRC768=A prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria em dados de tempo de execu\u00E7\u00E3o foi ativada com \u00EAxito
VRFY018=pilha m\u00E1x. excedida
VRFY019=falha de carregamento de classe
VRFY010=v\u00E1rios jsrs utilizam um \u00FAnico retorno
SHRC750=Nenhum m\u00E9todo AOT corresponde \u00E0(s) especifica\u00E7\u00E3o(\u00F5es)
VRFY011=par\u00E2metro lookupswitch n\u00E3o inteiro
SHRC751=Falha ao analisar as especifica\u00E7\u00F5es de m\u00E9todo. N\u00E3o mais do que %d especifica\u00E7\u00F5es de m\u00E9todo s\u00E3o permitidas.
VRFY012=formato de pilha inconsistente
SHRC752=Falha ao analisar a(s) especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo
VRFY013=restri\u00E7\u00E3o de carregamento de classe violado
SHRC753=Falha para obter o mutex de grava\u00E7\u00E3o de cache
VRFY014=bytecode return incompat\u00EDvel com tipo de retorno
VRFY015=v\u00E1rios retornos para um \u00FAnico jsr
VRFY016=par\u00E2metro de bytecode shift n\u00E3o inteiro
VRFY017=<init> n\u00E3o chama este <init> ou super <init>
SHRC758=Falha ao configurar a permiss\u00E3o de acesso do grupo conforme solicitado pela subop\u00E7\u00E3o 'groupAccess' na mem\u00F3ria compartilhada com shmid\=%d associado ao cache de classe compartilhada.
SHRC759=Falha ao configurar a permiss\u00E3o de acesso do grupo conforme solicitado pela subp\u00E7\u00E3o 'groupAccess' no arquivo de controle de sem\u00E1foro associado ao cache de classe compartilhada.
SHRC754=A recrea\u00E7\u00E3o de arquivo de controle de mem\u00F3ria compartilhada n\u00E3o \u00E9 permitida
SHRC755=\t invalidatedaot Imprime apenas os tipos aot invalidados o cache compartilhado.
SHRC756=Falha ao configurar a permiss\u00E3o de acesso do grupo no arquivo de cache compartilhado conforme solicitado pela subop\u00E7\u00E3o 'groupAccess'.
VRFY020=argumentos de chamada de tipo n\u00E3o compat\u00EDvel
SHRC757=Falha ao configurar a permiss\u00E3o de acesso do grupo conforme solicitado pela subp\u00E7\u00E3o 'groupAccess' na configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d associado ao cache de classe compartilhada.
SHRC783=O espa\u00E7o m\u00E1ximo permitido para dados JIT n\u00E3o deve ser maior do que o limite de softmx de %u bytes configurado no uso de cache compartilhado.
SHRC300=O cache de classe compartilhado est\u00E1 em uso por uma outra vm, n\u00E3o poss\u00EDvel aumentar o cache aninhado
SHRC784=N\u00E3o \u00E9 poss\u00EDvel configurar o espa\u00E7o m\u00EDnimo reservado para dados AOT e/ou JIT conforme solicitado. O limite de softmx configurado no uso de cache compartilhado ou o tamanho total do cache n\u00E3o \u00E9 grande o suficiente.
SHRC301=N\u00E3o \u00E9 poss\u00EDvel aumentar o cache aninhado "%s", falha ao alocar o novo supercache para sugest\u00F5es
SHRC785=O m\u00EDnimo de bytes reservados de AOT est\u00E1 configurado como %d.
SHRC302=N\u00E3o \u00E9 poss\u00EDvel aumentar o cache aninhado "%s", falha ao alocar o bloco para sugest\u00F5es
SHRC786=O m\u00E1ximo permitido de bytes AOT est\u00E1 configurado como %d.
SHRC780=O tamanho de espa\u00E7o m\u00E1ximo de AOT n\u00E3o deve ser menor do que os bytes de AOT (%d) que j\u00E1 est\u00E3o armazenados no cache.
SHRC781=O espa\u00E7o m\u00E1ximo permitido de AOT n\u00E3o deve ser maior do que o limite de softmx de %u bytes configurado no uso de cache compartilhado.
SHRC782=O tamanho de espa\u00E7o m\u00E1ximo para dados JIT n\u00E3o deve ser menor do que os bytes JIT (%d) que j\u00E1 est\u00E3o armazenados no cache.
SHRC307=\tROMMETHOD\: %2$.*1$s Assinatura\: %4$.*3$s Endere\u00E7o\: 0x%5$p
SHRC308=Falha ao serializar o cache "%s". Falha ao atualizar os deslocamentos de Classe ROM em m\u00E9todos AOT.
SHRC309=As op\u00E7\u00F5es "grow" e "readonly" n\u00E3o podem ser usadas juntas.
SHRC303=Falha ao criar o cache aninhado "%s"
SHRC787=O m\u00EDnimo de bytes reservados de dados JIT est\u00E1 configurado como %d.
SHRC304=Falha ao substituir o cache "%s"
SHRC788=O m\u00E1ximo permitido de bytes de dados JIT est\u00E1 configurado como %d.
SHRC305=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a tabela de consulta de sugest\u00F5es em SH_ClasspathManagerImpl2
SHRC789=Os bytes de softmx est\u00E3o configurados como %u.
SHRC306=\ Assinatura\: %2$.*1$s Endere\u00E7o\: 0x%3$p
SHRC772=O limite de softmx para o uso de cache compartilhado "%s" foi atingido. Use a op\u00E7\u00E3o "%s" para aumentar o limite de softmx.
SHRC773=O espa\u00E7o para dados AOT no cache compartilhado "%s" est\u00E1 completo.
SHRC774=O espa\u00E7o para dados JIT no cache compartilhado "%s" est\u00E1 completo.
SHRC775=O limite de softmx configurado para o uso de cache compartilhado \u00E9 maior que o tamanho total do cache de %u bytes. Ele ser\u00E1 configurado com o mesmo tamanho total do cache.
SHRC770=A JVM foi desativada protegendo p\u00E1ginas parcialmente preenchidas. Se '-Xshareclasses\:mprotect\=onfind' for especificado, ele tamb\u00E9m ser\u00E1 ignorado.
SHRC771=Ative a prote\u00E7\u00E3o de mem\u00F3ria de p\u00E1ginas parcialmente preenchidas. No z/OS, \u00E9 equivalente a 'partialpagesonstartup'.
SHRC776=O limite de softmx para uso de cache compartilhado \u00E9 menor do que o n\u00FAmero de bytes %u no cache compartilhado j\u00E1 em uso.
SHRC777=O limite de softmx para o uso de cache compartilhado \u00E9 menor do que o valor m\u00EDnimo fact\u00EDvel de %u bytes.
SHRC778=O espa\u00E7o m\u00EDnimo reservado de AOT n\u00E3o deve ser maior do que o espa\u00E7o m\u00E1ximo permitido de AOT.
SHRC779=O espa\u00E7o m\u00EDnimo reservado para dados JIT n\u00E3o deve ser maior do que o espa\u00E7o m\u00E1ximo permitido para dados JIT.
SHRC321=Recupera\u00E7\u00E3o de erro\: fechando sem\u00E1foros de mem\u00F3ria compartilhada.
SHRC322=Falha ao inicializar sem\u00E1foros para o cache de classe compartilhado. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC323=ERRO\: Falha ao inserir o mutex para o cabe\u00E7alho do cache de classe compartilhada. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC324=ERRO\: Falha ao sair do mutex para o cabe\u00E7alho do cache de classe compartilhada. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC320=Recupera\u00E7\u00E3o de erro\: destruindo sem\u00E1foros de mem\u00F3ria compartilhada.
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex falhou ao adquirir o mutex de tabela da sequ\u00EAncia (c\u00F3digo de retorno %d).
SHRC325=Falha ao postar o cabe\u00E7alho do cache de classes compartilhado, o bloqueio falhou durante a inicializa\u00E7\u00E3o. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC326=Falha ao postar o usu\u00E1rio do cache de classes compartilhado, o bloqueio falhou durante a inicializa\u00E7\u00E3o. Aviso\: seu cache pode estar danificado. Se voc\u00EA encontrar problemas ao usar o cache compartilhado, poder\u00E1 ser necess\u00E1rio destru\u00ED-lo e recri\u00E1-lo.
SHRC327=A chamada de SH_OSCachesysv\:\:acquireWriteLock() para j9shsem_wait falhou com o erro %d.
SHRC328=O IPC do System V relatou o seguinte erro '%s'
VERB032=espa\u00E7o m\u00EDnimo de cache de classe compartilhado reservado para dados JIT
SHRC310=O cache persistente n\u00E3o pode estar localizado em um sistema de arquivos de rede. Selecione um cacheDir diferente.
SHRC794=Ajuste o espa\u00E7o m\u00E1ximo permitido de cache de classes compartilhado para dados JIT para <size>.
VERB033=espa\u00E7o m\u00E1ximo de cache de classe compartilhado reservado para dados JIT
SHRC311=Erro ao liberar o bloqueio de grava\u00E7\u00E3o de conex\u00E3o do arquivo de cache de classe compartilhado
SHRC795=A soma do m\u00EDnimo reservado de bytes AOT %d e m\u00EDnimo reservado de bytes de dados JIT %d n\u00E3o deve ser maior do que os bytes de softmx %d.
VERB034=tamanho de p\u00E1gina grande para cache de c\u00F3digo JIT
SHRC312=Erro ao liberar o bloqueio de grava\u00E7\u00E3o de cabe\u00E7alho do arquivo de cache de classe compartilhado
SHRC796=O espa\u00E7o m\u00EDnimo reservado de AOT n\u00E3o deve ser maior do que o limite de softmx de %d configurado no uso de cache compartilhado.
VERB035=tamanhos de p\u00E1ginas grandes dispon\u00EDveis para cache de c\u00F3digo JIT\:
SHRC313=Falha ao criar jclCacheMutex em shrinit
SHRC797=O espa\u00E7o m\u00EDnimo reservado para dados JIT n\u00E3o deve ser maior do que o limite de softmx de %d configurado no uso de cache compartilhado.
VERB036=tamanho inicial dos metadados de refer\u00EAncias compactados
SHRC790=Ajuste o tamanho de softmx no cache para <size>.
VERB037=tamanho do cache de classe compartilhado
SHRC791=Ajuste o espa\u00E7o m\u00EDnimo reservado de cache de classes compartilhado para dados AOT para <size>.
VERB038=tamanho m\u00E1ximo de cache soft de classe compartilhada
SHRC792=Ajuste o espa\u00E7o m\u00E1ximo permitido de cache de classes compartilhado para dados AOT para <size>.
SHRC793=Ajuste o espa\u00E7o m\u00EDnimo reservado de cache de classes compartilhado para dados JIT para <size>.
SHRC318=Recupera\u00E7\u00E3o de erro\: destruindo a mem\u00F3ria compartilhada.
SHRC319=Recupera\u00E7\u00E3o de erro\: fechando a mem\u00F3ria compartilhada.
SHRC314=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a tabela de consulta de sugest\u00F5es em SH_Manager
SHRC798=O espa\u00E7o m\u00E1ximo permitido de AOT n\u00E3o deve ser maior do que o limite de softmx de %d configurado no uso de cache compartilhado.
SHRC315=N\u00E3o \u00E9 poss\u00EDvel inicializar segmentos de mem\u00F3ria de classe cachelet
SHRC799=O espa\u00E7o m\u00E1ximo permitido para dados JIT n\u00E3o deve ser maior do que o limite de softmx de %d configurado no uso de cache compartilhado.
VERB030=espa\u00E7o m\u00E1ximo de cache de classe compartilhado reservado para JIT
SHRC316=N\u00E3o \u00E9 poss\u00EDvel serializar o cache porque n\u00E3o h\u00E1 nenhum encadeamento de VM atual.
VERB031=espa\u00E7o de cache de classe compartilhado reservado para atributos de depura\u00E7\u00E3o de classe
SHRC317=Imprima o nome do arquivo de cache de classe compartilhado que ser\u00E1 usado.
VRFY029=returnAddress inv\u00E1lido para instru\u00E7\u00E3o ret
VRFY021=emitido objeto que n\u00E3o pode ser emitido
SHRC343=A classe %1$s foi localizada no cache compartilhado para o ID de carregador de classes %2$d com URL %4$.*3$s.
VRFY022=as sub-rotinas devem ser percorridas novamente para cada jsr
SHRC344=Falha ao localizar a classe %1$s no cache compartilhado para o ID de carregador de classes %2$d com URL %4$.*3$s.
VRFY023=par\u00E2metro tableswitch n\u00E3o inteiro
SHRC345=A classe %1$s foi localizada no cache compartilhado para o ID de carregador de classes %2$d com Token %4$.*3$s.
VRFY024=os argumentos n\u00E3o s\u00E3o de tipo compat\u00EDvel
SHRC346=Falha ao localizar a classe %1$s no cache compartilhado para o ID de carregador de classes %2$d com Token %4$.*3$s.
VRFY025=acesso inv\u00E1lido a dados protegidos
VRFY026=EOF inesperado
SHRC340=A verifica\u00E7\u00E3o de CRC de Cache Compartilhado falhou. CRC armazenado %1$x, CRC calculado %2$x
VRFY027=o receptor \u00E9 incompat\u00EDvel com classe de declara\u00E7\u00E3o
SHRC341=A classe %1$s foi localizada no cache compartilhado para o ID de carregador de classes %2$d.
VRFY028=dimens\u00E3o inv\u00E1lida
SHRC342=Falha ao localizar a classe %1$s no cache compartilhado para o ID de carregador de classes %2$d.
SHRC347=A classe %2$.*1$s foi armazenada no cache compartilhado para o ID de carregador de classes %3$d com URL %5$.*4$s (\u00EDndice %6$d).
SHRC348=Falha ao armazenar a classe %2$.*1$s no cache compartilhado para o ID de carregador de classes %3$d com URL %5$.*4$s (\u00EDndice %6$d).
VRFY030=tipo inv\u00E1lido na pilha
SHRC349=A classe %2$.*1$s foi armazenada no cache compartilhado para o ID de carregador de classes %3$d com URL %5$.*4$s.
VRFY031=tentativa para iinc n\u00E3o inteiro
J2SE000=\n
VRFY032=receptor inv\u00E1lido para <init>
SHRC332=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria de dados ativada com \u00EAxito para o cache
VRFY033=campo de tipo n\u00E3o compat\u00EDvel
SHRC333=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria padr\u00E3o ativada com \u00EAxito para o cache
VRFY034=PC de destino inv\u00E1lido
SHRC334=Falha na recupera\u00E7\u00E3o de erro\: A destrui\u00E7\u00E3o da mem\u00F3ria compartilhada falhou.
VRFY035=sem erro
SHRC335=Falha na recupera\u00E7\u00E3o de erro\: A destrui\u00E7\u00E3o do sem\u00E1foro compartilhado falhou.
VRFY036=underflow de pilha
VRFY037=objeto n\u00E3o inicializado durante ramifica\u00E7\u00E3o de retrocesso
VRFY038=invokespecial em destino inv\u00E1lido
SHRC330=SH_CompositeCacheImpl\:\:runExitCode falhou ao adquirir o mutex de \u00E1rea de grava\u00E7\u00E3o (c\u00F3digo de retorno %d).
VRFY039=bytecode desconhecido
SHRC331=Adquirido um sem\u00E1foro diferente daquele usado anteriormente com este cache.
SHRC336=C\u00F3digo de erro de camada da porta \= %1$d
VRFY040=verificador n\u00E3o conseguiu alocar mem\u00F3ria nativa
SHRC337=Mensagem de erro de plataforma\: %1$s
SHRC338=C\u00F3digo de erro de camada da porta \= %1$d
VRFY041=invokespecial de inicializador errado
VRFY042=%1$s; classe\=%3$.*2$s, m\u00E9todo\=%5$.*4$s%7$.*6$s, pc\=%8$u; Incompatibilidade de tipos, o argumento %9$d na assinatura %11$.*10$s.%13$.*12$s\:%15$.*14$s n\u00E3o corresponde
SHRC339=Mensagem de erro de plataforma\: %1$s
VERB007=tamanho da pilha de encadeamento do sistema operacional
VERB008=tamanho inicial da pilha de encadeamento java
VERB009=incremento da pilha de encadeamento java
SHRC360=Falha ao localizar os dados de bytes para a chave %.*s no cache compartilhado...
SHRC365=Ativa o armazenamento de informa\u00E7\u00F5es sobre depura\u00E7\u00E3o de classe na classe compartilhada.
EXEL109=\  -XX\:ShareClassesEnableBCI   criar o cache de classe compartilhada com suporte para instrumenta\u00E7\u00E3o de bytecode
SHRC366=depura\u00E7\u00E3o ativada  \= true
VERB000=Pilha detalhada\: "%2$.*1$s" utilizou %3$zd/%4$zd bytes em pilhas Java/C
SHRC367=depura\u00E7\u00E3o ativada  \= false
VERB001=
SHRC368=Encerrando o cache de classes compartilhado sem depura\u00E7\u00E3o ativada.
VERB002=Pilha detalhada\: a utiliza\u00E7\u00E3o m\u00E1xima da pilha foi de %1$zd/%2$zd bytes em pilhas Java/C
SHRC361=Erro ao conectar-se \u00E0 mem\u00F3ria compartilhada durante abertura/cria\u00E7\u00E3o
VERB003=Erro\: o n\u00FAmero de arquivos -Xverbosegclog deve ser maior que 0
SHRC362=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para ClasspathItem
VERB004=Erro\: o n\u00FAmero de ciclos -Xverbosegclog deve ser maior que 0
SHRC363=N\u00E3o \u00E9 poss\u00EDvel alocar api para classes compartilhadas em shrinit
VERB005=Erro\: est\u00E1 faltando o nome do arquivo -Xverbosegclog
SHRC364=A chamada de SH_OSCachesysv\:\:acquireWriteLock() para j9shsem_wait em semid %d falhou com o erro %d.
VERB006=Falha em inicializar
EXEL112=\  -Xscsoftmx<x>   configurar o tamanho m\u00E1ximo flex\u00EDvel do novo cache de classe compartilhada para <x>
EXEL113=\  -Xscmx<x>       tamanho de configura\u00E7\u00E3o (ou tamanho m\u00E1ximo aproximado se a op\u00E7\u00E3o -XX\:SharedCacheHardLimit\= estiver presente) do novo cache de classe compartilhada para <x>
EXEL114=\  -XX\:SharedCacheHardLimit\=<x>   tamanho de configura\u00E7\u00E3o do novo cache de classe compartilhada para <x>
EXEL115=\  -XX\:+ShareAnonymousClasses - ativar o armazenamento e a localiza\u00E7\u00E3o de classes an\u00F4nimas no cache de classe compartilhada
SHRC369=-Xnolinenumbers    \= true
EXEL116=\  -XX\:-ShareAnonymousClasses desativar o armazenamento e a localiza\u00E7\u00E3o de classes an\u00F4nimas no cache de classe compartilhada
EXEL117=\  -XX\:+ShareUnsafeClasses - ativar o armazenamento e a localiza\u00E7\u00E3o de classes n\u00E3o seguras e n\u00E3o an\u00F4nimas no cache de classe compartilhada
EXEL118=\  -XX\:-ShareUnsafeClasses - desativar o armazenamento e a localiza\u00E7\u00E3o de classes n\u00E3o seguras e n\u00E3o an\u00F4nimas no cache de classe compartilhada
EXEL119=\  -XX\:+UseGCStartupHints - ativar o armazenamento e a localiza\u00E7\u00E3o de sugest\u00F5es de inicializa\u00E7\u00E3o do GC no cache da classe compartilhada
EXEL110=\  -XX\:ShareClassesDisableBCI   criar o cache de classe compartilhada sem suporte para instrumenta\u00E7\u00E3o de bytecode
EXEL111=\  -XX\:+StoreIntermediateClassfile   armazenar dados de classe n\u00E3o-processados a serem usados durante a re-transforma\u00E7\u00E3o
SHRC354=Falha ao localizar o c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado.
SHRC355=O c\u00F3digo AOT para ROMMethod 0x%1$p foi armazenado no cache compartilhado.
SHRC356=Falha ao armazenar o c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado.
SHRC357=Os dados de bytes para a chave %.*s foram armazenados no cache compartilhado.
SHRC350=Falha ao armazenar a classe %2$.*1$s no cache compartilhado para o ID de carregador de classes %3$d com URL %5$.*4$s.
SHRC351=A classe %2$.*1$s foi armazenada no cache compartilhado para o ID de carregador de classes %3$d com Token %5$.*4$s.
SHRC352=Falha ao armazenar a classe %2$.*1$s no cache compartilhado para o ID de carregador de classes %3$d com Token %5$.*4$s.
SHRC353=O c\u00F3digo AOT para ROMMethod 0x%1$p foi localizado no cache compartilhado.
EXEL101=\n  -Xhealthcenter  ativa o agente Health Center
EXEL102=
EXEL103=\  -Xscdmx<x>      configurar o tamanho da \u00E1rea do atributo de depura\u00E7\u00E3o do cache de classe compartilhado para <x>
EXEL104=\  -Xscminjit<x>   configurar o espa\u00E7o m\u00EDnimo de cache de classes compartilhado reservado para os dados de JIT para <x>
SHRC358=Falha ao armazenar os dados de bytes para a chave %.*s no cache compartilhado.
EXEL105=\  -Xscmaxjit<x>   configurar o espa\u00E7o m\u00E1ximo do cache de classes compartilhado permitido para os dados de JIT para <x>
SHRC359=Dados de bytes para a chave %.*s localizados no cache compartilhado...
EXEL106=\  -Xscminjitdata<x>   configurar o espa\u00E7o m\u00EDnimo de cache de classes compartilhado reservado para os dados JIT para <x>
EXEL107=\  -Xscmaxjitdata<x>   configurar o espa\u00E7o m\u00E1ximo do cache de classes compartilhado permitido para os dados JIT para <x>
EXEL108=\  -Xzero\:nosharebootzip   n\u00E3o compartilhar caches de entrada do JAR de inicializa\u00E7\u00E3o no cache de classe compartilhada
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj ativar realtime tempor\u00E1rio
VERB029=espa\u00E7o m\u00EDnimo de cache de classe compartilhado reservado para JIT
SHRC380=\u00C1rea de depura\u00E7\u00E3o da classe %% usada             %*c\= %u%%
SHRC381=Bytes da classe LineNumberTable        %*c\= %u
SHRC382=Bytes da \u00E1rea de depura\u00E7\u00E3o da classe LocalVariableTable %*c\= %u\n
VERB021=Entrada de caminho de classe inv\u00E1lida\: %s (tipo de arquivo n\u00E3o suportado)
SHRC387=bytes livres %*c\= %d
VERB022=Entrada de caminho de classe inv\u00E1lida\: %s (tipo de arquivo desconhecido)
SHRC388=bytes de ROMClass %*c\= %d
VERB023=Entrada de caminho de classe inv\u00E1lida\: %s (erro desconhecido)
SHRC389=Bytes de metadados %*c\= %d
VERB024=Entrada de caminho de classe inv\u00E1lida\: %s (jxe n\u00E3o cont\u00E9m rom.classes)
VERB025=Entrada de caminho de classe inv\u00E1lida\: %s (cabe\u00E7alho de imagem de jxe corrompida)
SHRC383=\n endere\u00E7o de base %*c\= 0x%p
VERB026=Entrada de caminho de classe inv\u00E1lida\: %s (jxe endian oposto n\u00E3o suportado)
SHRC384=endere\u00E7o final %*c\= 0x%p
VERB027=Pilha detalhada\: O encadeamento em execu\u00E7\u00E3o "%2$.*1$s" est\u00E1 usando %3$zd/%4$zd bytes nas pilhas Java/C
SHRC385=ponteiro de aloca\u00E7\u00E3o %*c\= 0x%p\n
VERB028=Pilha detalhada\: Imposs\u00EDvel imprimir a informa\u00E7\u00E3o de pilha dos encadeamentos atualmente em execu\u00E7\u00E3o
SHRC386=tamanho do cache %*c\= %d
VERB020=Entrada de caminho de classe inv\u00E1lida\: %s (arquivo corrompido)
VERB018=Entrada de caminho de classe inv\u00E1lida\: %s (falha de E/S do arquivo)
VERB019=Entrada de caminho de classe inv\u00E1lida\: %s (falha na leitura do arquivo)
SHRC370=-Xnolinenumbers    \= false
SHRC371=Bytes do cache de Zip \= %d
VERB010=tamanho m\u00E1ximo da pilha de encadeamento java
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC377=O valor do -Xscdmx de %u bytes \u00E9 maior que %u bytes de espa\u00E7o livre dispon\u00EDvel. Um valor de %u bytes ser\u00E1 usado para o -Xscdmx.
VERB011=tamanho da pilha de encadeamento java
VERB012=incremento do segmento de classe RAM
SHRC378=\n Op\u00E7\u00F5es de linha de comandos relacionadas\:\n
VERB013=incremento do segmento de classe ROM
SHRC379=Tamanho da \u00E1rea de depura\u00E7\u00E3o da classe               %*c\= %u
VERB014=m\u00E1ximo de mem\u00F3ria
SHRC372=\# caches do Zip    \= %d
VERB015=tamanho do cache de classe compartilhado
SHRC373=Bytes de dados JIT \= %d
SHRC374=Cache criado com\:
VERB016=espa\u00E7o m\u00EDn. reservado do cache compartilhado para AOT
SHRC375=O nome do cache fica muito longo quando o nome de usu\u00E1rio \u00E9 inclu\u00EDdo. H\u00E1 %d bytes restantes nesse buffer e seu nome de usu\u00E1rio cont\u00E9m %d bytes.
VERB017=espa\u00E7o m\u00E1x. reservado do cache compartilhado para AOT
EXEL120=\  -XX\:-UseGCStartupHints - desativar o armazenamento e a localiza\u00E7\u00E3o de sugest\u00F5es de inicializa\u00E7\u00E3o do GC no cache da classe compartilhada
EXEL121=\  -XX\:+PortableSharedCache - ativar o recurso que tenta maximizar a portabilidade do cache compartilhado entre m\u00E1quinas
EXEL122=\  -XX\:-PortableShareCache  - desativar o recurso que tenta maximizar a portabilidade do cache compartilhado entre m\u00E1quinas
SHRC390=%% metadados usados %*c\= %d%%
SHRC391=\# ROMClasses %*c\= %d
SHRC392=\# Classpaths %*c\= %d
SHRC393=\# URLs %*c\= %d
SHRC398=\# M\u00E9todos de AOT %*c\= %d
SHRC399=Bytes de dados %*c\= %d
SHRC394=\# Tokens %*c\= %d
SHRC395=\# Classes antigas %*c\= %d
SHRC396=%% Classes antigas %*c\= %d%%\n
SHRC397=Bytes de AOT %*c\= %d
CFRE100=foram solicitadas excessivas dimens\u00F5es no bytecode multianewarray
CFRE101=deslocamento fora do intervalo no bytecode switch
CFRE102=assinatura de campo inv\u00E1lida
CFRE103=o m\u00E9todo abstrato n\u00E3o pode ser privado, est\u00E1tico, final, nativo, sincronizado ou restrito
CFRE104=o campo pode ser no m\u00E1ximo um entre p\u00FAblico privado ou protegido
CFRE110=constante incompat\u00EDvel para campo
CFRE111=UTF8 malformado
CFRE112=o VM n\u00E3o suporta verifica\u00E7\u00E3o din\u00E2mica
CFRE113=EOF inesperado
CFRE114=o nome de campo \u00E9 inv\u00E1lido
CFRE115=dimens\u00F5es da matriz > 255
CFRE105=superClass deve ser uma classe
CFRE106=m\u00E9todo duplicado
CFRE107=deslocamento fora do intervalo no bytecode jump
CFRE108=o \u00EDndice de m\u00E9todo do m\u00E9todo de inclus\u00E3o deve referir-se a um nome e tipo
CFRE109=assinatura de m\u00E9todo inv\u00E1lida
CFRE141=method_info tem mais que um atributo RuntimeInvisibleParameterAnnotations ou RuntimeVisibleParameterAnnotations
CFRE142=A classe tem mais que um atributo RuntimeInvisibleAnnotations ou RuntimeVisibleAnnotations
CFRE143=Diversos atributos de aninhamento
CFRE144=O membro do host de aninhamento do atributo de aninhamento deve ser uma classe constante
CFRE145=O host de aninhamento deve ser uma classe constante
CFRE146=O m\u00E9todo <clinit> n\u00E3o \u00E9 est\u00E1tico
CFRE147=O m\u00E9todo <clinit> possui uma assinatura inv\u00E1lida
CFRE148=A interface n\u00E3o pode possuir um m\u00E9todo com o nome <init>
CFRE140=method_info tem mais que um atributo AnnotationDefault
CFRE138=O atributo Classfile refere-se a uma entrada do conjunto de constantes n\u00E3o existente
CFRE139=A classe tem mais que um atributo SourceDebugExtension
CFRE152=module-info n\u00E3o \u00E9 uma classe porque access_flag ACC_MODULE est\u00E1 configurado
CFRE153=A entrada do conjunto constante n\u00E3o \u00E9 v\u00E1lida nos arquivos de classe com vers\u00F5es < 55.0
CFRE154=Os bytecodes ldc e ldc_2 devem fazer refer\u00EAncia a uma constante ou um Constant_Dynamic
CFRE155=O bytecode ldc2_w deve fazer refer\u00EAncia a uma constante ou um Constant_Dynamic
CFRE156=As entradas Constant_Dynamic referenciadas pelos bytecodes ldc e ldc_w n\u00E3o devem retornar 'long' ou 'double'
CFRE157=As entradas Constant_Dynamic referenciadas pelo bytecode ldc2_w devem retornar 'long' ou 'double'
CFRE158=A entrada do conjunto da constante n\u00E3o \u00E9 v\u00E1lida nos arquivos de classe com vers\u00F5es < 49.0
CFRE159=A entrada do conjunto da constante n\u00E3o \u00E9 v\u00E1lida nos arquivos de classe com vers\u00F5es < 51.0
CFRE150=Tag constante 20 desconhecida no arquivo de classe
CFRE151=A entrada do conjunto constante n\u00E3o \u00E9 v\u00E1lida nos arquivos de classe com vers\u00F5es < 53.0
CFRE149=Tag constante 19 desconhecida no arquivo de classe
CFRE120=Os c\u00F3digos de opera\u00E7\u00E3o jsr e jsr_w n\u00E3o s\u00E3o v\u00E1lidos nos arquivos de classe com vers\u00F5es >\= 51.0
CFRE121=nome de campo ilegal
CFRE122=a classe pode ser no m\u00E1ximo uma destas\: p\u00FAblica ou m\u00F3dulo
CFRE123=As constantes de MethodHandle devem se referir a um campo ou refer\u00EAncia de m\u00E9todo
CFRE124=a tag do valor de elemento da anota\u00E7\u00E3o \u00E9 inv\u00E1lida
CFRE125=invokedynamic bytecode deve referenciar uma entrada de conjunto de constantes InvokeDynamic
CFRE126=o bytecode invokeinterface reservou o slots diferente de zero
CFRE116=o bytecode invoke deve referenciar um Methodref
CFRE117=o campo n\u00E3o pode ser final e vol\u00E1til
CFRE118=bytes extras ap\u00F3s EOF
CFRE119=atributos SourceFile m\u00FAltiplos
CFRE130=v\u00E1rios atributos BootstrapMethods
CFRE131=o atributo BootstrapMethods requerido por invokedynamic est\u00E1 ausente ou \u00E9 muito pequeno
CFRE132=type_annotation target_type n\u00E3o reconhecido
CFRE133=O m\u00E9todo possui dois atributos MethodParameters
CFRE134=O par\u00E2metro de m\u00E9todo possui uma sinaliza\u00E7\u00E3o inv\u00E1lida.
CFRE135=O nome do par\u00E2metro de m\u00E9todo n\u00E3o \u00E9 UTF8
CFRE136=modificadores ilegais para o m\u00E9todo de interface
CFRE137=A classe possui mais de um atributo RuntimeVisibleTypeAnnotations ou RuntimeInvisibleTypeAnnotations
CFRE127=o \u00EDndice do m\u00E9todo de autoinicializa\u00E7\u00E3o deve se referir a uma entrada do conjunto de constantes MethodHandle
CFRE128=assinatura de m\u00E9todo inv\u00E1lida
CFRE129=Os c\u00F3digos de opera\u00E7\u00E3o constant e entry_w n\u00E3o s\u00E3o v\u00E1lidos nos arquivos de classe com vers\u00F5es <\= 51.0
CFRE163=O arquivo de classe \u00E9 uma vers\u00E3o de visualiza\u00E7\u00E3o, mas tem a vers\u00E3o principal incorreta ou a visualiza\u00E7\u00E3o n\u00E3o est\u00E1 ativada.
CFRE164=O \u00EDndice em LocalVariableTable est\u00E1 fora do intervalo
CFRE165=O \u00EDndice em LocalVariableTypeTable est\u00E1 fora do intervalo
CFRE166=Entradas duplicadas no LocalVariableTypeTable n\u00E3o s\u00E3o permitidas
CFRE167=v\u00E1rios atributos Record
CFRE168=As classes Record n\u00E3o podem ser abstratas
CFRE169=O nome de Record deve ser uma sequ\u00EAncia de caracteres
CFRE160=A entrada do conjunto constante n\u00E3o \u00E9 v\u00E1lida nos arquivos de classe com vers\u00F5es < 55.0
CFRE161=Os argumentos de BootstrapMethod (%1$d) cont\u00EAm uma entrada constantpool inv\u00E1lida no \u00EDndice (\#%2$u) do tipo (%3$u); class\=%5$.*4$s, offset\=%6$u
CFRE162=Os tipos de valor s\u00E3o ativados somente com a op\u00E7\u00E3o -XX\:+EnableValhalla
SHRC703=Falha ao abrir o arquivo da captura instant\u00E2nea do cache compartilhado "%s"
SHRC704=C\u00F3digo de erro de camada da porta \= %1$d
SHRC705=Mensagem de erro de plataforma\: %1$s
SHRC706=Falha ao adquirir o bloqueio do arquivo no arquivo da captura instant\u00E2nea do cache compartilhado
SHRC700=A captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s" foi criada
SHRC701=Falha ao criar uma captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s"
SHRC702=Falha ao obter um diret\u00F3rio para a captura instant\u00E2nea do cache compartilhado
SHRC707=Falha ao adquirir o mutex do cache "%s"
SHRC708=Falha ao truncar o arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente existente "%s"
SHRC709=A JVM est\u00E1 criando uma captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s", mas um arquivo da captura instant\u00E2nea "%s" j\u00E1 existe e ser\u00E1 sobrescrito
CFRE174=m\u00FAltiplos atributos PermittedSubclasses
CFRE175=classes finais n\u00E3o podem ser seladas
CFRE176=O nome de permittedSubclasses deve ser uma sequ\u00EAncia
CFRE177=A entrada de classe permittedSubclasses n\u00E3o \u00E9 um tipo de classe
CFRE178=As classes seladas devem ter pelo menos uma subclasse permitida
CFRE170=O nome RecordComponent deve ser uma sequ\u00EAncia de caracteres
CFRE171=O descritor de RecordComponent deve ser uma sequ\u00EAncia de caracteres
CFRE172=Record \u00E9 implicitamente final
CFRE173=A entrada LocalVariableTypeTable n\u00E3o corresponde a nenhuma entrada LocalVariableTable
SHRC720=A recria\u00E7\u00E3o do arquivo de controle de mem\u00F3ria compartilhada n\u00E3o \u00E9 permitida ao criar uma captura instant\u00E2nea do cache
SHRC725=O comprimento do arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s" \u00E9 inv\u00E1lido. O comprimento do arquivo \u00E9 de %lld bytes. Um arquivo da captura instant\u00E2nea v\u00E1lido \u00E9 de pelo menos %d bytes e no m\u00E1ximo %lld bytes.
SHRC726=O cache compartilhado n\u00E3o persistente "%s" j\u00E1 existe. Ele n\u00E3o pode ser restaurado a partir da captura instant\u00E2nea.
SHRC727=Ocorreu um erro ao criar o novo cache compartilhado n\u00E3o persistente
SHRC728=Falha ao ler o arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s"
SHRC721=A JVM n\u00E3o est\u00E1 configurada para acessar o arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s". Para abrir o arquivo, use a subop\u00E7\u00E3o 'groupAccess'.
SHRC722=A JVM n\u00E3o permite acesso ao arquivo da captura instant\u00E2nea do cache compartilhado "%s" porque o ID do usu\u00E1rio e o ID do grupo do processo da JVM s\u00E3o diferentes do ID do usu\u00E1rio e do ID do grupo do propriet\u00E1rio do arquivo da captura instant\u00E2nea do cache compartilhado e o ID do usu\u00E1rio do processo da JVM n\u00E3o pertence ao grupo do propriet\u00E1rio do arquivo da captura instant\u00E2nea do cache compartilhado.
SHRC723=A JVM n\u00E3o p\u00F4de verificar as permiss\u00F5es do arquivo da captura instant\u00E2nea do cache compartilhado "%s"
SHRC724=O arquivo da captura instant\u00E2nea do cache compartilhado "%s" n\u00E3o existe
SHRC729=A captura instant\u00E2nea foi criada por uma constru\u00E7\u00E3o JVM diferente e n\u00E3o corresponde \u00E0 JVM em execu\u00E7\u00E3o
SHRC714=Nenhuma captura instant\u00E2nea do cache compartilhado dispon\u00EDvel
SHRC715=Gera\u00E7\u00E3o mais antiga da captura instant\u00E2nea do cache compartilhado removida "%s"
SHRC716=Falha ao remover a gera\u00E7\u00E3o mais antiga da captura instant\u00E2nea do cache compartilhado "%s"
SHRC717=Falha ao remover a gera\u00E7\u00E3o atual da captura instant\u00E2nea do cache compartilhado "%s"
SHRC710=Falha ao gravar no arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s"
SHRC711=Falha ao reposicionar a compensa\u00E7\u00E3o do descritor do arquivo no arquivo da captura instant\u00E2nea do cache compartilhado n\u00E3o persistente "%s"
SHRC712=Tentando destruir todas as capturas instant\u00E2neas do cache compartilhado no cacheDir "%s"
SHRC713=Falha ao obter o comprimento do arquivo da captura instant\u00E2nea do cache compartilhado "%s"
SHRC718=A captura instant\u00E2nea do cache compartilhado n\u00E3o existe
SHRC719=A captura instant\u00E2nea do cache compartilhado "%s" foi destru\u00EDda
SHRC740=Uso\: %s{<method_specification>[,<method_specification>]}
SHRC741=O formato de <method_specification> \u00E9 [\!]{*|[*]<packagename/classname>[*]}[.{*|[*]<methodname>[*]}[({*|[*]<parameters>[*]})]], por exemplo\:\n\n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC742=IMPORTANTE\: \u00C9 poss\u00EDvel analisar v\u00E1rias especifica\u00E7\u00F5es de m\u00E9todo separadas por v\u00EDrgula. Em que um valor da op\u00E7\u00E3o cont\u00E9m v\u00EDrgula(s), ele deve estar entre chaves. \n\tVoc\u00EA pode precisar colocar as op\u00E7\u00F5es entre aspas para evitar que o shell intercepte e fragmente as linhas de comando separadas por v\u00EDrgula, ou seja\: \n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" ou\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC747=Falha ao invalidar o(s) m\u00E9todo(s) AOT
SHRC748=Falha ao revalidar o(s) m\u00E9todo(s) AOT
SHRC749=Falha ao localizar o(s) m\u00E9todo(s) AOT
SHRC743=Especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo inv\u00E1lida(s) para a op\u00E7\u00E3o "%s"
SHRC744=M\u00E9todo (s) %d AOT invalidado(s)
SHRC745=M\u00E9todo(s) %d AOT revalidado(s)
SHRC746=M\u00E9todo(s) %d AOT localizado(s)
SHRC730=A JVM criou o cache compartilhado com a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths'. Chamadas de JVM subsequente n\u00E3o poder\u00E3o armazenar caminhos de classe no cache compartilhado
SHRC731=A JVM ignorou a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths' j\u00E1 que o cache compartilhado existente foi criado sem a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths'
SHRC736=Invalide o(s) m\u00E9todo(s) AOT correspondente(s) \u00E0(s) especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo.
SHRC737=Revalide o(s) m\u00E9todo(s) AOT correspondente(s) \u00E0(s) especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo.
SHRC738=Imprima o(s) m\u00E9todo(s) AOT correspondente(s) \u00E0(s) especifica\u00E7\u00E3o(\u00F5es) de m\u00E9todo.\n\t<method_specification> \u00E9 definido como\: [\!]{*|[*]<packagename/classname>[*]}[.{*|[*]<methodname>[*]}[({*|[*]<parameters>[*]})]].
SHRC739=INVALIDADO
SHRC732=A JVM pode armazenar caminhos de classe no cache compartilhado criado com a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths'
SHRC733=A JVM n\u00E3o pode armazenar caminhos de classe no cache compartilhado j\u00E1 que o cache foi criado com a op\u00E7\u00E3o '-Xshareclasses\:restrictClasspaths'
SHRC734=Imprima o nome do arquivo da captura instant\u00E2nea de classe compartilhada que ser\u00E1 usado.
SHRC735=Use uma JVM %d-bit para executar a opera\u00E7\u00E3o solicitada no cache compartilhado %d-bit "%s" j\u00E1 que a JVM %d-bit n\u00E3o pode verificar se a mem\u00F3ria compartilhada foi criada pela JVM
SHRC640=A JVM est\u00E1 usando o cache de classe compartilhada existente no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic), mas o cache n\u00E3o estava criando nesse modo. Usar o cache nesse modo pode afetar o desempenho.
SHRC641=A JVM est\u00E1 tentando usar o cache de classe compartilhada existente no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic), mas o cache n\u00E3o estava criando nesse modo. Nesse caso, a op\u00E7\u00E3o mprotect\=diagnostic ser\u00E1 ignorada no z/OS.
SHRC642=A JVM criou o cache de classe compartilhada no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic). Usar o cache nesse modo pode afetar o desempenho.
SHRC643=A JVM foi conectada ao cache de classe compartilhada criado no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic). Usar o cache nesse modo pode afetar o desempenho.
SHRC648=A JVM n\u00E3o est\u00E1 configurada para acessar o conjunto de sem\u00E1foros associado ao cache de classe compartilhada n\u00E3o persistente existente. Para se conectar ao cache de classe compartilhada n\u00E3o persistente, use a subop\u00E7\u00E3o 'groupAccess'.
SHRC649=A JVM n\u00E3o permite acesso ao conjunto de sem\u00E1foros do cache compartilhado criado e pertencente a outro usu\u00E1rio que n\u00E3o est\u00E1 em seu grupo.
J9CL030=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para dado nativo do arrendat\u00E1rio
J9CL031=N\u00E3o foi poss\u00EDvel registrar dbgwrapper.dll como a biblioteca de autoinicializa\u00E7\u00E3o. C\u00F3digo de erro \= %zu
J9CL032=%1$d\: Falha ao recuperar Informa\u00E7\u00F5es de %2$s.
SHRC644=A JVM foi conectada ao cache de classe compartilhada criado no modo de diagn\u00F3stico mprotect (usando a op\u00E7\u00E3o -Xshareclasses\:mprotect\=diagnostic). A op\u00E7\u00E3o -Xshareclasses\:mprotect\=none ser\u00E1 ignorada.
SHRC645=Ativar o modo de diagn\u00F3stico mprotect
SHRC646=A JVM n\u00E3o p\u00F4de verificar as permiss\u00F5es do conjunto de sem\u00E1foros associado ao cache compartilhado.
SHRC647=A JVM detectou que o ID de usu\u00E1rio efetivo do processo \u00E9 o propriet\u00E1rio, mas n\u00E3o o criador do conjunto de sem\u00E1foros associado ao cache compartilhado. A JVM n\u00E3o ser\u00E1 conectada ao cache compartilhado para evitar acesso ao cache compartilhado n\u00E3o desejado.
J9CL037=N\u00E3o \u00E9 poss\u00EDvel recuperar informa\u00E7\u00F5es de uso da CPU da JVM quando -XX\:-EnableCPUMonitor foi especificado.
J9CL038=Erro ao recuperar informa\u00E7\u00F5es de uso da CPU da JVM.
J9CL039=O registro de data e hora \u00E9 inv\u00E1lido ao recuperar informa\u00E7\u00F5es de uso da CPU da JVM.
J9CL033=N\u00E3o foi poss\u00EDvel registrar %s como a biblioteca de autoinicializa\u00E7\u00E3o. C\u00F3digo de erro \= %zu
J9CL034=%1$d\: Falha ao recuperar Informa\u00E7\u00F5es de %2$s. %3$s
J9CL035=M\u00E9todos de interface privada requerem invokespecial
J9CL036=carregando viola\u00E7\u00E3o de restri\u00E7\u00E3o\: %2$.*1$s n\u00E3o vis\u00EDvel a partir de %4$.*3$s
J9CL019=N\u00E3o \u00E9 poss\u00EDvel alocar o buffer SIOCGIFCONF
SHRC630=O espa\u00E7o est\u00E1 completo para armazenar dados n\u00E3o AOT/n\u00E3o JIT, como classes, no cache compartilhado "%s".
SHRC631=O espa\u00E7o reservado para dados AOT no cache compartilhado "%s" est\u00E1 completo. Use -Xscminaot para aumentar o espa\u00E7o reservado para dados AOT.
SHRC632=O espa\u00E7o reservado para dados JIT no cache compartilhado "%s" est\u00E1 completo. Use -Xscminjitdata para aumentar o espa\u00E7o reservado para dados JIT.
SHRC637=A subop\u00E7\u00E3o-Xshareclasses\:cacheRetransformed \u00E9 incompat\u00EDvel com um BCI existente com cache compartilhado habilitado.
SHRC638=A cria\u00E7\u00E3o de cache com a op\u00E7\u00E3o cacheRetransformed for\u00E7a o modo disableBCI.
SHRC639=Op\u00E7\u00F5es de utilit\u00E1rios de cache compartilhado apenas podem ser usadas em combina\u00E7\u00E3o com -Xmt. Coloque outras op\u00E7\u00F5es de cache compartilhado no arquivo javad.options.
J9CL020=N\u00E3o h\u00E1 mem\u00F3ria suficiente para ler dados do c\u00F3digo do idioma
J9CL021=N\u00E3o h\u00E1 mem\u00F3ria suficiente para criar a lista de \u00EDndice
SHRC633=A op\u00E7\u00E3o "-XX\:+StoreIntermediateClassfile" foi especificada, mas o cache existente n\u00E3o foi criado com a op\u00E7\u00E3o"-XX\:+StoreIntermediateClassfile".
SHRC634=A op\u00E7\u00E3o "-XX\:-StoreIntermediateClassfile" foi especificada, mas o cache existente foi criado com a op\u00E7\u00E3o "-XX\:+StoreIntermediateClassfile".
SHRC635=Arquivo de classe intermedi\u00E1rio de armazenamento \= true
SHRC636=A subop\u00E7\u00E3o "disableBCI" \u00E9 incompat\u00EDvel com o BCI existente com cache compartilhado habilitado.
J9CL026=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para conte\u00FAdo de postagem HTTP
J9CL027=Erro de leitura do arquivo zip
J9CL028=Erro interno ao ler o arquivo zip, C\u00F3digo de Erro %d
J9CL029=Localizados caracteres com defeito/n\u00E3o mapeados
J9CL022=N\u00E3o h\u00E1 mem\u00F3ria suficiente para listar armazenamentos de registros
J9CL023=N\u00E3o h\u00E1 mem\u00F3ria suficiente dispon\u00EDvel para ler registro
J9CL024=Sem mem\u00F3ria
J9CL025=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para cabe\u00E7alhos de resposta de HTTP
SHRC662=Recupera\u00E7\u00E3o de erro\: configura\u00E7\u00E3o de sem\u00E1foro destru\u00EDda associada ao cache de classe compartilhada.
SHRC663=Recupera\u00E7\u00E3o de erro\: configura\u00E7\u00E3o de sem\u00E1foro destru\u00EDda com o id\=%d associada ao cache de classe compartilhada.
SHRC664=Recupera\u00E7\u00E3o de erro com falha\: Falha ao destruir a configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d associado com o cache de classe compartilhada. Apenas o criador ou propriet\u00E1rio ou usu\u00E1rio com privil\u00E9gios administrativos pode destruir a configura\u00E7\u00E3o de sem\u00E1foro.
SHRC665=Recupera\u00E7\u00E3o de erro com falha\: Falha ao destruir a configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d associado com o cache de classe compartilhada.
SHRC660=Falha na JVM ao associar o id\=%d da configura\u00E7\u00E3o de sem\u00E1foro com o cache de classe compartilhada.
SHRC661=Falha na JVM ao associar o id\=%d da mem\u00F3ria compartilhada com o cache da classe compartilhada.
SHRC666=Recupera\u00E7\u00E3o de erro\: mem\u00F3ria compartilhada destru\u00EDda associada ao cache de classe compartilhada.
SHRC667=Recupera\u00E7\u00E3o de erro\: mem\u00F3ria compartilhada destru\u00EDda com id\=%d associado ao cache de classe compartilhada.
SHRC668=Recupera\u00E7\u00E3o de erro com falha\: Falha ao destruir a mem\u00F3ria compartilhada com shmid\=%d associada com o cache de classe compartilhada. Apenas o criador ou propriet\u00E1rio ou usu\u00E1rio com privil\u00E9gios administrativos podem destruir a mem\u00F3ria compartilhada.
SHRC669=Recupera\u00E7\u00E3o de erro com falha\: Falha ao destruir a mem\u00F3ria compartilhada com shmid\=%d associada com o cache de classe compartilhada.
SHRC651=A JVM detectou que o ID de usu\u00E1rio efetivo do processo \u00E9 o propriet\u00E1rio, mas n\u00E3o o criador da mem\u00F3ria compartilhada associada ao cache compartilhado. A JVM n\u00E3o ser\u00E1 conectada ao cache compartilhado para evitar acesso ao cache compartilhado n\u00E3o desejado.
SHRC652=A JVM n\u00E3o est\u00E1 configurada para acessar a mem\u00F3ria compartilhada associada ao cache de classe compartilhada n\u00E3o persistente existente. Para se conectar ao cache de classe compartilhada n\u00E3o persistente, use a subop\u00E7\u00E3o 'groupAccess'.
SHRC653=A JVM n\u00E3o est\u00E1 configurada para acessar a mem\u00F3ria compartilhada associada ao cache de classe compartilhada n\u00E3o persistente existente. Para se conectar ao cache de classe compartilhada n\u00E3o persistente, use as subop\u00E7\u00F5es 'groupAccess' e 'readonly'.
SHRC654=A JVM n\u00E3o permite acesso \u00E0 regi\u00E3o de mem\u00F3ria compartilhada do cache compartilhado criado e pertencente a outro usu\u00E1rio que n\u00E3o est\u00E1 em seu grupo.
SHRC650=A JVM n\u00E3o p\u00F4de verificar as permiss\u00F5es da mem\u00F3ria compartilhada associada ao cache compartilhado.
SHRC659=Ocorreu um erro ao abrir a mem\u00F3ria compartilhada
J9CL040=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a nova refer\u00EAncia global de JNI
J9CL041=A classe de host %2$.*1$s e a classe an\u00F4nima %4$.*3$s est\u00E3o em pacotes diferentes
J9CL042=O membro de aninhamento %2$.*1$s em %4$.*3$s declara um host de aninhamento diferente de %6$.*5$s
SHRC655=O cache est\u00E1 acess\u00EDvel ao usu\u00E1rio atual \= %s
SHRC656=A JVM n\u00E3o est\u00E1 configurada para acessar o arquivo de cache compartilhado. Para se conectar ao cache de classe compartilhada, use a subop\u00E7\u00E3o 'groupAccess'.
SHRC657=A JVM n\u00E3o permite acesso ao arquivo de cache compartilhado porque o ID do usu\u00E1rio e o ID do grupo do processo da JVM s\u00E3o diferentes do ID do usu\u00E1rio e do ID do grupo do propriet\u00E1rio do arquivo de cache compartilhado e o ID do usu\u00E1rio do processo da JVM n\u00E3o pertence ao grupo do propriet\u00E1rio do arquivo de cache compartilhado.
SHRC658=A JVM n\u00E3o p\u00F4de verificar as permiss\u00F5es do arquivo de cache compartilhado.
SHRC200=\ Localiza\u00E7\u00E3o bem-sucedida de %2$.*1$s.
SHRC684=Ocorreu um erro ao abrir o sem\u00E1foro. O arquivo de controle n\u00E3o p\u00F4de ser bloqueado.
DUMP034=O usu\u00E1rio solicitou o dump %1$s usando '%2$s' por meio de %3$s
SHRC201=\ Substitui\u00E7\u00E3o bem-sucedida de %2$.*1$s.
SHRC685=Ocorreu um erro ao abrir a mem\u00F3ria compartilhada. O arquivo de controle n\u00E3o p\u00F4de ser bloqueado.
DUMP033=A JVM solicitou o dump %1$s em resposta a um evento
SHRC202=Falha ao inicializar conjuntos no Gerenciador de classes compartilhado
SHRC686=Falha ao inicializar o cache de classe compartilhada. Continuar sem us\u00E1-lo como -Xshareclasses\:nonfatal \u00E9 especificado
DUMP036=Filtro -Xdump inv\u00E1lido ou ausente
SHRC203=N\u00E3o \u00E9 poss\u00EDvel criar tabela hash no Gerenciador de classes compartilhado
SHRC687=Um novo cache de classe compartilhada n\u00E3o pode ser criado ao executar com a op\u00E7\u00E3o -Xshareclasses\:readonly
DUMP035=O usu\u00E1rio solicitou o dump %1$s por meio de %2$s
SHRC680=Recupera\u00E7\u00E3o de erro com falha\: Falha ao remover o arquivo de controle de configura\u00E7\u00E3o de sem\u00E1foro %s associado ao cache de classe compartilhada.
DUMP030=N\u00E3o \u00E9 poss\u00EDvel gravar o dump no arquivo %s\: %s
SHRC681=O limite do sistema para o n\u00FAmero m\u00E1ximo de sem\u00E1foros ou do n\u00FAmero m\u00E1ximo em todo o sistema de sem\u00E1foros foi atingido.
SHRC682=O limite do sistema para o n\u00FAmero m\u00E1ximo de regi\u00F5es da mem\u00F3ria compartilhada ou o limite do sistema inteiro na mem\u00F3ria alocada para regi\u00F5es de mem\u00F3ria compartilhada foi atingido.
DUMP032=A JVM solicitou o dump %1$s usando '%2$s' em resposta a um evento
SHRC683=O limite do sistema no n\u00FAmero total de arquivos abertos foi atingido.
DUMP031=O heapdump solicitado n\u00E3o foi produzido porque o bloqueio exclusive da VM n\u00E3o foi solicitado. Inclua request\=exclusive+prepwalk+compact em sua op\u00E7\u00E3o da linha de comandos -Xdump\:heap\:.
SHRC208=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para conjunto de itens de tabela hash em CompiledMethodManagerImpl
SHRC209=Ativar sa\u00EDda detalhada de dados de bytes
SHRC204=N\u00E3o \u00E9 poss\u00EDvel criar o mutex da tabela hash no Gerenciador de classes compartilhado
SHRC688=Caminhos de classe podem ser inclu\u00EDdos apenas pela primeira JVM inicializando o cache.
DUMP027=O heapdump solicitado n\u00E3o foi produzido porque um outro componente est\u00E1 retendo o bloqueio exclusive da VM.
SHRC205=Falha ao criar novo item de tabela hash em CompiledMethodManagerImpl
SHRC689=Permite que uma JVM armazene caminhos de classe no cache criado com a op\u00E7\u00E3o "restrictClasspaths".
DUMP026=Nome de IEATDUMP excedendo o comprimento m\u00E1ximo permitido. Nome padr\u00E3o usado.
SHRC206=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em CompiledMethodManagerImpl
DUMP029=O pedido de prepwalk ou compact antes de executar um dump do sistema ser\u00E1 ignorado porque o bloqueio exclusive da VM n\u00E3o foi solicitado.
SHRC207=N\u00E3o \u00E9 poss\u00EDvel digitar mutex de tabela hash CompiledMethodManager
DUMP028=O bloqueio exclusive da VM n\u00E3o p\u00F4de ser obtido antes da execu\u00E7\u00E3o do dump do sistema.
SHRC673=Falha ao destruir a configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d associada ao cache de classe compartilhada.
DUMP045=O n\u00FAmero de op\u00E7\u00F5es de dump deve ser menor que %d, incluindo as op\u00E7\u00F5es configuradas por padr\u00E3o.
SHRC674=O usu\u00E1rio n\u00E3o tem permiss\u00E3o para destruir a mem\u00F3ria compartilhada com shmid\=%d. Apenas o criador ou propriet\u00E1rio ou usu\u00E1rio com privil\u00E9gios administrativos podem destruir a mem\u00F3ria compartilhada.
DUMP044=Valor v\u00E1lido reservado ou inv\u00E1lido para %s
SHRC675=Falha ao destruir a mem\u00F3ria compartilhada associada ao cache de classe compartilhada.
DUMP047=A VM est\u00E1 sendo encerrada. Motivo\: desconhecido
SHRC676=Falha ao destruir a mem\u00F3ria compartilhada com shmid\=%d associado ao cache de classe compartilhada.
DUMP046=A VM est\u00E1 sendo encerrada. Motivo\: %2$.*1$s
DUMP041=Uso incorreto de -Xdump msg_filter
SHRC670=Recupera\u00E7\u00E3o de erro\: tentando usar o cache compartilhado no modo somente leitura se existir a regi\u00E3o de mem\u00F3ria compartilhadas, em resposta \u00E0 op\u00E7\u00E3o "-Xshareclasses\:nonfatal".
DUMP040=Dump %1$s gravado no(s) conjunto de dados(s) usando o template de nome %2$s
SHRC671=O usu\u00E1rio n\u00E3o tem permiss\u00E3o para destruir a configura\u00E7\u00E3o de sem\u00E1foro com semid\=%d. Apenas o criador ou propriet\u00E1rio ou usu\u00E1rio com privil\u00E9gios administrativos pode destruir a configura\u00E7\u00E3o de sem\u00E1foro.
DUMP043=%s n\u00E3o suportado nesta plataforma
SHRC672=Falha ao destruir a configura\u00E7\u00E3o de sem\u00E1foro associada ao cache de classe compartilhada.
DUMP042=Interromper sinal recebido durante a execu\u00E7\u00E3o na pilha Java. Os agentes de dump JVM n\u00E3o puderam ser executados.
SHRC677=C\u00F3digo de erro de camada da porta \= %1$d
DUMP038=O dump de ajuste n\u00E3o \u00E9 gravado por causa do rastreio no arquivo\: %1$s
SHRC678=Mensagem de erro de plataforma\: %1$s
DUMP037=Erro no dump %1$s\: %2$s falhou, c\u00F3digo de erro\: %3$d
SHRC679=Recupera\u00E7\u00E3o de erro com falha\: Falha ao remover o arquivo de controle de configura\u00E7\u00E3o de sem\u00E1foro %s associado ao cache de classe compartilhada.
DUMP039=Processando o evento de dump "%1$s", detalhe "%3$.*2$s" em %4$s - aguarde.
J9CL008=valor de tempo limite em nanossegundos fora do intervalo
J9CL009=Encadeamento j\u00E1 iniciado
SHRC222=O cache de classe compartilhado persistente n\u00E3o pode ser criado/utilizado, pois o mapeamento de mem\u00F3ria n\u00E3o suporta os recursos necess\u00E1rios
SHRC223=O caches de classe compartilhado persistente n\u00E3o pode ser criado/utilizado, pois o bloqueio de arquivo n\u00E3o \u00E9 suportado
SHRC224=Sem mem\u00F3ria para c\u00F3pia local de nome do cache
SHRC225=Erro ao obter caminho de arquivo de cache
SHRC220=C\u00F3digo de erro de camada da porta \= %1$d
SHRC221=Mensagem de erro de plataforma\: %1$s
J9CL010=Falha em alocar JNIEnv
SHRC226=Erro ao abrir o arquivo de cache de classe compartilhado
SHRC227=Erro ao adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho de arquivo do cache de classe compartilhado
SHRC228=Erro ao atualizar o cache de classe compartilhado desde a \u00FAltima conex\u00E3o
SHRC229=Erro\: o arquivo de cache de classe compartilhado possui um cabe\u00E7alho inv\u00E1lido
J9CL015=Falha ao criar rastreio de pilha (muito provavelmente devido \u00E0 falta de mem\u00F3ria no S.O.)
J9CL016=n\u00E3o foi poss\u00EDvel criar a nova entrada de caminho da classe
J9CL017=n\u00E3o foi poss\u00EDvel alocar para recurso de fuso hor\u00E1rio
J9CL018=n\u00E3o foi poss\u00EDvel alocar para entrada de fuso hor\u00E1rio
J9CL011=Falha em bifurcar o encadeamento do S.O.
J9CL012=
J9CL013=Falha em alocar o monitor do S.O.
J9CL014=Argumento de linha de comandos JCL inv\u00E1lido
SHRC690=Restringir Caminhos de classe \= true
SHRC211=Localizando dados de bytes para a chave %.*s no cache compartilhado...
SHRC695=Restaurar um novo cache compartilhado n\u00E3o persistente a partir de uma captura instant\u00E2nea
SHRC212=Armazenando dados de bytes para a chave %.*s no cache compartilhado...
SHRC696=As subop\u00E7\u00F5es "%s" e "%s" s\u00E3o incompat\u00EDveis. A subop\u00E7\u00E3o "%s" \u00E9 ignorada
SHRC213=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ByteDataManagerImpl
SHRC697=Falha ao obter um diret\u00F3rio para o cache compartilhado
SHRC214=N\u00E3o \u00E9 poss\u00EDvel digitar mutex de tabela hash ByteDataManager
SHRC698=O cache compartilhado n\u00E3o persistente "%s" foi restaurado com sucesso a partir da captura instant\u00E2nea
SHRC691=Restringir Caminhos de classe                  \= false
SHRC692=Criar captura instant\u00E2nea de um cache compartilhado n\u00E3o persistente existente
SHRC693=Destruir a captura instant\u00E2nea de um cache compartilhado (usar par\u00E2metro de nome ou padr\u00E3o)
SHRC210=[-Xshareclasses sa\u00EDda detalhada de dados de bytes ativada]
SHRC694=Destruir todas as capturas instant\u00E2neas do cache compartilhado
SHRC219=[-Xshareclasses acesso de grupo ativado para novos caches]
SHRC215=Criar cache de classe compartilhado persistente
SHRC699=Falha ao restaurar o cache compartilhado n\u00E3o persistente "%s" a partir da captura instant\u00E2nea
SHRC216=Criar cache de classe compartilhado n\u00E3o-persistente
SHRC217=[-Xshareclasses cache persistente ativado]
SHRC218=[-Xshareclasses cache persistente desativado]
J9CL004=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: esperava-se JCL v%1$i, encontrou-se v%2$i
J9CL005=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: requer VM v%1$i, encontrou-se v%2$i
J9CL006=Nenhum dado de pr\u00E9-verifica\u00E7\u00E3o para java/lang/Object
J9CL007=valor de tempo limite negativo
J9CL000=Biblioteca de classes incompat\u00EDvel
J9CL001=Tentar executando com -jcl\:%s
J9CL002=As classes s\u00E3o de uma biblioteca diferente de J9 ou um JXE reduzido incorretamente
J9CL003=Vers\u00E3o da biblioteca de classes incompat\u00EDvel\: JCL %1$x, VM %2$x
SHRC244=Erro ao obter comprimento do arquivo de cache de classe compartilhado
SHRC245=Erro ao mapear o arquivo de cache de classe compartilhado
SHRC246=%1$s
SHRC247=Erro\: os dados de identifica\u00E7\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado s\u00E3o inv\u00E1lidos
SHRC240=Erro\: n\u00E3o \u00E9 poss\u00EDvel adquirir bloqueio de grava\u00E7\u00E3o de conex\u00E3o do arquivo de cache de classe compartilhado
SHRC241=Erro\: n\u00E3o \u00E9 poss\u00EDvel excluir o arquivo de cache de classe compartilhado
SHRC242=Erro ao atualizar o arquivo de cache de classe compartilhado desde a \u00FAltima desconex\u00E3o
SHRC243=Erro ao liberar o bloqueio de leitura de conex\u00E3o do arquivo de cache de classe compartilhado
SHRC248=Erro\: a vers\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado \u00E9 inv\u00E1lida
SHRC249=Erro\: o modlevel do cabe\u00E7alho do arquivo de cache de classe compartilhado \u00E9 inv\u00E1lido
SHRC233=Erro ao criar cabe\u00E7alho do arquivo de cache de classe compartilhado
SHRC234=Erro ao adquirir bloqueio de leitura de conex\u00E3o de arquivo de cache de classe compartilhado
SHRC235=Erro ao liberar o bloqueio de leitura de conex\u00E3o do arquivo de cache de classe compartilhado
SHRC236=Criado cache persistente de classes compartilhado %1$s
SHRC230=Erro ao inicializar cabe\u00E7alho de dados do cache compartilhado
SHRC231=Erro ao configurar comprimento do arquivo de cache de classe compartilhado
SHRC232=N\u00E3o \u00E9 poss\u00EDvel criar monitor no modo de leitura
SHRC237=Aberto cache persistente de classes compartilhado %1$s
SHRC238=Erro\: o cache de classe compartilhado n\u00E3o est\u00E1 conectado
SHRC239=Erro\: n\u00E3o \u00E9 poss\u00EDvel adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho do arquivo de cache de classe compartilhado
SHRC260=Falha ao criar conjunto em ByteDataManager
SHRC261=Ativar sa\u00EDda detalhada interna de sequ\u00EAncia
SHRC266=[-Xshareclasses armazenamento em cache de classes retransformadas ativado]
SHRC267=Desativar armazenamento em cache de classes do caminho de classe de inicializa\u00E7\u00E3o
SHRC268=[-Xshareclasses armazenamento em cache de entradas do caminho de classe de inicializa\u00E7\u00E3o desativado]
SHRC269=O sistema n\u00E3o suporta prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria
SHRC262=Bytes de dados         \= %d
SHRC263=Ativar p\u00E1ginas detalhadas de CompositeCache
SHRC264=N\u00E3o aproximar \u00E1reas de cache de limites da p\u00E1gina
SHRC265=Classes de cache que s\u00E3o retransformadas atrav\u00E9s de JVMTI
EXEL013=\  -Xmn<x>         configura o novo tamanho de espa\u00E7o para <x>
EXEL014=\  -Xmn<x>         configura o novo tamanho de espa\u00E7o inicial/m\u00E1ximo para <x>
EXEL015=\  -Xmns<x>        configura o novo tamanho de espa\u00E7o inicial para <x>
EXEL016=\  -Xmnx<x>        configura o novo tamanho de espa\u00E7o m\u00E1ximo para <x>
EXEL017=\  -Xmo<x>         configura o tamanho de espa\u00E7o antigo para <x>
EXEL018=\  -Xmo<x>         configura o tamanho de espa\u00E7o inicial/m\u00E1ximo antigo para <x>
EXEL019=\  -Xmos<x>        configura o tamanho de espa\u00E7o antigo inicial para <x>
EXEL010=Valor com sufixo "k" (kilo) ou "m" (mega) ser\u00E3o fatorados de maneira adequada.\n
EXEL011=\  -Xmca<x>        configura o incremento do segmento de classe de RAM para <x>
EXEL012=\  -Xmco<x>        configura o incremento do segmento de classe de ROM para <x>
SHRC250=O cache n\u00E3o pode ser aberto como de leitura uma vez que ele ainda n\u00E3o foi inicializado
SHRC255=Erro ao atualizar arquivo de cache de classe compartilhado desde a \u00FAltima desconex\u00E3o na sa\u00EDda da JVM
SHRC256=O cache compartilhado persistente "%1$s" foi destru\u00EDdo
SHRC257=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada no Gerenciador
SHRC258=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash no Gerenciador
SHRC251=N\u00E3o excluir automaticamente caches de diferentes buildIDs
SHRC252=Erro ao buscar no arquivo de cache de classe compartilhado
SHRC253=Erro ao gravar no arquivo de cache de classe compartilhado
SHRC254=Erro ao configurar comprimento do arquivo de cache de classe compartilhado
EXEL002=\  -Xbootclasspath/p\:<path>  pr\u00E9-anexa <path> ao caminho de classe de autoinicializa\u00E7\u00E3o
EXEL003=\  -Xbootclasspath/a\:<path>  anexa <path> ao caminho de classe de autoinicializa\u00E7\u00E3o
EXEL004=\n  -Xrun<library>[\:op\u00E7\u00F5es]  carregar biblioteca de agente nativo\n                            (obsoleto em favor de -agentlib)\n
EXEL005=\  -Xint           executa interpretado apenas (equivalente a -Xnojit -Xnoaot)
SHRC259=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex da tabela hash do Gerenciador
EXEL006=\  -Xnojit         desativa o JIT
EXEL007=\  -Xnoaot         n\u00E3o executa c\u00F3digo pr\u00E9-compilado
EXEL008=\  -Xfuture        ativa verifica\u00E7\u00F5es mais r\u00EDgidas, antecipando o padr\u00E3o futuro
EXEL009=\nArgumentos para as seguintes op\u00E7\u00F5es s\u00E3o expressos em bytes.
EXEL000=As op\u00E7\u00F5es a seguir n\u00E3o s\u00E3o op\u00E7\u00F5es padr\u00E3o e est\u00E3o sujeitas a altera\u00E7\u00F5es sem aviso pr\u00E9vio.\n
EXEL001=\  -Xbootclasspath\:<path>    configura o caminho de classe de autoinicializa\u00E7\u00E3o para <path>
SHRC280=Listando todos os caches em cacheDir %s
SHRC281=Tentando destruir todos os caches em cacheDir %s
SHRC282=O tamanho da p\u00E1gina do sistema operacional \u00E9 incompat\u00EDvel com este cache. Tentando recriar o cache.
SHRC283=Abra o cache com permiss\u00F5es de leitura
SHRC288=ID de mem\u00F3ria compartilhada   \= %d
SHRC289=N\u00E3o detectar quando um cache est\u00E1 localizado em um sistema de arquivos de rede remota
SHRC284=N\u00E3o \u00E9 poss\u00EDvel criar monitor no modo de leitura
SHRC285=Aberto cache persistente de classes compartilhado %1$s no modo de leitura
SHRC286=Aberto cache de classe compartilhado %1$s no modo de leitura
SHRC287=O cache persistente n\u00E3o pode estar localizado em um sistema de arquivos de rede. Selecione "nonpersistent" ou um cacheDir diferente.
EXEL035=\  -Xminf<x>       porcentagem m\u00EDnima de heap livre ap\u00F3s GC
EXEL036=\  -Xmaxf<x>       porcentagem m\u00E1xima de heap livre ap\u00F3s GC
EXEL037=\nOs argumentos para as op\u00E7\u00F5es a seguir s\u00E3o expressos como n\u00FAmeros decimais.\n
EXEL038=\  -Xgcthreads<x>                configura o n\u00FAmero de encadeamentos GC
EXEL039=\  -Xnoclassgc                   desativa o descarregamento de classe din\u00E2mico
EXEL030=\  -Xss<x>        configura o tamanho da pilha de encadeamento para <x>
EXEL031=\  -Xmine<x>       configura o tamanho m\u00EDnimo para expans\u00E3o de heap para <x>
EXEL032=\  -Xmaxe<x>       configura o tamanho m\u00E1ximo para expans\u00E3o de heap para <x>
EXEL033=\nOs argumentos para as op\u00E7\u00F5es a seguir s\u00E3o expressos como decimal de 0 a 1.
EXEL034=Um valor 0,3 representa uma solicita\u00E7\u00E3o de 30%%\n
SHRC270=Configurar prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria cache
SHRC271=Subop\u00E7\u00E3o n\u00E3o reconhecida para a op\u00E7\u00E3o mprotect\=
SHRC272=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria completa ativada com \u00EAxito para o cache
SHRC277=Para executar o utilit\u00E1rio "%s" em um cache compartilhado n\u00E3o persistente "%s", tamb\u00E9m \u00E9 necess\u00E1rio usar a subop\u00E7\u00E3o "nonpersistent"
SHRC278=Observe que o utilit\u00E1rio "%s" n\u00E3o pode operar no cache de classes incompat\u00EDvel "%s". Utilize uma JVM do n\u00EDvel correto.
SHRC279=Recriar cache compartilhado na inicializa\u00E7\u00E3o
SHRC273=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria padr\u00E3o ativada com \u00EAxito para o cache
SHRC274=Prote\u00E7\u00E3o de p\u00E1gina de mem\u00F3ria desativada para o cache
SHRC275=Configurar o local dos arquivos de cache da JVM
SHRC276=Para executar o utilit\u00E1rio "%s" no cache de classes persistente "%s", n\u00E3o utilize a subop\u00E7\u00E3o "nonpersistent"
EXEL024=\  -Xmx<x>         configura a mem\u00F3ria m\u00E1xima para <x>
EXEL025=\  -Xmr<x>         configura o tamanho da configura\u00E7\u00E3o lembrada para <x>
EXEL026=\  -Xmrx<x>         configura o tamanho m\u00E1ximo da configura\u00E7\u00E3o lembrada para <x>
EXEL027=\  -Xmso<x>        configura o tamanho da pilha de encadeamento do S.O. para <x>
EXEL028=\  -Xiss<x>        configura o tamanho da pilha de encadeamento java inicial para <x>
EXEL029=\  -Xss<x>        configura o tamanho da pilha de encadeamento java m\u00E1ximo para <x>
EXEL020=\  -Xmox<x>        configura o tamanho de espa\u00E7o antigo m\u00E1ximo antigo para <x>
EXEL021=\  -Xmoi<x>        configura o incremento de espa\u00E7o antigo para <x>
EXEL022=\  -Xms<x>         configura o tamanho de espa\u00E7o antigo para <x>
EXEL023=\  -Xms<x>           configura o tamanho de mem\u00F3ria inicial para <x>
EXEL057=
EXEL058=Erro interno da VM\: Sem mem\u00F3ria
EXEL059=Erro interno da VM\: Falha em localizar a classe java/lang/String
EXEL050=\  -Xrdbginfo\:<host>\:<porta>      ativar servidor de informa\u00E7\u00F5es de depura\u00E7\u00E3o remoto
EXEL051=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize "-classpath <path>" ou "-cp <path>".
EXEL052=\nAVISO\: O argumento da linha de comandos "%s" foi reprovado.\nAVISO\: Utilize o -X equivalente.
EXEL053=
EXEL054=
EXEL055=Destino\: %s
EXEL056=
SHRC291=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de hashtable em ROMClassResourceManager
SHRC292=N\u00E3o \u00E9 poss\u00EDvel inserir mutex de hashtable ROMClassResourceManager
SHRC293=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para conjunto de itens de hashtable em ROMClassResourceManager
SHRC294=%1$d\: 0x%2$p CHARARRAY\: em 0x%3$p.
SHRC290=Falha ao criar novo item de hashtable em ROMClassResourceManager
SHRC299=O cache de classe compartilhado "%s" n\u00E3o foi criado com a op\u00E7\u00E3o aninhada, n\u00E3o \u00E9 poss\u00EDvel aumentar o cache
SHRC295=Desativar depend\u00EAncia de ter CORE_MMAP no AIX
SHRC296=Executar com a op\u00E7\u00E3o "noCoreMmap" significa que \u00E9 pouco prov\u00E1vel que a IBM ajude com quaisquer travamentos, uma vez que os dados de classe estar\u00E3o ausentes de dumps do sistema
SHRC297=Para usar caches de classe compartilhados persistentes no AIX,a vari\u00E1vel de ambiente CORE_MMAP deve ser configurada como "yes"
SHRC298=Para executar o utilit\u00E1rio "%s" no cache de classe persistente "%s", use a subop\u00E7\u00E3o "persistent"
EXEL046=\  -Xlp                          ativa o suporte de p\u00E1gina grande
EXEL047=\n  -Xdbg\:<options>               ativa o debug, op\u00E7\u00F5es padr\u00E3o JDWP
EXEL048=\  -Xrunjdwp\:<options>           ativa as, op\u00E7\u00F5es padr\u00E3o JDWP
EXEL049=\  -Xdbginfo\:<symbol file path>  ativa o servidor de informa\u00E7\u00F5es de depura\u00E7\u00E3o
EXEL040=\  -Xclassgc                     ativa o descarregamento de classe din\u00E2mico
EXEL041=\  -Xalwaysclassgc               ativa o descarregamento de classe din\u00E2mico em todos os GCs
EXEL042=\  -Xnocompactexplicitgc         desativa a compacta\u00E7\u00E3o em um sistema GC
EXEL043=\  -Xcompactexplicitgc           ativa a compacta\u00E7\u00E3o em todos os sistemas GCs
EXEL044=\  -Xcompactgc                   ativa a compacta\u00E7\u00E3o
EXEL045=\  -Xnocompactgc                 desativa a compacta\u00E7\u00E3o
SHRC192=O valor -Xscmaxaot \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado como ilimitado
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC194=\tpara ROMClass %2$.*1$s em 0x%3$p.
SHRC195=Ativar sa\u00EDda detalhada de AOT
SHRC190=O valor -Xscminaot n\u00E3o deve ser maior do que o valor -Xscmaxaot
SHRC191=O valor -Xscminaot \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado para ser igual ao valor -Xscmx
SHRC196=[-Xshareclasses sa\u00EDda detalhada AOT ativada]
SHRC197=Localizando c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado...
SHRC198=Armazenando c\u00F3digo AOT para ROMMethod 0x%1$p no cache compartilhado...
SHRC199=\ Armazenamento bem-sucedido de %2$.*1$s.
TRCE020=Ocorreu um tempo limite durante o encerramento do mecanismo de rastreio
JNCK097=\tadvice         exibir recomenda\u00E7\u00E3o
JNCK098=Erro de JNI em %1$s\: argumento \#%2$d espera %3$s %4$s, o argumento real \u00E9 %5$s %6$s
JNCK095=Erro de JNI no valor retornado\: o tipo de retorno \u00E9 uma refer\u00EAncia mas o valor (0x%1$p) n\u00E3o \u00E9 uma refer\u00EAncia de objeto v\u00E1lida. Seu tipo \u00E9\: %2$s
JNCK096=\twarn           exibir avisos
JNCK099=Erro de JNI em %1$s\: argumento \#%2$d requer um tipo sem matriz
JNCK090=Detectado aviso no quadro do manipulador de um evento JVMPI ou JVMTI\n
JNCK093=Erro de JNI em %s\: O m\u00E9todo n\u00E3o \u00E9 um construtor
JNCK094=Erro de JNI em %1$s\: Os dados apontados pelo argumento \#%2$d foram modificados durante a execu\u00E7\u00E3o de %3$s. Os dados podem ter sido modificados por outro encadeamento ou por uma chamada aninhada. O resultado de %4$s pode estar incorreto e o VM pode se tornar inst\u00E1vel
JNCK091=Detectada recomenda\u00E7\u00E3o no quadro do manipulador de um evento JVMPI ou JVMTI\n
JNCK092=\tvalist         check for va_list reuse
JNCK086=Aviso de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 um java/nio/Buffer. %3$s retornar\u00E1 um c\u00F3digo de erro
JNCK087=Erro de JNI em \#%1$s\: O argumento \#%2$d n\u00E3o \u00E9 java/lang/reflect/Method ou java/lang/reflect/Constructor
JNCK084=Aviso detectado em JNI_OnLoad da biblioteca %.*s\n
JNCK085=Orienta\u00E7\u00E3o detectada em JNI_OnLoad da biblioteca %.*s\n
JNCK088=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma refer\u00EAncia fraca. Uma refer\u00EAncia fraca pode se tornar NULA a qualquer momento. A refer\u00EAncia deve ser promovida utilizando NewLocalRef ou NewGlobalRef e, em seguida, comparada com NULO antes de chamar %3$s
JNCK089=Detectado erro no quadro do manipulador de um evento JVMPI ou JVMTI\n
CFRE020=o PC de in\u00EDcio do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
CFRE021=campo duplicado
CFRE022=thisClass deve ser uma classe
CFRE023=conjunto de constantes vazio
CFRE024=o nome da classe deve ser uma sequ\u00EAncia
CFRE025=o campo possui dois atributos ConstantValue
CFRE026=tipo de bytecode newarray n\u00E3o reconhecido
CFRE027=o bytecode multianewarray deve referir-se a uma classe de matriz
CFRE017=atributos StackMap/StackMapTable m\u00FAltiplos
CFRE018=a classe interna deve ser uma classe
CFRE019=in\u00EDcio de PC de vari\u00E1vel local inv\u00E1lido
CFRE031=a exce\u00E7\u00E3o lan\u00E7ada deve ser uma classe
CFRE032=a superclasse da interface deve ser java.lang.Object
CFRE033=o intervalo do manipulador de exce\u00E7\u00F5es est\u00E1 vazio
CFRE034=bytecode incompleto
CFRE035=o novo bytecode deve referir-se a uma classe
CFRE036=direcionar n\u00E3o-instru\u00E7\u00E3o em bytecode jump
CFRE037=temp cont\u00E9m um tipo incorreto
CFRE038=o m\u00E9todo possui dois atributos Exceptions
CFRE030=superclasse nula
CFRE028=o bytecode ldc* deve referir-se a uma constante
CFRE029=o bytecode multianewarray deve referir-se a uma classe
CFRE000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
CFRE001=%1$s; class\=%3$.*2$s, offset\=%4$u
CFRE002=o nome do m\u00E9todo \u00E9 inv\u00E1lido
CFRE003=vers\u00E3o principal inv\u00E1lida
CFRE004=bytecode desconhecido
CFRE005=interface duplicada
CFRE010=contagem negativa para pares de correspond\u00EAncia e deslocamento no bytecode lookupswitch
CFRE011=o bytecode anewarray deve referir-se a uma classe
CFRE012=o valor constante deve ser um valor
CFRE013=comprimento de PC vari\u00E1vel local inv\u00E1lido
CFRE014=Atributo de c\u00F3digo especificado para um m\u00E9todo nativo ou abstrato
CFRE015=as interfaces devem ser classes
CFRE016=\u00EDndice de vari\u00E1vel local fora do intervalo em incremento
CFRE006=atributo StackMap/StackMapTable inv\u00E1lido
CFRE007=a assinatura do campo \u00E9 inv\u00E1lida
CFRE008=alto < baixo no bytecode tableswitch
CFRE009=o campo de interface deve ser est\u00E1tico p\u00FAblico e final
CFRE064=o descritor deve ser uma sequ\u00EAncia UTF8
CFRE065=v\u00E1rios atributos de m\u00E9todos de inclus\u00E3o
CFRE066=atributos InnerClasses m\u00FAltiplos
CFRE067=tag de entrada do conjunto de constantes desconhecida
CFRE068=o nome da classe \u00E9 inv\u00E1lido
CFRE069=comprimento do atributo maior do que os dados do atributo
CFRE060=o PC de final do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o ou o final da matriz de bytecode
CFRE061=o nome deve ser uma sequ\u00EAncia UTF8
CFRE062=o m\u00E1x. de locais \u00E9 menor do que o tamanho de argumentos
CFRE063=o bytecode invoke chama o m\u00E9todo inv\u00E1lido
JNCK039=Erro de JNI em %1$s\: O argumento \#%2$d \u00E9 NULL
JNCK037=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia local. Seu tipo \u00E9\: %4$s
JNCK038=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia do objeto v\u00E1lida. Seu tipo \u00E9\: %4$s\n
JNCK031=Erro de JNI em %1$s\: O argumento \#%2$d \u00E9 NULL
JNCK032=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 jobjectArray
JNCK030=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada enquanto o GC est\u00E1 desativado (provavelmente, ela foi chamada a partir de um evento JVMPI ou JVMTI)
JNCK035=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia global. Seu tipo \u00E9\: %4$s
JNCK036=Erro de JNI em %1$s\: O argumento \#%2$d (0x%3$p) n\u00E3o \u00E9 uma refer\u00EAncia global fraca. Seu tipo \u00E9\: %4$s
JNCK033=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 jarray
JNCK034=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 %3$s
CFRE075=assinatura de vari\u00E1vel local inv\u00E1lida
CFRE076=n\u00FAmero m\u00E1gico inv\u00E1lido
CFRE077=as interfaces devem ser abstratas
CFRE078=o \u00EDndice da classe de m\u00E9todo de inclus\u00E3o deve referir-se a uma classe
CFRE079=o PC do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
CFRE070=PC de n\u00FAmero de linha inv\u00E1lido
CFRE071=a matriz de bytecode est\u00E1 vazia
CFRE072=entradas n\u00E3o classificadas no bytecode lookupswitch
CFRE073=atributo StackMap/StackMapTable localizado fora do atributo Code
CFRE074=nenhum atributo Code especificado
JNCK028=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada quando uma exce\u00E7\u00E3o est\u00E1 pendente
JNCK029=Erro de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o pode ser chamada dentro de uma se\u00E7\u00E3o cr\u00EDtica
JNCK026=Erro JNI em %s\: JNIEnv n\u00E3o parece ser um encadeamento v\u00E1lido, a mem\u00F3ria foi corrompida ou esta n\u00E3o \u00E9 uma m\u00E1quina virtual J9
JNCK027=Erro JNI em %s\: JNIEnv n\u00E3o \u00E9 o JNIEnv para o encadeamento ativo
JNCK020=refer\u00EAncia do depurador
JNCK021=refer\u00EAncia local em outro encadeamento
JNCK024=Foi detectado erro de JNI. Interrompendo.
JNCK025=Utilize -Xcheck\:jni\:nonfatal para continuar executando quando forem detectados erros.
JNCK022=refer\u00EAncia local liberada
JNCK023=Foi detectado erro de JNI. Continuando...
CFRE042=tamanho de matriz de bytecode > 65535
CFRE043=o bytecode n\u00E3o pode ser ampliado
CFRE044=o bytecode invokeinterface reservou o slot diferente de zero
CFRE045=\u00EDndice de conjunto de constantes fora do intervalo
CFRE046=preenchimento de bytecode switch incorreto
CFRE047=a classe de interface pode ser apenas p\u00FAblica, abstrata ou de anota\u00E7\u00E3o
CFRE048=\u00EDndice de vari\u00E1vel local fora do intervalo no armazenamento
CFRE049=o bytecode checkcast deve referir-se a uma classe
CFRE040=comprimento do atributo menor que os dados do atributo
CFRE041=vers\u00E3o secund\u00E1ria inv\u00E1lida
JNCK017=refer\u00EAncia local
JNCK018=refer\u00EAncia global
JNCK015=\thelp          imprimir esta tela
JNCK016=NULL
JNCK019=refer\u00EAncia global fraca
CFRE039=\u00EDndice de vari\u00E1vel local fora do intervalo no carregamento
JNCK010=\tnonfatal       n\u00E3o sai quando erros s\u00E3o detectados
JNCK013=\tnovalist      n\u00E3o verifica reutiliza\u00E7\u00E3o va_list
JNCK014=\tpedantic      executar verifica\u00E7\u00F5es mais cuidadosas, mas mais lentas
JNCK011=\tnowarn         n\u00E3o exibe avisos
JNCK012=\tnoadvice       n\u00E3o exibe orienta\u00E7\u00E3o
CFRE053=o m\u00E9todo possui mais de 255 slots de argumentos
CFRE054=o bytecode de campo deve fazer refer\u00EAncia a um Fieldref
CFRE055=o PC de fim do manipulador de exce\u00E7\u00F5es \u00E9 inv\u00E1lido
CFRE056=contagem do argumento de bytecode invokeinterface incorreta
CFRE057=o tipo de manipulador de exce\u00E7\u00F5es deve ser uma classe
CFRE058=\u00EDndice de vari\u00E1vel local fora do intervalo no retorno da sub-rotina
CFRE059=o PC do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o
CFRE050=o m\u00E9todo da interface deve ser p\u00FAblico e abstrato
CFRE051=a constante da sequ\u00EAncia deve ser uma sequ\u00EAncia
CFRE052=a classe externa deve ser uma classe
JNCK006=\tall            verificar classes de aplicativo e de sistema
JNCK007=\tverbose        rastrear determinadas fun\u00E7\u00F5es e atividades de JNI
JNCK004=jnichk - Utilit\u00E1rio de verifica\u00E7\u00E3o JNI para J9, Vers\u00E3o %s
JNCK005=Uso\: -Xcheck\:jni\:[option[,option[,...]]]
JNCK008=\ttrace          rastrear todas as fun\u00E7\u00F5es de JNI
JNCK009=\tnobounds       n\u00E3o executa verifica\u00E7\u00E3o de limites em cadeias e matrizes
JNCK002=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI\: imposs\u00EDvel registrar evento
JNCK003=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI\: imposs\u00EDvel alocar mem\u00F3ria local VM
JNCK000=-Xcheck\:jni\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
JNCK001=Utilit\u00E1rio de verifica\u00E7\u00E3o JNI instalado. Utilize -Xcheck\:jni\:help para uso
JNCK082=A orienta\u00E7\u00E3o foi detectada no quadro mais externo de um encadeamento conectado\n
JNCK083=Erro detectado em JNI_OnLoad da biblioteca %.*s\n
JNCK080=O erro foi detectado no quadro mais externo de um encadeamento conectado\n
JNCK081=O aviso foi detectado no quadro mais externo de um encadeamento conectado\n
SHRC604=Reservar <tamanho> bytes de espa\u00E7o de cache para dados brutos de classe
TRCE009=Erro ao gravar no arquivo snap
SHRC605=O tamanho da mem\u00F3ria para "%s" \u00E9 muito grande, ou especifica unidades diferentes de 'K','M' ou 'G'.
TRCE008=Erro ao executar busca no arquivo de rastreio\: %s
SHRC606=Incluir sugest\u00F5es JIT n\u00E3o funcionais nos m\u00E9todos para teste; usar com -Xint e um cache pr\u00E9-preenchido.
SHRC607=Armazenados %1$s dados anexados %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
SHRC600=A \u00E1rea de dados brutos de classe est\u00E1 corrompida porque armazenar %u bytes exceder\u00E1 o espa\u00E7o livre da \u00E1rea dispon\u00EDvel ('in\u00EDcio do espa\u00E7o livre'\=%p, 'fim do espa\u00E7o livre'\=%p).
SHRC601=Tamanho da \u00E1rea de dados brutos de classe            %*c\= %lu
SHRC602=\u00C1rea de dados brutos de classe %% usada          %*c\= %lu%%
SHRC603=Bytes usados de dados brutos de classe           %*c\= %lu
JNCK075=Erro interno de jnichk em %1$s\: Descritor n\u00E3o reconhecido 0x%2$x
TRCE001=Erro ao processar op\u00E7\u00E3o de rastreio\: -Xtrace\:%s
JNCK076=Erro interno de jnichk em %s\: Sem mem\u00F3ria
TRCE000=Op\u00E7\u00E3o de rastreio n\u00E3o reconhecida\: -Xtrace\:%s
JNCK073=Orienta\u00E7\u00E3o de JNI em %1$s\: JNI_ABORT foi especificado, mas n\u00E3o pode ser honrado porque os dados foram modificados.\n(CRC original\=0x%2$x, novo CRC\=0x%3$x).\nComo %4$s retornou o conte\u00FAdo real da matriz, as altera\u00E7\u00F5es n\u00E3o ser\u00E3o descartadas. Isto pode n\u00E3o ser o que voc\u00EA desejada.
TRCE003=Erro ao processar op\u00E7\u00E3o de rastreio, detalhe\: %s
JNCK074=Orienta\u00E7\u00E3o de JNI em %s\: Parece que o buffer n\u00E3o foi modificado. Considere a possibilidade de utilizar JNI_ABORT, em vez de modo 0.
TRCE002=Erro ao processar op\u00E7\u00E3o de rastreio\: -Xtrace\:%s\=%s
TRCE005=Erro ao gravar cabe\u00E7alho no arquivo de rastreio\: %s
SHRC608=Localizados %1$s dados anexados %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
JNCK079=Orienta\u00E7\u00E3o detectada em %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE004=Erro ao abrir arquivo de rastreio\: %s
SHRC609=Atualizados %1$s dados anexados %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
TRCE007=Erro ao abrir pr\u00F3xima gera\u00E7\u00E3o do arquivo de rastreio\: %s
JNCK077=Erro detectado em %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE006=Erro ao gravar %d bytes no arquivo de rastreio\: %s rc\: %d
JNCK078=Aviso detectado em %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK071=Aviso de JNI\: A mem\u00F3ria em 0x%1$p, obtida por %2$s, n\u00E3o foi liberada antes de retornar de nativo. Provavelmente, seja uma fuga de mem\u00F3ria.
JNCK072=Orienta\u00E7\u00E3o de JNI em %1$s\: JNI_COMMIT foi especificado, mas ser\u00E1 ignorado.\nComo %2$s retornou o conte\u00FAdo real da matriz, o buffer ser\u00E1 inv\u00E1lido ap\u00F3s esta chamada. Isto pode n\u00E3o ser o que voc\u00EA desejada.
TRCE010=Falha de aloca\u00E7\u00E3o de mem\u00F3ria nativa, voltando para configura\u00E7\u00F5es de rastreio n\u00E3o din\u00E2micas.
JNCK070=Aviso de JNI em %1$s\: Dados originais da matriz foram modificados entre %2$s e %3$s.\n(CRC original\=0x%4$x, novo CRC\=0x%5$x).\nComo %6$s retornou uma c\u00F3pia do conte\u00FAdo da matriz, o novo conte\u00FAdo ser\u00E1 perdido.
TRCE019=Falha na inicializa\u00E7\u00E3o adequada do mecanismo de rastreio, RC \= %d
JNCK064=Aviso JNI em %1$s\: Aumento autom\u00E1tico fraco da capacidade do conjunto de refer\u00EAncia de %2$d para %3$d.\nIsto pode ser um indicador de fuga de mem\u00F3ria.
TRCE012=N\u00E3o foi poss\u00EDvel abrir arquivo contador de ponto de rastreio %s, contadores redirecionados para stderr.
JNCK065=Aviso JNI em %1$s\: Aumento autom\u00E1tico da capacidade de quadro de refer\u00EAncia local de %2$d para %3$d. %4$d refer\u00EAncias est\u00E3o em uso.\nUtilize EnsureLocalCapacity ou PushLocalFrame para aumentar explicitamente o quadro.
TRCE011=M\u00F3dulo n\u00E3o configurado para rastreio\: %s
JNCK062=Aviso de JNI em %s\: Esta fun\u00E7\u00E3o n\u00E3o deve ser chamada dentro de uma se\u00E7\u00E3o cr\u00EDtica
TRCE014=Falha na inicializa\u00E7\u00E3o do mecanismo de rastreio, rastreio n\u00E3o ativado
JNCK063=Aviso JNI em %1$s\: Aumento autom\u00E1tico da capacidade do conjunto de refer\u00EAncias global de %2$d para %3$d.\nIsto pode ser um indicador de fuga de mem\u00F3ria.
TRCE013=Gravando informa\u00E7\u00F5es de contagem de rastreio em %s
TRCE016=Armazenamento para RasGlobalStorage n\u00E3o dispon\u00EDvel, rastreio n\u00E3o ativado
JNCK068=Aviso de JNI em %1$s\: O in\u00EDcio ou \u00EDndice est\u00E1 fora do intervalo (%2$d >\= %3$d)
JNCK069=Aviso de JNI em %1$s\: Fim est\u00E1 fora do intervalo (%2$d + %3$d > %4$d)
TRCE015=Erro ao registrar assinante de grava\u00E7\u00E3o de rastreio
TRCE018=N\u00E3o foi poss\u00EDvel alocar chave de armazenamento local de encadeamento UTE
JNCK066=Aviso de JNI em %1$s\: In\u00EDcio ou \u00EDndice negativo (%2$d) especificado
TRCE017=N\u00E3o foi poss\u00EDvel alocar chave de armazenamento local de encadeamento RAS
JNCK067=Aviso de JNI em %1$s\: Tamanho de regi\u00E3o negativo (%2$d) especificado
CFRE086=o m\u00E9todo possui dois atributos Code
CFRE087=o bytecode do m\u00E9todo de interface deve referenciar um InterfaceMethodref
CFRE088=o nome da vari\u00E1vel local deve ser uma sequ\u00EAncia
CFRE089=esperando nome e tipo
JNCK060=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma assinatura de m\u00E9todo malformada ("%3$s")
JNCK061=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 uma assinatura de campo malformada ("%3$s")
SHRC620=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. O arquivo de controle foi considerado corrompido.
CFRE080=a assinatura de m\u00E9todo \u00E9 inv\u00E1lida
SHRC621=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Incompatibilidade no ID da mem\u00F3ria compartilhada.
CFRE081=o arquivo de origem deve ser um UTF8
CFRE082=<init> o m\u00E9todo n\u00E3o pode ser est\u00E1tico, final, sincronizado, nativo ou abstrato
CFRE083=a classe \u00E9 abstrata e final
CFRE084=sem erro
CFRE085=o nome interno deve ser uma sequ\u00EAncia
SHRC626=As estat\u00EDsticas do cache compartilhado n\u00E3o podem ser obtidas j\u00E1 que um cache compartilhado v\u00E1lido n\u00E3o existe.
SHRC627=A recria\u00E7\u00E3o do arquivo de controle de mem\u00F3ria compartilhada n\u00E3o \u00E9 permitida quando estiver executando em modo de somente leitura.
SHRC628=O arquivo de controle de mem\u00F3ria compartilhada n\u00E3o \u00E9 leg\u00EDvel.
JNCK059=Aviso de JNI em %1$s\: O argumento \#%2$d \u00E9 um identificador malformado ("%3$s")
SHRC629=O arquivo de controle de mem\u00F3ria compartilhada \u00E9 somente leitura.
SHRC622=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Incompatibilidade na chave da mem\u00F3ria compartilhada.
SHRC623=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Falha na verifica\u00E7\u00E3o do ID do grupo.
SHRC624=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Falha na verifica\u00E7\u00E3o do ID do usu\u00E1rio.
SHRC625=Erro ao abrir a regi\u00E3o de mem\u00F3ria compartilhada. Falha na verifica\u00E7\u00E3o do tamanho da mem\u00F3ria compartilhada.
JNCK053=Erro de JNI\: A se\u00E7\u00E3o cr\u00EDtica deve ser liberada antes da fun\u00E7\u00E3o ser retornada
JNCK054=Erro de JNI em %1$s\: Op\u00E7\u00E3o de modo n\u00E3o reconhecida %2$d
JNCK051=Erro interno de VM em %1$s\: Os bytes enviados %2$p s\u00E3o menores do que os bytes de refer\u00EAncia JNI %3$p
JNCK052=Erro de JNI em %1$s\: A classe %3$.*2$s \u00E9 obsoleta
JNCK057=Erro de JNI em %1$s\: N\u00E3o utilize %2$s para liberar mem\u00F3ria 0x%3$p adquirida utilizando %4$s
JNCK058=Aviso de JNI em %1$s\: Depois de chamar %2$s, voc\u00EA deve verificar se h\u00E1 exce\u00E7\u00F5es utilizando ExceptionCheck, ExceptionClear ou ExceptionOccurred antes de chamar %3$s
JNCK055=Erro de JNI em %1$s\: O ponteiro 0x%2$p n\u00E3o foi retornado por nenhuma fun\u00E7\u00E3o da JNI ou j\u00E1 foi liberado
JNCK056=Erro de JNI em %1$s\: A mem\u00F3ria 0x%2$p foi obtida do objeto 0x%3$p, liberando de 0x%4$p
CFRE097=duplicar entrada de classe interna no atributo
CFRE098=a assinatura de vari\u00E1vel local deve ser uma sequ\u00EAncia
CFRE099=modificadores de m\u00E9todo ilegais
JNCK050=Erro de JNI em %s\: PopLocalFrame foi chamado sem um quadro local na pilha
CFRE090=o novo bytecode n\u00E3o pode criar matrizes
CFRE091=o PC de in\u00EDcio do manipulador de exce\u00E7\u00F5es n\u00E3o \u00E9 uma instru\u00E7\u00E3o
SHRC610=Desativar o suporte para instrumenta\u00E7\u00E3o de bytecode.
CFRE092=assinatura inv\u00E1lida
CFRE093=o m\u00E9todo pode ser no m\u00E1ximo um entre p\u00FAblico privado ou protegido
CFRE094=o bytecode instanceof deve referir-se a uma classe
CFRE095=as anota\u00E7\u00F5es devem ser interfaces
CFRE096=direcionar n\u00E3o-instru\u00E7\u00E3o em bytecode switch
SHRC615=Ocorreu um erro ao abrir o sem\u00E1foro. Incompatibilidade na chave do sem\u00E1foro.
SHRC616=Ocorreu um erro ao abrir o sem\u00E1foro. Incompatibilidade no n\u00FAmero de sem\u00E1foros no conjunto de sem\u00E1foros.
SHRC617=Ocorreu um erro ao abrir o sem\u00E1foro. Marcador de sem\u00E1foro n\u00E3o localizado no conjunto de sem\u00E1foros.
JNCK048=Erro de JNI em %s\: Receptor n\u00E3o qualificado
SHRC618=O arquivo de controle do sem\u00E1foro n\u00E3o \u00E9 leg\u00EDvel.
JNCK049=Erro de JNI em %s\: reutiliza\u00E7\u00E3o de va_list detectada
SHRC611=A subop\u00E7\u00E3o "disableBCI" foi especificada, mas o cache existente foi criado com a subop\u00E7\u00E3o "enableBCI".
SHRC612=Configurar artificialmente a chave de armazenamento (0-15) no z/OS para teste.
SHRC613=Ocorreu um erro ao abrir o sem\u00E1foro. O arquivo de controle foi considerado corrompido.
SHRC614=Ocorreu um erro ao abrir o sem\u00E1foro. Incompatibilidade no ID do sem\u00E1foro.
JNCK042=Erro de JNI em %1$s\: O argumento \#%2$d n\u00E3o \u00E9 uma subclasse de %3$s
JNCK043=Erro de JNI em %1$s\: Argumento \#%2$d; imposs\u00EDvel localizar %3$s
JNCK040=Erro de JNI em %1$s\: O argumento \#%2$d est\u00E1 fora do intervalo para um %3$s (0x%4$x < 0x%5$x)
JNCK041=Erro de JNI em %1$s\: O argumento \#%2$d est\u00E1 fora do intervalo para um %3$s (0x%4$x > 0x%5$x)
SHRC619=O arquivo de controle do sem\u00E1foro \u00E9 somente leitura.
JNCK046=Erro de JNI em %1$s\: O m\u00E9todo tem tipo de retorno incorreto ('%2$c')
JNCK047=Erro de JNI em %s\: Argumento clazz incorreto
JNCK044=Erro de JNI em %s\: O m\u00E9todo \u00E9 est\u00E1tico
JNCK045=Erro de JNI em %s\: O m\u00E9todo n\u00E3o \u00E9 est\u00E1tico
SHRC520=\t classpath   Imprime apenas tipos de caminho de classe no cache compartilhado
SHRC521=\t url               Imprime apenas tipos de URL no cache compartilhado.
SHRC522=\t token           Imprime apenas tipos de tokens no cache compartilhado.
SHRC527=\t zipcache      Imprime somente tipos zipcache no cache compartilhado.
SHRC528=\t extra           Imprime todos os tipos privados a seguir no cache compartilhado.
SHRC529=\t orphan         Imprime apenas tipos \u00F3rf\u00E3os no cache compartilhado.
SHRC523=\t romclass     Imprime apenas tipos romclass no cache compartilhado.
SHRC524=\t rommethod   Imprime apenas tipos rommethod no cache compartilhado.
SHRC525=\t aot               Imprime apenas tipos aot no cache compartilhado.
SHRC526=\t jitprofile Imprime apenas tipos jitprofile no cache compartilhado.
SHRC510=Desative a cria\u00E7\u00E3o de dumps em caches danificados
SHRC511=O cache composto possui valor do sinalizador de inicializa\u00E7\u00E3o inv\u00E1lido. O valor de ccInitComplete \u00E9 %lu
SHRC516=Listar todos os elementos em cache O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es.
SHRC517=Subop\u00E7\u00E3o n\u00E3o reconhecida para a op\u00E7\u00E3o printallstats\= O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es.
SHRC518=Op\u00E7\u00F5es dispon\u00EDveis para -Xshareclasses\:printAllStats\=<options>. O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es. Ou seja, printallstats\=aot+url \n
SHRC519=\t all               Imprime todos os tipos a seguir no cache compartilhado.
SHRC512=n\u00E3o existem dados no cache
SHRC513=Configure as permiss\u00F5es de estilo unix para criar diret\u00F3rios de cache
SHRC514=Configura\u00E7\u00E3o inv\u00E1lida para a op\u00E7\u00E3o cacheDirPerm. Ela deve ser a permiss\u00E3o de arquivo de estilo unix no intervalo de 0700 - 0777 ou 1700 - 1777 (em representa\u00E7\u00E3o octal).
SHRC515=Falha ao obter diret\u00F3rio de cache padr\u00E3o.
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC549=-Xshareclasses\:checkStringTableReset pode falhar. A tabela da sequ\u00EAncia n\u00E3o \u00E9 grande o bastante. Ela precisa ter mais que o tamanho de p\u00E1gina do S.O. Tamanho da tabela \= %d, Tamanho da p\u00E1gina \= %d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC547=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a matriz de caracteres em shrinit
SHRC548=For\u00E7ar verifica\u00E7\u00E3o para reconfigura\u00E7\u00E3o da tabela de sequ\u00EAncia quando ela estiver marcada como corrompida.
SHRC530=\t jithint       Imprime apenas tipos jithint no cache compartilhado.
SHRC531=\t aotch           Imprime apenas tipos aotch no cache compartilhado.
SHRC532=\t aotthunk     Imprime apenas tipos aotthunk no cache compartilhado.
SHRC533=\t aotdata       Imprime apenas tipos aotdata no cache compartilhado.
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC534=\t jcl               Imprime apenas tipos jcl no cache compartilhado.
SHRC535=\t bytedata     Imprime todos os outros tipos bytedata no cache compartilhado.
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s Endere\u00E7o\: 0x%5$p Tamanho\: %6$d
SHRC563=Abrindo um cache em tempo real, o que n\u00E3o \u00E9 compat\u00EDvel com esta JVM; use a op\u00E7\u00E3o -Xrealtime JVM para acessar esse cache.
SHRC564=[-Xshareclasses crossguest de cache compartilhado ativado]
SHRC565=Criar cache de classe compartilhada crossguest
SHRC566=O destaque do cabe\u00E7alho do cache de classe compartilhada de convidado cruzado \u00E9 inv\u00E1lido
SHRC560=O nome do cache interno n\u00E3o \u00E9 adequado.
SHRC561=Falha ao inicializar o cache de classes compartilhado, n\u00E3o h\u00E1 espa\u00E7o suficiente no sistema de arquivos. Bytes de espa\u00E7o livre em disco dispon\u00EDveis \= %lld, bytes solicitados \= %lld.
SHRC562=Leia os dados corrompidos para o cabe\u00E7alho de entrada de cache 0x%p (comprimento de item inv\u00E1lido de %u bytes)
SHRC567=Cache de convidado cruzado aberto de classe compartilhada %1$s somente leitura
SHRC568=Cache de convidado cruzado aberto de classes compartilhadas %1$s
SHRC569=Classes de cache de convidado cruzado criadas compartilhadas %1$s
SHRC552=N\u00E3o \u00E9 poss\u00EDvel alocar o tamanho de bloco solicitado para o cache "%s". Bytes dispon\u00EDveis \= %d, Bytes solicitados \= %d
SHRC553=O cache cont\u00E9m apenas classes com n\u00FAmeros de linha
SHRC554=O cache cont\u00E9m apenas classes sem n\u00FAmeros de linha
SHRC555=O cache cont\u00E9m classes com n\u00FAmeros de linha e classes sem n\u00FAmeros de linha
SHRC550=O sinalizador de tempo de execu\u00E7\u00E3o ROUND_TO_PAGE_SIZE est\u00E1 ausente. -Xshareclasses\:checkStringTableReset requer que a tabela da sequ\u00EAncia seja arredondada para o tamanho da p\u00E1gina.
SHRC551=O cache "%s" est\u00E1 marcado como cheio. Falha ao alocar o tamanho de bloco \= %d.
SHRC556=Imprimir resumo de estat\u00EDsticas de cache. O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es.
SHRC557=Subop\u00E7\u00E3o n\u00E3o reconhecida para a op\u00E7\u00E3o printstats\= . O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es.
SHRC558=Op\u00E7\u00F5es dispon\u00EDveis para -Xshareclasses\:printStats\=<options>. O di\u00E1logo \u00E9 estendido para exibir mais op\u00E7\u00F5es. Ou seja, printstats\=aot+url \n
SHRC559=Falha ao criar um diret\u00F3rio "%s" para o cache de classe compartilhado
SHRC580=Erro ao liberar bloqueio de leitura de conex\u00E3o do cache de classe compartilhada de convidado cruzado
SHRC101=\t\u00CDndice %1$d no caminho de classe 0x%2$p
SHRC585=Erro ao adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho do cache de classe compartilhada de convidado cruzado
SHRC102=\tURL 0x%p
SHRC586=Erro\: o cache de classe compartilhada de convidado cruzado possui um cabe\u00E7alho inv\u00E1lido
SHRC103=\tToken 0x%p
SHRC587=Erro ao atualizar o \u00FAltimo hor\u00E1rio de conex\u00E3o do cache de classe compartilhada de convidado cruzado
SHRC104=%1$d\: 0x%2$p CLASSPATH
SHRC588=Erro ao liberar o bloqueio de leitura do cabe\u00E7alho do cache de classe compartilhada de convidado cruzado
SHRC581=Erro ao mapear no objeto compartilhado de convidado cruzado
SHRC582=Erro\: n\u00E3o \u00E9 poss\u00EDvel excluir cache de classe compartilhada de convidado cruzado
SHRC583=Erro ao atualizar o "\u00FAltimo hor\u00E1rio removido" do cache de classe compartilhada de convidado cruzado
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s em 0x%5$p.
SHRC584=Erro ao adquirir bloqueio de leitura de conex\u00E3o do cache de classe compartilhada de convidado cruzado
SHRC109=\!STALE\!
SHRC105=%1$d\: 0x%2$p URL
SHRC589=Criar o cache com suporte para instrumenta\u00E7\u00E3o de bytecode.
SHRC106=%1$d\: 0x%2$p TOKEN
SHRC107=\t%.*s
SHRC108=\t%.*s
SHRC574=N\u00E3o \u00E9 poss\u00EDvel localizar o cache compartilhado de convidado cruzado em um sistema de arquivos de rede. Selecione "nonpersistent" ou um cacheDir diferente.
SHRC575=Erro ao adquirir bloqueio de grava\u00E7\u00E3o para o cabe\u00E7alho no cache de classe compartilhada de convidado cruzado
SHRC576=N\u00E3o \u00E9 poss\u00EDvel abrir o cache compartilhado de convidado cruzado como somente leitura uma vez que ele ainda n\u00E3o foi inicializado
SHRC577=N\u00E3o \u00E9 poss\u00EDvel criar um cache compartilhado de convidado cruzado no modo somente leitura
SHRC570=O cache compartilhado de convidado cruzado "%1$s" foi destru\u00EDdo
SHRC571=As classes de cache de convidado cruzado anexadas compartilhadas %1$s
SHRC572=Localizada a especifica\u00E7\u00E3o de destino incorreta. O destino especificado no cabe\u00E7alho do cache \u00E9\: %s, mas o esperado \u00E9\: %s.
SHRC573=A op\u00E7\u00E3o da linha de comandos "-Xshareclasses\:%s" requer "-Xvirt"
SHRC578=Erro ao criar cabe\u00E7alho no cache de classe compartilhada de convidado cruzado
SHRC579=Erro ao inicializar cabe\u00E7alho de dados do cache compartilhado de convidado cruzado
SHRC123=%% Stale classes          \= %1$d%%\n
SHRC124=O cache est\u00E1 %1$d%% cheio\n
SHRC125=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para o buffer de sequ\u00EAncia em SH_CacheMap
SHRC126=Foi feita solicita\u00E7\u00E3o para incluir muitos itens em ClasspathItem
SHRC120=\# URLs           \= %d
SHRC121=\# Tokens         \= %d
SHRC122=\# Stale classes  \= %d
SHRC127=SH_CompositeCache\:\:enterMutex falhou com c\u00F3digo de retorno %d. Aviso\: seu cache pode estar danificado.
SHRC128=SH_CompositeCache\:\:exitMutex falhou com c\u00F3digo de retorno %d. Aviso\: seu cache pode estar danificado.
SHRC129=Tentativa de configurar readerCount como -1\!
SHRC590=A subop\u00E7\u00E3o "enableBCI" foi especificada, mas o cache existente n\u00E3o foi criado com a subop\u00E7\u00E3o "enableBCI".
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
SHRC112=ponto de aloca\u00E7\u00E3o             \= 0x%p\n
SHRC596=Executar verifica\u00E7\u00F5es extras ao armazenar e alocar dados de classe inadequados.
SHRC113=tamanho do cache       \= %d
SHRC597=-Xshareclasses\:rcdSize\=%u bytes \u00E9 maior que %u bytes de espa\u00E7o livre dispon\u00EDvel, -Xshareclasses\:rcdSize\=%u ser\u00E1 usado no lugar.
SHRC114=bytes livres       \= %d
SHRC598=A \u00E1rea de dados brutos de classe est\u00E1 corrompida porque seu tamanho de %lu \u00E9 maior que o tamanho total do cache de %lu.
SHRC115=bytes de ROMClass   \= %d
SHRC599=O espa\u00E7o livre da \u00E1rea de dados brutos de classe est\u00E1 corrompido ('in\u00EDcio do espa\u00E7o livre'\=%p, 'fim do espa\u00E7o livre'\=%p, 'tamanho livre'\=%lu bytes)
SHRC592=BCI Ativado        \= true
SHRC593=BCI Ativado        \= false
SHRC110=\nendere\u00E7o base              \= 0x%p
SHRC594=A subop\u00E7\u00E3o -Xshareclasses\:cacheRetransformed \u00E9 incompat\u00EDvel com um cache compartilhado criado com a subop\u00E7\u00E3o enableBCI
SHRC111=endere\u00E7o final               \= 0x%p
SHRC595=As op\u00E7\u00F5es da linha de comandos "%s" e "%s" s\u00E3o incompat\u00EDveis
SHRC116=Bytes de metadados   \= %d
SHRC117=%% de metadados utilizado \= %1$d%%\n
SHRC118=\# ROMClasses     \= %d
SHRC119=\# Classpaths     \= %d
J9TI006=Elimine os recursos estendidos de capabilities_ptr.
J9TI007=Obtenha o conjunto atual de recursos estendidos por meio de capabilities_ptr.
J9TI004=Retorna por meio do capabilities_ptr os recursos estendidos dispon\u00EDveis neste momento.
SHRC140=tamanho\:\t%1$d\t\t\t%2$d\n
J9TI005=Inclua os novos recursos estendidos a partir de capabilities_ptr.
J9TI008=Indica o in\u00EDcio de uma fase de compila\u00E7\u00E3o de JIT. (N\u00E3o \u00E9 seguro para retorno de chamada)
J9TI009=Indica o fim de uma fase de compila\u00E7\u00E3o de JIT. (N\u00E3o \u00E9 seguro para retorno de chamada)
SHRC145=Localizando a classe %1$s no cache compartilhado para cldr id %2$d com URL %4$.*3$s...
SHRC146=Localizando a classe %1$s no cache compartilhado para cldr id %2$d com Token %4$.*3$s...
VMUT001=(encadeamento sem nome)
SHRC147=O caractere %.*s n\u00E3o \u00E9 v\u00E1lido para nome de cache
VMUT000=(sem mem\u00F3ria)
SHRC148=Permitir acesso de grupo ao cache (usu\u00E1rio \u00E9 o padr\u00E3o)
VMUT003=Arquivo de op\u00E7\u00F5es n\u00E3o localizado
SHRC141=bytes incompat\u00EDveis\:
VMUT002=(erro de acesso)
SHRC142=\tem 0x%1$p\t\t%2$x \!\= %3$x
VMUT005=Op\u00E7\u00E3o muito grande\: '%s'
SHRC143=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com URL %5$.*4$s...
VMUT004=Op\u00E7\u00E3o malformada\: '%s'
SHRC144=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com Token %5$.*4$s...
SHRC149=Ativar Sa\u00EDda Detalhada de Localiza\u00E7\u00E3o/Armazenamento
J9TI002=Agent_OnLoad n\u00E3o localizado na biblioteca %s
J9TI003=Agent_OnLoad falhou para a biblioteca %s
J9TI000=Sem mem\u00F3ria, est\u00E1 tentando carregar a biblioteca do agente %s
J9TI001=A biblioteca do agente %1$s n\u00E3o p\u00F4de ser aberta (%2$s)
J9TI017=Controla v\u00E1rias op\u00E7\u00F5es de VM e de compila\u00E7\u00E3o.
J9TI018=Configura um m\u00E9todo para notifica\u00E7\u00E3o seletiva de entrada e sa\u00EDda.
J9TI015=Solicita um dump JLM.
J9TI016=Permitir seq\u00FCenciamento na presen\u00E7a de eventos de entrada e sa\u00EDda de m\u00E9todo (resultando em um prov\u00E1vel relat\u00F3rio impreciso de entrada e sa\u00EDda)
J9TI019=Configura o modo de notifica\u00E7\u00E3o para eventos estendidos, permitindo seletividade em n\u00EDvel de encadeamento
SHRC134=Falha em criar o conjunto em SH_ROMClassManagerImpl
VMUT010=Valor da op\u00E7\u00E3o malformado, a op\u00E7\u00E3o "%1$s%3$.*2$s" cont\u00E9m os caracteres \u00E0 direita "%4$s" que foram ignorados
SHRC135=Falha em criar tabela hash em SH_ROMClassManagerImpl
SHRC136=N\u00E3o \u00E9 poss\u00EDvel criar o monitor em SH_ROMClassManagerImpl
VMUT012=%2$.*1$s n\u00E3o \u00E9 uma superinterface direta de %4$.*3$s.
VMUT011=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para a matriz de op\u00E7\u00F5es da linha de comandos
SHRC137=MODO SEGURO\: Aviso\: ROMClass %.*s n\u00E3o corresponde a ROMClass em cache
SHRC130=Tentativa de alocar enquanto a confirma\u00E7\u00E3o ainda est\u00E1 pendente
VMUT014=A classe do receptor %2$.*1$s deve ser a classe atual ou um subtipo da interface %4$.*3$s
SHRC131=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada em ROMClassManagerImpl
VMUT013=Arquivo de op\u00E7\u00F5es %s inv\u00E1lido
SHRC132=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ROMClassManagerImpl
SHRC133=N\u00E3o \u00E9 poss\u00EDvel digitar mutex da tabela hash ROMClassManager
VMUT007=Valor malformado para JAVA_TOOL_OPTIONS
VMUT006=Op\u00E7\u00E3o malformada %s localizada em -Xoptionsfile
VMUT009=Valor malformado para -Xservice
VMUT008=Valor malformado para IBM_JAVA_OPTIONS
SHRC138=Foram localizados mais de um ROMClass \u00F3rf\u00E3os %.*s
SHRC139=\n\tROMClass sendo armazenado\tROMClass em cache
J9TI010=Entrada do m\u00E9todo com informa\u00E7\u00F5es estendidas sobre o tipo de m\u00E9todo.
J9TI013=Permite retornos de chamada para aloca\u00E7\u00F5es instrument\u00E1veis (as n\u00E3o relatadas por VMObjectAlloc).
J9TI014=Controla o JLM (Java Lock Monitor) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI011=Inclua uma op\u00E7\u00E3o -Xtrace din\u00E2mica
J9TI012=Inclua uma op\u00E7\u00E3o -Xdump din\u00E2mica
SHRC160=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao abrir o sem\u00E1foro
SHRC161=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao criar mem\u00F3ria compartilhada
SHRC162=Foi excedido o tempo limite de espera pelo mutex de cria\u00E7\u00E3o ao abrir mem\u00F3ria compartilhada
SHRC167=Desativa o compartilhamento de classe
SHRC168=Total de bytes de classe compartilhada lidos\=%1$lld. Total de bytes armazenados\=%2$d
SHRC169=Altera\u00E7\u00E3o detectada em %2$.*1$s...\n \t...%3$d classes armazenadas em cache marcadas como antigas
SHRC163=[-Xshareclasses sa\u00EDda detalhada ativada]
SHRC164=[-Xshareclasses sa\u00EDda de E/S detalhada ativada]
SHRC165=[-Xshareclasses sa\u00EDda detalhada de API Auxiliar ativada]
SHRC166=Conectado ao cache "%1$s", size\=%2$d bytes
SHRC150=Ativar Sa\u00EDda Detalhada da API Auxiliar
SHRC151=Suprimir Todas as Mensagens
SHRC156=Erro ao copiar nome do grupo para nome de cache
SHRC157=N\u00E3o \u00E9 poss\u00EDvel alocar %1$d bytes de mem\u00F3ria compartilhada solicitada \n \tM\u00E1ximo permitido de mem\u00F3ria compartilhada alocado com \u00EAxito (%2$d bytes) \n \t(Para aumentar a mem\u00F3ria compartilhada dispon\u00EDvel, modifique o valor SHMMAX do sistema)
SHRC158=Cache de classe compartilhada "%1$s" criado
SHRC159=Cache de classe compartilhada "%1$s" aberto
SHRC152=Sempre Iniciar a JVM Independentemente de Erros/Avisos
SHRC153=Especifique o nome do cache compartilhado\n \t(Use %%g para substituir nome do grupo e %%u para nome do usu\u00E1rio)
SHRC154=Caractere de escape %.*s inv\u00E1lido para nome de cache
SHRC155=Erro ao copiar nome do usu\u00E1rio para nome de cache
SHRC181=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex de tabela hash ScopeManagerImpl
SHRC182=N\u00E3o \u00E9 poss\u00EDvel criar monitor em ScopeManagerImpl
SHRC183=N\u00E3o \u00E9 poss\u00EDvel criar tabela hash em ScopeManagerImpl
SHRC184=\tParti\u00E7\u00E3o %.*s
SHRC180=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para entrada de tabela hash em ScopeManagerImpl
SHRC189=N\u00BA de M\u00E9todos AOT      \= %d
SHRC185=\tModContext %.*s
SHRC186=\tParti\u00E7\u00E3o %.*s em ModContext %.*s
SHRC187=Desativar armazenamento de dados AOT no cache compartilhado
SHRC188=Bytes de AOT          \= %d
SHRC170=Especifique o nome do cache compartilhado\n \t(Use %%u para substituir nome do usu\u00E1rio)
SHRC171=O z/OS n\u00E3o pode criar cache do tamanho solicitado\: Verifique as configura\u00E7\u00F5es de BPXPRMxx do sistema z/OS
SHRC172=N\u00E3o \u00E9 poss\u00EDvel criar o cache do tamanho solicitado devido a restri\u00E7\u00F5es do Sistema Operacional
SHRC173=Configure o diret\u00F3rio para arquivos de controle de JVM (avan\u00E7ado)
SHRC178=Ignorando a op\u00E7\u00E3o noIncrementalUpdates devido ao uso da op\u00E7\u00E3o singleJVM
SHRC179=O segmento ROMClass foi corrompido. Erro ao ler ROMClass em 0x%p
SHRC174=Ativar otimiza\u00E7\u00F5es para uso de JVM \u00FAnica
SHRC175=Tornar a persist\u00EAncia do cache al\u00E9m das reinicializa\u00E7\u00F5es (apenas Win)
SHRC176=Reloca\u00E7\u00E3o invari\u00E1vel de sequ\u00EAncia ativada
SHRC177=N\u00E3o \u00E9 poss\u00EDvel executar o modo seguro devido ao uso da op\u00E7\u00E3o singleJVM
SHRC082=N\u00E3o \u00E9 poss\u00EDvel criar identifiedMutex em SH_ClasspathManagerImpl2
J9VM039=-Xscmx ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
SHRC083=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a matriz identifiedClasspaths em SH_ClasspathManagerImpl2
SHRC084=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o item da lista vinculada
SHRC085=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o cabe\u00E7alho do item da lista vinculada
SHRC080=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para a entrada da tabela hash
SHRC081=N\u00E3o \u00E9 poss\u00EDvel criar cpeTableMutex em SH_ClasspathManagerImpl2
SHRC086=N\u00E3o \u00E9 poss\u00EDvel digitar o mutex da tabela hash ClasspathManager
SHRC087=MarkStale falhou durante ClasspathManager\:\:update()
SHRC088=Falha ao criar cache como ROMImageSegment em SH_CacheMap
SHRC089=N\u00E3o \u00E9 poss\u00EDvel criar mutex de atualiza\u00E7\u00E3o em SH_CacheMap
J9TI060=Criar uma assinatura para registros de GC detalhados
J9TI061=Cancelar uma assinatura para registros de GC detalhados
J9VM030=UTF8 inv\u00E1lido utilizado na fun\u00E7\u00E3o JNI
J9VM031=A classe requerida %2$.*1$s deveria estar no caminho de classe de inicializa\u00E7\u00E3o, mas foi localizada no caminho de classe do aplicativo em %4$.*3$s
J9TI064=A fun\u00E7\u00E3o de inicializa\u00E7\u00E3o %s do agente falhou para a biblioteca %s, c\u00F3digo de retorno %d
CDRT000=Imposs\u00EDvel localizar o mapa tempor\u00E1rio JIT - interrompendo a VM
J9VM032=Erro irrecuper\u00E1vel\: n\u00E3o \u00E9 poss\u00EDvel carregar %1$s\: %2$s
J9TI065=Fun\u00E7\u00E3o de inicializa\u00E7\u00E3o %s do agente n\u00E3o localizada na biblioteca %s
J9VM033=Erro irrecuper\u00E1vel\: falha em inicializar %s
J9TI062=Obt\u00E9m o ponteiro J9VMThread de um jthread
CDRT002=PC com Falha\: %1$p (offset %2$p), metaData \= %3$p
J9VM034=JVMRI requer um mecanismo de rastreio\: execute com o sinalizador -Xtrace
J9TI063=Obt\u00E9m o ponteiro J9Method de JMethodID
CDRT001=M\u00E9todo\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
J9VM035=Imposs\u00EDvel alocar OutOfMemoryError
J9VM036=dividir por zero
J9VM037=Falha em alocar o monitor
J9TI066=Criar uma assinatura para tracepoints de VM
J9VM038=-Xthr\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
J9TI067=Cancelar uma assinatura para tracepoints de VM
SHRC071=A op\u00E7\u00E3o da linha de comandos "%s" requer a subop\u00E7\u00E3o
J9VM028=\tem %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
SHRC072=A op\u00E7\u00E3o da linha de comandos "%s" n\u00E3o \u00E9 reconhecida
J9VM029=\tem (M\u00E9todo Desconhecido)
SHRC073=Armazenando a classe %2$.*1$s no cache compartilhado para cldr id %3$d com URL %5$.*4$s (\u00EDndice %6$d)...
SHRC074=\ Com \u00CAxito.
SHRC070=Atualiza\u00E7\u00F5es incrementais desativadas
SHRC079=N\u00E3o \u00E9 poss\u00EDvel criar a tabela hash em SH_ClasspathManagerImpl2
SHRC075=\ Falhou.
SHRC076=Localizando a classe %1$s no cache compartilhado para cldr id %2$d...
SHRC077=Falha ao criar o conjunto linkedListImpl em SH_ClasspathManagerImpl2
SHRC078=Falha ao criar o conjunto linkedListHdr em SH_ClasspathManagerImpl2
J9VM020=Procurado em %.*s
J9VM021=Sem mem\u00F3ria para mapa tempor\u00E1rio do interpretador - interrompendo a VM
J9VM022=Falha no mapa tempor\u00E1rio, resultado \= %p - interrompendo a VM
J9VM023=Isto pode indicar que JAVA_HOME est\u00E1 incorreto ou que as bibliotecas de classes n\u00E3o est\u00E3o instaladas
J9VM024=Exce\u00E7\u00E3o no encadeamento "%.*s"
J9VM025=\tem %2$.*1$s.%4$.*3$s (M\u00E9todo Nativo)
J9VM026=\tem %2$.*1$s.%4$.*3$s (Origem Desconhecida)
J9VM027=\tem %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM050=-Xjni\: op\u00E7\u00E3o n\u00E3o reconhecida --> '%s'
J9VM051=Uso\:\n
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] configurou o tamanho m\u00E1ximo da matriz em cache JNI\n
J9VM053=Op\u00E7\u00E3o malformada %s localizada em -Xoptionsfile
J9VM054=Falha ao criar um encadeamento\: retVal %1$zd, errno %2$zd
J9VM055=Erro irrecuper\u00E1vel\: A vers\u00E3o Principal de JXE \u00E9 diferente de %d
J9VM056=Vers\u00E3o principal
J9VM057=Limite do cache de monitor excedido
J9VM058=-Xscminaot ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM059=-Xscmaxaot ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
SHRC093=Foi detectado um encerramento inesperado de outra JVM durante a atualiza\u00E7\u00E3o
SHRC094=\u00D3rf\u00E3o localizado mas o ROMClass local foi transmitido para addROMClassToCache
SHRC095=As tentativas de chamar markStale nos itens de cache compartilhados falharam
SHRC096=O cache compartilhado "%s" est\u00E1 completo. Utilize -Xscmx para configurar o tamanho do cache.
SHRC090=Falha ao obter mutex de cache na inicializa\u00E7\u00E3o de SH_CacheMap
SHRC091=Leitura de dados corrompidos para o item 0x%p (dataType inv\u00E1lido)
SHRC092=Falha ADD ao ler cache
SHRC097=O cache compartilhado "%s" est\u00E1 corrompido. Nenhum novo JVM ser\u00E1 permitido para conex\u00E3o com o cache.\n \tAs JVMs existentes podem continuar a funcionar, mas n\u00E3o podem atualizar o cache.
SHRC098=\nEstat\u00EDsticas atuais para o cache %s\: \n
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s em 0x%5$p.
JITM031=O valor para '%s' n\u00E3o est\u00E1 correto
JITM032=A op\u00E7\u00E3o '%1$s' n\u00E3o est\u00E1 completa, deve especificar o par\u00E2metro '%2$s'.
J9VM040=estouro de pilha do sistema operacional
JITM030=O valor de %s especificado \u00E9 muito grande
J9VM041=n\u00FAmero incorreto de argumentos
JITM035=O tamanho de p\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado para o cache de c\u00F3digo JIT; usando %3$zu%4$s %5$s no lugar
J9VM042=Configura\u00E7\u00E3o de Encadeamento
JITM036=O tamanho de p\u00E1gina grande %1$zu%2$s %3$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado para o cache de c\u00F3digo JIT; usando %4$zu%5$s no lugar
J9VM043=-----------------------
JITM033=Caracteres extras de v\u00EDrgula foram descobertos na op\u00E7\u00E3o '-Xlp' - ignorado
J9VM044=Monitores de sistema de tr\u00EAs camadas suportados
JITM034=O tamanho de p\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado para o cache de c\u00F3digo JIT; usando %3$zu%4$s no lugar
J9VM045=Monitores de sistema de tr\u00EAs camadas n\u00E3o suportados
J9VM046=JLM suportado
J9VM047=JLM n\u00E3o suportado
JITM037=O tamanho de p\u00E1gina grande %1$zu%2$s %3$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado para o cache de c\u00F3digo JIT; usando %4$zu%5$s %6$s no lugar
J9VM048=Tempos de suspens\u00E3o de JLM suportados
J9VM049=Tempos de suspens\u00E3o de JLM n\u00E3o suportados
J9TI028=Relata o fim de um dump de RAS.
J9TI029=Consulta a configura\u00E7\u00E3o do agente de dump do RAS.
JITM019=Incompatibilidade do recurso Concurrent Scavenge. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI026=Aciona um dump utilizando a configura\u00E7\u00E3o de RAS fornecida.
J9TI027=Relata o in\u00EDcio de um dump de RAS.
J9RI019=jvmri->InjectOutOfMemory n\u00E3o suportado.
J9RI017=N\u00E3o \u00E9 poss\u00EDvel alocar agente de dump em jvmri->SetOutOfMemoryHook, fun\u00E7\u00E3o n\u00E3o registrada.
J9RI018=jvmri->NotifySignal emitindo o sinal %d.
JITM020=Incompatibilidade do recurso Software Read Barrier. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM021=Incompatibilidade do recurso TM. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM024=Incompatibilidade do Compressedrefs Shift. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI020=Obt\u00E9m o ID de encadeamento de S.O. de um jthread
J9RI015=jvmri->RunDumpRoutine\: componentId est\u00E1 fora dos limites.
JITM025=O SCC \u00E9 muito grande para que o JIT codifique corretamente os deslocamentos. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI021=Obter informa\u00E7\u00F5es estendidas sobre o quadro
J9RI016=jvmri->SetOutOfMemoryHook foi chamado com retorno de chamada nulo, fun\u00E7\u00E3o n\u00E3o registrada.
JITM022=Incompatibilidade do Lockword. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9RI013=jvmri->ReleaseRasInfo\: a estrutura tem campo de tipo n\u00E3o suportado.
JITM023=Incompatibilidade do Arraylet Size. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9RI014=jvmri->RunDumpRoutine\: imposs\u00EDvel recuperar dados do componente.
JITM028=A configura\u00E7\u00E3o do sistema n\u00E3o suporta o par\u00E2metro '%.*s' na op\u00E7\u00E3o '-Xlp'
J9TI024=Sa\u00EDda de m\u00E9todo sem o valor de retorno.
J9RI011=A estrutura RasInfo tem campo de tipo n\u00E3o suportado.
JITM029=%s deve ser seguido por um n\u00FAmero
J9TI025=Permitir JNI direta na presen\u00E7a de eventos de entrada e sa\u00EDda de m\u00E9todo (resultando em um prov\u00E1vel relat\u00F3rio impreciso de entrada e sa\u00EDda)
J9RI012=jvmri->ReleaseRasInfo foi chamado com a estrutura RasInfo nula.
JITM026=Problema desconhecido. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI022=Obter informa\u00E7\u00F5es estendidas sobre o quadro para todos os rastreios de pilha
JITM027=O JIT falhou ao alocar mem\u00F3ria
J9TI023=Obter informa\u00E7\u00F5es estendidas sobre o quadro para uma lista de encadeamento
J9RI010=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
J9TI039=Destruir um cache compartilhado nomeado.
JITM008=A valida\u00E7\u00E3o do cabe\u00E7alho da AOT falhou; o bit de integridade do in\u00EDcio do sinalizador de recurso est\u00E1 codificado. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI037=Obter a mem\u00F3ria total do heap.
JITM009=A valida\u00E7\u00E3o do cabe\u00E7alho da AOT falhou; o bit de integridade do t\u00E9rmino do sinalizador de recurso est\u00E1 codificado. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI038=Iterar sobre caches compartilhados.
J9RI008=jvmri->GetRasInfo n\u00E3o consegue obter componentes.
J9RI009=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
J9RI006=jvmri->GetRasInfo foi chamado com a estrutura RasInfo nula.
J9RI007=jvmri->GetRasInfo n\u00E3o consegue alocar mem\u00F3ria.
JITM010=Incompatibilidade de recurso de SMP. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
JITM013=Incompatibilidade do recurso Disable Traps. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI031=Cancela o evento ass\u00EDncrono em um \u00FAnico encadeamento ou em todos os encadeamentos
J9RI004=jvmri->DynamicVerbosegc n\u00E3o suportado.
JITM014=Incompatibilidade do recurso TLH Prefetch. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI032=Indica que um encadeamento processou o evento ass\u00EDncrono
J9RI005=O componente %s de jvmri->GetComponentDataArea n\u00E3o tem dataArea nesta vm.
JITM011=Incompatibilidade do recurso de refer\u00EAncia compactada. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9RI002=jvmri->DumpRegister foi chamado com callback NULL, fun\u00E7\u00E3o n\u00E3o registrada.
JITM012=Incompatibilidade do recurso DFP. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI030=Sinaliza o evento ass\u00EDncrono em um \u00FAnico encadeamento ou em todos os encadeamentos
J9RI003=N\u00E3o \u00E9 poss\u00EDvel alocar agente de dump em jvmri->DumpRegister, fun\u00E7\u00E3o n\u00E3o registrada.
JITM017=Incompatibilidade do recurso SIMD Enabled. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI035=Ciclo de coleta de lixo conclu\u00EDdo.
J9RI000=jvmri->CreateThread n\u00E3o pode alocar mem\u00F3ria de argumentos de encadeamento
JITM018=Incompatibilidade do recurso Async Compilation. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI036=Obter a mem\u00F3ria livre do heap atual.
J9RI001=Erro interno ao remover o agente de dump em jvmri->DumpDeregister, fun\u00E7\u00E3o pode n\u00E3o ter registro removido.
JITM015=Incompatibilidade do recurso Method Trampoline. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI033=Reconfigure as op\u00E7\u00F5es de dump de VM.
JITM016=Incompatibilidade do recurso HCR Enabled. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI034=Ciclo de coleta de lixo iniciado.
J9VM017=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para a matriz de op\u00E7\u00F5es da linha de comandos
J9VM018=N\u00E3o foi poss\u00EDvel alocar mem\u00F3ria para o conjunto de tabelas de carregamento da biblioteca compartilhada
J9VM019=Erro irrecuper\u00E1vel\: n\u00E3o \u00E9 poss\u00EDvel localizar e inicializar a classe obrigat\u00F3ria %.*s
J9TI048=Obt\u00E9m os metadados de rastreio que podem ser usados com o formatador para processar buffers de rastreio
J9TI049=Os nomes de Classe de Retorno, M\u00E9todo e Pacote para um conjunto de ponteiros do M\u00E9todo RAM
JITM002=Falha ao armazenar c\u00F3digo AOT no cache de classe compartilhado. O cache de classe compartilhado pode estar danificado. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9TI042=Sinalizar tags autom\u00E1ticas para o objeto recentemente alocado e sua classe.
JITM003=Falha durante a inicializa\u00E7\u00E3o do tempo de execu\u00E7\u00E3o de AOT. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9VM010=Falha em inicializar %s
J9TI043=Sinalizar carregamento de classe apenas para classes de matriz.
JITM000=hardware N\u00E3o Suportado [%d].
J9VM011=N\u00E3o foi poss\u00EDvel carregar %1$s\: %2$s
J9TI040=Inclui o recurso estendido can_autotag_objects.
JITM001=N\u00E3o h\u00E1 mais espa\u00E7o para o c\u00F3digo AOT no cache de classe compartilhado. O novo c\u00F3digo AOT n\u00E3o ser\u00E1 gerado.
J9VM012=N\u00E3o foi poss\u00EDvel descarregar %1$s\: %2$s
J9TI041=Sinalizar o evento renomeado por objeto(s) (movido ou exclu\u00EDdo).
JITM006=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado com a pol\u00EDtica de coleta de lixo atual. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9VM013=Erro de inicializa\u00E7\u00E3o na fun\u00E7\u00E3o %1$s(%2$d)\: %3$s
J9TI046=Cancelar uma assinatura para registros de rastreio externos
JITM007=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado com as configura\u00E7\u00F5es atuais de JVMPI ou JVMTI. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9VM014=Erro de encerramento na fun\u00E7\u00E3o %1$s(%2$d)\: %3$s
J9TI047=Todos os registros de rastreio em uso s\u00E3o alternados e passados para assinantes do rastreio
JITM004=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado no processador atual. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9VM015=Erro de inicializa\u00E7\u00E3o para a biblioteca %1$s(%2$d)\: %3$s
J9TI044=Excluir todas as tags de objeto.
JITM005=O c\u00F3digo AOT no cache de classe compartilhado n\u00E3o pode ser executado no release atual da JVM. Ignorando c\u00F3digo AOT no cache de classe compartilhado.
J9VM016=Erro de encerramento para a biblioteca %1$s(%2$d)\: %3$s
J9TI045=Criar uma assinatura para registros de rastreio externos
MECK001=Op\u00E7\u00E3o -Xcheck\:memory n\u00E3o reconhecida\: %s
J9VM006=Op\u00E7\u00E3o de linha de comandos inv\u00E1lida\: %s
MECK000=Ocorreu um erro ao inicializar o utilit\u00E1rio -Xcheck\:memory
J9VM007=Op\u00E7\u00E3o de linha de comandos n\u00E3o reconhecida\: %s
J9VM008=J9VMDllMain n\u00E3o localizado
J9TI059=Obter a quantia de mem\u00F3ria nativa usada pela JVM, quebrada dentro das categorias de mem\u00F3ria.
MECK002=Ocorreu um erro ao criar a estrutura de dados do site de chamada. As informa\u00E7\u00F5es do site de chamada n\u00E3o ser\u00E3o exibidas
J9VM009=J9VMDllMain falhou
J9TI050=Obter um c\u00F3digo hash para o monitor de um objeto.
J9TI053=Configurar as op\u00E7\u00F5es de log da VM.
J9TI054=Solicitar um dump de Java Lock Monitor (JLM) com um especificador de formato.
J9VM000=Valor malformado para IBM_JAVA_OPTIONS
J9TI051=Limpar o sinalizador per-method para notifica\u00E7\u00E3o seletiva de entrada e sa\u00EDda.
J9VM001=Valor malformado para -Xservice
J9TI052=Consultar as op\u00E7\u00F5es atuais de log da VM.
J9VM002=Arquivo de op\u00E7\u00F5es n\u00E3o localizado
J9TI057=N\u00E3o foi poss\u00EDvel converter as sequ\u00EAncias nativas das op\u00E7\u00F5es de log da JVM.
J9VM003=O compilador JIT "%s" n\u00E3o foi localizado. Ser\u00E1 utilizado o interpretador.
J9TI058=N\u00E3o foi poss\u00EDvel configurar as op\u00E7\u00F5es de log da JVM.
J9VM004=N\u00E3o \u00E9 poss\u00EDvel carregar a biblioteca requerida por\: %s
J9TI055=N\u00E3o foi poss\u00EDvel alocar o buffer para as op\u00E7\u00F5es de log da JVM.
J9VM005=Valor inv\u00E1lido para a vari\u00E1vel de ambiente\: %s
J9TI056=N\u00E3o foi poss\u00EDvel consultar as op\u00E7\u00F5es de log da JVM.
PORT033=Falha ao detectar um Hypervisor Suportado.
PORT032=Falha na opera\u00E7\u00E3o relacionada ao Hypervisor.
PORT031=Foi recebida a condi\u00E7\u00E3o LE %s%i, que corresponde a um sinal POSIX criado pelo software
PORT030=%s configura\u00E7\u00E3o "%s" especifica que o core dump deve ser canalizado para um programa externo.  Tentando renomear core ou core.%d.\n
PORT037=N\u00E3o est\u00E1 sendo executado em um Hypervisor.
PORT036=C\u00F3digo de retorno inesperado de servi\u00E7o CSRSI no z/OS
PORT035=Falha de __malloc31 ao alocar buffer no z/OS
PORT034=Tentativa de anexar mem\u00F3ria compartilhada criada na chave de prote\u00E7\u00E3o de mem\u00F3ria %lu, mas executando atualmente na chave %lu.
PORT039=Falha na atualiza\u00E7\u00E3o de HYPFS
PORT038=Valor malformado para IBM_JAVA_HYPERVISOR_SETTINGS
PORT022=Anexando .X&DS ao template de dump especificado pelo usu\u00E1rio para ativar dumps multipartes.
PORT021=Voc\u00EA abriu um sem\u00E1foro compartilhado do System V antigo\: arquivo\:%1$s semid\:%2$d
PORT020=Voc\u00EA abriu uma mem\u00F3ria compartilhada do System V antiga\: arquivo\:%1$s shmid\:%2$d
PORT026=O arquivo especificado \u00E9 um diret\u00F3rio.
PORT025=Tipo de trava inv\u00E1lido para a opera\u00E7\u00E3o de trava de arquivo. lockFlags\: %1$d
PORT024=IEATDUMP falhou porque n\u00E3o foi poss\u00EDvel alocar o conjunto de dados de dump (verificar permiss\u00F5es de espa\u00E7o em disco e campo).
PORT023=IEATDUMP falhou porque o template de dump especificado pelo usu\u00E1rio era muito longo. Tentando novamente o dump com o template padr\u00E3o.
PORT029=Identificador inv\u00E1lido. identificador de arquivos\: %1$d.
PORT028=Falha no mmap devido \u00E0s op\u00E7\u00F5es de mapeamento inv\u00E1lidas.
PORT027=Falha no mmap devido ao par\u00E2metro de prote\u00E7\u00E3o de mem\u00F3ria inv\u00E1lido.
PORT011=Imposs\u00EDvel alocar mem\u00F3ria durante a tentativa de carregar uma biblioteca compartilhada
PORT010=A permiss\u00E3o para carregar a biblioteca compartilhada n\u00E3o foi concedida
PORT015=Imposs\u00EDvel resolver refer\u00EAncias da biblioteca compartilhada - uma biblioteca compartilhada de pr\u00E9-requisito pode estar ausente
PORT014=Falha ao carregar dll, pois n\u00E3o foi localizado
PORT013=Erro no carregamento da biblioteca compartilhada - a tabela dll n\u00E3o p\u00F4de ser localizada
PORT012=Erro no carregamento da biblioteca compartilhada devido a bits PACE sendo configurados
PORT019=N\u00E3o foi poss\u00EDvel criar diret\u00F3rio %s.  As classes compartilhadas ser\u00E3o desativadas at\u00E9 que este diret\u00F3rio seja criado.
PORT018=Falha na Opera\u00E7\u00E3o\: %1$d (%2$s falhou\: %3$d)
PORT017=Falha na Opera\u00E7\u00E3o\: %d
PORT016=Erro Interno %i
PORT000=
ZIPS000=Imposs\u00EDvel abrir %1$s (%2$s)
ZIPS001=Imposs\u00EDvel abrir %s (Exporta\u00E7\u00E3o ausente)
PORT009=A biblioteca compartilhada especificada n\u00E3o foi localizada
PORT004=Falha de resolu\u00E7\u00E3o de s\u00EDmbolo
PORT003=O m\u00F3dulo dependente %s n\u00E3o p\u00F4de ser carregado
PORT002=Erro desconhecido ao carregar a biblioteca compartilhada
PORT001=Falha ao alocar mem\u00F3ria durante a tentativa de gravar em um arquivo.
PORT008=O m\u00F3dulo n\u00E3o \u00E9 a arquitetura correta
J9RI022=O JVMRI de inicializa\u00E7\u00E3o n\u00E3o pode alocar o monitor de dump jvmri
PORT007=O m\u00F3dulo especificado n\u00E3o \u00E9 um m\u00F3dulo
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister e TraceListener n\u00E3o s\u00E3o mais suportados, usa novas vers\u00F5es em JVMRAS_VERSION_1_5
PORT006=O formato do m\u00F3dulo n\u00E3o est\u00E1 correto
J9RI020=jvmri->CreateThread n\u00E3o consegue alocar monitor privado
PORT005=N\u00E3o foi poss\u00EDvel carregar a biblioteca compartilhada
J9RI021=jvmri->RunDumpRoutine n\u00E3o suportado.
J9VM070=mem\u00F3ria nativa esgotada durante a liga\u00E7\u00E3o do m\u00E9todo nativo %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM071=tentativa de ligar recursivamente o m\u00E9todo nativo %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM072=mem\u00F3ria nativa esgotada
J9VM073=Classe %2$.*1$s acessando ilegalmente o membro %3$s da classe %5$.*4$s
J9VM074=Classe %2$.*1$s acessando ilegalmente classe %3$s %5$.*4$s
J9VM075=opera\u00E7\u00E3o ilegal no encadeamento eventron
J9VM076=mem\u00F3ria nativa esgotada ao alocar entrada da lista para objeto finaliz\u00E1vel ou de refer\u00EAncia
J9VM077=Nota\: -Xdfpbd n\u00E3o tem efeito neste release do Java
J9VM078=Valor malformado para JAVA_TOOL_OPTIONS
J9VM079=triggerOneOffDump(%1$s) requer %2$s
J9VM060=runNamedDump(%1$s) requer %2$s
J9VM061=insertDumpAgent requer %s
J9VM062=removeDumpAgent requer %s
J9VM063=seekDumpAgent requer %s
J9VM064=setDumpOption requer %s
J9VM065=o objeto n\u00E3o \u00E9 uma inst\u00E2ncia da classe de declara\u00E7\u00E3o
J9VM066=incompatibilidade de tipo de argumento
J9VM067=-Xshareclasses n\u00E3o ativado, op\u00E7\u00E3o -Xzero\:sharezip ignorada
J9VM068=-Xshareclasses n\u00E3o ativado, op\u00E7\u00E3o -Xzero\:sharestring ignorada
J9VM069=viola\u00E7\u00E3o de restri\u00E7\u00E3o de carregamento\: o carregador de classes "%2$.*1$s@%3$x" iniciou anteriormente o carregamento de um tipo diferente com o nome "%5$.*4$s" definido pelo carregador de classes "%7$.*6$s@%8$x"
SHRC500=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o endere\u00E7o inferior do espa\u00E7o livre %p, \u00E9 maior do que o endere\u00E7o superior do espa\u00E7o livre %p
SHRC505=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o endere\u00E7o superior do espa\u00E7o livre %p menos o endere\u00E7o inferior do espa\u00E7o livre %p excede o tamanho da regi\u00E3o de depura\u00E7\u00E3o de %lu bytes
SHRC506=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque seu tamanho de %lu \u00E9 maior do que o tamanho do cache total de %u armazenado no cabe\u00E7alho do cache
J9VM090=Resposta lenta \u00E0 consulta de rede (%d segundos), verifique a configura\u00E7\u00E3o de DNS de IP
SHRC507=Execute verifica\u00E7\u00F5es extras ao armazenar e alocar os dados de depura\u00E7\u00E3o de classe
J9VM091=Rota\u00E7\u00E3o adapt\u00E1vel suportada
SHRC508=Adquirido um sem\u00E1foro diferente daquele usado anteriormente com este cache. Antigo semid\=%d, novo semid\=%d
J9VM092=Rota\u00E7\u00E3o adapt\u00E1vel n\u00E3o suportada
SHRC501=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o endere\u00E7o inferior de 'dados da tabela do n\u00FAmero da linha' %p, \u00E9 maior do que o endere\u00E7o superior %p
J9VM093=Esta vers\u00E3o do Java requer uma CPU que suporte SSE2 ou extens\u00F5es posteriores.  Consulte as informa\u00E7\u00F5es sobre 'Supported Environments' no IBM Java User Guide para obter mais detalhes.
SHRC502=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o endere\u00E7o inferior dos 'dados da tabela de vari\u00E1vel local' %p, \u00E9 maior do que o endere\u00E7o superior %p
J9VM094=O encadeamento "%s" ainda est\u00E1 ativo ap\u00F3s a execu\u00E7\u00E3o dos ganchos de encerramento.
SHRC503=A \u00E1rea de depura\u00E7\u00E3o est\u00E1 danificada porque o armazenamento dos bytes da 'tabela de n\u00FAmero da linha' %d  e dos bytes da 'tabela de vari\u00E1vel local' %d resultar\u00E1 em um endere\u00E7o superior de 'dados da tabela de n\u00FAmero da linha' de %p, que ser\u00E1 maior do que o novo endere\u00E7o inferior de dados da 'tabela de vari\u00E1vel local' %p
J9VM095=viola\u00E7\u00E3o de restri\u00E7\u00E3o de carregamento ao resolver o m\u00E9todo "%2$.*1$s.%4$.*3$s%6$.*5$s" \: o carregador de classes "%8$.*7$s@%9$x" da classe "%11$.*10$s" e o carregador de classes "%13$.*12$s@%14$x" da classe "%16$.*15$s" possuem tipos diferentes para a assinatura de m\u00E9todo
SHRC504=O in\u00EDcio dos dados em cache \u00E9 nulo. In\u00EDcio de dados\: %p
J9VM096=-Xscdmx ser\u00E1 ignorado se -Xshareclasses n\u00E3o for especificado
J9VM097=\n Uso\:\n
J9VM098=-Xsyslog\:help              Imprimir ajuda da -Xsyslog da JVM.
J9VM099=-Xsyslog\:none              Desativar as op\u00E7\u00F5es de log da JVM anteriormente especificadas, incluindo os padr\u00F5es.
SHRC509=Crie um cache uma gera\u00E7\u00E3o mais antiga do que a gera\u00E7\u00E3o atual.
PORT040=Falha na leitura de HYPFS
PORT044=Falha ao alocar mem\u00F3ria enquanto recupera informa\u00E7\u00F5es do hypervisor.
PORT043=%1$d\: Falha ao recuperar Informa\u00E7\u00F5es de %2$s.
PORT042=N\u00E3o foi poss\u00EDvel ler /proc/sysinfo
PORT041=HYPFS n\u00E3o montado
J9VM080=queryVmDump requer %s
J9VM081=Valor da op\u00E7\u00E3o malformado, a op\u00E7\u00E3o "%1$s%3$.*2$s" cont\u00E9m os caracteres \u00E0 direita "%4$s" que foram ignorados
J9VM082=N\u00E3o foi poss\u00EDvel alternar para o processador IFA - emita "extattr +a lib%s.so"
J9VM083=Erro ao alternar para o processador IFA, rc\: %08x
J9VM084=Erro de IFA\: c\u00F3digo de retorno inesperado %08x do servi\u00E7o de comutador IFA
J9VM085=Op\u00E7\u00E3o malformada\: '%s'
PORT048=Falha ao criar dump do sistema, pois um arquivo "%s" n\u00E3o comum existe com o mesmo nome que o arquivo de dump do sistema esperado
J9VM086=Op\u00E7\u00E3o muito grande\: '%s'
PORT047=Mem\u00F3ria de buffer insuficiente ao tentar carregar uma biblioteca compartilhada
J9VM087=resetDumpOption requer %s
PORT046=N\u00E3o foi poss\u00EDvel abrir o execut\u00E1vel
J9VM088=Aviso\: syscorepath n\u00E3o foi configurado, o que pode impedir a gera\u00E7\u00E3o do arquivo principal do sistema (se algum for necess\u00E1rio).\n\t\tConsulte as instru\u00E7\u00F5es de instala\u00E7\u00E3o do WebSphere Real Time para as defini\u00E7\u00F5es de configura\u00E7\u00E3o adequadas de syscorepath.\n\t\tNOTA\: O syscorepath deve ser configurado cada vez que a m\u00E1quina \u00E9 reiniciada.
PORT045=Falha ao alocar mem\u00F3ria durante a recupera\u00E7\u00E3o das informa\u00E7\u00F5es do sistema.
J9VM089=Aviso\: n\u00E3o foi poss\u00EDvel verificar as configura\u00E7\u00F5es de syscorepath usando o sysconfig\: %s.
SHRC400=Bytes de cache de Zip                     %*c\= %d
SHRC401=\# Caches de Zip %*c\= %d
SHRC406=endere\u00E7o de in\u00EDcio dos metadados              %*c\= 0x%p
SHRC407=sinalizadores de tempo de execu\u00E7\u00E3o %*.c\= 0x%.16llX
SHRC408=gera\u00E7\u00E3o de cache %*.c\= %d\n
SHRC409=Bytes de c\u00F3digo de AOT %*c\= %d
SHRC402=Bytes de dados de JIT %*c\= %d
SHRC403=Bytes usados da \u00E1rea de depura\u00E7\u00E3o da classe         %*c\= %u
SHRC404=Falha ao obter um diret\u00F3rio para o cache
SHRC405=Falha ao criar um diret\u00F3rio para o cache
SHRC420=\# Entradas de Dados de AOT %*c\= %d
SHRC421=\# Hierarquia de Classe de AOT               %*c\= %d
SHRC422=\# Thunks de AOT %*c\= %d
SHRC423=\# Hints de JIT %*c\= %d
SHRC428=Removida a gera\u00E7\u00E3o mais antiga do cache de classe compartilhado "%s"
SHRC429=Falha ao remover a gera\u00E7\u00E3o mais antiga do cache de classe compartilhado "%s"
SHRC424=\# Perfis de JIT %*c\= %d
SHRC425=\# Objetos Java %*c\= %d
SHRC426=\# Entradas de JCL %*c\= %d
SHRC427=Modificador usado para imprimir as estat\u00EDsticas de cache detalhadas
SHRC410=Bytes de dados de AOT %*c\= %d
SHRC411=Bytes de hierarquia de classes de AOT                       %*c\= %d
SHRC412=Bytes de thunk de AOT %*c\= %d
SHRC417=Bytes de dados de JCL %*c\= %d
SHRC418=Bytes de dados de byte %*c\= %d
SHRC419=Bytes da classe LocalVariableTable      %*c\= %u
SHRC413=Bytes de sugest\u00E3o de JIT %*c\= %d
SHRC414=Bytes de perfil de JIT %*c\= %d
SHRC415=Bytes de Objeto Java %*c\= %d
SHRC416=Bytes de ReadWrite %*c\= %d
SHRC442=O cache compartilhado "%s" est\u00E1 corrompido. O c\u00F3digo de distor\u00E7\u00E3o \u00E9 %d. O valor corrompido \u00E9 0x%p. Nenhum novo JVM ser\u00E1 permitido para conex\u00E3o com o cache.\n \tAs JVMs existentes podem continuar a funcionar, mas n\u00E3o podem atualizar o cache.
SHRC443=O cache CRC est\u00E1 indicando incorretamente um cache corrompido. Cache de CRC incorreto\: 0x%x.
SHRC444=Leia os dados corrompidos para o cabe\u00E7alho de entrada de cache 0x%p (comprimento do item inv\u00E1lido)
SHRC445=O tamanho do cache \u00E9 muito pequeno para ser \u00FAtil. Tamanho do cache inv\u00E1lido\: 0x%x.
SHRC440=O valor do -XscminJIT \u00E9 maior que o valor do -Xscmx, ent\u00E3o, ele foi configurado para um valor igual ao do -Xscmx
SHRC441=O valor do -XscmaxJIT \u00E9 maior que o valor do -Xscmx, ent\u00E3o, ele foi configurado para ilimitado
SHRC446=Falha ao adquirir o bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho durante a inicializa\u00E7\u00E3o do cache com o c\u00F3digo de erro\: %d.
SHRC447=Os dados de identifica\u00E7\u00E3o do cabe\u00E7alho do cache n\u00E3o s\u00E3o v\u00E1lidos. O endere\u00E7o da sequ\u00EAncia de caracteres em destaque no cabe\u00E7alho do cache\: 0x%p.
SHRC448=O campo do tamanho do cache no cabe\u00E7alho do cache n\u00E3o \u00E9 v\u00E1lido. O tamanho do cache no cabe\u00E7alho do cache \u00E9\: 0x%x.
SHRC449=O preenchimento \u00E9 diferente de zero. Os bytes de preenchimento no cabe\u00E7alho do cache s\u00E3o\: %u.
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC432=\ Assinatura\: %2$.*1$s Endere\u00E7o\: 0x%3$p
SHRC433=\tpara ROMClass %2$.*1$s em 0x%3$p.
SHRC434=O Value\=%d passado pela op\u00E7\u00E3o -Xitsn est\u00E1 fora do intervalo dos valores de n\u00FAmeros primos suportados pela VM. Intervalo suportado \= 0 - %u
SHRC430=Falha ao remover a gera\u00E7\u00E3o atual do cache de classe compartilhado"%s"
SHRC439=O valor do -XscminJIT n\u00E3o deve ser maior que o valor do -XscmaxJIT
SHRC435=-Xitsn%2$u usa %1$u bytes de mem\u00F3ria, que \u00E9 maior do que o tamanho do cache de classes compartilhado de %3$u bytes
SHRC436=Erro ao adquirir bloqueio de grava\u00E7\u00E3o do cabe\u00E7alho de arquivo do cache de classe compartilhado
SHRC437=Erro ao liberar o bloqueio de leitura do cabe\u00E7alho do arquivo do cache de classe compartilhado
SHRC438=Desativar o armazenamento dos dados de JIT no cache compartilhado
JNCK101=Erro de JNI em %1$s\: O argumento \#%2$d deve ser est\u00E1tico, mas um ID de campo n\u00E3o est\u00E1tico \u00E9 passado para o JNI
JNCK102=Erro de JNI em %1$s\: o argumento \#%2$d deve ser n\u00E3o est\u00E1tico, mas um ID de campo est\u00E1tico \u00E9 passado para o JNI
JNCK100=Aviso JNI em %1$s\: esta fun\u00E7\u00E3o n\u00E3o pode ser usada com objetos empacotados. Em vez disso, use %2$s.
SHRC464=Ativar sa\u00EDda detalhada de dados JIT
SHRC465=[-Xshareclasses sa\u00EDda detalhada de dados JIT ativada]
SHRC466=Localizados %1$s dados anexados para %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC467=Falha ao localizar %1$s dados anexados para %8$.*7$s.%4$.*3$s.%6$.*5$s, motivo\:%2$s
SHRC460=Desativar o armazenamento dos dados de JIT no cache compartilhado
SHRC461=O valor -Xscminjitdata n\u00E3o deve ser maior do que o valor -Xscmaxjitdata
SHRC462=O valor -Xscminjitdata \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado para ser igual ao valor -Xscmx
SHRC463=O valor -Xscmaxjitdata \u00E9 maior do que o valor -Xscmx, portanto, ele foi configurado como ilimitado
SHRC468=Armazenados %1$s dados anexados para %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC469=Falha ao armazenar 1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\:%2$s
J9GC084=A resolu\u00E7\u00E3o de clock do S.O. indica n\u00E3o suportar o tempo de pausa do destino solicitado.  Substituindo devido \u00E0 op\u00E7\u00E3o da linha de comandos -Xgc\:overrideHiresTimerCheck
J9GC083=Falha ao inicializar, a ocupa\u00E7\u00E3o variada suporta apenas -Xgcpolicy\:balanced
J9GC086=Falha ao instanciar metadados de refer\u00EAncia compactados; %1$zu%2$s solicitado
J9GC085=tamanho inicial dos metadados de refer\u00EAncias compactados
J9GC088=O tamanho %1$zu%2$s de p\u00E1gina objectheap solicitado n\u00E3o p\u00F4de ser satisfeito; em vez disso, %3$zu%4$s  est\u00E1 em uso
J9GC087=N\u00E3o \u00E9 poss\u00EDvel satisfazer o tamanho de heap %1$zu%2$s com o tamanho da p\u00E1gina %3$zu%4$s. O tamanho de heap pode ser especificado com -Xmx
J9GC089=A op\u00E7\u00E3o -Xgc\:preferredHeapBase n\u00E3o \u00E9 suportada no z/OS.
SHRC453=Listar todos os elementos em cache, incluindo classes \u00F3rf\u00E3s
SHRC454=Desativar verifica\u00E7\u00E3o se o ID do sem\u00E1foro SysV atual \u00E9 o mesmo que o ID do sem\u00E1foro SysV em cache
SHRC455=For\u00E7ar verifica\u00E7\u00E3o da tabela da sequ\u00EAncia na inicializa\u00E7\u00E3o
SHRC456=For\u00E7ar descoberta de uma mudan\u00E7a no ID da constru\u00E7\u00E3o VM
SHRC450=O campo de comprimento dos dados no cabe\u00E7alho do cache n\u00E3o \u00E9 v\u00E1lido. O comprimento dos dados no cabe\u00E7alho do cache \u00E9 \: %u.
SHRC451=O campo de in\u00EDcio dos dados no cabe\u00E7alho do cache n\u00E3o \u00E9 v\u00E1lido. O endere\u00E7o de in\u00EDcio dos dados no cabe\u00E7alho do cache\: 0x%p.
SHRC452=Desativar prote\u00E7\u00E3o da mem\u00F3ria da \u00E1rea de leitura/grava\u00E7\u00E3o (tabela da sequ\u00EAncia)
SHRC457=Nome de cache inv\u00E1lido, o nome de cache "%.*s" cont\u00E9m apenas espa\u00E7o em branco ou est\u00E1 vazio
SHRC458=Desativar o compartilhamento de classe sem desativar APIs do utilit\u00E1rio
SHRC459=Desativar o compartilhamento de classe e APIs do utilit\u00E1rio
SHRC480=muitas atualiza\u00E7\u00F5es durante a leitura
SHRC481=cache est\u00E1 corrompido
J9GC071=O valor para '%s' n\u00E3o est\u00E1 correto
J9GC070=Falha ao inicializar o Coletor de Lixo
SHRC002=em uso
SHRC486=Espa\u00E7o reservado para bytes de dados JIT         %*c\= %d
SHRC003=\u00FAltima desconex\u00E3o
SHRC487=Espa\u00E7o m\u00E1ximo para bytes de dados JIT         %*c\= %d
SHRC004=N\u00E3o \u00E9 poss\u00EDvel destruir o cache %s
SHRC488=O total dos valores de -Xscminaot e -Xscminjitdata n\u00E3o deve ser maior do que o tamanho do cache dispon\u00EDvel
SHRC005=N\u00E3o existem caches de classe de compartilhamento
SHRC489=Se o cache aberto estiver marcado como danificado, acione um evento dump de cache
SHRC482=endere\u00E7o n\u00E3o est\u00E1 no cache
SHRC483=atualiza\u00E7\u00E3o de cache com falha
SHRC000=Cache Compartilhado
SHRC484=Espa\u00E7o reservado para bytes AOT         %*c\= %d
SHRC001=OS shmid
SHRC485=Espa\u00E7o m\u00E1ximo para bytes AOT         %*c\= %d
J9GC069=Falha ao inicializar encadeamento de finaliza\u00E7\u00E3o
SHRC006=O n\u00FAmero de cache expirado nos \u00FAltimos %1$d minutos \u00E9 %2$d
SHRC007=Falha em remover o cache de classe compartilhado "%s"
SHRC008=Cache compartilhado criado\: %1$s de tamanho\: %2$d bytes
SHRC009=Cache compartilhado aberto\: %1$s de tamanho\: %2$d bytes
J9GC062=O valor %s deve ser uma pot\u00EAncia de dois
J9GC061=tamanho m\u00E1ximo de espa\u00E7o de mem\u00F3ria com escopo definido
J9GC064=Falha ao alocar espa\u00E7o antigo
J9GC063=N\u00E3o \u00E9 poss\u00EDvel abrir nome do arquivo '%s' para grava\u00E7\u00E3o
J9GC066=A geometria de mem\u00F3ria de heap dividida necess\u00E1ria n\u00E3o p\u00F4de ser alocada
J9GC065=Falha ao alocar novo espa\u00E7o
J9GC068=ScopedMemory.join/joinAndEnter interrompido
J9GC067=Falha ao instanciar o heap dividido\: %1$s (novo tamanho %2$zu%3$s, tamanho antigo %4$zu%5$s)
SHRC470=Atualizados %1$s dados anexados para %7$.*6$s.%3$.*2$s%5$.*4$s
J9GC080=A configura\u00E7\u00E3o do sistema n\u00E3o suporta o par\u00E2metro '%.*s' na op\u00E7\u00E3o '-Xlp'
J9GC082=A solicita\u00E7\u00E3o para %1$s tamanho de p\u00E1gina %2$zu%3$s%4$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado; usando %5$zu%6$s%7$s no lugar
J9GC081=Caracteres extras de v\u00EDrgula foram descobertos na op\u00E7\u00E3o '-Xlp' - ignorado
SHRC475=n\u00E3o existem dados
SHRC476=dados j\u00E1 existem
SHRC477=sem espa\u00E7o em cache para %d bytes
SHRC478=tamanho dos dados %d maior do que o dispon\u00EDvel %d
SHRC471=Falha ao atualizar %1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\:%2$s
SHRC472=sem acesso para o recurso
SHRC473=enterWriteMutex com falha
SHRC474=enterReadMutex com falha
SHRC479=aloca\u00E7\u00E3o de mem\u00F3ria de %d bytes com falha
J9GC073=O tamanho de p\u00E1gina grande %1$zu%2$s %3$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado; usando %4$zu%5$s no lugar
J9GC072=O tamanho de p\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado; usando %3$zu%4$s %5$s no lugar
J9GC075=Ocorreu um erro ao analisar a op\u00E7\u00E3o '-Xlp'
J9GC074=O tamanho de p\u00E1gina grande %1$zu%2$s %3$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado; usando %4$zu%5$s %6$s no lugar
J9GC077=A configura\u00E7\u00E3o do sistema n\u00E3o suporta o tamanho de p\u00E1gina grande %1$zu%2$s %3$s solicitado
J9GC076=A configura\u00E7\u00E3o do sistema n\u00E3o suporta o tamanho de p\u00E1gina grande %1$zu%2$s solicitado
J9GC079=A op\u00E7\u00E3o '%1$s' n\u00E3o est\u00E1 completa, deve especificar o par\u00E2metro '%2$s'.
J9GC078='%1$s' n\u00E3o est\u00E1 especificado como o primeiro par\u00E2metro na op\u00E7\u00E3o '%2$s'
SHRC024=erro de desconex\u00E3o de mem\u00F3ria compartilhada
SHRC025=erro ao conectar mem\u00F3ria compartilhada
SHRC026=N\u00E3o \u00E9 poss\u00EDvel criar cache do tamanho solicitado\: Verifique as configura\u00E7\u00F5es de SHMMAX e SHMMIN
SHRC027=O nome do cache compartilhado \u00E9 muito longo
SHRC020=Ocorreu um erro ao abrir o sem\u00E1foro
SHRC021=Foi retornado um c\u00F3digo de erro desconhecido
SHRC022=Erro ao criar a regi\u00E3o de mem\u00F3ria compartilhada
SHRC023=O cache n\u00E3o existe
J9GC048=incremento de espa\u00E7o antigo
J9GC047=tamanho m\u00E1ximo de espa\u00E7o antigo
J9GC049=tamanho configurado lembrado
SHRC028=Permiss\u00E3o Negada
SHRC029=N\u00E3o h\u00E1 mem\u00F3ria suficiente no sistema
J9GC040=Op\u00E7\u00E3o desconhecida\: %s
J9GC042=A soma de %1$s e %2$s \u00E9 muito pequena para %3$s
J9GC041=Tipo fvtest desconhecido\: %s
J9GC044=tamanho m\u00E1ximo de espa\u00E7o novo
J9GC043=tamanho de novo espa\u00E7o inicial
J9GC046=tamanho de espa\u00E7o inicial antigo
J9GC045=tamanho de mem\u00F3ria inicial
SHRC490=Force a descoberta de um cache de classes compartilhadas danificado
SHRC491=Falha ao armazenar %1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\: %2$s
SHRC492=Falha ao atualizar %1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\:%2$s
J9GC060=tamanho de espa\u00E7o de mem\u00F3ria permanente
SHRC013=A remo\u00E7\u00E3o de "%s" de mem\u00F3ria do cache compartilhado falhou
SHRC497=Placeholder, not used
SHRC014=A remo\u00E7\u00E3o de %s de sem\u00E1foro do cache compartilhado falhou
SHRC498=Placeholder, not used
SHRC015=Erro do Cache de Classe Compartilhado\: Sinalizador inv\u00E1lido
SHRC499=Placeholder, not used
SHRC016=Erro do Cache de Classe Compartilhado\:
SHRC493=Falha ao localizar %1$s dados anexados para %8$.*7$s.%4$.*3$s%6$.*5$s, motivo\: %2$s
SHRC010=O cache compartilhado "%s" foi destru\u00EDdo
SHRC494=Falha ao localizar %1$s dados conectados para o endere\u00E7o 0x%2$p, motivo\: %3$s
SHRC011=Erro\: N\u00E3o \u00E9 poss\u00EDvel abrir o cache de classes compartilhado
SHRC495=Falha ao armazenar %1$s dados conectados para o endere\u00E7o 0x%2$p, motivo\: %3$s
SHRC012=N\u00E3o \u00E9 poss\u00EDvel remover o cache compartilhado "%s", pois ainda h\u00E1 JVMs conectados ao cache
SHRC496=Falha ao atualizar %1$s dados conectados para o endere\u00E7o 0x%2$p, motivo\: %3$s
J9GC059="A pol\u00EDtica metron\u00F4mica n\u00E3o \u00E9 permitida sem -Xrealtime"
J9GC058=Falha ao alocar espa\u00E7o de mem\u00F3ria permanente
SHRC017=C\u00F3digo de erro\: %d
SHRC018=n\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria
SHRC019=o tamanho da solicita\u00E7\u00E3o \u00E9 muito pequeno
J9GC051=incremento do segmento de classe RAM
J9GC050=m\u00E1ximo de mem\u00F3ria virtual
J9GC053=m\u00E1ximo de mem\u00F3ria
J9GC052=incremento do segmento de classe ROM
J9GC055=tamanho de p\u00E1gina grande
J9GC054=O Tamanho de P\u00E1gina grande %1$zu%2$s n\u00E3o \u00E9 um tamanho de p\u00E1gina suportado, utilizando ent\u00E3o %3$zu%4$s.
J9GC057=%1$s n\u00E3o pode ser maior do que %2$s
J9GC056=tamanhos de p\u00E1ginas grandes dispon\u00EDveis\:
SHRC040=Especificar nome de cache compartilhado
SHRC041=Destruir cache compartilhado (usar par\u00E2m. de nome ou padr\u00E3o)
SHRC046=Exibir todos os caches compartilhados e suas estat\u00EDsticas
SHRC047=Imprimir resumo de estat\u00EDsticas de cache
SHRC048=Listar todos os elementos em cache
SHRC049=Modo de depura\u00E7\u00E3o que verifica todos os bytecodes de entrada
SHRC042=Destruir todos os caches compartilhados
SHRC043=Ativar compartilhamento de bytecode modificado\n \t<modContext> \u00E9 um descritor de usu\u00E1rio que descreve o tipo de modifica\u00E7\u00E3o\n \tOs JVMs que usam o mesmo <modContext> devem usar as mesmas modifica\u00E7\u00F5es
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC045=Destruir caches que n\u00E3o foram utilizados por <t> minutos
J9GC026=-Xverbosegclog falhou na aloca\u00E7\u00E3o de estruturas internas
J9GC025=Soma de %1$s e %2$s
J9GC028=Op\u00E7\u00E3o muito grande\: '%s'
J9GC027=Op\u00E7\u00E3o malformada\: '%s'
J9GC029=Erro de op\u00E7\u00E3o\: '%s'
J9GC020=%s muito grande para heap
J9GC022=A soma de %1$s e %2$s \u00E9 muito grande para %3$s
J9GC021=%1$s deve ser igual a %2$s
J9GC024=A soma de %1$s e %2$s \u00E9 muito grande para heap
J9GC023=A soma de %1$s e %2$s deve ser igual a %3$s
SHRC030=O Cache de Classe Compartilhada que voc\u00EA est\u00E1 anexando possui um cabe\u00E7alho inv\u00E1lido.
SHRC035=Armazenamento em cache local de caminhos de classe desativado
SHRC036=Redu\u00E7\u00E3o simult\u00E2nea de conten\u00E7\u00E3o de armazenamento desativada
SHRC037=Atualiza\u00E7\u00F5es incrementais desativadas
SHRC038=Uso\:\n\njava -Xshareclasses[\:op\u00E7\u00E3o,...]\n\n As op\u00E7\u00F5es v\u00E1lidas inclu\u00EDdas (com um breve resumo) s\u00E3o\:\n\n
SHRC031=O Cache de Classe Compartilhado que voc\u00EA est\u00E1 conectando tem vers\u00E3o de JVM incompat\u00EDvel.
SHRC032=O Cache de Classe Compartilhado que voc\u00EA est\u00E1 conectando tem n\u00EDvel de modifica\u00E7\u00E3o incorreto.
SHRC033=Bloqueio de tabelas hash locais desativado
SHRC034=Verifica\u00E7\u00E3o do time stamp desativada
J9GC037=%1$s n\u00E3o suportado com valores diferentes de %2$zu
J9GC036=O valor de %1$s deve ser superior a %2$zu
J9GC039=*** %1$s reprovado\: utilize %2$s no lugar ***
J9GC038=O valor de %s especificado \u00E9 muito grande
SHRC039=Imprimir ajuda compartilhada geral
J9GC031=Erro de op\u00E7\u00E3o\: '%1$s' e '%2$s' n\u00E3o podem ser ambos especificados
J9GC030=O valor de %1$s de %2$.2f deve ser, pelo menos, %3$s menor que o valor de %4$s de %5$.2f
J9GC033=O valor de %1$s deve estar entre %2$.2f e %3$.2f (inclusive)
J9GC032=A configura\u00E7\u00E3o do sistema n\u00E3o suporta a op\u00E7\u00E3o '%s'
J9GC035=%s deve ser seguido por um n\u00FAmero
J9GC034=O valor de %1$s deve estar entre %2$zu e %3$zu (inclusive)
SHRC060=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para o buffer de sequ\u00EAncia em shrinit\:\:hookFindSharedClass
SHRC061=O nome do cache n\u00E3o deve ter mais de 64 caracteres. O cache n\u00E3o foi criado.
SHRC062=Erro ao copiar o nome do usu\u00E1rio no nome de cache padr\u00E3o
SHRC063=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para sharedClassConfig em shrinit
SHRC068=Armazenamento em cache local de caminhos de classe desativado
SHRC069=Redu\u00E7\u00E3o simult\u00E2nea de conten\u00E7\u00E3o de armazenamento desativada
SHRC064=Falha ao criar configMonitor em shrinit
SHRC065=N\u00E3o \u00E9 poss\u00EDvel alocar o conjunto em shrinit
SHRC066=Bloqueio de tabelas hash locais desativado
SHRC067=Verifica\u00E7\u00E3o do time stamp desativada
J9GC004=Falha em instanciar o coletor de lixo global
J9GC003=Falha em instanciar o dispatcher de tarefas
J9GC006=Falha em inicializar, sem mem\u00F3ria
J9GC005=Falha em inicializar
J9GC008=Falha em inicializar extens\u00F5es do m\u00F3dulo
J9GC007=Falha em inicializar, n\u00E3o foi poss\u00EDvel analisar a linha de comandos
J9GC009=Falha em inicializar o mutex para estat\u00EDsticas de GC
J9GC000=Erro Interno, Sem Mem\u00F3ria
J9GC002=Falha em instanciar heap. %1$zu%2$s pedido
J9GC001=Falha em instanciar heap
SHRC050=Ativar sa\u00EDda detalhada
SHRC051=Desativar atualiza\u00E7\u00F5es din\u00E2micas
SHRC052=Desativar armazenamento em cache de caminho de classe local
SHRC057=Par\u00E2metros incorretos para op\u00E7\u00E3o de expira\u00E7\u00E3o
SHRC058=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para ClasspathItem em shrinit\:\:hookStoreSharedClass
SHRC059=N\u00E3o \u00E9 poss\u00EDvel alocar mem\u00F3ria para ClasspathItem em shrinit\:\:hookFindSharedClass
SHRC053=Desativar bloqueio da tabela hash local
SHRC054=Desativar algoritmo para reduzir a conten\u00E7\u00E3o de armazenamento
SHRC055=Desativar atualiza\u00E7\u00F5es de cache incrementais
SHRC056=A op\u00E7\u00E3o da linha de comandos "%s" n\u00E3o \u00E9 reconhecida
J9GC015=Falha em alocar espa\u00E7o de mem\u00F3ria padr\u00E3o
J9GC014=Falha em alocar segmentos de mem\u00F3ria da classe VM
J9GC017=%1$s muito pequeno, deve ser pelo menos %2$zu %3$sbytes
J9GC016=Falha em alocar segmento subsistente no espa\u00E7o de mem\u00F3ria padr\u00E3o
J9GC019=%1$s muito grande para %2$s
J9GC018=%1$s muito pequeno para %2$s
J9GC011=Falha em inicializar o conjunto de espa\u00E7os de mem\u00F3ria
J9GC010=Falha em inicializar o gerenciamento do finalizador
J9GC013=Falha em alocar segmentos de mem\u00F3ria de objeto VM
J9GC012=Falha em alocar segmentos de mem\u00F3ria VM
