#Thu Jan 21 02:08:20 CST 2021
EXEL070=Obraz pami\u0119ci ROM ma b\u0142\u0119dn\u0105 wersj\u0119
EXEL079=\  -Xscmx<x>       Ustawienie wielko\u015Bci nowej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci \n                  podr\u0119cznej klas na <x>.
J9VM151=Otwarcie biblioteki jimage si\u0119 nie powiod\u0142o
J9VM150=Opcja -Xscsoftmx jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
J9VM153=Prze\u0142\u0105czenie na wewn\u0119trzny program odczytuj\u0105cy jimage, poniewa\u017C \u015Brodowisko JVM nie mo\u017Ce u\u017Cy\u0107 biblioteki jimage
EXEL071=Nie znaleziono nazwy g\u0142\u00F3wnej klasy
J9VM152=Wyszukanie symbolu %s w bibliotece jimage si\u0119 nie powiod\u0142o
EXEL072=B\u0142\u0105d uruchomienia maszyny VM\: Brak pami\u0119ci
J9VM155=B\u0142\u0119dna warto\u015B\u0107 opcji -Xpatch; we w\u0142a\u015Bciwo\u015Bci %s\=%s nie podano \u015Bcie\u017Cki dla poprawki
EXEL073=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Niepowodzenie utworzenia maszyny VM Java
J9VM154=B\u0142\u0119dna warto\u015B\u0107 opcji -Xpatch; nie podano warto\u015Bci w\u0142a\u015Bciwo\u015Bci %s
EXEL074=
J9VM157=Klasa %2$.*1$s(%3$s) nie mo\u017Ce uzyska\u0107 dost\u0119pu do klasy %5$.*4$s(%6$s), poniewa\u017C modu\u0142 %3$s nie mo\u017Ce odczyta\u0107 modu\u0142u %6$s
EXEL075=\  -Xquickstart    Poprawienie czasu uruchamiania poprzez op\u00F3\u017Anienie \n                  optymalizacji.
J9VM156=Opcja -XX\:SharedCacheHardLimit\= jest ignorowana, je\u015Bli nie podano warto\u015Bci -Xshareclasses
EXEL076=JIT  - %s\n
J9VM159=B\u0142\u0105d\: %s wymaga podania \u015Bcie\u017Cki modu\u0142u
EXEL077=\  -Xssi<x>        Ustawienie warto\u015Bci przyrostu stosu w\u0105tk\u00F3w program\u00F3w \n                  java na <x>.
J9VM158=Klasa %2$.*1$s(%3$s) nie mo\u017Ce uzyska\u0107 dost\u0119pu do klasy %5$.*4$s(%6$s), poniewa\u017C modu\u0142 %6$s nie mo\u017Ce wyeksportowa\u0107 pakietu %7$s do modu\u0142u %3$s
EXEL078=\  -Xshareclasses[\:opcje]    W\u0142\u0105czenie wsp\u00F3\u0142u\u017Cytkowania danych klas \n                            (u\u017Cyj opcji help, aby uzyska\u0107 szczeg\u00F3\u0142y).\n
J9VM149=Opcja %s nie jest ju\u017C obs\u0142ugiwana. Dodaj wymagane biblioteki / pliki jar do \u015Bcie\u017Cki klas.
EXEL068=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Niepowodzenie ustawienia elementu tablicy dla %s
EXEL069=Nie znaleziono obrazu pami\u0119ci ROM
J9VM140=Program wywo\u0142uj\u0105cy nie ma adnotacji @sun.reflect.CallerSensitive.
J9VM142=Opcja -Xrealtime wiersza komend nie jest obs\u0142ugiwana w tej wersji oprogramowania IBM SDK
EXEL060=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Niepowodzenie utworzenia tablicy bajt\u00F3w dla klasy o nazwie %s
J9VM141=konflikt metod domy\u015Blnych dla '%2$.*1$s%4$.*3$s' w %6$.*5$s z klas [%7$s]
EXEL061=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Niepowodzenie utworzenia java/lang/String dla klasy o nazwie %s
J9VM144=zbyt du\u017Co parametr\u00F3w\: 255 + 1
EXEL062=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Brak pami\u0119ci podczas konwertowania \u0142a\u0144cucha na znaki UTF dla klasy o nazwie %s
J9VM143=Opcja %s wiersza komend nie jest obs\u0142ugiwana w tej wersji oprogramowania IBM SDK
EXEL063=Klasa %s nie implementuje funkcji main()
J9VM146=invokeinterface dla niepublicznej metody '%4$.*3$s%6$.*5$s' w %2$.*1$s
EXEL064=Metoda main musi by\u0107 zadeklarowana jako public, static i void.
J9VM145=Opcja %s nie jest obs\u0142ugiwana w systemie z/OS.
EXEL065=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Niepowodzenie utworzenia tablicy argument\u00F3w
J9VM148=Opcja %s nie jest ju\u017C obs\u0142ugiwana. Mechanizm nadpisywania wymuszonego standardu jest obs\u0142ugiwany tylko z u\u017Cyciem aktualizowalnych modu\u0142\u00F3w.
EXEL066=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Niepowodzenie utworzenia tablicy bajt\u00F3w dla argumentu %s
J9VM147=Nie mo\u017Cna przy\u0142\u0105czy\u0107 bie\u017C\u0105cego w\u0105tku
EXEL067=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Niepowodzenie utworzenia java/lang/String dla argumentu %s
SMAP000=
EXEL090=\  -Xscmaxaot<x>   Ustawienie maksymalnej dozwolonej wielko\u015Bci wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas na dane AOT na warto\u015B\u0107 <x>
EXEL091=\n  -Xcheck[\:option[\:...]]  Sterowanie sprawdzaniem. Wpisz -Xcheck\:help, aby uzyska\u0107 wi\u0119cej szczeg\u00F3\u0142\u00F3w
EXEL092=\n  -Xdump[\:opcja,...]  Sterowanie zrzutami. Wpisz -Xdump\:help, aby uzyska\u0107 wi\u0119cej szczeg\u00F3\u0142\u00F3w
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP005=
J9VM171=Pr\u00F3bowano ustawi\u0107 pole instancji %2$.*1$s.%4$.*3$s typu final metody "%6$.*5$s", kt\u00F3ra nie jest <init>
J9VM170=Pr\u00F3bowano ustawi\u0107 pole statyczne %2$.*1$s.%4$.*3$s typu final metody "%6$.*5$s", kt\u00F3ra nie jest <clinit>
J9VM173=Klasa %2$.*1$s i jej host gniazda %4$.*3$s musz\u0105 mie\u0107 ten sam pakiet.
J9VM172=Klasa %2$.*1$s i jej host gniazda %4$.*3$s musz\u0105 mie\u0107 ten sam program \u0142aduj\u0105cy klasy.
J9VM175=Nie uda\u0142o si\u0119 za\u0142adowa\u0107 biblioteki %1$s wymaganej przez modu\u0142\: %2$s
EXEL093=Poni\u017Csze opcje steruj\u0105 globaln\u0105 konfiguracj\u0105 VM\:
J9VM174=Klasa %2$.*1$s musi by\u0107 przej\u0119ta przez jej host gniazda %4$.*3$s
EXEL094=\  -Xcompressedrefs              U\u017Cycie referencji do skompresowanej sterty
J9VM177=Klasa %2$.*1$s musi mie\u0107 mo\u017Cliwo\u015B\u0107 za\u0142adowania swojego hosta gniazda %4$.*3$s.
EXEL095=\  -Xrealtime                    W\u0142\u0105czenie rozszerze\u0144 czasu rzeczywistego
J9VM176=naruszenie ograniczenia \u0142adowania podczas nadpisywania metody "%2$.*1$s.%4$.*3$s%6$.*5$s" w momencie tworzenia klasy "%18$.*17$s"\: program \u0142aduj\u0105cy "%8$.*7$s@%9$x" klasy "%11$.*10$s" i program \u0142aduj\u0105cy "%13$.*12$s@%14$x" klasy "%16$.*15$s"  maj\u0105 r\u00F3\u017Cne typy dla sygnatury metody
EXEL096=\  -Xgcpolicy\:metronome          W\u0142\u0105czenie rozszerze\u0144 czasu rzeczywistego
J9VM179=Modu\u0142 nie ma nazwy.
EXEL097=\  -Xrealtime                    W\u0142\u0105czenie \u0142agodnego trybu czasu rzeczywistego
J9VM178=Modu\u0142 ma warto\u015B\u0107 NULL.
EXEL098=\  -Xgcpolicy\:metronome          W\u0142\u0105czenie \u0142agodnego trybu czasu rzeczywistego
EXEL099=\  -Xrealtime -Xnortsj           W\u0142\u0105czenie \u0142agodnego trybu czasu rzeczywistego
EXEL080=wersja java "%s"
EXEL081=wersja java "%1$s/%2$s"
J9VM160=B\u0142\u0105d\: %s wymaga podania modu\u0142u
J9VM162=\tw %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s)
J9VM161=\tw %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s\:%9$u)
J9VM164=\tw %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s)
EXEL082=\  -Xlp<x>         Ustawienie wielko\u015Bci du\u017Cych stron na <x>
J9VM163=\tw %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s\:%8$u)
EXEL083=Nie mo\u017Cna otworzy\u0107 pliku\: %s
J9VM166=\tw %2$.*1$s.%4$.*3$s (%5$.*6$s)
EXEL084=Nie mo\u017Cna utworzy\u0107 kopii zapasowej pliku\: %s
J9VM165=\tw %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
EXEL085=\nOSTRZE\u017BENIE\: Argument wiersza komend "%s" jest nieaktualny.\nOSTRZE\u017BENIE\: U\u017Cyj "-jxe <\u015Bcie\u017Cka>". \n
J9VM168=
EXEL086=\n  -Xtrace[\:opcja,...]  Sterowanie \u015Bledzeniem. Wpisz -Xtrace\:help, aby uzyska\u0107 wi\u0119cej szczeg\u00F3\u0142\u00F3w
J9VM167=Optymalizacje czyszczenia pami\u0119ci w stanie bezczynno\u015Bci nie s\u0105 obs\u0142ugiwane
EXEL087=\  -Xjni\:<opcje>               Ustawienie opcji JNI
EXEL088=
J9VM169=
EXEL089=\  -Xscminaot<x>   Ustawienie minimalnej wielko\u015Bci wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas zarezerwowanej na dane AOT na warto\u015B\u0107 <x>
J9VM117=Opcja -Xitsn jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
J9VM116=noLockword\:%.*s
J9VM119=Opcja -Xscmaxjit jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
J9VM118=Opcja -Xscminjit jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
J9VM111=Podano niepoprawn\u0105 opcj\u0119 lockword\: %s
J9VM110=Podano niepoprawny tryb lockword\: %s
J9VM113=---------------------
J9VM112=Konfiguracja lockword
J9VM115=lockword\:%.*s
J9VM114=Tryb lockword\=%s
J9VM106=Opcje info, warn, error, vital i config mog\u0105 by\u0107 \u0142\u0105czone z u\u017Cyciem przecinka ',', na przyk\u0142ad\:\n
J9VM105=-Xsyslog\:config            Rejestruje komunikaty o konfiguracji JVM.\n
J9VM108=-Xsyslog\:info,warn,error\n
J9VM107=-Xsyslog\:error,warn
J9VM109=Nieobs\u0142ugiwany system operacyjny (%s)\: wymagany jest system Windows XP lub nowszy.
J9VM100=-Xsyslog\:all               Rejestruje wszystkie komunikaty JVM.
J9VM102=-Xsyslog\:warn              Rejestruje komunikaty ostrzegawcze JVM.
J9VM101=-Xsyslog\:info              Rejestruje informacyjne komunikaty JVM.
J9VM104=-Xsyslog\:vital             Rejestruje istotne komunikaty JVM. Opcja w\u0142\u0105czona domy\u015Blnie.
J9VM103=-Xsyslog\:error             Rejestruje komunikaty o b\u0142\u0119dach JVM. Opcja w\u0142\u0105czona domy\u015Blnie.
J9VM139=
J9VM138=
J9VM131=Przerywanie procesu z u\u017Cyciem CEE3AB2(), abend\: %1$u, przyczyna\: %2$u, czyszczenie\: %3$u.
J9VM130=Aplikacja wznowi\u0142a dzia\u0142anie po obs\u0142u\u017Ceniu nienaprawialnego b\u0142\u0119du i w spos\u00F3b niedozwolony powr\u00F3ci\u0142a albo wywo\u0142a\u0142a \u015Brodowisko Java (kod JIT)
J9VM133=Twardy systemowy limit wielko\u015Bci pliku core jest ustawiony na %d, zrzuty systemowe mog\u0105 by\u0107 obci\u0119te.
J9VM132=Podano niepoprawne s\u0142owo blokowania (lockword), java/lang/Class i java/lang/String nie mog\u0105 mie\u0107 s\u0142\u00F3w blokowania, gdy u\u017Cywana jest opcja -Xtenant\: %s
J9VM135=W pliku /proc/sys/kernel/core_pattern ustawienie "%s" okre\u015Bla, \u017Ce zrzuty pami\u0119ci maj\u0105 by\u0107 przekazywane przez potok do programu zewn\u0119trznego. \u015Arodowisko JVM mo\u017Ce nie by\u0107 w stanie odszuka\u0107 zrzut\u00F3w i zmieni\u0107 ich nazwy.
J9VM134=Systemowa opcja fullcore ma warto\u015B\u0107 FALSE, zrzuty systemowe mog\u0105 by\u0107 obci\u0119te.
J9VM137=Klasa %2$.*1$s ma sprzeczne warto\u015Bci domy\u015Blne dla metody %4$.*3$s%6$.*5$s
J9VM136=W pliku /proc/sys/kernel/core_pattern ustawienie "%s" okre\u015Bla format zmiany nazwy zrzut\u00F3w pami\u0119ci. \u015Arodowisko JVM mo\u017Ce nie by\u0107 w stanie odszuka\u0107 zrzut\u00F3w i zmieni\u0107 ich nazwy.
J9VM128=Miejsce sterty Java
J9VM127=Wielko\u015B\u0107 pocz\u0105tkowa 32-bitowego podalokatora nie mo\u017Ce mie\u0107 warto\u015Bci zero.
J9VM129=Aplikacja wznowi\u0142a dzia\u0142anie po obs\u0142u\u017Ceniu nienaprawialnego b\u0142\u0119du i w spos\u00F3b niedozwolony powr\u00F3ci\u0142a albo wywo\u0142a\u0142a \u015Brodowisko Java
J9VM120=Opcja -Xscminjitdata jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
J9VM122=Niepowodzenie uzyskania zakresu adres\u00F3w user32.dll wymaganych dla opcji -Xprotectcontiguous.
J9VM121=Opcja -Xscmaxjitdata jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
J9VM124=Nie mo\u017Cna zdefiniowa\u0107 klasy %.*s - '%.*s' jest chronionym pakietem systemowym
J9VM123=Pr\u00F3ba uruchomienia na nieobs\u0142ugiwanym procesorze, \u015Brodowisko JVM zostanie zatrzymane.
J9VM126=Wielko\u015B\u0107 zatwierdzania 32-bitowego podalokatora nie mo\u017Ce mie\u0107 warto\u015Bci zero.
J9VM125=Wielko\u015B\u0107 zatwierdzania 32-bitowego podalokatora jest wi\u0119ksza od wielko\u015Bci pocz\u0105tkowej. Wielko\u015B\u0107 zatwierdzania \= %1$u, wielko\u015B\u0107 pocz\u0105tkowa \= %2$u.
SHRC802=Mi\u0119kkie zape\u0142nienie pami\u0119ci podr\u0119cznej\: %1$d%%\n
SHRC803=W\u0142\u0105cz ochron\u0119 pami\u0119ci dla cz\u0119\u015Bciowo zape\u0142nionych stron podczas uruchamiania.
SHRC804=\u015Arodowisko JVM w\u0142\u0105czy\u0142o cz\u0119\u015Bciow\u0105 ochron\u0119 stron wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej podczas uruchamiania, poniewa\u017C istniej\u0105ca wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna zosta\u0142a utworzona z w\u0142\u0105czon\u0105 cz\u0119\u015Bciow\u0105 ochron\u0105 stron podczas uruchamiania.
SHRC805=\u015Arodowisko JVM nie w\u0142\u0105czy\u0142o ochrony cz\u0119\u015Bciowo zape\u0142nionych stron wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej podczas uruchamiania.
SHRC800=Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna jest pe\u0142na. Minimalne zarezerwowane miejsce i maksymalne dozwolone miejsce na dane AOT/JIT oraz limit softmx nie mog\u0105 by\u0107 ju\u017C modyfikowane.
SHRC801=softmx (bajty)                      %*c\= %d
SHRC806=Zniszczono skompresowan\u0105 trwa\u0142\u0105 pami\u0119\u0107 podr\u0119czn\u0105 referencji "%1$s". U\u017Cyj opcji -Xnocompressedrefs, je\u015Bli chcesz zniszczy\u0107 nieskompresowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 referencji.
SHRC807=Zniszczono nieskompresowan\u0105 trwa\u0142\u0105 pami\u0119\u0107 podr\u0119czn\u0105 referencji "%1$s". U\u017Cyj opcji -Xcompressedrefs, je\u015Bli chcesz zniszczy\u0107 skompresowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 referencji.
SHRC808=Skompresowana wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna referencji "%s" zosta\u0142a zniszczona. U\u017Cyj opcji -Xnocompressedrefs, je\u015Bli chcesz zniszczy\u0107 nieskompresowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 referencji.
SHRC809=Nieskompresowana wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna referencji "%s" zosta\u0142a zniszczona. U\u017Cyj opcji -Xcompressedrefs, je\u015Bli chcesz zniszczy\u0107 skompresowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 referencji.
DUMP001=Nierozpoznane zdarzenie zrzutu\:...%s
DUMP000=Nierozpoznana opcja zrzutu\: -Xdump\:%s
DUMP003=Nierozpoznany agent zrzutu\: %s
DUMP002=Nierozpoznany token\: %%%1$c
DUMP012=B\u0142\u0105d w zrzucie %1$s\: %2$s
DUMP011=Zrzut %1$s utworzy\u0142 proces %2$d
DUMP014=Nierozpoznane dzia\u0142anie maszyny VM\:...%s
DUMP013=Przetworzono zdarzenie zrzutu "%1$s", szczeg\u00F3\u0142 "%3$.*2$s".
DUMP010=Zrzut %1$s zosta\u0142 zapisany w %2$s
SHRC824=Flagi SZCZEG\u00D3\u0141U PODPOWIEDZI URUCHAMIANIA\: %1$zu DANE1\: %2$zu DANE2\: %3$zu
DUMP009=Zrzut %s jest niedost\u0119pny
SHRC825=\t startuphint       Wy\u015Bwietla tylko typy podpowiedzi uruchamiania we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
DUMP008=korzystaj\u0105c z '%s'
SHRC826=Bajty podpowiedzi uruchamiania      %*c\= %d
SHRC827=liczba podpowiedzi uruchamiania     %*c\= %d
SHRC820=Wy\u0142\u0105cz buforowanie klas \u0142adowanych przez program \u0142aduj\u0105cy klasy programu startowego.
DUMP005=Brak narz\u0119dzia zewn\u0119trznego
SHRC821=Wy\u0142\u0105cz buforowanie klas \u0142adowanych przez programy \u0142aduj\u0105ce klasy inne ni\u017C programu startowego. Ta opcja w\u0142\u0105cza opcj\u0119 "nonfatal".
DUMP004=Brak nazwy pliku
SHRC822=Nie uruchamiaj wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, je\u015Bli wyst\u0105pi b\u0142\u0105d.
DUMP007=JVM \u017C\u0105da zrzutu  %1$s, korzystaj\u0105c z '%2$s'
SHRC823=%1$d\: 0x%2$p KLUCZ PODPOWIEDZI URUCHAMIANIA\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
DUMP006=Przetwarzanie zdarzenia zrzutu "%1$s", szczeg\u00F3\u0142 "%3$.*2$s" - Prosz\u0119 czeka\u0107.
SHRC828=\u015Acie\u017Cka wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej jest za d\u0142uga.
SHRC829=Nie uda\u0142o si\u0119 u\u017Cy\u0107 katalogu osobistego u\u017Cytkownika jako domy\u015Blnego katalogu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Nie mo\u017Cna uzyska\u0107 katalogu osobistego. Ustaw inny katalog w zmiennej \u015Brodowiskowej "HOME" lub w wierszu komend w opcji "cacheDir\=" albo popraw katalog osobisty w systemowym pliku hase\u0142.
DUMP023=Nie wykonano \u017C\u0105danego przygotowania sterty, poniewa\u017C nie za\u017C\u0105dano dost\u0119pu na wy\u0142\u0105czno\u015B\u0107 lub uzyskanie takiego dost\u0119pu by\u0142o niemo\u017Cliwe.
DUMP022=Nie wykonano \u017C\u0105danego upakowania sterty, poniewa\u017C nie za\u017C\u0105dano dost\u0119pu na wy\u0142\u0105czno\u015B\u0107 lub uzyskanie takiego dost\u0119pu by\u0142o niemo\u017Cliwe.
DUMP025=Niepowodzenie IEATDUMP dla DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=Za\u017C\u0105dano wielu zrzut\u00F3w sterty, ale w etykiecie pliku brakuje %%id\: zrzuty b\u0119d\u0105 nadpisywa\u0107
DUMP021=Nie utworzono \u017C\u0105danego zrzutu sterty (heapdump), poniewa\u017C nie za\u017C\u0105dano dost\u0119pu na wy\u0142\u0105czno\u015B\u0107 lub uzyskanie takiego dost\u0119pu by\u0142o niemo\u017Cliwe.
DUMP020=Zrzut %s zosta\u0142 zapisany
SHRC813=\u0141\u0105czna liczba niezapisanych bajt\u00F3w z powodu ustawienia -Xscsoftmx wynosi %u. Niezapisane bajty AOT z powodu ustawienia -Xscmaxaot\: %u. Niezapisane bajty JIT z powodu ustawienia -Xscmaxjitdata\: %u.
SHRC814=\t stale           Drukuje wszystkie nieaktualne pozycje we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
DUMP019=JVM \u017C\u0105da zrzutu %s
SHRC815=nieaktualne bajty                   %*c\= %u
SHRC816=Warto\u015B\u0107 %s jest wi\u0119ksza ni\u017C wielko\u015B\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, dlatego zosta\u0142a ustawiona na r\u00F3wn\u0105 tej ostatniej.
DUMP016=Przerywanie\: Nie mo\u017Cna utworzy\u0107 pliku (%s)
SHRC810=Obraz stanu skompresowanej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej referencji "%s" zosta\u0142 zniszczony. U\u017Cyj opcji -Xnocompressedrefs, je\u015Bli chcesz zniszczy\u0107 obraz stanu nieskompresowanej pami\u0119ci podr\u0119cznej referencji.
DUMP015=Przerywanie\: Nie mo\u017Cna otworzy\u0107 lub odczyta\u0107 (%s)
SHRC811=Obraz stanu nieskompresowanej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej referencji "%s" zosta\u0142 zniszczony. U\u017Cyj opcji -Xcompressedrefs, je\u015Bli chcesz zniszczy\u0107 obraz stanu skompresowanej pami\u0119ci podr\u0119cznej referencji.
DUMP018=\u017B\u0105dane zdarzenie jest niedost\u0119pne. Uruchom z opcj\u0105 -Xdump\:dynamic
SHRC812=Funkcja                              \= %s
DUMP017=Przerywanie\: Nie mo\u017Cna skompresowa\u0107 pliku (%s)
SHRC817=Warto\u015B\u0107 %s jest wi\u0119ksza ni\u017C wielko\u015B\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, dlatego zosta\u0142a ustawiona na nieograniczon\u0105.
SHRC818=\u0141\u0105czna liczba niezapisanych bajt\u00F3w z powodu ustawienia mi\u0119kkiego limitu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej wynosi %u. Niezapisane bajty AOT z powodu ustawienia -Xscmaxaot\: %u. Niezapisane bajty JIT z powodu ustawienia -Xscmaxjitdata\: %u.
SHRC819=Nie mo\u017Cna by\u0142o uruchomi\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Istniej\u0105ca wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna zosta\u0142a utworzona przez inn\u0105 kompilacj\u0119 \u015Brodowiska JVM i nie jest zgodna z uruchomionym \u015Brodowiskiem JVM
SHRC840=Nie mo\u017Cna by\u0142o uruchomi\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC841=Podaj numer najwy\u017Cszej warstwy. Utw\u00F3rz now\u0105 warstw\u0119 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, je\u015Bli podana warstwa nie istnieje.
SHRC846=\nBie\u017C\u0105ce statystyki dla najwy\u017Cszej warstwy pami\u0119ci podr\u0119cznej "%s"\: \n
SHRC847=Warstwa pami\u0119ci podr\u0119cznej          %*.c\= %d
SHRC848=\nBie\u017C\u0105ce statystyki dla wszystkich warstw pami\u0119ci podr\u0119cznej "%s"\: \n
J9VM191=%2$.*1$s nie jest widoczna
SHRC849=Wy\u015Bwietl tylko podsumowanie statystyk pami\u0119ci podr\u0119cznej tylko dla najwy\u017Cszej warstwy. U\u017Cyj printTopLayerStats\=help, aby pozna\u0107 dost\u0119pne opcje.
J9VM190=Superklasa %2$.*1$s nie mo\u017Ce by\u0107 interfejsem
SHRC842=Utw\u00F3rz now\u0105 warstw\u0119 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
J9VM193=W wersji Java 13 opcje -Xverify\:none i -noverify sta\u0142y si\u0119 nieaktualne i mog\u0105 zosta\u0107 w przysz\u0142o\u015Bci usuni\u0119te.
SHRC843=Niepoprawny numer warstwy %d dla "%s". Numer warstwy powinien by\u0107 mniejszy od %d.
J9VM192=%2$.*1$s nie jest interfejsem
SHRC844=Niepoprawny numer warstwy %d. Istniej\u0105ca najwy\u017Csza warstwa to %d. Numer nowej warstwy powinien mie\u0107 warto\u015B\u0107 %d.
J9VM195=Tablica pakietu jest pusta.
SHRC845=Nie sprawdzaj wolnego miejsca na dysku przed utworzeniem trwa\u0142ej pami\u0119ci podr\u0119cznej.
J9VM194=Niepoprawna relacja \u0142adowania klas dla klasy podrz\u0119dnej\: %2$.*1$s, klasa nadrz\u0119dna\: %4$.*3$s
J9VM197=Opcja %1$s nie jest obs\u0142ugiwana z opcj\u0105 %2$s.
J9VM196=\u0141a\u0144cuch pakietu jest pusty.
J9VM199=Klasa %2$.*1$s nie ma uprawnie\u0144 do odziedziczenia ze swojego zapiecz\u0119towanego nadinterfejsu.
J9VM198=Klasa %2$.*1$s nie ma uprawnie\u0144 do odziedziczenia ze swojej zapiecz\u0119towanej nadklasy.
SHRC830=Nie uda\u0142o si\u0119 u\u017Cy\u0107 katalogu osobistego u\u017Cytkownika jako domy\u015Blnego katalogu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. \u015Acie\u017Cka jest zbyt d\u0142uga Nie mo\u017Cna uzyska\u0107 katalogu osobistego. Ustaw inny katalog w zmiennej \u015Brodowiskowej "HOME" lub w wierszu komend w opcji "cacheDir\=" albo popraw katalog osobisty w systemowym pliku hase\u0142.
SHRC835=Sprawdzaj datowniki adres\u00F3w URL niestartowych plik\u00F3w jar/zip podczas ka\u017Cdego \u0142adowania klasy.
SHRC836=Zniszcz wszystkie warstwy wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej o tej samej nazwie (u\u017Cyj parametru nazwy lub nazwy domy\u015Blnej)
SHRC837=Nie uda\u0142o si\u0119 przydzieli\u0107 deskryptora pami\u0119ci podr\u0119cznej
J9VM180=Nazwa modu\u0142u jest niepoprawna.
SHRC838=Nie mo\u017Cna by\u0142o uruchomi\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Wykryto modyfikacj\u0119 w ni\u017Cszej warstwie wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Oczekiwany unikalny identyfikator pami\u0119ci podr\u0119cznej\: %s
SHRC831=Nie uda\u0142o si\u0119 u\u017Cy\u0107 katalogu osobistego u\u017Cytkownika jako domy\u015Blnego katalogu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. \u015Acie\u017Cka wskazuje katalog w systemie plik\u00F3w NFS. Nie mo\u017Cna uzyska\u0107 katalogu osobistego. Ustaw inny katalog w zmiennej \u015Brodowiskowej "HOME" lub w wierszu komend w opcji "cacheDir\=" albo popraw katalog osobisty w systemowym pliku hase\u0142.
J9VM182=Tylko program startowy lub program \u0142aduj\u0105cy klasy platformy mo\u017Ce definiowa\u0107 pakiet java lub java.*.
SHRC832=Nie uda\u0142o si\u0119 u\u017Cy\u0107 katalogu osobistego u\u017Cytkownika jako domy\u015Blnego katalogu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Kod b\u0142\u0119du\: %1$d.
J9VM181=Tylko program startowy programu \u0142aduj\u0105cego klasy mo\u017Ce definiowa\u0107 modu\u0142 java.base.
SHRC833=Nie uda\u0142o si\u0119 przydzieli\u0107 pami\u0119ci rodzimej wymaganej do uzyskania katalogu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
J9VM184=B\u0142\u0119dna klasa %2$.*1$s\: pole instancji Qtype nie jest typem warto\u015Bci
SHRC834=Zminimalizuj sprawdzanie datownik\u00F3w dla adres\u00F3w URL plik\u00F3w jar/zip.
J9VM183=Element gniazda %2$.*1$s musi mie\u0107 mo\u017Cliwo\u015B\u0107 za\u0142adowania hosta gniazda %4$.*3$s.
J9VM186=B\u0142\u0119dny typ obiektu %2$.*1$s\: obiekt na stosie nie jest typem warto\u015Bci
J9VM185=B\u0142\u0119dna klasa %2$.*1$s\: classref nie jest typem warto\u015Bci
J9VM188=Utworzenie w\u0105tku nie powiod\u0142o si\u0119\: retVal %1$zd, numer_b\u0142\u0119du %2$zd (0x%3$zx), numer_b\u0142\u0119du2 0x%4$x
J9VM187=B\u0142\u0119dny typ obiektu %2$.*1$s\: synchronizowany obiekt jest typem warto\u015Bci
SHRC839=Nie mo\u017Cna by\u0142o uruchomi\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Wyst\u0105pi\u0142 b\u0142\u0105d podczas uzyskiwania unikalnego identyfikatora ni\u017Cszej warstwy wymaganej wst\u0119pnie pami\u0119ci podr\u0119cznej.
J9VM189=Nie mo\u017Cna rozszerza\u0107 finalnej superklasy %2$.*1$s
SHRC850=Dost\u0119pne opcje dla -Xshareclasses\:%1$s<opcje>. U\u017Cyj znaku '+', aby poda\u0107 wiele opcji, np\: %2$saot+url \n
SHRC851=Wy\u0142\u0105cza sprawdzanie datownik\u00F3w podczas wyszukiwania klas we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Ze wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej mog\u0105 by\u0107 \u0142adowane nieaktualne klasy.
SHRC852=Warstwa najwy\u017Csza (warstwa %d) pami\u0119ci podr\u0119cznej jest zniszczona. Wykryto modyfikacj\u0119 warstwy %d wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Oczekiwany unikalny identyfikator pami\u0119ci podr\u0119cznej\: %s, bie\u017C\u0105cy unikalny identyfikator pami\u0119ci podr\u0119cznej\: %s.
SHRC853=Funkcje procesora                    \= %s
VRFY007=przes\u0142oni\u0119cie metody finalnej
VRFY008=indeks tablicy nie jest liczb\u0105 ca\u0142kowit\u0105
VRFY009=tablica niezgodna z typem
SHRC761=Nie uda\u0142o si\u0119 ustawi\u0107 uprawnienia dost\u0119pu dla grupy (jak za\u017C\u0105dano przez podopcj\u0119 'groupAccess') dla pliku obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
VRFY000=%1$s; klasa\=%3$.*2$s, metoda\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC762=Wyst\u0105pi\u0142 b\u0142\u0105d podczas uzyskiwania statystyk dla pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas podczas weryfikowania uprawnie\u0144 dost\u0119pu dla grupy.
VRFY001=%1$s; klasa\=%3$.*2$s, metoda\=%5$.*4$s%7$.*6$s
SHRC763=\u0141\u0105czna d\u0142ugo\u015B\u0107 wszystkich podopcji klas wsp\u00F3\u0142u\u017Cytkowanych nie mo\u017Ce przekracza\u0107 %u znak\u00F3w.
VRFY002=niepoprawna sekwencja kodu bajtowego
SHRC764=Nie mo\u017Cna utworzy\u0107 pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej o wielko\u015Bci %1$d bajt\u00F3w, jak to za\u017C\u0105dano\n \tU\u017Cyto maksymalnej dozwolonej wielko\u015Bci pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej (%2$d bajt\u00F3w)\n \t(Aby zwi\u0119kszy\u0107 dost\u0119pn\u0105 pami\u0119\u0107 wsp\u00F3\u0142u\u017Cytkowan\u0105, zmie\u0144 warto\u015B\u0107 SHMMAX)\n \t Je\u015Bli u\u017Cyto opcji -Xscdmx, obszar atrybut\u00F3w debugowania jest proporcjonalnie\n \t dostosowany zgodnie z oryginalnym wsp\u00F3\u0142czynnikiem jego wielko\u015Bci do warto\u015Bci -Xscmx.
VRFY003=klasa nie zawiera danych sprzed weryfikacji
VRFY004=wstawianie jsr napotka\u0142o zbyt wiele jsr
VRFY005=lokalne niezgodne z typem
VRFY006=rozmiar nowej tablicy nie jest liczb\u0105 ca\u0142kowit\u0105
SHRC760=Nie uda\u0142o si\u0119 ustawi\u0107 uprawnienia dost\u0119pu dla grupy (jak za\u017C\u0105dano przez podopcj\u0119 'groupAccess') dla pliku kontrolnego pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej i powi\u0105zanej ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC769=\u015Arodowisko JVM w\u0142\u0105czy\u0142o cz\u0119\u015Bciow\u0105 ochron\u0119 stron wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, poniewa\u017C istniej\u0105ca wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna zosta\u0142a utworzona z w\u0142\u0105czon\u0105 cz\u0119\u015Bciow\u0105 ochron\u0105 stron.
SHRC765=Pomy\u015Blnie w\u0142\u0105czono ochron\u0119 stron pami\u0119ci dla danych wykonawczych, danych \u0142a\u0144cuchowych do odczytu i zapisu oraz cz\u0119\u015Bciowo zape\u0142nionych stron
SHRC766=Pomy\u015Blnie w\u0142\u0105czono ochron\u0119 stron pami\u0119ci dla danych wykonawczych oraz cz\u0119\u015Bciowo zape\u0142nionych stron
SHRC767=Pomy\u015Blnie w\u0142\u0105czono ochron\u0119 stron pami\u0119ci dla danych wykonawczych oraz danych \u0142a\u0144cuchowych do odczytu i zapisu
SHRC768=Pomy\u015Blnie w\u0142\u0105czono ochron\u0119 stron pami\u0119ci dla danych wykonawczych
VRFY018=przekroczono maksymaln\u0105 wielko\u015B\u0107 stosu
VRFY019=niepowodzenie za\u0142adowania klasy
VRFY010=wiele jsr u\u017Cywa pojedynczego powrotu
SHRC750=\u017Badna metoda AOT nie jest zgodna ze specyfikacjami
VRFY011=parametr lookupswitch nie jest liczb\u0105 ca\u0142kowit\u0105
SHRC751=Niepowodzenie analizowania specyfikacji metod. Maksymalna dozwolona liczba specyfikacji metod\: %d.
VRFY012=niesp\u00F3jny kszta\u0142t stosu
SHRC752=Niepowodzenie analizowania specyfikacji metod.
VRFY013=naruszenie ograniczenia \u0142adowania klasy
SHRC753=Niepowodzenie uzyskania blokady mutex dla zapisu w pami\u0119ci podr\u0119cznej
VRFY014=zwracany kod bajtowy niezgodny ze zwracanym typem
VRFY015=wiele powrot\u00F3w do pojedynczego jsr
VRFY016=parametr przestawienia kodu bajtowego nie jest liczb\u0105 ca\u0142kowit\u0105
VRFY017=<init> nie wywo\u0142uje tego <init> ani nadrz\u0119dnego <init>
SHRC758=Nie uda\u0142o si\u0119 ustawi\u0107 uprawnienia dost\u0119pu dla grupy (jak za\u017C\u0105dano przez podopcj\u0119 'groupAccess') dla pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej ustawionej przez shmid\=%d i powi\u0105zanej ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC759=Nie uda\u0142o si\u0119 ustawi\u0107 uprawnienia dost\u0119pu dla grupy (jak za\u017C\u0105dano przez podopcj\u0119 'groupAccess') dla pliku kontrolnego semafora powi\u0105zanego ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC754=Ponowne utworzenie pliku steruj\u0105cego pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej nie jest dopuszczalne.
SHRC755=\t invalidatedaot Wy\u015Bwietla tylko typy aot uniewa\u017Cnione we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC756=Nie uda\u0142o si\u0119 ustawi\u0107 uprawnienia dost\u0119pu dla grupy dla pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, jak za\u017C\u0105dano przez podopcj\u0119 'groupAccess'.
VRFY020=parametry wywo\u0142ania niezgodne z typem
SHRC757=Nie uda\u0142o si\u0119 ustawi\u0107 uprawnienia dost\u0119pu dla grupy (jak za\u017C\u0105dano przez podopcj\u0119 'groupAccess') dla semafora ustawionego przez semid\=%d i powi\u0105zanego ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC783=Maksymalne dozwolone miejsce na dane JIT nie powinno by\u0107 wi\u0119ksze od limitu softmx (%u bajt\u00F3w) ustawionego dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC300=Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna klas jest u\u017Cywana przez inn\u0105 maszyn\u0119 VM; zwi\u0119kszenie zagnie\u017Cd\u017Conej pami\u0119ci podr\u0119cznej jest niemo\u017Cliwe
SHRC784=Nie mo\u017Cna ustawi\u0107 minimalnego zarezerwowanego miejsca na dane AOT lub JIT, tak jak to za\u017C\u0105dano. Niewystarczaj\u0105cy limit softmx ustawiony dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej lub niewystarczaj\u0105ca ca\u0142kowita wielko\u015B\u0107 pami\u0119ci podr\u0119cznej.
SHRC301=Nie mo\u017Cna zwi\u0119kszy\u0107 zagnie\u017Cd\u017Conej pami\u0119ci podr\u0119cznej "%s"; przydzielenie nowej pami\u0119ci podr\u0119cznej dla wskaz\u00F3wek nie powiod\u0142o si\u0119
SHRC785=Minimalne zarezerwowane miejsce AOT ustawiono na %d bajt\u00F3w.
SHRC302=Nie mo\u017Cna zwi\u0119kszy\u0107 zagnie\u017Cd\u017Conej pami\u0119ci podr\u0119cznej "%s"; przydzielenie bloku dla wskaz\u00F3wek nie powiod\u0142o si\u0119
SHRC786=Maksymalna ilo\u015B\u0107 danych AOT zosta\u0142a ustawiona na %d bajt\u00F3w.
SHRC780=Maksymalne miejsce AOT nie powinno by\u0107 mniejsze od liczby bajt\u00F3w AOT (%d) obecnie przechowywanych w pami\u0119ci podr\u0119cznej.
SHRC781=Maksymalne dozwolone miejsce AOT nie powinno by\u0107 wi\u0119ksze od limitu softmx (%u bajt\u00F3w) ustawionego dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC782=Maksymalne miejsce na dane JIT nie powinno by\u0107 mniejsze od liczby bajt\u00F3w JIT (%d) obecnie przechowywanych w pami\u0119ci podr\u0119cznej.
SHRC307=\tROMMETHOD\: %2$.*1$s Podpis\: %4$.*3$s Adres\: 0x%5$p
SHRC308=Niepowodzenie serializacji pami\u0119ci podr\u0119cznej "%s". Niepowodzenie aktualizacji pozycji klasy ROM w metodach AOT.
SHRC309=Opcji "grow" i "readonly" nie mo\u017Cna u\u017Cywa\u0107 jednocze\u015Bnie.
SHRC303=Niepowodzenie utworzenia zagnie\u017Cd\u017Conej pami\u0119ci podr\u0119cznej "%s"
SHRC787=Minimalne zarezerwowane miejsce na dane JIT ustawiono na %d bajt\u00F3w.
SHRC304=Niepowodzenie zast\u0105pienia pami\u0119ci podr\u0119cznej "%s"
SHRC788=Maksymalna ilo\u015B\u0107 danych JIT zosta\u0142a ustawiona na %d bajt\u00F3w.
SHRC305=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla tabeli wyszukiwania wskaz\u00F3wek w SH_ClasspathManagerImpl2
SHRC789=Warto\u015B\u0107 softmx ustawiono na %u bajt\u00F3w.
SHRC306=\ Podpis\: %2$.*1$s Adres\: 0x%3$p
SHRC772=Osi\u0105gni\u0119to limit wykorzystania softmx dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s". U\u017Cyj opcji "%s", aby zwi\u0119kszy\u0107 limit softmx.
SHRC773=Miejsce dla danych AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" jest zape\u0142nione.
SHRC774=Miejsce dla danych JIT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" jest zape\u0142nione.
SHRC775=Limit softmx ustawiony dla u\u017Cycia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej jest wi\u0119kszy od ca\u0142kowitej wielko\u015Bci pami\u0119ci podr\u0119cznej (%u bajt\u00F3w). Zostanie ustawiony na wielko\u015B\u0107 pami\u0119ci podr\u0119cznej.
SHRC770=\u015Arodowisko JVM wy\u0142\u0105czy\u0142o ochron\u0119 cz\u0119\u015Bciowo zape\u0142nionych stron. Je\u015Bli podano opcj\u0119 '-Xshareclasses\:mprotect\=onfind', zostanie ona zignorowana.
SHRC771=W\u0142\u0105cz ochron\u0119 pami\u0119ci dla cz\u0119\u015Bciowo zape\u0142nionych stron. W systemie z/OS odpowiada to opcji 'partialpagesonstartup'.
SHRC776=Limit softmx u\u017Cycia dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej jest mniejszy od miejsca obecnie u\u017Cywanego w pami\u0119ci podr\u0119cznej (%u bajt\u00F3w).
SHRC777=Limit softmx ustawiony dla u\u017Cycia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej jest mniejszy od minimalnej realnej warto\u015Bci (%u bajt\u00F3w).
SHRC778=Minimalne zarezerwowane miejsce AOT nie powinno by\u0107 wi\u0119ksze od maksymalnego dozwolonego miejsca AOT.
SHRC779=Minimalne zarezerwowane miejsce na dane JIT nie powinno by\u0107 wi\u0119ksze od maksymalnego dozwolonego miejsca na dane JIT.
SHRC321=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: zamykanie semafor\u00F3w pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
SHRC322=Niepowodzenie inicjowania semafor\u00F3w dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas. Ostrze\u017Cenie\: pami\u0119\u0107 podr\u0119czna mo\u017Ce by\u0107 uszkodzona. Je\u015Bli wyst\u0105pi\u0105 problemy z u\u017Cyciem tej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, mo\u017Ce by\u0107 konieczne jej zniszczenie i ponowne utworzenie.
SHRC323=B\u0141\u0104D\: niepowodzenie podczas wprowadzania blokady mutex dla nag\u0142\u00F3wka wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas. Ostrze\u017Cenie\: pami\u0119\u0107 podr\u0119czna mo\u017Ce by\u0107 uszkodzona. Je\u015Bli wyst\u0105pi\u0105 problemy z u\u017Cyciem tej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, mo\u017Ce by\u0107 konieczne jej zniszczenie i ponowne utworzenie.
SHRC324=B\u0141\u0104D\: niepowodzenie podczas ko\u0144czenia dzia\u0142ania blokady mutex dla nag\u0142\u00F3wka wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas. Ostrze\u017Cenie\: pami\u0119\u0107 podr\u0119czna mo\u017Ce by\u0107 uszkodzona. Je\u015Bli wyst\u0105pi\u0105 problemy z u\u017Cyciem tej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, mo\u017Ce by\u0107 konieczne jej zniszczenie i ponowne utworzenie.
SHRC320=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: niszczenie semafor\u00F3w pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
SHRC329=Niepowodzenie uzyskania blokady mutex tabeli \u0142a\u0144cuch\u00F3w przez SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex. Kod powrotu to %d.
SHRC325=Niepowodzenie opublikowania blokady nag\u0142\u00F3wka wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas podczas inicjowania. Ostrze\u017Cenie\: pami\u0119\u0107 podr\u0119czna mo\u017Ce by\u0107 uszkodzona. Je\u015Bli wyst\u0105pi\u0105 problemy z u\u017Cyciem tej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, mo\u017Ce by\u0107 konieczne jej zniszczenie i ponowne utworzenie.
SHRC326=Niepowodzenie opublikowania blokady u\u017Cytkownika wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas podczas inicjowania. Ostrze\u017Cenie\: pami\u0119\u0107 podr\u0119czna mo\u017Ce by\u0107 uszkodzona. Je\u015Bli wyst\u0105pi\u0105 problemy z u\u017Cyciem tej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, mo\u017Ce by\u0107 konieczne jej zniszczenie i ponowne utworzenie.
SHRC327=Niepowodzenie wywo\u0142ania SH_OSCachesysv\:\:acquireWriteLock() do j9shsem_wait. Zosta\u0142 zwr\u00F3cony b\u0142\u0105d %d.
SHRC328=Komunikacja IPC System V zg\u0142osi\u0142a nast\u0119puj\u0105cy b\u0142\u0105d '%s'
VERB032=minimalny zarezerwowany obszar wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla danych JIT
SHRC310=Trwa\u0142a pami\u0119\u0107 podr\u0119czna nie mo\u017Ce znajdowa\u0107 si\u0119 w sieciowym systemie plik\u00F3w. Wybierz inny katalog cacheDir.
SHRC794=Dostosuj maksymalne miejsce wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas przeznaczone na dane JIT na <wielko\u015B\u0107>.
VERB033=maksymalny dozwolony obszar wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla danych JIT
SHRC311=B\u0142\u0105d podczas zwalniania blokady zapisu w trakcie przy\u0142\u0105czania pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC795=Suma minimalnego zarezerwowanego miejsca na dane AOT (%d bajt\u00F3w) i dane JIT (%d bajt\u00F3w) nie powinna by\u0107 wi\u0119ksza od warto\u015Bci softmx (%d bajt\u00F3w).
VERB034=wielko\u015B\u0107 du\u017Cych stron dla pami\u0119ci podr\u0119cznej kodu JIT
SHRC312=B\u0142\u0105d podczas zwalniania blokady zapisu nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC796=Minimalne zarezerwowane miejsce na dane AOT nie powinno by\u0107 wi\u0119ksze od limitu softmx (%d) ustawionego dla u\u017Cycia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
VERB035=dost\u0119pna wielko\u015B\u0107 du\u017Cych stron dla pami\u0119ci podr\u0119cznej kodu JIT\:
SHRC313=Niepowodzenie utworzenia jclCacheMutex w shrinit
SHRC797=Minimalne zarezerwowane miejsce na dane JIT nie powinno by\u0107 wi\u0119ksze od limitu softmx (%d) ustawionego dla u\u017Cycia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
VERB036=Pocz\u0105tkowa wielko\u015B\u0107 skompresowanych metadanych referencji
SHRC790=Dostosuj wielko\u015B\u0107 softmx w pami\u0119ci podr\u0119cznej na <wielko\u015B\u0107>.
VERB037=wielko\u015B\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC791=Dostosuj minimalne miejsce wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas zarezerwowane na dane AOT na <wielko\u015B\u0107>.
VERB038=mi\u0119kka maksymalna wielko\u015B\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC792=Dostosuj maksymalne miejsce wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas przeznaczone na dane AOT na <wielko\u015B\u0107>.
SHRC793=Dostosuj minimalne miejsce wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas zarezerwowane na dane JIT na <wielko\u015B\u0107>.
SHRC318=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: niszczenie pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
SHRC319=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: zamykanie pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
SHRC314=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla tabeli wyszukiwania wskaz\u00F3wek w SH_Manager
SHRC798=Maksymalne dozwolone miejsce na dane AOT nie powinno by\u0107 wi\u0119ksze od limitu softmx (%d) ustawionego dla u\u017Cycia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC315=Nie mo\u017Cna zainicjowa\u0107 segment\u00F3w pami\u0119ci klasy cachelet
SHRC799=Maksymalne dozwolone miejsce na dane JIT nie powinno by\u0107 wi\u0119ksze od limitu softmx (%d) ustawionego dla u\u017Cycia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
VERB030=maksymalny dozwolony obszar wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla JIT
SHRC316=Nie mo\u017Cna serializowa\u0107 pami\u0119ci podr\u0119cznej, poniewa\u017C nie ma \u017Cadnego bie\u017C\u0105cego w\u0105tku VM.
VERB031=zarezerwowany obszar pami\u0119ci podr\u0119cznej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla atrybut\u00F3w debugowania klasy
SHRC317=Wydrukuj nazw\u0119 pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas, kt\u00F3ry b\u0119dzie u\u017Cywany.
VRFY029=niepoprawny adres powrotu w instrukcji ret
VRFY021=zg\u0142oszono obiekt, kt\u00F3rego nie mo\u017Cna zg\u0142asza\u0107
SHRC343=Znaleziono klas\u0119 %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d o adresie URL %4$.*3$s.
VRFY022=procedury nale\u017Cy przej\u015B\u0107 ponownie dla ka\u017Cdego jsr
SHRC344=Niepowodzenie znalezienia klasy %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d o adresie URL %4$.*3$s.
VRFY023=parametr tableswitch nie jest liczb\u0105 ca\u0142kowit\u0105
SHRC345=Znaleziono klas\u0119 %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d o tokenie %4$.*3$s.
VRFY024=argumenty niezgodne z typem
SHRC346=Niepowodzenie znalezienia klasy %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d o tokenie %4$.*3$s.
VRFY025=b\u0142\u0119dny dost\u0119p do zabezpieczonych danych
VRFY026=nieoczekiwany znak ko\u0144ca pliku
SHRC340=Sprawdzenie CRC wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej nie powiod\u0142o si\u0119. Zapisana CRC\: %1$x; obliczona CRC\: %2$x
VRFY027=odbiornik niezgodny z deklaruj\u0105c\u0105 klas\u0105
SHRC341=Znaleziono klas\u0119 %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d.
VRFY028=b\u0142\u0119dny wymiar
SHRC342=Niepowodzenie znalezienia klasy %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d.
SHRC347=Zapisano klas\u0119 %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d o adresie URL %5$.*4$s (indeks %6$d).
SHRC348=Niepowodzenie zapisania klasy %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d o adresie URL %5$.*4$s (indeks %6$d).
VRFY030=b\u0142\u0119dny typ stosu
SHRC349=Zapisano klas\u0119 %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d o adresie URL %5$.*4$s.
VRFY031=pr\u00F3ba wykonania iinc na liczbie innej ni\u017C ca\u0142kowita
J2SE000=\n
VRFY032=b\u0142\u0119dny odbiornik dla <init>
SHRC332=Pomy\u015Blnie w\u0142\u0105czono ochron\u0119 stron pami\u0119ci danych dla pami\u0119ci podr\u0119cznej
VRFY033=pole niezgodne z typem
SHRC333=W\u0142\u0105czenie domy\u015Blnej ochrony stron pami\u0119ci podr\u0119cznej powiod\u0142o si\u0119
VRFY034=niepoprawny docelowy PC
SHRC334=Niepowodzenie odtwarzania po wyst\u0105pieniu b\u0142\u0119du\: zniszczenie pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej nie powiod\u0142o si\u0119.
VRFY035=bez b\u0142\u0119du
SHRC335=Niepowodzenie odtwarzania po wyst\u0105pieniu b\u0142\u0119du\: zniszczenie wsp\u00F3\u0142u\u017Cytkowanego semafora nie powiod\u0142o si\u0119.
VRFY036=niedomiar stosu
VRFY037=niezainicjowany obiekt w ga\u0142\u0119zi powrotnej
VRFY038=invokespecial na niepoprawnym obiekcie docelowym
SHRC330=Niepowodzenie uzyskania blokady mutex obszaru zapisu przez SH_CompositeCacheImpl\:\:runExitCode. Kod powrotu to %d.
VRFY039=nieznany kod bajtowy
SHRC331=Uzyskano semafor, kt\u00F3ry jest inny ni\u017C semafor poprzednio u\u017Cywany z t\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105
SHRC336=Kod b\u0142\u0119du warstwy port\u00F3w \= %1$d
VRFY040=weryfikator nie mo\u017Ce przydzieli\u0107 rodzimej pami\u0119ci
SHRC337=Komunikat o b\u0142\u0119dzie platformy\: %1$s
SHRC338=Kod b\u0142\u0119du warstwy port\u00F3w \= %1$d
VRFY041=invokespecial dla niepoprawnego inicjatora
VRFY042=%1$s; klasa\=%3$.*2$s, metoda\=%5$.*4$s%7$.*6$s, pc\=%8$u; Niezgodno\u015B\u0107 typ\u00F3w, argument %9$d w podpisie %11$.*10$s.%13$.*12$s\:%15$.*14$s nie jest zgodny
SHRC339=Komunikat o b\u0142\u0119dzie platformy\: %1$s
VERB007=wielko\u015B\u0107 stosu w\u0105tk\u00F3w systemu operacyjnego
VERB008=wielko\u015B\u0107 pocz\u0105tkowa stosu w\u0105tk\u00F3w java
VERB009=przyrost stosu w\u0105tk\u00F3w java
SHRC360=Niepowodzenie wyszukiwania danych bajtowych dla klucza %.*s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej...
SHRC365=W\u0142\u0105cza zapisanie informacji debugowania klasy w klasie wsp\u00F3\u0142u\u017Cytkowanej.
EXEL109=\  -XX\:ShareClassesEnableBCI   Tworzenie wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas z obs\u0142ug\u0105 instrumentacji kodu bajtowego
SHRC366=debugowanie w\u0142\u0105czone \= true
VERB000=Stos szczeg\u00F3\u0142owy\: "%2$.*1$s" wykorzysta\u0142 b%3$zd/%4$zd bajt\u00F3w na stosach Java/C
SHRC367=debugowanie w\u0142\u0105czone \= false
VERB001=
SHRC368=Zamykanie wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas bez w\u0142\u0105czonej obs\u0142ugi debugowania.
VERB002=Stos szczeg\u00F3\u0142owy\: maksymalne wykorzystanie stosu wynosi\u0142o %1$zd/%2$zd na stosach Java/C
SHRC361=B\u0142\u0105d podczas przy\u0142\u0105czania do pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej podczas otwierania/tworzenia
VERB003=B\u0142\u0105d\: -Xverbosegclog liczba plik\u00F3w musi by\u0107 wi\u0119ksza ni\u017C 0
SHRC362=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla ClasspathItem
VERB004=B\u0142\u0105d\: -Xverbosegclog liczba cykli musi by\u0107 wi\u0119ksza ni\u017C 0
SHRC363=Nie mo\u017Cna przydzieli\u0107 API dla klas wsp\u00F3\u0142u\u017Cytkowanych w shrinit
VERB005=B\u0142\u0105d\: -Xverbosegclog brakuje nazwy pliku
SHRC364=Niepowodzenie wywo\u0142ania SH_OSCachesysv\:\:acquireWriteLock() do j9shsem_wait z ID semafora %d. Zosta\u0142 zwr\u00F3cony b\u0142\u0105d %d.
VERB006=Niepowodzenie inicjowania
EXEL112=\  -Xscsoftmx<x>   Ustawienie mi\u0119kkiej maksymalnej wielko\u015Bci nowej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas na <x>
EXEL113=\  -Xscmx<x>       Ustawienie wielko\u015Bci (lub mi\u0119kkiej warto\u015Bci maksymalnej, je\u015Bli podano opcj\u0119 -XX\:SharedCacheHardLimit\=) nowej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas na <x>
EXEL114=\  -XX\:SharedCacheHardLimit\=<x>   Ustawienie wielko\u015Bci nowej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas na wielko\u015B\u0107 <x>
EXEL115=\  -XX\:+ShareAnonymousClasses   W\u0142\u0105cza przechowywanie i wyszukiwanie klas anonimowych we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC369=-Xnolinenumbers    \= true
EXEL116=\  -XX\:-ShareAnonymousClasses   Wy\u0142\u0105cza przechowywanie i wyszukiwanie klas anonimowych we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
EXEL117=\  -XX\:+ShareUnsafeClasses   W\u0142\u0105cza przechowywanie i wyszukiwanie niebezpiecznych klas nieanonimowych we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
EXEL118=\  -XX\:-ShareUnsafeClasses   Wy\u0142\u0105cza przechowywanie i wyszukiwanie niebezpiecznych klas nieanonimowych we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
EXEL119=\  -XX\:+UseGCStartupHints   W\u0142\u0105cza przechowywanie i wyszukiwanie wskaz\u00F3wek uruchamiania czyszczenia pami\u0119ci (GC) we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
EXEL110=\  -XX\:ShareClassesDisableBCI   Tworzenie wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas bez obs\u0142ugi instrumentacji kodu bajtowego
EXEL111=\  -XX\:+StoreIntermediateClassfile   Zapisywanie surowych danych klasy, kt\u00F3re b\u0119d\u0105 u\u017Cywane przy ponownej transformacji
SHRC354=Niepowodzenie wyszukania kodu AOT dla ROMMethod 0x%1$p we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC355=Zapisano kod AOT dla ROMMethod 0x%1$p we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC356=Niepowodzenie zapisania kodu AOT dla ROMMethod 0x%1$p we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC357=Zapisano dane bajtowe dla klucza %.*s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC350=Niepowodzenie zapisania klasy %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d o adresie URL %5$.*4$s.
SHRC351=Zapisano klas\u0119 %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d o tokenie %5$.*4$s.
SHRC352=Niepowodzenie zapisania klasy %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d o tokenie %5$.*4$s.
SHRC353=Znaleziono kod AOT dla ROMMethod 0x%1$p we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
EXEL101=\n  -Xhealthcenter  W\u0142\u0105czenie agenta centrum poprawno\u015Bci
EXEL102=
EXEL103=\  -Xscdmx<x>      Ustawienie wielko\u015Bci obszaru atrybutu debugowania wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas na warto\u015B\u0107 <x>
EXEL104=\  -Xscminjit<x>   Ustawienie minimalnej wielko\u015Bci wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas zarezerwowanej na dane JIT na warto\u015B\u0107 <x>
SHRC358=Niepowodzenie zapisania danych bajtowych dla klucza %.*s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
EXEL105=\  -Xscmaxjit<x>   Ustawienie maksymalnej dozwolonej wielko\u015Bci wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas na dane JIT na warto\u015B\u0107 <x>
SHRC359=Znaleziono dane bajtowe dla klucza %.*s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
EXEL106=\  -Xscminjitdata<x>   Ustawienie minimalnej wielko\u015Bci wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas zarezerwowanej na dane JIT na warto\u015B\u0107 <x>
EXEL107=\  -Xscmaxjitdata<x>   Ustawienie maksymalnej dozwolonej wielko\u015Bci wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas na dane JIT na warto\u015B\u0107 <x>
EXEL108=\  -Xzero\:nosharebootzip   Nie wsp\u00F3\u0142u\u017Cytkuj pami\u0119ci podr\u0119cznych pozycji jar programu startowego we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj W\u0142\u0105czenie \u0142agodnego trybu czasu rzeczywistego
VERB029=minimalny zarezerwowany obszar wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla JIT
SHRC380=%% u\u017Cytego obszaru debugowania klas  %*c\= %u%%
SHRC381=Bajty klasy LineNumberTable         %*c\= %u
SHRC382=Bajty obszaru debugowania klasy LocalVariableTable %*c\= %u\n
VERB021=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (nieobs\u0142ugiwany typ pliku)
SHRC387=wolne bajty                         %*c\= %d
VERB022=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (nieznany typ pliku)
SHRC388=bajty ROMClass                      %*c\= %d
VERB023=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (nieznany b\u0142\u0105d)
SHRC389=bajty metadanych                    %*c\= %d
VERB024=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (w jxe brakuje rom.classes)
VERB025=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (uszkodzony nag\u0142\u00F3wek obrazu jxe)
SHRC383=\nadres podstawowy                    %*c\= 0x%p
VERB026=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (brak obs\u0142ugi przeciwnego endian jxe)
SHRC384=adres ko\u0144cowy                       %*c\= 0x%p
VERB027=Szczeg\u00F3\u0142owy stos\: Dzia\u0142anie w\u0105tku "%2$.*1$s" wykorzystuje %3$zd/%4$zd bajt\u00F3w stos\u00F3w Java/C
SHRC385=wska\u017Anik alokacji                   %*c\= 0x%p\n
VERB028=Szczeg\u00F3\u0142owy stos\: Nie mo\u017Cna wy\u015Bwietli\u0107 informacji o stosie dla obecnie uruchomionych w\u0105tk\u00F3w.
SHRC386=wielko\u015B\u0107 pami\u0119ci podr\u0119cznej         %*c\= %d
VERB020=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (plik uszkodzony)
VERB018=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (niepowodzenie operacji we/wy na pliku)
VERB019=Niepoprawna pozycja \u015Bcie\u017Cki klasy\: %s (niepowodzenie operacji odczytu pliku)
SHRC370=-Xnolinenumbers    \= false
SHRC371=Bajty pami\u0119ci podr\u0119cznej Zip \= %d
VERB010=wielko\u015B\u0107 maksymalna stosu w\u0105tk\u00F3w java
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC377=-Xscdmx warto\u015B\u0107 %u bajt\u00F3w jest wi\u0119ksza od dost\u0119pnego miejsca (%u bajt\u00F3w). W opcji -Xscdmx zostanie u\u017Cyta warto\u015B\u0107 %u.
VERB011=wielko\u015B\u0107 stosu w\u0105tk\u00F3w java
VERB012=przyrost segmentu klasy RAM
SHRC378=\nPokrewne opcje wiersza komend\:\n
VERB013=przyrost segmentu klasy ROM
SHRC379=Wielko\u015B\u0107 obszaru debugowania klas   %*c\= %u
VERB014=maksymalna wielko\u015B\u0107 pami\u0119ci
SHRC372=L. pami\u0119ci podr\u0119cznych Zip \= %d
VERB015=wielko\u015B\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC373=Bajty danych JIT   \= %d
SHRC374=Pami\u0119\u0107 podr\u0119czna utworzona z\:
VERB016=minimalny zarezerwowany obszar wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla AOT
SHRC375=Nazwa pami\u0119ci podr\u0119cznej b\u0119dzie za d\u0142uga, gdy do\u0142\u0105czona zostanie nazwa u\u017Cytkownika. W tym buforze pozosta\u0142o %d bajt\u00F3w, a nazwa u\u017Cytkownika zajmuje %d bajt\u00F3w.
VERB017=maksymalny dozwolony obszar wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla AOT
EXEL120=\  -XX\:-UseGCStartupHints   Wy\u0142\u0105cza przechowywanie i wyszukiwanie wskaz\u00F3wek uruchamiania czyszczenia pami\u0119ci (GC) we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
EXEL121=\  -XX\:+PortableSharedCache   W\u0142\u0105cza funkcj\u0119 pr\u00F3buj\u0105c\u0105 zmaksymalizowa\u0107 przeno\u015Bno\u015B\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej mi\u0119dzy komputerami
EXEL122=\  -XX\:-PortableShareCache   Wy\u0142\u0105cza funkcj\u0119 pr\u00F3buj\u0105c\u0105 zmaksymalizowa\u0107 przeno\u015Bno\u015B\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej mi\u0119dzy komputerami
SHRC390=%% u\u017Cytych metadanych                %*c\= %d%%
SHRC391=liczba klas ROMClasses              %*c\= %d
SHRC392=liczba Classpaths                   %*c\= %d
SHRC393=liczba adres\u00F3w URL                  %*c\= %d
SHRC398=liczba metod AOT                    %*c\= %d
SHRC399=bajty danych                        %*c\= %d
SHRC394=liczba token\u00F3w                      %*c\= %d
SHRC395=liczba nieaktualnych klas           %*c\= %d
SHRC396=%% nieaktualnych klas                %*c\= %d%%\n
SHRC397=bajty AOT                           %*c\= %d
CFRE100=w kodzie bajtowym multianewarray za\u017C\u0105dano za du\u017Co wymiar\u00F3w
CFRE101=pozycja poza zakresem w kodzie bajtowym switch
CFRE102=niepoprawna sygnatura pola
CFRE103=metoda abstrakcyjna nie mo\u017Ce by\u0107 prywatna, statyczna, finalna, rodzima, zsynchronizowana ani \u015Bcis\u0142a
CFRE104=pole mo\u017Ce by\u0107 albo publiczne, albo prywatne, albo chronione
CFRE110=niezgodna sta\u0142a dla pola
CFRE111=zniekszta\u0142cone UTF8
CFRE112=VM nie obs\u0142uguje weryfikacji dynamicznej
CFRE113=nieoczekiwany znak ko\u0144ca pliku
CFRE114=niepoprawna nazwa pola
CFRE115=wymiary tablicy > 255
CFRE105=nadklasa musi by\u0107 klas\u0105
CFRE106=zduplikowana metoda
CFRE107=pozycja poza zakresem w kodzie bajtowym jump
CFRE108=indeks metody obejmuj\u0105cej musi odnosi\u0107 si\u0119 do nazwy i typu
CFRE109=niepoprawna sygnatura metody
CFRE141=method_info zawiera wi\u0119cej ni\u017C jeden atrybut RuntimeInvisibleParameterAnnotations lub RuntimeVisibleParameterAnnotations
CFRE142=Klasa ma wi\u0119cej ni\u017C jeden atrybut RuntimeInvisibleAnnotations lub RuntimeVisibleAnnotations
CFRE143=Wiele atrybut\u00F3w typu nestmate
CFRE144=Element sk\u0142adowy hosta gniazda dla atrybutu gniazda musi by\u0107 klas\u0105 typu constant
CFRE145=Host gniazda musi by\u0107 klas\u0105 typu constant
CFRE146=Metoda <clinit> nie jest statyczna
CFRE147=Metoda <clinit> ma niedozwolon\u0105 sygnatur\u0119
CFRE148=Interfejs nie mo\u017Ce mie\u0107 metody o nazwie <init>
CFRE140=method_info zawiera wi\u0119cej ni\u017C jeden atrybut AnnotationDefault
CFRE138=Atrybut Classfile odwo\u0142uje si\u0119 do nieistniej\u0105cej pozycji puli sta\u0142ych
CFRE139=Klasa ma wi\u0119cej ni\u017C jeden atrybut SourceDebugExtension
CFRE152=module-info nie jest klas\u0105, poniewa\u017C ustawiono opcj\u0119 access_flag ACC_MODULE
CFRE153=Pozycja puli sta\u0142ych jest niepoprawna w plikach klas o wersjach < 55.0
CFRE154=Kody bajtowe ldc i ldc_2 musz\u0105 wskazywa\u0107 sta\u0142\u0105 lub sta\u0142\u0105 dynamiczn\u0105 (Constant_Dynamic)
CFRE155=Kod bajtowy ldc2_w musi wskazywa\u0107 sta\u0142\u0105 lub sta\u0142\u0105 dynamiczn\u0105 (Constant_Dynamic)
CFRE156=Pozycje sta\u0142e dynamiczne (Constant_Dynamic) wskazywane przez kody bajtowe ldc i ldc_w nie mog\u0105 zwraca\u0107 typ\u00F3w 'long' ani 'double'
CFRE157=Pozycje sta\u0142e dynamiczne (Constant_Dynamic) wskazywane przez kod bajtowy ldc2_w musz\u0105 zwraca\u0107 typy 'long' lub 'double'
CFRE158=Pozycja puli sta\u0142ych jest niepoprawna w plikach klas o wersjach < 49.0
CFRE159=Pozycja puli sta\u0142ych jest niepoprawna w plikach klas o wersjach < 51.0
CFRE150=Nieznany znacznik sta\u0142ej 20 w pliku klasy
CFRE151=Pozycja puli sta\u0142ych jest niepoprawna w plikach klas o wersjach < 53.0
CFRE149=Nieznany znacznik sta\u0142ej 19 w pliku klasy
CFRE120=kody opcode jsr i jsr_w nie s\u0105 poprawne w plikach klas o wersjach >\= 51.0
CFRE121=niedozwolona nazwa pola
CFRE122=klasa mo\u017Ce by\u0107 albo publiczna, albo modu\u0142em
CFRE123=Sta\u0142e MethodHandle musz\u0105 odnosi\u0107 si\u0119 do pola albo referencji metody
CFRE124=niepoprawny znacznik warto\u015Bci elementu adnotacji
CFRE125=kod bajtowy invokedynamic musi odwo\u0142ywa\u0107 si\u0119 do pozycji puli sta\u0142ych InvokeDynamic
CFRE126=niezerowe zarezerwowane szczeliny w kodzie bajtowym invokedynamic
CFRE116=kod bajtowy wywo\u0142ania musi odwo\u0142ywa\u0107 si\u0119 do Methodref
CFRE117=pole nie mo\u017Ce by\u0107 jednocze\u015Bnie finalne i ulotne
CFRE118=dodatkowe bajty po znaku ko\u0144ca pliku
CFRE119=wiele atrybut\u00F3w SourceFile
CFRE130=wiele atrybut\u00F3w BootstrapMethods
CFRE131=Atrybut BootstrapMethods wymagany przez invokedynamic nie wyst\u0119puje lub jest zbyt ma\u0142y
CFRE132=Pozycja type_annotation target_type nie zosta\u0142a rozpoznana
CFRE133=Metoda ma dwa atrybuty MethodParameters
CFRE134=Parametr metody ma niepoprawn\u0105 opcj\u0119.
CFRE135=Nazw\u0105 parametru metody nie jest UTF8
CFRE136=niedozwolone modyfikatory dla metody interfejsu
CFRE137=Klasa ma wi\u0119cej ni\u017C jeden atrybut RuntimeVisibleTypeAnnotations lub RuntimeInvisibleTypeAnnotations
CFRE127=indeks metody programu startowego musi odnosi\u0107 si\u0119 do pozycji puli sta\u0142ych MethodHandle
CFRE128=niepoprawna sygnatura methodtype
CFRE129=pozycja puli sta\u0142ych jest niepoprawna w plikach klas o wersjach < 51.0
CFRE163=Plik klasy jest w wersji przedpremierowej, ma jednak b\u0142\u0119dn\u0105 g\u0142\u00F3wn\u0105 wersj\u0119 albo opcja dost\u0119pu przedpremierowego nie zosta\u0142a w\u0142\u0105czona.
CFRE164=Indeks w LocalVariableTable jest spoza zakresu
CFRE165=Indeks w LocalVariableTypeTable jest spoza zakresu
CFRE166=Zduplikowane pozycje w LocalVariableTypeTable nie s\u0105 dozwolone
CFRE167=Wiele atrybut\u00F3w rekordu
CFRE168=Klasy rekordu nie mog\u0105 by\u0107 abstrakcyjne
CFRE169=Nazwa rekordu musi by\u0107 \u0142a\u0144cuchem
CFRE160=Pozycja puli sta\u0142ych jest niepoprawna w plikach klas o wersjach < 55.0
CFRE161=Argumenty metody BootstrapMethod (%1$d) zawieraj\u0105 niepoprawn\u0105 pozycj\u0119 constantpool o indeksie (\#%2$u) i typie (%3$u); klasa\=%5$.*4$s, przesuni\u0119cie\=%6$u
CFRE162=Obs\u0142uga ValueType jest mo\u017Cliwa po u\u017Cyciu opcji -XX\:+EnableValhalla
SHRC703=Nie mo\u017Cna otworzy\u0107 pliku obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC704=Kod b\u0142\u0119du warstwy port\u00F3w \= %1$d
SHRC705=Komunikat o b\u0142\u0119dzie platformy\: %1$s
SHRC706=Nie mo\u017Cna zablokowa\u0107 pliku obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC700=Utworzono obraz stanu wsp\u00F3\u0142u\u017Cytkowanej nietrwa\u0142ej pami\u0119ci podr\u0119cznej "%s"
SHRC701=Niepowodzenie utworzeniu obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej nietrwa\u0142ej pami\u0119ci podr\u0119cznej "%s"
SHRC702=Niepowodzenie uzyskania katalogu dla obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC707=Niepowodzenie uzyskania blokady mutex dla pami\u0119ci podr\u0119cznej "%s"
SHRC708=Niepowodzenie obci\u0119cia istniej\u0105cego pliku obrazu stanu nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC709=\u015Arodowisko JVM tworzy obraz stanu nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s", ale plik obrazu "%s" ju\u017C istnieje i zostanie nadpisany
CFRE174=wiele atrybut\u00F3w PermittedSubclasses
CFRE175=klasy finalne nie mog\u0105 by\u0107 zapiecz\u0119towane
CFRE176=nazwa klasy PermittedSubclasses musi by\u0107 \u0142a\u0144cuchem
CFRE177=pozycja klasy PermittedSubclasses nie jest typu class
CFRE178=Zapiecz\u0119towane klasy musz\u0105 mie\u0107 przynajmniej jedn\u0105 dozwolon\u0105 podklas\u0119
CFRE170=Nazwa RecordComponent musi by\u0107 \u0142a\u0144cuchem
CFRE171=Deskryptor RecordComponent musi by\u0107 \u0142a\u0144cuchem
CFRE172=Rekord jest niejawnie finalny
CFRE173=Pozycja LocalVariableTypeTable nie jest zgodna z \u017Cadn\u0105 pozycj\u0105 LocalVariableTable
SHRC720=Ponowne utworzenie pliku steruj\u0105cego pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej nie jest dopuszczalne przy tworzeniu obrazu stanu
SHRC725=D\u0142ugo\u015B\u0107 pliku obrazu stanu nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" jest niepoprawna. D\u0142ugo\u015B\u0107 pliku w bajtach\: %lld. Poprawny plik obrazu stanu ma d\u0142ugo\u015B\u0107 przynajmniej %d bajt\u00F3w i nie wi\u0119cej ni\u017C %lld bajt\u00F3w.
SHRC726=Ju\u017C istnieje nietrwa\u0142a wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna "%s". Nie mo\u017Cna jej przywr\u00F3ci\u0107 z obrazu stanu.
SHRC727=Wyst\u0105pi\u0142 b\u0142\u0105d podczas tworzenia nowej nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC728=Niepowodzenie podczas odczytywania pliku obrazu stanu nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC721=\u015Arodowisko JVM nie jest skonfigurowane do dost\u0119pu do pliku obrazu stanu nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s". Aby otworzy\u0107 plik, u\u017Cyj podopcji 'groupAccess'.
SHRC722=\u015Arodowisko JVM nie zezwala na dost\u0119p do pliku obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s", poniewa\u017C ID u\u017Cytkownika i ID grupy procesu \u015Brodowiska JVM s\u0105 inne ni\u017C ID u\u017Cytkownika i ID grupy w\u0142a\u015Bciciela pliku obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, a ID u\u017Cytkownika procesu \u015Brodowiska JVM nie nale\u017Cy do grupy w\u0142a\u015Bciciela pliku obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC723=\u015Arodowisko JVM nie mog\u0142o sprawdzi\u0107 uprawnie\u0144 pliku obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC724=Plik obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" nie istnieje
SHRC729=Obraz stanu zosta\u0142 utworzony przez inn\u0105 kompilacj\u0119 \u015Brodowiska JVM i nie jest zgodny z uruchomionym \u015Brodowiskiem JVM
SHRC714=Nie s\u0105 dost\u0119pne \u017Cadne obrazy stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC715=Usuni\u0119to starsz\u0105 generacj\u0119 obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC716=Niepowodzenie usuni\u0119cia starszej generacji obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC717=Niepowodzenie usuni\u0119cia bie\u017C\u0105cej generacji obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC710=Niepowodzenie zapisania w pliku obrazu stanu nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC711=Niepowodzenie zmiany pozycji deskryptora w pliku obrazu stanu nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC712=Pr\u00F3ba zniszczenia wszystkich obraz\u00F3w stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej w katalogu "%s"
SHRC713=Niepowodzenie okre\u015Blenia d\u0142ugo\u015Bci pliku obrazu stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC718=Obraz stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej nie istnieje
SHRC719=Obraz stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" zosta\u0142 zniszczony
SHRC740=Sk\u0142adnia\: %s{<specyfikacja_metody>[,<specyfikacja_metody>]}
SHRC741=Format <specyfikacji_metody> jest nast\u0119puj\u0105cy\: [\!]{*|[*]<nazwa_pakietu/nazwa_klasy>[*]}[.{*|[*]<nazwa_metody>[*]}[({*|[*]<parametry>[*]})]], np.\:\n\n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC742=WA\u017BNE\: Mo\u017Cna poda\u0107 wiele specyfikacji, oddzielaj\u0105c je przecinkami. Je\u015Bli warto\u015B\u0107 opcji zawiera przecinek, nale\u017Cy umie\u015Bci\u0107 go w nawiasach klamrowych. \n\tMo\u017Ce by\u0107 konieczne umieszczenie opcji w cudzys\u0142owie, aby zapobiec interpretowaniu znak\u00F3w specjalnych przez pow\u0142ok\u0119, na przyk\u0142ad\: \n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" lub\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC747=Niepowodzenie uniewa\u017Cnienia metod AOT
SHRC748=Niepowodzenie ponownego sprawdzenia metod AOT
SHRC749=Niepowodzenie wyszukania metod AOT
SHRC743=Niepoprawna specyfikacja metody dla opcji "%s"
SHRC744=Uniewa\u017Cniono nast\u0119puj\u0105c\u0105 liczb\u0119 metod AOT\: %d
SHRC745=Ponownie sprawdzono nast\u0119puj\u0105c\u0105 liczb\u0119 metod AOT\: %d
SHRC746=Znaleziono nast\u0119puj\u0105c\u0105 liczb\u0119 metod AOT\: %d
SHRC730=\u015Arodowisko JVM utworzy\u0142o wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 z u\u017Cyciem opcji '-Xshareclasses\:restrictClasspaths'. Kolejne wywo\u0142ania JVM nie b\u0119d\u0105 mog\u0142y przechowywa\u0107 \u015Bcie\u017Cek klas we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC731=\u015Arodowisko JVM zignorowa\u0142o opcj\u0119 '-Xshareclasses\:restrictClasspaths', poniewa\u017C istniej\u0105ca wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna zosta\u0142a utworzona bez opcji '-Xshareclasses\:restrictClasspaths'
SHRC736=Uniewa\u017Cnij metody AOT zgodne ze specyfikacjami metod.
SHRC737=Ponownie sprawd\u017A poprawno\u015B\u0107 metod AOT zgodnych ze specyfikacjami metod.
SHRC738=Wy\u015Bwietl metody AOT zgodne ze specyfikacjami metod.\n\t<specyfikacja_metody> jest zdefiniowana jako\: [\!]{*|[*]<nazwa_pakietu/nazwa_klasy>[*]}[.{*|[*]<nazwa_metody>[*]}[({*|[*]<parametry>[*]})]].
SHRC739=UNIEWA\u017BNIONO
SHRC732=\u015Arodowisko JVM mo\u017Ce przechowywa\u0107 \u015Bcie\u017Cki klas we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej utworzonej z u\u017Cyciem opcji '-Xshareclasses\:restrictClasspaths'
SHRC733=\u015Arodowisko JVM nie mo\u017Ce przechowywa\u0107 \u015Bcie\u017Cek klas we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, poniewa\u017C pami\u0119\u0107 ta zosta\u0142a utworzona z u\u017Cyciem opcji '-Xshareclasses\:restrictClasspaths'
SHRC734=Wy\u015Bwietl nazw\u0119 pliku obrazu stan wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, kt\u00F3ry zostanie u\u017Cyty.
SHRC735=U\u017Cyj %d-bitowej wersji \u015Brodowiska JVM, aby wykona\u0107 \u017C\u0105dan\u0105 operacj\u0119 w %d-bitowej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s", poniewa\u017C %d-bitowe \u015Brodowisko JVM nie mo\u017Ce sprawdzi\u0107, czy wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna by\u0142a utworzona przez JVM.
SHRC640=Maszyna JVM u\u017Cywa istniej\u0105cej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas w trybie diagnostycznym mprotect (za pomoc\u0105 opcji -Xshareclasses\:mprotect\=diagnostic), ale pami\u0119\u0107 podr\u0119czna nie by\u0142a tworzona w tym trybie. U\u017Cycie pami\u0119ci podr\u0119cznej w tym trybie mo\u017Ce wp\u0142yn\u0105\u0107 na wydajno\u015B\u0107.
SHRC641=Maszyna JVM pr\u00F3buje u\u017Cy\u0107 istniej\u0105cej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas w trybie diagnostycznym mprotect (za pomoc\u0105 opcji -Xshareclasses\:mprotect\=diagnostic), ale pami\u0119\u0107 podr\u0119czna nie by\u0142a tworzona w tym trybie. W takim przypadku opcja mprotect\=diagnostic jest ignorowana w systemie z/OS.
SHRC642=Maszyna JVM utworzy\u0142a wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas w trybie diagnostycznym mprotect (za pomoc\u0105 opcji -Xshareclasses\:mprotect\=diagnostic). U\u017Cycie pami\u0119ci podr\u0119cznej w tym trybie mo\u017Ce wp\u0142yn\u0105\u0107 na wydajno\u015B\u0107.
SHRC643=Maszyna JVM zosta\u0142a przy\u0142\u0105czona do wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas utworzonej w trybie diagnostycznym mprotect (za pomoc\u0105 opcji -Xshareclasses\:mprotect\=diagnostic). U\u017Cycie pami\u0119ci podr\u0119cznej w tym trybie mo\u017Ce wp\u0142yn\u0105\u0107 na wydajno\u015B\u0107.
SHRC648=Maszyna JVM nie jest skonfigurowana do uzyskania dost\u0119pu do zestawu semafor\u00F3w powi\u0105zanego z istniej\u0105c\u0105 nietrwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas. Aby wykona\u0107 przy\u0142\u0105czenie do nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas, nale\u017Cy u\u017Cy\u0107 podopcji 'groupAccess'.
SHRC649=Maszyna JVM nie zezwala na dost\u0119p do zestawu semafor\u00F3w wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, kt\u00F3ry zosta\u0142 utworzony przez innego u\u017Cytkownika spoza grupy i kt\u00F3ry nale\u017Cy do takiego u\u017Cytkownika.
J9CL030=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla danych rodzimych dzier\u017Cawcy
J9CL031=Nie mo\u017Cna zarejestrowa\u0107 pliku dbgwrapper.dll jako biblioteki programu startowego. Kod b\u0142\u0119du \= %zu
J9CL032=%1$d\: Niepowodzenie pobrania informacji o %2$s.
SHRC644=Maszyna JVM zosta\u0142a przy\u0142\u0105czona do wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas utworzonej w trybie diagnostycznym mprotect (za pomoc\u0105 opcji -Xshareclasses\:mprotect\=diagnostic). Opcja -Xshareclasses\:mprotect\=none zostanie zignorowana.
SHRC645=W\u0142\u0105cz tryb diagnostyczny mprotect
SHRC646=Maszyna JVM nie mog\u0142a sprawdzi\u0107 uprawnie\u0144 zestawu semafor\u00F3w powi\u0105zanego ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105.
SHRC647=Maszyna JVM wykry\u0142a, \u017Ce faktyczny ID u\u017Cytkownika procesu jest w\u0142a\u015Bcicielem zestawu semafor\u00F3w powi\u0105zanego ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105, ale nie jest jego tw\u00F3rc\u0105. Maszyna JVM nie zostanie przy\u0142\u0105czona do tej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, aby zapobiec uzyskaniu dost\u0119pu do niepo\u017C\u0105danej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
J9CL037=Nie mo\u017Cna pobra\u0107 informacji na temat wykorzystania procesora przez \u015Brodowisko JVM, gdy podano opcj\u0119 -XX\:-EnableCPUMonitor.
J9CL038=B\u0142\u0105d podczas pobierania informacji na temat wykorzystania procesora przez \u015Brodowisko JVM.
J9CL039=Niepoprawny datownik podczas pobierania informacji na temat wykorzystania procesora przez \u015Brodowisko JVM.
J9CL033=Nie mo\u017Cna zarejestrowa\u0107 pliku %s jako biblioteki programu startowego. Kod b\u0142\u0119du \= %zu
J9CL034=%1$d\: Niepowodzenie pobrania informacji o %2$s. %3$s
J9CL035=Metody interfejsu prywatnego wymagaj\u0105 wywo\u0142ania invokespecial
J9CL036=naruszenie podczas \u0142adowania regu\u0142y ograniczaj\u0105cej\: %2$.*1$s nie jest widoczne z %4$.*3$s
J9CL019=Nie mo\u017Cna przydzieli\u0107 buforu SIOCGIFCONF
SHRC630=We wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" zape\u0142niono miejsce na przechowywanie danych innych ni\u017C AOT/JIT, takich jak klasy.
SHRC631=We wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" zape\u0142niono miejsce zarezerwowane na dane AOT. U\u017Cyj opcji -Xscminaot, aby zwi\u0119kszy\u0107 obszar zarezerwowany dla danych AOT.
SHRC632=We wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" zape\u0142niono miejsce zarezerwowane na dane JIT. U\u017Cyj opcji -Xscminjitdata, aby zwi\u0119kszy\u0107 obszar zarezerwowany dla danych JIT.
SHRC637=Podopcja -Xshareclasses\:cacheRetransformed nie jest zgodna z istniej\u0105c\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 z obs\u0142ug\u0105 BCI.
SHRC638=Tworzenie pami\u0119ci podr\u0119cznej przy u\u017Cyciu opcji cacheRetransformed wymusza tryb disableBCI.
SHRC639=W po\u0142\u0105czeniu z opcj\u0105 -Xmt mo\u017Cna u\u017Cywa\u0107 tylko opcji programu narz\u0119dziowego wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. W pliku javad.options nale\u017Cy umie\u015Bci\u0107 inne opcje wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
J9CL020=Zbyt ma\u0142o pami\u0119ci, aby odczyta\u0107 dane ustawie\u0144 narodowych
J9CL021=Zbyt ma\u0142o pami\u0119ci, aby utworzy\u0107 list\u0119 indeks\u00F3w
SHRC633=Podano opcj\u0119 "-XX\:+StoreIntermediateClassfile", ale istniej\u0105ca pami\u0119\u0107 podr\u0119czna nie zosta\u0142a utworzona z opcj\u0105 "-XX\:+StoreIntermediateClassfile".
SHRC634=Podano opcj\u0119 "-XX\:-StoreIntermediateClassfile", ale istniej\u0105ca pami\u0119\u0107 podr\u0119czna zosta\u0142a utworzona z opcj\u0105 "-XX\:+StoreIntermediateClassfile".
SHRC635=Zapis po\u015Bredniego pliku klas \= prawda
SHRC636=Podopcja "disableBCI" nie jest zgodna z istniej\u0105c\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 z obs\u0142ug\u0105 BCI.
J9CL026=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla tre\u015Bci metody post HTTP
J9CL027=B\u0142\u0105d odczytu pliku ZIP
J9CL028=B\u0142\u0105d wewn\u0119trzny podczas odczytywania pliku ZIP, kod b\u0142\u0119du %d
J9CL029=znaleziono zniekszta\u0142cone / niemo\u017Cliwe do odwzorowania znaki
J9CL022=Zbyt ma\u0142o pami\u0119ci, aby wy\u015Bwietli\u0107 magazyny rekord\u00F3w
J9CL023=Zbyt ma\u0142o dost\u0119pnej pami\u0119ci, aby odczyta\u0107 rekord
J9CL024=Brak pami\u0119ci
J9CL025=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla nag\u0142\u00F3wk\u00F3w odpowiedzi HTTP
SHRC662=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: zniszczono zestaw semafor\u00F3w powi\u0105zanych ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC663=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: zniszczono zestaw semafor\u00F3w (id\=%d) powi\u0105zanych ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC664=Niepowodzenie odtwarzania po wyst\u0105pieniu b\u0142\u0119du\: nie uda\u0142o si\u0119 zniszczy\u0107 zestawu semafor\u00F3w (semid\=%d) powi\u0105zanych ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas. Zestaw semafor\u00F3w mo\u017Ce zniszczy\u0107 tylko tw\u00F3rca, w\u0142a\u015Bciciel albo administrator.
SHRC665=Niepowodzenie odtwarzania po wyst\u0105pieniu b\u0142\u0119du\: nie uda\u0142o si\u0119 zniszczy\u0107 zestawu semafor\u00F3w (semid\=%d) powi\u0105zanych ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC660=\u015Arodowisko JVM nie mog\u0142o powi\u0105za\u0107 identyfikatora zestawu semafor\u00F3w id\=%d ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC661=\u015Arodowisko JVM nie mog\u0142o powi\u0105za\u0107 identyfikatora pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej id\=%d ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC666=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: zniszczono pami\u0119\u0107 wsp\u00F3\u0142u\u017Cytkowan\u0105 powi\u0105zan\u0105 ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC667=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: zniszczono pami\u0119\u0107 wsp\u00F3\u0142u\u017Cytkowan\u0105 (id\=%d) powi\u0105zan\u0105 ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC668=Niepowodzenie odtwarzania po wyst\u0105pieniu b\u0142\u0119du\: nie uda\u0142o si\u0119 zniszczy\u0107 pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej (shmid\=%d) powi\u0105zanej ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas. Pami\u0119\u0107 wsp\u00F3\u0142u\u017Cytkowan\u0105 mo\u017Ce zniszczy\u0107 tylko tw\u00F3rca, w\u0142a\u015Bciciel albo administrator.
SHRC669=Niepowodzenie odtwarzania po wyst\u0105pieniu b\u0142\u0119du\: nie uda\u0142o si\u0119 zniszczy\u0107 pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej (shmid\=%d) powi\u0105zanej ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
SHRC651=Maszyna JVM wykry\u0142a, \u017Ce faktyczny ID u\u017Cytkownika procesu jest w\u0142a\u015Bcicielem pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej powi\u0105zanej ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105, ale nie jest jej tw\u00F3rc\u0105. Maszyna JVM nie zostanie przy\u0142\u0105czona do tej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, aby zapobiec uzyskaniu dost\u0119pu do niepo\u017C\u0105danej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC652=Maszyna JVM nie jest skonfigurowana do uzyskania dost\u0119pu do pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej powi\u0105zanej z istniej\u0105c\u0105 nietrwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas. Aby wykona\u0107 przy\u0142\u0105czenie do nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas, nale\u017Cy u\u017Cy\u0107 podopcji 'groupAccess'.
SHRC653=Maszyna JVM nie jest skonfigurowana do uzyskania dost\u0119pu do pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej powi\u0105zanej z istniej\u0105c\u0105 nietrwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas. Aby wykona\u0107 przy\u0142\u0105czenie do nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas, nale\u017Cy u\u017Cy\u0107 podopcji 'groupAccess' i 'readonly'.
SHRC654=Maszyna JVM nie zezwala na dost\u0119p do regionu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej nale\u017C\u0105cego do wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, kt\u00F3ry zosta\u0142 utworzony przez innego u\u017Cytkownika spoza grupy i kt\u00F3ry nale\u017Cy do takiego u\u017Cytkownika.
SHRC650=Maszyna JVM nie mog\u0142a sprawdzi\u0107 uprawnie\u0144 pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej powi\u0105zanej ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105.
SHRC659=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej
J9CL040=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla nowej globalnej referencji JNI
J9CL041=Klasa hosta %2$.*1$s i klasa anonimowa %4$.*3$s s\u0105 w r\u00F3\u017Cnych pakietach
J9CL042=Zagnie\u017Cd\u017Cony element %2$.*1$s w %4$.*3$s deklaruje innego zagnie\u017Cd\u017Conego hosta %6$.*5$s
SHRC655=Pami\u0119\u0107 podr\u0119czna jest dost\u0119pna dla bie\u017C\u0105cego u\u017Cytkownika \= %s
SHRC656=Maszyna JVM nie jest skonfigurowana do dost\u0119pu do pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej. Aby wykona\u0107 przy\u0142\u0105czenie do wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas, nale\u017Cy u\u017Cy\u0107 podopcji 'groupAccess'.
SHRC657=Maszyna JVM nie zezwala na dost\u0119p do pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, poniewa\u017C ID u\u017Cytkownika i ID grupy procesu maszyny JVM s\u0105 inne ni\u017C ID u\u017Cytkownika i ID grupy w\u0142a\u015Bciciela pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej, a ID u\u017Cytkownika procesu maszyny JVM nie nale\u017Cy do grupy w\u0142a\u015Bciciela pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC658=Maszyna JVM nie mog\u0142a sprawdzi\u0107 uprawnie\u0144 pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC200=\ Pomy\u015Blne wyszukanie %2$.*1$s.
SHRC684=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania semafora. Nie mo\u017Cna by\u0142o zablokowa\u0107 pliku kontrolnego.
DUMP034=U\u017Cytkownik za\u017C\u0105da\u0142 zrzutu %1$s z u\u017Cyciem '%2$s' przez %3$s
SHRC201=\ Pomy\u015Blne zast\u0105pienie %2$.*1$s.
SHRC685=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej. Nie mo\u017Cna by\u0142o zablokowa\u0107 pliku kontrolnego.
DUMP033=Maszyna JVM za\u017C\u0105da\u0142a zrzutu %1$s w odpowiedzi na zdarzenie
SHRC202=Niepowodzenie inicjowania pul w mened\u017Cerze klas wsp\u00F3\u0142u\u017Cytkowanych
SHRC686=Nie mo\u017Cna by\u0142o uruchomi\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas. Kontynuowanie bez niej, poniewa\u017C podano opcj\u0119 -Xshareclasses\:nonfatal.
DUMP036=Niepoprawny filtr -Xdump lub brak tego filtru
SHRC203=Nie mo\u017Cna utworzy\u0107 tabeli mieszaj\u0105cej w mened\u017Cerze klas wsp\u00F3\u0142u\u017Cytkowanych
SHRC687=Nie mo\u017Cna utworzy\u0107 nowej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas, je\u015Bli podano opcj\u0119 -Xshareclasses\:readonly
DUMP035=U\u017Cytkownik za\u017C\u0105da\u0142 zrzutu %1$s przez %2$s
SHRC680=Niepowodzenie odtwarzania po wyst\u0105pieniu b\u0142\u0119du\: nie uda\u0142o si\u0119 usuni\u0119cie pliku kontrolnego zestawu semafor\u00F3w (%s) powi\u0105zanych ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
DUMP030=Nie mo\u017Cna zapisa\u0107 zrzutu w pliku %s\: %s
SHRC681=Osi\u0105gni\u0119to limit systemowy dla maksymalnej liczby semafor\u00F3w.
SHRC682=Osi\u0105gni\u0119to limit systemowy maksymalnej liczby region\u00F3w pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej lub limit systemowy pami\u0119ci przydzielonej dla region\u00F3w pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
DUMP032=Maszyna JVM za\u017C\u0105da\u0142a zrzutu %1$s z u\u017Cyciem '%2$s' w odpowiedzi na zdarzenie
SHRC683=Osi\u0105gni\u0119to limit systemowy maksymalnej liczby otwartych plik\u00F3w.
DUMP031=Nie utworzono \u017C\u0105danego zrzutu sterty, poniewa\u017C nie za\u017C\u0105dano blokady VM na wy\u0142\u0105czno\u015B\u0107. Dodaj request\=exclusive+prepwalk+compact do opcji -Xdump\:heap\: wiersza komend.
SHRC208=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla puli element\u00F3w tabeli mieszaj\u0105cej w CompiledMethodManagerImpl
SHRC209=W\u0142\u0105cz szczeg\u00F3\u0142owe dane wyj\u015Bciowe danych bajtowych
SHRC204=Nie mo\u017Cna utworzy\u0107 blokady mutex tabeli mieszaj\u0105cej w mened\u017Cerze klas wsp\u00F3\u0142u\u017Cytkowanych
SHRC688=\u015Acie\u017Cki klas mog\u0105 by\u0107 dodawane tylko przez pierwsze \u015Brodowisko JVM inicjuj\u0105ce pami\u0119\u0107 podr\u0119czn\u0105.
DUMP027=Nie utworzono \u017C\u0105danego zrzutu sterty, poniewa\u017C inny komponent ma blokad\u0119 maszyny VM na wy\u0142\u0105czno\u015B\u0107.
SHRC205=Niepowodzenie utworzenia nowej pozycji tabeli mieszaj\u0105cej w CompiledMethodManagerImpl
SHRC689=Pozwala \u015Brodowisku JVM na przechowywanie \u015Bcie\u017Cek klas w pami\u0119ci podr\u0119cznej utworzonej z opcj\u0105 "restrictClasspaths" (zastrze\u017Cone \u015Bcie\u017Cki klas).
DUMP026=Nazwa IEATDUMP przekracza maksymaln\u0105 dozwolon\u0105 d\u0142ugo\u015B\u0107. U\u017Cyto nazwy domy\u015Blnej.
SHRC206=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla pozycji tabeli mieszaj\u0105cej w CompiledMethodManagerImpl
DUMP029=\u017B\u0105danie u\u017Cycia opcji prepwalk lub compact przed utworzeniem zrzutu systemowego zostanie zignorowane, poniewa\u017C nie za\u017C\u0105dano blokady VM na wy\u0142\u0105czno\u015B\u0107.
SHRC207=Nie mo\u017Cna wej\u015B\u0107 do blokady mutex tabeli mieszaj\u0105cej CompiledMethodManager
DUMP028=Uzyskanie blokady VM na wy\u0142\u0105czno\u015B\u0107 przed utworzeniem zrzutu systemowego by\u0142o niemo\u017Cliwe.
SHRC673=Nie uda\u0142o si\u0119 zniszczy\u0107 zestawu semafor\u00F3w (semid\=%d) powi\u0105zanych ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
DUMP045=Liczba opcji musi by\u0107 mniejsza od %d, w\u0142\u0105czaj\u0105c w to opcje ustawione domy\u015Blnie.
SHRC674=U\u017Cytkownik nie ma uprawnie\u0144 do zniszczenia pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej (shmid\=%d). Pami\u0119\u0107 wsp\u00F3\u0142u\u017Cytkowan\u0105 mo\u017Ce zniszczy\u0107 tylko tw\u00F3rca, w\u0142a\u015Bciciel albo administrator.
DUMP044=Niepoprawna lub zarezerwowana poprawna warto\u015B\u0107 dla %s
SHRC675=Nie uda\u0142o si\u0119 zniszczy\u0107 pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej powi\u0105zanej ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
DUMP047=\u015Arodowisko VM jest zamykane. Przyczyna nie jest znana.
SHRC676=Nie uda\u0142o si\u0119 zniszczy\u0107 pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej (shmid\=%d) powi\u0105zanej ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
DUMP046=\u015Arodowisko VM jest zamykane. Przyczyna\: %2$.*1$s
DUMP041=Niepoprawne u\u017Cycie opcji -Xdump filtr_komunikat\u00F3w
SHRC670=Odtwarzanie po wyst\u0105pieniu b\u0142\u0119du\: pr\u00F3ba u\u017Cycia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej w trybie tylko do odczytu, je\u015Bli istnieje region pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej (reakcja na opcj\u0119 "-Xshareclasses\:nonfatal").
DUMP040=Zrzut %1$s zosta\u0142 zapisany w zestawie danych z u\u017Cyciem szablonu %2$s
SHRC671=U\u017Cytkownik nie ma uprawnie\u0144 do zniszczenia zestawu semafor\u00F3w (semid\=%d). Zestaw semafor\u00F3w mo\u017Ce zniszczy\u0107 tylko tw\u00F3rca, w\u0142a\u015Bciciel albo administrator.
DUMP043=%s nie jest obs\u0142ugiwane na tej platformie
SHRC672=Nie uda\u0142o si\u0119 zniszczy\u0107 zestawu semafor\u00F3w powi\u0105zanych ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
DUMP042=Podczas dzia\u0142ania na stosie Java odebrano sygna\u0142 przerwania. Agenty zrzutu JVM nie mog\u0105 dzia\u0142a\u0107.
SHRC677=Kod b\u0142\u0119du warstwy port\u00F3w \= %1$d
DUMP038=Zrzut typu snap nie zostanie zapisany z powodu \u015Bledzenia w pliku\: %1$s
SHRC678=Komunikat o b\u0142\u0119dzie platformy\: %1$s
DUMP037=B\u0142\u0105d w zrzucie %1$s\: %2$s. Kod b\u0142\u0119du %3$d
SHRC679=Niepowodzenie odtwarzania po wyst\u0105pieniu b\u0142\u0119du\: nie uda\u0142o si\u0119 usuni\u0119cie pliku kontrolnego zestawu semafor\u00F3w (%s) powi\u0105zanych ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 klas.
DUMP039=Przetwarzanie zdarzenia zrzutu "%1$s", szczeg\u00F3\u0142 "%3$.*2$s"\: %4$s - prosz\u0119 czeka\u0107.
J9CL008=wyra\u017Cona w nanosekundach warto\u015B\u0107 limitu czasu nie mie\u015Bci si\u0119 w poprawnym zakresie
J9CL009=W\u0105tek zosta\u0142 ju\u017C uruchomiony
SHRC222=Nie mo\u017Cna tworzy\u0107/u\u017Cywa\u0107 trwa\u0142ych wsp\u00F3\u0142u\u017Cytkowanych pami\u0119ci podr\u0119cznych klas, poniewa\u017C odwzorowywanie pami\u0119ci nie obs\u0142uguje wymaganych mo\u017Cliwo\u015Bci
SHRC223=Nie mo\u017Cna tworzy\u0107/u\u017Cywa\u0107 trwa\u0142ych wsp\u00F3\u0142u\u017Cytkowanych pami\u0119ci podr\u0119cznych klas, poniewa\u017C blokowanie plik\u00F3w nie jest obs\u0142ugiwane
SHRC224=Brak pami\u0119ci dla lokalnej kopii nazwy pami\u0119ci podr\u0119cznej
SHRC225=B\u0142\u0105d uzyskania \u015Bcie\u017Cki pliku pami\u0119ci podr\u0119cznej
SHRC220=Kod b\u0142\u0119du warstwy port\u00F3w \= %1$d
SHRC221=Komunikat o b\u0142\u0119dzie platformy\: %1$s
J9CL010=Niepowodzenie przydzia\u0142u JNIEnv
SHRC226=B\u0142\u0105d podczas otwierania wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC227=B\u0142\u0105d podczas nak\u0142adania blokady zapisu nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC228=B\u0142\u0105d podczas aktualizowania czasu ostatniego przy\u0142\u0105czenia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC229=B\u0142\u0105d\: Plik wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas ma niepoprawny nag\u0142\u00F3wek
J9CL015=Utworzenie \u015Bledzenia stosu nie powiod\u0142o si\u0119 (najprawdopodobniej z powodu braku pami\u0119ci w systemie operacyjnym).
J9CL016=Nie mo\u017Cna utworzy\u0107 nowej pozycji \u015Bcie\u017Cki klasy
J9CL017=Nie mo\u017Cna przydzieli\u0107 zasobu timezone
J9CL018=Nie mo\u017Cna przydzieli\u0107 pozycji timezone
J9CL011=Niepowodzenie utworzenia w\u0105tku systemu operacyjnego
J9CL012=
J9CL013=Niepowodzenie utworzenia monitora systemu operacyjnego
J9CL014=Niepoprawny argument wiersza komendy JCL
SHRC690=Zastrze\u017Cone \u015Bcie\u017Cki klas             \= tak
SHRC211=Wyszukiwanie danych bajtowych dla klucza %.*s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej...
SHRC695=Przywr\u00F3\u0107 z obrazu stanu now\u0105, nietrwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105
SHRC212=Zapisywanie danych bajtowych dla klucza %.*s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej...
SHRC696=Podopcje "%s" i "%s" nie s\u0105 kompatybilne. Podopcja "%s" zosta\u0142a zignorowana.
SHRC213=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla pozycji tabeli mieszaj\u0105cej w ByteDataManagerImpl
SHRC697=Niepowodzenie uzyskania katalogu dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC214=Nie mo\u017Cna wej\u015B\u0107 do blokady mutex tabeli mieszaj\u0105cej ByteDataManager
SHRC698=Pomy\u015Blnie przywr\u00F3cono z obrazu stanu nietrwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 "%s"
SHRC691=Zastrze\u017Cone \u015Bcie\u017Cki klas             \= nie
SHRC692=Utw\u00F3rz obraz stanu istniej\u0105cej, nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC693=Zniszcz obraz stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej (u\u017Cyj parametru nazwy lub nazwy domy\u015Blnej)
SHRC210=[w\u0142\u0105czono szczeg\u00F3\u0142owe dane wyj\u015Bciowe danych bajtowych -Xshareclasses]
SHRC694=Zniszcz wszystkie obrazy stanu wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC219=[w\u0142\u0105czono dost\u0119p do grupy -Xshareclasses dla nowych pami\u0119ci podr\u0119cznych]
SHRC215=Utw\u00F3rz trwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas
SHRC699=Przywr\u00F3cenie z obrazu stanu nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s" si\u0119 nie powiod\u0142o
SHRC216=Utw\u00F3rz nietrwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas
SHRC217=[w\u0142\u0105czono trwa\u0142\u0105 pami\u0119\u0107 podr\u0119czn\u0105 -Xshareclasses]
SHRC218=[wy\u0142\u0105czono trwa\u0142\u0105 pami\u0119\u0107 podr\u0119czn\u0105 -Xshareclasses]
J9CL004=Niekompatybilna wersja biblioteki klas\: oczekiwano JCL v%1$i, znaleziono v%2$i
J9CL005=Niekompatybilna wersja biblioteki klas\: wymaga VM v%1$i, znaleziono v%2$i
J9CL006=Brak danych przedweryfikacyjnych dla java/lang/Object
J9CL007=ujemna warto\u015B\u0107 limitu czasu
J9CL000=Niekompatybilna biblioteka klas
J9CL001=Spr\u00F3buj uruchomi\u0107 z opcj\u0105 -jcl\:%s
J9CL002=Klasy pochodz\u0105 z biblioteki innej ni\u017C J9 lub z niepoprawnie zredukowanego pliku JXE
J9CL003=Niekompatybilna wersja biblioteki klas\: JCL %1$x, VM %2$x
SHRC244=B\u0142\u0105d podczas pobierania d\u0142ugo\u015Bci pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC245=B\u0142\u0105d podczas odwzorowywania pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC246=Przy\u0142\u0105czono trwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas %1$s
SHRC247=B\u0142\u0105d\: Motyw g\u0142\u00F3wny nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas jest niepoprawny
SHRC240=B\u0142\u0105d\: nie mo\u017Cna na\u0142o\u017Cy\u0107 blokady zapisu w trakcie przy\u0142\u0105czania pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC241=B\u0142\u0105d\: nie mo\u017Cna usun\u0105\u0107 pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC242=B\u0142\u0105d podczas aktualizowania czasu ostatniego od\u0142\u0105czenia pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC243=B\u0142\u0105d podczas zwalniania blokady odczytu w trakcie przy\u0142\u0105czania pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC248=B\u0142\u0105d\: Wersja nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas jest niepoprawna
SHRC249=B\u0142\u0105d\: Poziom modlevel nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas jest niepoprawny
SHRC233=B\u0142\u0105d podczas tworzenia nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC234=B\u0142\u0105d podczas nak\u0142adania blokady odczytu w trakcie przy\u0142\u0105czania pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC235=B\u0142\u0105d podczas zwalniania blokady odczytu w trakcie przy\u0142\u0105czania pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC236=Utworzono trwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas %1$s
SHRC230=B\u0142\u0105d inicjowania nag\u0142\u00F3wka danych wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC231=B\u0142\u0105d podczas ustawiania d\u0142ugo\u015Bci pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC232=Nie mo\u017Cna utworzy\u0107 pami\u0119ci podr\u0119cznej w trybie tylko do odczytu
SHRC237=Otwarto trwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas %1$s
SHRC238=B\u0142\u0105d\: wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna klas nie zosta\u0142a przy\u0142\u0105czona
SHRC239=B\u0142\u0105d\: nie mo\u017Cna na\u0142o\u017Cy\u0107 blokady zapisu nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC260=Niepowodzenie utworzenia puli w ByteDataManager
SHRC261=W\u0142\u0105cz szczeg\u00F3\u0142owe dane wyj\u015Bciowe internowania \u0142a\u0144cucha
SHRC266=[w\u0142\u0105czono buforowanie -Xshareclasses ponownie przekszta\u0142conych klas]
SHRC267=Wy\u0142\u0105cz buforowanie klas z bootclasspath
SHRC268=[wy\u0142\u0105czono buforowanie -Xshareclasses pozycji bootclasspath]
SHRC269=System nie obs\u0142uguje ochrony stron pami\u0119ci
SHRC262=Bajty danych       \= %d
SHRC263=W\u0142\u0105cz szczeg\u00F3\u0142owe dane wyj\u015Bciowe CompositeCache
SHRC264=Nie zaokr\u0105glaj obszar\u00F3w pami\u0119ci podr\u0119cznej do granic strony
SHRC265=Klasy pami\u0119ci podr\u0119cznej ponownie przekszta\u0142cane przez JVMTI
EXEL013=\  -Xmn<x>         Ustawienie wielko\u015Bci nowego obszaru na <x>.
EXEL014=\  -Xmn<x>         Ustawienie pocz\u0105tkowej/maksymalnej wielko\u015Bci nowego \n                  obszaru na <x>.
EXEL015=\  -Xmns<x>        Ustawienie pocz\u0105tkowej wielko\u015Bci nowego obszaru na <x>.
EXEL016=\  -Xmnx<x>        Ustawienie maksymalnej wielko\u015Bci nowego obszaru na <x>.
EXEL017=\  -Xmo<x>         Ustawienie wielko\u015Bci starego obszaru na <x>.
EXEL018=\  -Xmo<x>         Ustawienie pocz\u0105tkowej/maksymalnej wielko\u015Bci starego\n                  obszaru na <x>.
EXEL019=\  -Xmos<x>        Ustawienie pocz\u0105tkowej wielko\u015Bci starego obszaru na <x>.
EXEL010=Warto\u015Bci o przyrostkach "k" (kilo) lub "m" (mega) mno\u017Cone s\u0105 przez \nodpowiedni wsp\u00F3\u0142czynnik.\n
EXEL011=\  -Xmca<x>        Ustawienie warto\u015Bci przyrostu segmentu klasy RAM na <x>.
EXEL012=\  -Xmco<x>        Ustawienie warto\u015Bci przyrostu segmentu klasy ROM na <x>.
SHRC250=Nie mo\u017Cna otworzy\u0107 pami\u0119ci podr\u0119cznej w trybie tylko do odczytu, poniewa\u017C nie zosta\u0142a zainicjowana
SHRC255=B\u0142\u0105d podczas aktualizowania czasu ostatniego od\u0142\u0105czenia pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas przy wyj\u015Bciu z maszyny JVM
SHRC256=Trwa\u0142a wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna "%1$s" zosta\u0142a zniszczona
SHRC257=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla elementu listy wska\u017Anikowej w mened\u017Cerze
SHRC258=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na pozycj\u0119 tabeli mieszaj\u0105cej w mened\u017Cerze
SHRC251=Nie nale\u017Cy automatycznie usuwa\u0107 pami\u0119ci podr\u0119cznych z r\u00F3\u017Cnych identyfikator\u00F3w buildID
SHRC252=B\u0142\u0105d podczas wyszukiwania pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC253=B\u0142\u0105d podczas zapisywania nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC254=B\u0142\u0105d podczas ustawiania d\u0142ugo\u015Bci pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
EXEL002=\  -Xbootclasspath/p\:<\u015Bcie\u017Cka>  Dopisanie warto\u015Bci <\u015Bcie\u017Cka> na pocz\u0105tku\n                               opcji startowej classpath.
EXEL003=\  -Xbootclasspath/a\:<\u015Bcie\u017Cka>  Dopisanie warto\u015Bci <\u015Bcie\u017Cka> na ko\u0144cu\n                               opcji startowej classpath.
EXEL004=\n  -Xrun<biblioteka>[\:opcje]  za\u0142aduj w\u0142asn\u0105 bibliotek\u0119 agenta\n                            (straci\u0142o aktualno\u015B\u0107 na rzecz -agentlib)\n
EXEL005=\  -Xint           Uruchomienie tylko w trybie interpretowanym \n                  (odpowiednik -Xnojit -Xnoaot).
SHRC259=Nie mo\u017Cna wej\u015B\u0107 do blokady mutex tabeli mieszaj\u0105cej mened\u017Cera
EXEL006=\  -Xnojit         Wy\u0142\u0105czenie JIT.
EXEL007=\  -Xnoaot         Bez uruchamiania kodu prekompilowanego.
EXEL008=\  -Xfuture       W\u0142\u0105czenie naj\u015Bci\u015Blejszego sprawdzania\n                  (przewidywana przysz\u0142a opcja domy\u015Blna).
EXEL009=\nArgumenty nast\u0119puj\u0105cych opcji wyra\u017Cane s\u0105 w bajtach.
EXEL000=Nast\u0119puj\u0105ce opcje s\u0105 niestandardowe i mog\u0105 ulec zmianie bez powiadomienia.\n
EXEL001=\  -Xbootclasspath\:<\u015Bcie\u017Cka>    Ustawienie opcji startowej classpath na \n                               warto\u015B\u0107 <\u015Bcie\u017Cka>.
SHRC280=Wy\u015Bwietlanie listy wszystkich pami\u0119ci podr\u0119cznych w katalogu cacheDir %s
SHRC281=Pr\u00F3ba zniszczenia wszystkich pami\u0119ci podr\u0119cznych w katalogu cacheDir %s
SHRC282=Wielko\u015B\u0107 strony w systemie operacyjnym jest niekompatybilna z t\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105. Zostanie wykonana pr\u00F3ba ponownego utworzenia pami\u0119ci podr\u0119cznej.
SHRC283=Otw\u00F3rz pami\u0119\u0107 podr\u0119czn\u0105 z uprawnieniami tylko do odczytu
SHRC288=identyfikator pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej \= %d
SHRC289=Nie wykrywaj, gdy pami\u0119\u0107 podr\u0119czna znajduje si\u0119 w zdalnym sieciowym systemie plik\u00F3w
SHRC284=Nie mo\u017Cna utworzy\u0107 pami\u0119ci podr\u0119cznej w trybie tylko do odczytu
SHRC285=Otwarto trwa\u0142\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas %1$s w trybie tylko do odczytu
SHRC286=Otwarto wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas %1$s w trybie tylko do odczytu
SHRC287=Trwa\u0142a pami\u0119\u0107 podr\u0119czna nie mo\u017Ce znajdowa\u0107 si\u0119 w sieciowym systemie plik\u00F3w. Wybierz opcj\u0119 "nonpersistent" lub wybierz inny katalog cacheDir.
EXEL035=\  -Xminf<x>       Minimalny procent wolnej sterty po wykonaniu GC.
EXEL036=\  -Xmaxf<x>       Maksymalny procent wolnej sterty po wykonaniu GC.
EXEL037=\nArgumenty nast\u0119puj\u0105cych opcji wyra\u017Cane s\u0105 jako liczby dziesi\u0119tne.\n
EXEL038=\  -Xgcthreads<x>                Ustawienie liczby w\u0105tk\u00F3w GC.
EXEL039=\  -Xnoclassgc                   Wy\u0142\u0105czenie dynamicznego usuwania klas z pami\u0119ci.
EXEL030=\  -Xss<x>         Ustawienie wielko\u015Bci stosu w\u0105tk\u00F3w na <x>.
EXEL031=\  -Xmine<x>       Ustawienie minimalnej wielko\u015Bci rozszerzenia sterty na <x>.
EXEL032=\  -Xmaxe<x>       Ustawienie maksymalnej wielko\u015Bci rozszerzenia sterty na <x>.
EXEL033=\nArgumenty nast\u0119puj\u0105cych opcji wyra\u017Cane s\u0105 jako u\u0142amki dziesi\u0119tne od 0 do 1.
EXEL034=Warto\u015B\u0107 0,3 reprezentuje \u017C\u0105danie o warto\u015Bci 30%%.\n
SHRC270=Skonfiguruj ochron\u0119 stron pami\u0119ci podr\u0119cznej
SHRC271=Nierozpoznana podopcja opcji mprotect\=
SHRC272=W\u0142\u0105czenie pe\u0142nej ochrony stron pami\u0119ci podr\u0119cznej powiod\u0142o si\u0119
SHRC277=Aby uruchomi\u0107 program narz\u0119dziowy "%s" na nietrwa\u0142ej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s", nale\u017Cy te\u017C u\u017Cy\u0107 podopcji "nonpersistent"
SHRC278=Program narz\u0119dziowy "%s" nie mo\u017Ce dzia\u0142a\u0107 na pami\u0119ci podr\u0119cznej "%s" niekompatybilnej klasy. U\u017Cyj poprawnego poziomu maszyny JVM.
SHRC279=Ponownie utw\u00F3rz wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 podczas uruchamiania
SHRC273=W\u0142\u0105czenie domy\u015Blnej ochrony stron pami\u0119ci podr\u0119cznej powiod\u0142o si\u0119
SHRC274=Ochrona stron pami\u0119ci podr\u0119cznej wy\u0142\u0105czona
SHRC275=Okre\u015Bl po\u0142o\u017Cenie plik\u00F3w pami\u0119ci podr\u0119cznej JVM
SHRC276=Aby uruchomi\u0107 program narz\u0119dziowy "%s" na pami\u0119ci podr\u0119cznej klasy trwa\u0142ej "%s", nie nale\u017Cy u\u017Cywa\u0107 podopcji "nonpersistent"
EXEL024=\  -Xmx<x>         Ustawienie maksymalnej wielko\u015Bci pami\u0119ci na <x>.
EXEL025=\  -Xmr<x>         Ustawienie wielko\u015Bci zapami\u0119tanego zbioru na <x>.
EXEL026=\  -Xmrx<x>        Ustawienie maksymalnej wielko\u015Bci zapami\u0119tanego zbioru na <x>.
EXEL027=\  -Xmso<x>        Ustawienie wielko\u015Bci stosu w\u0105tk\u00F3w systemu operacyjnego\n                  na <x>.
EXEL028=\  -Xiss<x>        Ustawienie pocz\u0105tkowej wielko\u015Bci stosu w\u0105tk\u00F3w program\u00F3w \n                  java na <x>.
EXEL029=\  -Xss<x>         Ustawienie maksymalnej wielko\u015Bci stosu w\u0105tk\u00F3w program\u00F3w \n                  java na <x>.
EXEL020=\  -Xmox<x>        Ustawienie maksymalnej wielko\u015Bci starego obszaru na <x>.
EXEL021=\  -Xmoi<x>        Ustawienie warto\u015Bci przyrostu starego obszaru na <x>.
EXEL022=\  -Xms<x>         Ustawienie wielko\u015Bci starego obszaru na <x>.
EXEL023=\  -Xms<x>         Ustawienie pocz\u0105tkowej wielko\u015Bci pami\u0119ci na <x>.
EXEL057=
EXEL058=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Brak pami\u0119ci
EXEL059=B\u0142\u0105d wewn\u0119trzny maszyny VM\: Nie znaleziono klasy java/lang/String
EXEL050=\  -Xrdbginfo\:<host>\:<port>      w\u0142\u0105czenie serwera informacji ze zdalnego debugowania
EXEL051=\nOSTRZE\u017BENIE\: Argument wiersza komend "%s" jest nieaktualny.\nOSTRZE\u017BENIE\: Nale\u017Cy u\u017Cywa\u0107 "-classpath <\u015Bcie\u017Cka>" lub "-cp <\u015Bcie\u017Cka>".
EXEL052=\nOSTRZE\u017BENIE\: Argument wiersza komend "%s" jest nieaktualny.\nOSTRZE\u017BENIE\: Nale\u017Cy u\u017Cywa\u0107 odpowiednika -X.
EXEL053=
EXEL054=
EXEL055=Cel\: %s
EXEL056=
SHRC291=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla pozycji tabeli mieszaj\u0105cej w ROMClassResourceManager
SHRC292=Nie mo\u017Cna wej\u015B\u0107 do blokady mutex tabeli mieszaj\u0105cej ROMClassResourceManager
SHRC293=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla puli element\u00F3w tabeli mieszaj\u0105cej w ROMClassResourceManager
SHRC294=%1$d\: 0x%2$p CHARARRAY\: w 0x%3$p.
SHRC290=Niepowodzenie utworzenia nowej pozycji tabeli mieszaj\u0105cej w ROMClassResourceManager
SHRC299=Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna klas "%s" nie zosta\u0142a utworzona z zagnie\u017Cd\u017Con\u0105 opcj\u0105; zwi\u0119kszenie tej pami\u0119ci podr\u0119cznej jest niemo\u017Cliwe
SHRC295=Wy\u0142\u0105cz zale\u017Cno\u015B\u0107 od posiadania zmiennej CORE_MMAP w systemie AIX
SHRC296=Uruchomienie z opcj\u0105 "noCoreMmap" oznacza, \u017Ce IBM nie b\u0119dzie w stanie udzieli\u0107 pomocy w sprawie awarii, poniewa\u017C w zrzutach systemowych nie b\u0119dzie danych klas
SHRC297=Aby u\u017Cywa\u0107 trwa\u0142ych wsp\u00F3\u0142u\u017Cytkowanych pami\u0119ci podr\u0119cznych klas w systemie AIX, dla zmiennej \u015Brodowiskowej CORE_MMAP nale\u017Cy ustawi\u0107 warto\u015B\u0107 "yes"
SHRC298=Aby uruchomi\u0107 program narz\u0119dziowy "%s" z wykorzystaniem trwa\u0142ej pami\u0119ci podr\u0119cznej "%s", u\u017Cyj podopcji "persistent"
EXEL046=\  -Xlp                          W\u0142\u0105czenie obs\u0142ugi du\u017Cych stron.
EXEL047=\n  -Xdbg\:<opcje>                 W\u0142\u0105czenie debugowania, standardowe opcje JDWP.
EXEL048=\  -Xrunjdwp\:<opcje>             W\u0142\u0105czenie debugowania, standardowe opcje JDWP.
EXEL049=\  -Xdbginfo\:<\u015Bcie\u017Cka pliku symboli>\n                                W\u0142\u0105czenie serwera informacji z debugowania.
EXEL040=\  -Xclassgc                     W\u0142\u0105czenie dynamicznego usuwania klas z pami\u0119ci.
EXEL041=\  -Xalwaysclassgc               W\u0142\u0105czenie dynamicznego usuwania klas z pami\u0119ci\n                                podczas ka\u017Cdego wykonania GC.
EXEL042=\  -Xnocompactexplicitgc         Wy\u0142\u0105czenie pakowania danych przez systemowy GC.
EXEL043=\  -Xcompactexplicitgc           W\u0142\u0105czenie pakowania danych przez ka\u017Cdy \n                                systemowy GC.
EXEL044=\  -Xcompactgc                   W\u0142\u0105czenie pakowania danych.
EXEL045=\  -Xnocompactgc                 Wy\u0142\u0105czenie pakowania danych.
SHRC192=Warto\u015B\u0107 opcji -Xscmaxaot jest wi\u0119ksza ni\u017C warto\u015B\u0107 opcji -Xscmx, dlatego zosta\u0142a ona ustawiona na warto\u015B\u0107 nieograniczon\u0105
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC194=\tdla ROMClass %2$.*1$s w 0x%3$p.
SHRC195=W\u0142\u0105cz szczeg\u00F3\u0142owe dane wyj\u015Bciowe AOT
SHRC190=Warto\u015B\u0107 opcji -Xscminaot nie powinna by\u0107 wi\u0119ksza od warto\u015Bci opcji -Xscmaxaot
SHRC191=Warto\u015B\u0107 opcji -Xscminaot jest wi\u0119ksza ni\u017C warto\u015B\u0107 opcji -Xscmx, dlatego zosta\u0142a ona ustawiona na warto\u015B\u0107 r\u00F3wn\u0105 warto\u015Bci opcji -Xscmx
SHRC196=[w\u0142\u0105czono szczeg\u00F3\u0142owe dane wyj\u015Bciowe AOT -Xshareclasses]
SHRC197=Wyszukiwanie kodu AOT dla ROMMethod 0x%1$p we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej...
SHRC198=Zapisywanie kodu AOT dla ROMMethod 0x%1$p we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej...
SHRC199=\ Pomy\u015Blne zapisanie %2$.*1$s.
TRCE020=Podczas zatrzymywania mechanizmu \u015Bledzenia przekroczono limit czasu
JNCK097=\tadvice         wy\u015Bwietl porady
JNCK098=B\u0142\u0105d JNI w %1$s\: argument nr %2$d oczekuje\: %3$s %4$s, podano\: %5$s %6$s
JNCK095=B\u0142\u0105d JNI w warto\u015Bci zwracanej\: typ powrotu jest referencj\u0105, ale warto\u015B\u0107 (0x%1$p) nie jest poprawn\u0105 referencj\u0105 do obiektu. Jej typ to\: %2$s
JNCK096=\twarn           wy\u015Bwietl ostrze\u017Cenia
JNCK099=B\u0142\u0105d JNI w %1$s\: argument nr %2$d wymaga typu, kt\u00F3ry nie jest tablic\u0105
JNCK090=Wykryto ostrze\u017Cenie w ramce procedury obs\u0142ugi zdarzenia JVMPI lub JVMTI\n
JNCK093=B\u0142\u0105d JNI w %s\: Metoda nie jest konstruktorem
JNCK094=B\u0142\u0105d JNI w %1$s\: Dane wskazywane przez argument nr %2$d zosta\u0142y zmodyfikowane podczas wykonywania %3$s. Dane mog\u0142y zosta\u0107 zmodyfikowane przez inny w\u0105tek lub przez zagnie\u017Cd\u017Cone wywo\u0142anie. Wynik %4$s mo\u017Ce by\u0107 niepoprawny, a maszyna wirtualna mo\u017Ce utraci\u0107 stabilno\u015B\u0107.
JNCK091=Wykryto porad\u0119 w ramce procedury obs\u0142ugi zdarzenia JVMPI lub JVMTI\n
JNCK092=\tvalist         sprawdzenie ponownego wykorzystania va_list
JNCK086=Ostrze\u017Cenie JNI w %1$s\: Argumentem nr %2$d nie jest java/nio/Buffer. %3$s zwr\u00F3ci kod b\u0142\u0119du
JNCK087=B\u0142\u0105d JNI w %1$s\: Argumentem nr %2$d nie jest java/lang/reflect/Method ani java/lang/reflect/Constructor
JNCK084=Wykryto ostrze\u017Cenie w JNI_OnLoad biblioteki %.*s\n
JNCK085=Wykryto porad\u0119 w JNI_OnLoad biblioteki %.*s\n
JNCK088=Ostrze\u017Cenie JNI w %1$s\: Argument nr %2$d jest s\u0142ab\u0105 referencj\u0105. S\u0142aba referencja mo\u017Ce w dowolnym momencie uzyska\u0107 warto\u015B\u0107 NULL. Nale\u017Cy dokona\u0107 promocji referencji przy u\u017Cyciu NewLocalRef lub NewGlobalRef, a nast\u0119pnie por\u00F3wna\u0107 j\u0105 z warto\u015Bci\u0105 NULL przed wywo\u0142aniem %3$s.
JNCK089=Wykryto b\u0142\u0105d w ramce procedury obs\u0142ugi zdarzenia JVMPI lub JVMTI\n
CFRE020=niepoprawny PC uruchomienia procedury obs\u0142ugi wyj\u0105tku
CFRE021=zduplikowane pole
CFRE022=thisClass musi by\u0107 klas\u0105
CFRE023=pusta pula sta\u0142ych
CFRE024=nazwa klasy musi by\u0107 \u0142a\u0144cuchem
CFRE025=pole ma dwa atrybuty ConstantValue
CFRE026=nierozpoznany typ kodu bajtowego newarray
CFRE027=kod bajtowy multianewarray musi odnosi\u0107 si\u0119 do klasy tablicy
CFRE017=wiele atrybut\u00F3w StackMap/StackMapTable
CFRE018=klasa wewn\u0119trzna musi by\u0107 klas\u0105
CFRE019=niepoprawne uruchomienie PC zmiennej lokalnej
CFRE031=zg\u0142oszony wyj\u0105tek musi by\u0107 klas\u0105
CFRE032=nadklas\u0105 interfejsu musi by\u0107 java.lang.Object
CFRE033=zakres procedury obs\u0142ugi wyj\u0105tku jest pusty
CFRE034=niekompletny kod bajtowy
CFRE035=nowy kod bajtowy musi odnosi\u0107 si\u0119 do klasy
CFRE036=cel nie jest instrukcj\u0105 w kodzie bajtowym jump
CFRE037=temp zawiera niew\u0142a\u015Bciwy typ
CFRE038=metoda ma dwa atrybuty Exceptions
CFRE030=nadklasa ma warto\u015B\u0107 null
CFRE028=kod bajtowy ldc* musi odnosi\u0107 si\u0119 do sta\u0142ej
CFRE029=kod bajtowy multianewarray musi odnosi\u0107 si\u0119 do klasy
CFRE000=%1$s; klasa\=%3$.*2$s, metoda\=%5$.*4$s%7$.*6$s, pc\=%8$u
CFRE001=%1$s; klasa\=%3$.*2$s, pozycja\=%4$u
CFRE002=niepoprawna nazwa metody
CFRE003=b\u0142\u0119dna wersja g\u0142\u00F3wna
CFRE004=nieznany kod bajtowy
CFRE005=zduplikowany interfejs
CFRE010=ujemna liczba par zgodno\u015Bci i pozycji w kodzie bajtowym instrukcji lookupswitch
CFRE011=kod bajtowy anewarray musi odnosi\u0107 si\u0119 do klasy
CFRE012=warto\u015B\u0107 sta\u0142a musi by\u0107 warto\u015Bci\u0105
CFRE013=niepoprawna d\u0142ugo\u015B\u0107 zmiennej lokalnej PC
CFRE014=atrybut Code okre\u015Blony dla rodzimej lub abstrakcyjnej metody
CFRE015=interfejsy musz\u0105 by\u0107 klasami
CFRE016=indeks zmiennej lokalnej poza zakresem w przyro\u015Bcie
CFRE006=niepoprawny atrybut StackMap/StackMapTable
CFRE007=niepoprawna sygnatura pola
CFRE008=wysoka < niska w kodzie bajtowym tableswitch
CFRE009=pole interfejsu musi by\u0107 publiczne statyczne i finalne
CFRE064=deskryptor musi by\u0107 \u0142a\u0144cuchem UTF8
CFRE065=wiele atrybut\u00F3w metody obejmuj\u0105cej
CFRE066=wiele atrybut\u00F3w InnerClasses
CFRE067=nieznany znacznik pozycji puli sta\u0142ych
CFRE068=niepoprawna nazwa klasy
CFRE069=d\u0142ugo\u015B\u0107 atrybutu wi\u0119ksza ni\u017C dane atrybutu
CFRE060=PC zako\u0144czenia procedury obs\u0142ugi wyj\u0105tku nie jest instrukcj\u0105 ani ko\u0144cem tablicy kod\u00F3w bajtowych
CFRE061=nazwa musi by\u0107 \u0142a\u0144cuchem UTF8
CFRE062=maks. lokalne mniejsze ni\u017C wielko\u015B\u0107 argument\u00F3w
CFRE063=kod bajtowy wywo\u0142ania wywo\u0142uje niepoprawn\u0105 metod\u0119
JNCK039=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d ma warto\u015B\u0107 NULL
JNCK037=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d (0x%3$p) nie jest referencj\u0105 lokaln\u0105. Jego typem jest\: %4$s
JNCK038=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d (0x%3$p) nie jest poprawn\u0105 referencj\u0105 obiektu. Jego typem jest\: %4$s\n
JNCK031=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d ma warto\u015B\u0107 NULL
JNCK032=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d nie jest tablic\u0105 jobjectArray
JNCK030=B\u0142\u0105d JNI w %s\: Nie mo\u017Cna wywo\u0142a\u0107 tej funkcji, gdy wy\u0142\u0105czono GC (prawdopodobnie zosta\u0142a wywo\u0142ana ze zdarzenia JVMPI lub JVMTI)
JNCK035=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d (0x%3$p) nie jest referencj\u0105 globaln\u0105. Jego typem jest\: %4$s
JNCK036=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d (0x%3$p) nie jest s\u0142ab\u0105 referencj\u0105 globaln\u0105. Jego typem jest\: %4$s
JNCK033=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d nie jest tablic\u0105 jarray
JNCK034=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d nie jest obiektem %3$s
CFRE075=niepoprawna sygnatura zmiennej lokalnej
CFRE076=b\u0142\u0119dna liczba charakterystyczna
CFRE077=interfejsy musz\u0105 by\u0107 abstraktami
CFRE078=indeks klasy metody obejmuj\u0105cej musi odnosi\u0107 si\u0119 do klasy
CFRE079=niepoprawny PC procedury obs\u0142ugi wyj\u0105tku
CFRE070=niepoprawny PC numeru wiersza
CFRE071=tablica kod\u00F3w bajtowych jest pusta
CFRE072=pozycje nie s\u0105 posortowane w kodzie bajtowym lookupswitch
CFRE073=atrybut StackMap/StackMapTable znaleziono poza atrybutem Code
CFRE074=nieokre\u015Blony atrybut Code
JNCK028=B\u0142\u0105d JNI w %s\: Nie mo\u017Cna wywo\u0142a\u0107 tej funkcji, gdy wyj\u0105tek jest w toku
JNCK029=B\u0142\u0105d JNI w %s\: Funkcji tej nie mo\u017Cna wywo\u0142a\u0107 wewn\u0105trz sekcji krytycznej
JNCK026=B\u0142\u0105d JNI w %s\: JNIEnv nie wygl\u0105da na poprawny w\u0105tek lub uszkodzona zosta\u0142a pami\u0119\u0107, lub nie jest to maszyna wirtualna J9
JNCK027=B\u0142\u0105d JNI w %s\: JNIEnv nie jest JNIEnv dla aktywnego w\u0105tku
JNCK020=referencja debugera
JNCK021=referencja lokalna w innym w\u0105tku
JNCK024=Wykryto b\u0142\u0105d JNI. Przerywanie.
JNCK025=U\u017Cyj opcji -Xcheck\:jni\:nonfatal, aby kontynuowa\u0107 dzia\u0142anie w razie wykrycia b\u0142\u0119d\u00F3w.
JNCK022=zwolniona referencja lokalna
JNCK023=Wykryto b\u0142\u0105d JNI. Kontynuacja...
CFRE042=wielko\u015B\u0107 tablicy kod\u00F3w bajtowych > 65535
CFRE043=nie mo\u017Cna utworzy\u0107 szerokiego kodu bajtowego
CFRE044=kod bajtowy invokeinterface zarezerwowa\u0142 niezerowe gniazdo
CFRE045=indeks puli sta\u0142ych poza zakresem
CFRE046=niepoprawne dope\u0142nienie kodu bajtowego prze\u0142\u0105cznika
CFRE047=klasa interfejsu mo\u017Ce by\u0107 tylko publiczna, abstrakcyjna lub adnotacj\u0105
CFRE048=indeks zmiennej lokalnej poza zakresem w pami\u0119ci
CFRE049=kod bajtowy checkcast musi odnosi\u0107 si\u0119 do klasy
CFRE040=d\u0142ugo\u015B\u0107 atrybutu mniejsza ni\u017C dane atrybutu
CFRE041=b\u0142\u0119dna wersja drugorz\u0119dna
JNCK017=referencja lokalna
JNCK018=referencja globalna
JNCK015=\thelp           wy\u015Bwietlanie niniejszego ekranu
JNCK016=NULL
JNCK019=s\u0142aba referencja globalna
CFRE039=indeks zmiennej lokalnej poza zakresem w \u0142adowaniu
JNCK010=\tnonfatal       bez ko\u0144czenia dzia\u0142ania w razie wykrycia b\u0142\u0119d\u00F3w
JNCK013=\tnovalist       bez sprawdzania ponownego wykorzystania va_list
JNCK014=\tpedantic       dokonywanie dok\u0142adniejszego, lecz wolniejszego sprawdzenia
JNCK011=\tnowarn         bez wy\u015Bwietlania ostrze\u017Ce\u0144
JNCK012=\tnoadvice       bez wy\u015Bwietlania porad
CFRE053=metoda zawiera wi\u0119cej ni\u017C 255 szczelin argument\u00F3w
CFRE054=kod bajtowy pola musi odnosi\u0107 si\u0119 do Fieldref
CFRE055=niepoprawny PC zako\u0144czenia procedury obs\u0142ugi wyj\u0105tku
CFRE056=niepoprawna ilo\u015B\u0107 argument\u00F3w kodu bajtowego invokeinterface
CFRE057=typ procedury obs\u0142ugi wyj\u0105tku musi by\u0107 klas\u0105
CFRE058=indeks zmiennej lokalnej poza zakresem w powrocie z procedury
CFRE059=PC procedury obs\u0142ugi wyj\u0105tku nie jest instrukcj\u0105
CFRE050=metoda interfejsu musi by\u0107 publiczna i abstrakcyjna
CFRE051=sta\u0142a \u0142a\u0144cuchowa musi by\u0107 \u0142a\u0144cuchem
CFRE052=klasa zewn\u0119trzna musi by\u0107 klas\u0105
JNCK006=\tall            sprawdzanie klas aplikacji i systemowych
JNCK007=\tverbose        \u015Bledzenie pewnych funkcji i dzia\u0142a\u0144 JNI
JNCK004=jnichk - JNI Check utility for J9, wersja %s
JNCK005=Sk\u0142adnia\: -Xcheck\:jni\:[opcja[,opcja[,...]]]
JNCK008=\ttrace          \u015Bledzenie wszystkich funkcji JNI
JNCK009=\tnobounds       bez sprawdzania granic \u0142a\u0144cuch\u00F3w i tablic
JNCK002=Program narz\u0119dziowy sprawdzania JNI\: nie mo\u017Cna zarejestrowa\u0107 zdarzenia
JNCK003=Program narz\u0119dziowy sprawdzania JNI\: nie mo\u017Cna przydzieli\u0107 lokalnej pami\u0119ci masowej maszyny VM
JNCK000=-Xcheck\:jni\: nierozpoznana opcja --> '%s'
JNCK001=Zainstalowano program narz\u0119dziowy sprawdzania JNI. U\u017Cyj opcji -Xcheck\:jni\:help, aby uzyska\u0107 informacje o sk\u0142adni
JNCK082=Wykryto porad\u0119 w najbardziej zewn\u0119trznej ramce przy\u0142\u0105czonego w\u0105tku\n
JNCK083=Wykryto b\u0142\u0105d w JNI_OnLoad biblioteki %.*s\n
JNCK080=Wykryto b\u0142\u0105d w najbardziej zewn\u0119trznej ramce przy\u0142\u0105czonego w\u0105tku\n
JNCK081=Wykryto ostrze\u017Cenie w najbardziej zewn\u0119trznej ramce przy\u0142\u0105czonego w\u0105tku\n
SHRC604=Rezerwacja <liczba> bajt\u00F3w w pami\u0119ci podr\u0119cznej na dane surowe klasy
TRCE009=B\u0142\u0105d podczas zapisywania w pliku snap
SHRC605=Wielko\u015B\u0107 pami\u0119ci dla "%s" jest zbyt du\u017Ca albo podano jednostk\u0119 inn\u0105 ni\u017C 'K', 'M' lub 'G'.
TRCE008=B\u0142\u0105d podczas wykonywania operacji seek w pliku \u015Bledzenia\: %s
SHRC606=Dodaj do metod niefunkcjonalne podpowiedzi JIT w celu testowania; u\u017Cyj z opcj\u0105 -Xint i wst\u0119pnie zape\u0142nion\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105.
SHRC607=Zapisano przy\u0142\u0105czone dane (%1$s) %2$s dla %8$.*7$s.%4$.*3$s%6$.*5$s
SHRC600=Obszar danych surowych klasy jest uszkodzony, poniewa\u017C zapisanie %u bajt\u00F3w przekroczy ilo\u015B\u0107 dost\u0119pnego miejsca ('pocz\u0105tek wolnego miejsca'\=%p, 'koniec wolnego miejsca'\=%p).
SHRC601=Wielko\u015B\u0107 obszaru danych surowych klasy    %*c\= %lu
SHRC602=Procent wykorzystania obszaru danych surowych klasy      %*c\= %lu%%
SHRC603=Wykorzystane bajty danych surowych klasy         %*c\= %lu
JNCK075=B\u0142\u0105d wewn\u0119trzny jnichk w %1$s\: Nierozpoznany deskryptor 0x%2$x
TRCE001=Wyst\u0105pi\u0142 b\u0142\u0105d podczas przetwarzania opcji \u015Bledzenia\: -Xtrace\:%s
JNCK076=B\u0142\u0105d wewn\u0119trzny jnichk w %s\: Brak pami\u0119ci
TRCE000=Nierozpoznana opcja \u015Bledzenia\: -Xtrace\:%s
JNCK073=Porada JNI w %1$s\: Okre\u015Blono opcj\u0119 JNI_ABORT, ale nie mo\u017Cna jej honorowa\u0107, poniewa\u017C zmodyfikowane zosta\u0142y dane.\n(Oryginalna warto\u015B\u0107 CRC\=0x%2$x, nowa warto\u015B\u0107 CRC\=0x%3$x).\nPoniewa\u017C %4$s zwr\u00F3ci\u0142o rzeczywist\u0105 zawarto\u015B\u0107 tablicy, zmiany nie zostan\u0105 odrzucone. By\u0107 mo\u017Ce nie tego oczekiwano.
TRCE003=Wyst\u0105pi\u0142 b\u0142\u0105d podczas przetwarzania opcji \u015Bledzenia, szczeg\u00F3\u0142y\: %s
JNCK074=Porada JNI w %s\: Bufor wygl\u0105da na niezmodyfikowany. Rozwa\u017C u\u017Cycie opcji JNI_ABORT zamiast trybu 0.
TRCE002=Wyst\u0105pi\u0142 b\u0142\u0105d podczas przetwarzania opcji \u015Bledzenia\: -Xtrace\:%s\=%s
TRCE005=B\u0142\u0105d podczas zapisywania nag\u0142\u00F3wka w pliku \u015Bledzenia\: %s
SHRC608=Znaleziono przy\u0142\u0105czone dane (%1$s) %2$s dla %8$.*7$s.%4$.*3$s%6$.*5$s
JNCK079=Wykryto porad\u0119 w %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE004=B\u0142\u0105d podczas otwierania pliku \u015Bledzenia\: %s
SHRC609=Zaktualizowano przy\u0142\u0105czone dane (%1$s) %2$s dla %8$.*7$s.%4$.*3$s%6$.*5$s
TRCE007=B\u0142\u0105d podczas otwierania kolejnego generowanego pliku \u015Bledzenia\: %s
JNCK077=Wykryto b\u0142\u0105d w %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE006=B\u0142\u0105d podczas zapisywania %d bajt\u00F3w do pliku \u015Bledzenia\: %s, rc\: %d
JNCK078=Wykryto ostrze\u017Cenie w %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK071=Ostrze\u017Cenie JNI\: Pami\u0119\u0107 pod adresem 0x%1$p uzyskana przez %2$s nie zosta\u0142a zwolniona przed powrotem z funkcji rodzimej. Prawdopodobnie jest to przeciek pami\u0119ci.
JNCK072=Porada JNI w %1$s\: Okre\u015Blono opcj\u0119 JNI_COMMIT, ale zostanie ona zignorowana.\nPoniewa\u017C %2$s zwr\u00F3ci\u0142o rzeczywist\u0105 zawarto\u015B\u0107 tablicy, bufor b\u0119dzie niepoprawny po tym wywo\u0142aniu. By\u0107 mo\u017Ce nie tego oczekiwano.
TRCE010=Niepowodzenie przydzia\u0142u pami\u0119ci rodzimej, powr\u00F3t do ustawienia \u015Bledzenia nodynamic.
JNCK070=Ostrze\u017Cenie JNI w %1$s\: Oryginalne dane tablicy zosta\u0142y zmodyfikowane pomi\u0119dzy %2$s i %3$s.\n(Oryginalna warto\u015B\u0107 CRC\=0x%4$x, nowa warto\u015B\u0107 CRC\=0x%5$x).\nPoniewa\u017C %6$s zwr\u00F3ci\u0142o kopi\u0119 zawarto\u015Bci tablicy, nowa zawarto\u015B\u0107 zostanie utracona.
TRCE019=Zainicjowanie mechanizmu \u015Bledzenia nie powiod\u0142o si\u0119, RC \= %d
JNCK064=Ostrze\u017Cenie JNI w %1$s\: Pojemno\u015B\u0107 globalnej puli s\u0142abych referencji wzros\u0142a automatycznie od warto\u015Bci %2$d do warto\u015Bci %3$d.\nMo\u017Ce to by\u0107 przejawem przecieku pami\u0119ci.
TRCE012=Nie mo\u017Cna otworzy\u0107 pliku licznika punktu \u015Bledzenia %s, liczniki przekierowane na standardowe wyj\u015Bcie b\u0142\u0119d\u00F3w.
JNCK065=Ostrze\u017Cenie JNI w %1$s\: Pojemno\u015B\u0107 lokalnej ramki referencji wzros\u0142a automatycznie od warto\u015Bci %2$d do warto\u015Bci %3$d.\n Liczba referencji w u\u017Cyciu\: %4$d.\nU\u017Cyj EnsureLocalCapacity lub PushLocalFrame, aby jawnie zwi\u0119kszy\u0107 ramk\u0119.
TRCE011=Modu\u0142 nie jest skonfigurowany do \u015Bledzenia\: %s
JNCK062=Ostrze\u017Cenie JNI w %s\: Funkcji tej nie nale\u017Cy wywo\u0142ywa\u0107 wewn\u0105trz sekcji krytycznej
TRCE014=Inicjowanie mechanizmu \u015Bledzenia nie powiod\u0142o si\u0119, \u015Bledzenie nie zosta\u0142o w\u0142\u0105czone
JNCK063=Ostrze\u017Cenie JNI w %1$s\: Pojemno\u015B\u0107 globalnej puli referencji wzros\u0142a automatycznie od warto\u015Bci %2$d do warto\u015Bci %3$d.\nMo\u017Ce to by\u0107 przejawem przecieku pami\u0119ci.
TRCE013=Zapisywanie informacji licznika \u015Bledzenia w %s
TRCE016=Pami\u0119\u0107 masowa dla RasGlobalStorage jest niedost\u0119pna, \u015Bledzenie nie zosta\u0142o w\u0142\u0105czone
JNCK068=Ostrze\u017Cenie JNI w %1$s\: Pocz\u0105tek lub indeks nie mie\u015Bci si\u0119 w poprawnym zakresie (%2$d >\= %3$d)
JNCK069=Ostrze\u017Cenie JNI w %1$s\: Koniec nie mie\u015Bci si\u0119 w poprawnym zakresie (%2$d + %3$d > %4$d)
TRCE015=B\u0142\u0105d podczas rejestrowania subskrybenta zapisu \u015Bledzenia
TRCE018=Nie mo\u017Cna przydzieli\u0107 w\u0105tkowi UTE klucza lokalnej pami\u0119ci masowej
JNCK066=Ostrze\u017Cenie JNI w %1$s\: Okre\u015Blono ujemny pocz\u0105tek lub indeks (%2$d)
TRCE017=Nie mo\u017Cna przydzieli\u0107 w\u0105tkowi RAS klucza lokalnej pami\u0119ci masowej
JNCK067=Ostrze\u017Cenie JNI w %1$s\: Okre\u015Blono ujemn\u0105 d\u0142ugo\u015B\u0107 regionu (%2$d)
CFRE086=metoda ma dwa atrybuty Code
CFRE087=kod bajtowy metody interfejsu musi odnosi\u0107 si\u0119 do InterfaceMethodref
CFRE088=nazwa zmiennej lokalnej musi by\u0107 \u0142a\u0144cuchem
CFRE089=oczekiwana jest nazwa i typ
JNCK060=Ostrze\u017Cenie JNI w %1$s\: Argument nr %2$d jest zniekszta\u0142conym podpisem metody ("%3$s")
JNCK061=Ostrze\u017Cenie JNI w %1$s\: Argument nr %2$d jest zniekszta\u0142conym podpisem pola ("%3$s")
SHRC620=B\u0142\u0105d podczas otwierania regionu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej. Plik steruj\u0105cy jest uszkodzony.
CFRE080=niepoprawna sygnatura metody
SHRC621=B\u0142\u0105d podczas otwierania regionu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej. Niezgodno\u015B\u0107 w identyfikatorze pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
CFRE081=plik \u017Ar\u00F3d\u0142owy musi by\u0107 zakodowany w UTF8
CFRE082=metoda <init> nie mo\u017Ce by\u0107 statyczna, finalna, synchronizuj\u0105ca, rodzima ani abstrakcyjna
CFRE083=klasa jest zar\u00F3wno abstrakcyjna, jak i finalna
CFRE084=bez b\u0142\u0119du
CFRE085=nazwa wewn\u0119trzna musi by\u0107 \u0142a\u0144cuchem
SHRC626=Nie mo\u017Cna uzyska\u0107 statystyk pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej, poniewa\u017C nie istnieje poprawna pami\u0119\u0107 wsp\u00F3\u0142u\u017Cytkowana.
SHRC627=Ponowne utworzenie pliku steruj\u0105cego pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej nie jest dopuszczalne przy pracy w trybie tylko do odczytu.
SHRC628=Nie mo\u017Cna odczyta\u0107 pliku steruj\u0105cego pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
JNCK059=Ostrze\u017Cenie JNI w %1$s\: Argument nr %2$d jest zniekszta\u0142conym identyfikatorem ("%3$s")
SHRC629=Plik steruj\u0105cy pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej jest tylko do odczytu.
SHRC622=B\u0142\u0105d podczas otwierania regionu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej. Niezgodno\u015B\u0107 w kluczu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
SHRC623=B\u0142\u0105d podczas otwierania regionu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej. Niepowodzenie sprawdzania identyfikatora grupy.
SHRC624=B\u0142\u0105d podczas otwierania regionu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej. Niepowodzenie sprawdzania identyfikatora u\u017Cytkownika.
SHRC625=B\u0142\u0105d podczas otwierania regionu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej. Niepowodzenie sprawdzania wielko\u015Bci pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej.
JNCK053=B\u0142\u0105d JNI\: Przed powrotem funkcji nale\u017Cy zwolni\u0107 \u015Bcie\u017Ck\u0119 krytyczn\u0105
JNCK054=B\u0142\u0105d JNI w %1$s\: Nierozpoznana opcja trybu %2$d
JNCK051=B\u0142\u0105d wewn\u0119trzny maszyny VM w %1$s\: Liczba bajt\u00F3w umieszczonych na stosie %2$p jest mniejsza od liczby bajt\u00F3w referencji JNI %3$p
JNCK052=B\u0142\u0105d JNI w %1$s\: Klasa %3$.*2$s jest przestarza\u0142a
JNCK057=B\u0142\u0105d JNI w %1$s\: Nie nale\u017Cy u\u017Cywa\u0107 %2$s w celu zwolnienia pami\u0119ci 0x%3$p uzyskanej za pomoc\u0105 %4$s
JNCK058=Ostrze\u017Cenie JNI w %1$s\: Po wywo\u0142aniu %2$s, ale przed wywo\u0142aniem %3$s nale\u017Cy sprawdzi\u0107 wyst\u0105pienie wyj\u0105tk\u00F3w, korzystaj\u0105c z ExceptionCheck, ExceptionClear lub ExceptionOccurred
JNCK055=B\u0142\u0105d JNI w %1$s\: Wska\u017Anik 0x%2$p nie zosta\u0142 zwr\u00F3cony przez funkcj\u0119 JNI lub zosta\u0142 ju\u017C zwolniony
JNCK056=B\u0142\u0105d JNI w %1$s\: Uzyskano pami\u0119\u0107 0x%2$p z obiektu 0x%3$p; zwalnianie z 0x%4$p
CFRE097=zduplikowany wpis klasy wewn\u0119trznej w atrybucie InnerClasses
CFRE098=sygnatura zmiennej lokalnej musi by\u0107 \u0142a\u0144cuchem
CFRE099=niedozwolone modyfikatory metody
JNCK050=B\u0142\u0105d JNI w %s\: Wywo\u0142ano PopLocalFrame bez ramki lokalnej na stosie
CFRE090=nowy kod bajtowy nie mo\u017Ce tworzy\u0107 tablic
CFRE091=PC uruchomienia procedury obs\u0142ugi wyj\u0105tku nie jest instrukcj\u0105
SHRC610=Wy\u0142\u0105cz obs\u0142ug\u0119 instrumentacji kodu bajtowego.
CFRE092=niepoprawna sygnatura
CFRE093=metoda mo\u017Ce by\u0107 albo publiczna, albo prywatna, albo chroniona
CFRE094=kod bajtowy instanceof musi odnosi\u0107 si\u0119 do klasy
CFRE095=adnotacje musz\u0105 by\u0107 interfejsami
CFRE096=cel nie jest instrukcj\u0105 w kodzie bajtowym switch
SHRC615=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania semafora. Niezgodno\u015B\u0107 w kluczu semafora.
SHRC616=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania semafora. Niezgodno\u015B\u0107 w liczbie semafor\u00F3w zestawu semafor\u00F3w.
SHRC617=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania semafora. W zestawie semafor\u00F3w nie znaleziono znacznika semafora.
JNCK048=B\u0142\u0105d JNI w %s\: Niew\u0142a\u015Bciwy odbiornik
SHRC618=Plik steruj\u0105cy semafora jest nieczytelny.
JNCK049=B\u0142\u0105d JNI w %s\: Wykryto ponowne wykorzystanie va_list
SHRC611=Podano podopcj\u0119 "disableBCI", ale istniej\u0105ca pami\u0119\u0107 podr\u0119czna zosta\u0142a utworzona z podopcj\u0105 "enableBCI".
SHRC612=Sztucznie ustaw klucz pami\u0119ci masowej (0-15) w z/OS w celu testowania.
SHRC613=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania semafora. Plik steruj\u0105cy jest uszkodzony.
SHRC614=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania semafora. Niezgodno\u015B\u0107 w identyfikatorze semafora.
JNCK042=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d nie jest podklas\u0105 %3$s
JNCK043=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d; nie mo\u017Cna znale\u017A\u0107 %3$s
JNCK040=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d jest poza zakresem dla %3$s (0x%4$x < 0x%5$x)
JNCK041=B\u0142\u0105d JNI w %1$s\: Argument nr %2$d jest poza zakresem dla %3$s (0x%4$x > 0x%5$x)
SHRC619=Plik steruj\u0105cy semafora jest tylko do odczytu.
JNCK046=B\u0142\u0105d JNI w %1$s\: Metoda zwraca b\u0142\u0119dny typ ('%2$c')
JNCK047=B\u0142\u0105d JNI w %s\: Niepoprawny argument clazz
JNCK044=B\u0142\u0105d JNI w %s\: Metoda jest statyczna (static)
JNCK045=B\u0142\u0105d JNI w %s\: Metoda nie jest statyczna (static)
SHRC520=\t classpath   Drukuje tylko typy \u015Bcie\u017Cek klas we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC521=\t url               Drukuje tylko typy adres\u00F3w URL we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC522=\t token           Drukuje tylko typy token\u00F3w we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC527=\t zipcache     Drukuje tylko typy zipcache we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC528=\t extra           Drukuje wszystkie nast\u0119puj\u0105ce typy prywatne we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC529=\t orphan         Drukuje tylko typy orphan we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC523=\t romclass     Drukuje tylko typy romclass we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC524=\t rommethod   Drukuje tylko typy rommethod we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC525=\t aot               Drukuje tylko typy aot we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC526=\t jitprofile Drukuje tylko typy jitprofile we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC510=Wy\u0142\u0105cz tworzenie zrzut\u00F3w uszkodzonych pami\u0119ci podr\u0119cznych
SHRC511=Z\u0142o\u017Cona pami\u0119\u0107 podr\u0119czna mia\u0142a niepoprawn\u0105 warto\u015B\u0107 flagi inicjowania. Warto\u015B\u0107 ccInitComplete\: %lu
SHRC516=Domy\u015Blnie wy\u015Bwietl wszystkie elementy w pami\u0119ci podr\u0119cznej. U\u017Cyj printallstats\=help, aby pozna\u0107 dost\u0119pne opcje.
SHRC517=Nierozpoznana podopcja opcji printallstats\=. U\u017Cyj printallstats\=help, aby pozna\u0107 dost\u0119pne opcje.
SHRC518=Opcje dost\u0119pne dla -Xshareclasses\:printAllStats\=<opcje>. U\u017Cyj znaku '+', aby poda\u0107 wiele opcji, np\: printallstats\=aot+url \n
SHRC519=\t all               Drukuje wszystkie nast\u0119puj\u0105ce typy we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC512=brak danych w pami\u0119ci podr\u0119cznej
SHRC513=Ustaw uprawnienia w stylu systemu unix podczas tworzenia katalog\u00F3w pami\u0119ci podr\u0119cznej
SHRC514=Niepoprawne ustawienie opcji cacheDirPerm. Musz\u0105 to by\u0107 uprawnienia w stylu uprawnie\u0144 systemu plik\u00F3w systemu unix z zakresu 0700 - 0777 lub 1700 - 1777 (\u00F3semkowo).
SHRC515=Niepowodzenie uzyskania domy\u015Blnego katalogu pami\u0119ci podr\u0119cznej.
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC549=-Xshareclasses\:checkStringTableReset mo\u017Ce nie powie\u015B\u0107 si\u0119. Tabela \u0142a\u0144cuch\u00F3w nie jest wystarczaj\u0105co du\u017Ca. Musi ona by\u0107 wi\u0119ksza ni\u017C wielko\u015B\u0107 strony systemu operacyjnego. Wielko\u015B\u0107 tabeli \= %d, Wielko\u015B\u0107 strony \= %d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC547=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla tablicy znakowej w shrinit
SHRC548=Wymu\u015B sprawdzanie dla resetowania tabeli \u0142a\u0144cuch\u00F3w, gdy jest oznaczana jako uszkodzona.
SHRC530=\t jithint       Drukuje tylko typy jithint we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC531=\t aotch           Drukuje tylko typy aotch we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC532=\t aotthunk     Drukuje tylko typy aotthunk we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC533=\t aotdata       Drukuje tylko typy aotdata we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC534=\t jcl               Drukuje tylko typy jcl we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC535=\t bytedata     Drukuje wszystkie pozosta\u0142e typy danych bajtowych we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej.
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s Adres\: 0x%5$p Wielko\u015B\u0107\: %6$d
SHRC563=Otwieranie pami\u0119ci podr\u0119cznej typu Realtime, kt\u00F3ra nie jest kompatybilna z tym \u015Brodowiskiem JVM; u\u017Cyj opcji -Xrealtime, aby uzyska\u0107 dost\u0119p do tej pami\u0119ci podr\u0119cznej.
SHRC564=[-Xshareclasses w\u0142\u0105czono wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 dla wielu go\u015Bci]
SHRC565=Tworzenie wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC566=Niepoprawny nag\u0142\u00F3wek eyecatcher we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC560=Niew\u0142a\u015Bciwa nazwa wewn\u0119trznej pami\u0119ci podr\u0119cznej.
SHRC561=Niepowodzenie inicjowania wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas; brak wystarczaj\u0105cej ilo\u015Bci miejsca w systemie plik\u00F3w. Dost\u0119pne wolne miejsce na dysku w bajtach \= %lld, \u017C\u0105dana liczba bajt\u00F3w \= %lld.
SHRC562=Odczytano uszkodzone dane dla nag\u0142\u00F3wka pozycji pami\u0119ci podr\u0119cznej 0x%p (niepoprawna d\u0142ugo\u015B\u0107 elementu %u bajt\u00F3w)
SHRC567=Otwarto wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas dla wielu go\u015Bci %1$s w trybie tylko do odczytu
SHRC568=Otwarto wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas dla wielu go\u015Bci %1$s
SHRC569=Utworzono wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas dla wielu go\u015Bci %1$s
SHRC552=Nie mo\u017Cna przydzieli\u0107 \u017C\u0105danej wielko\u015Bci bloku dla pami\u0119ci podr\u0119cznej "%s". Dost\u0119pne bajty \= %d, \u017B\u0105dane bajty \= %d
SHRC553=Pami\u0119\u0107 podr\u0119czna zawiera tylko klasy z numerami wierszy
SHRC554=Pami\u0119\u0107 podr\u0119czna zawiera tylko klasy bez numer\u00F3w wierszy
SHRC555=Pami\u0119\u0107 podr\u0119czna zawiera klasy z numerami wierszy i klasy bez numer\u00F3w wierszy
SHRC550=Brak flagi wykonawczej ROUND_TO_PAGE_SIZE. -Xshareclasses\:checkStringTableReset wymaga, aby tabela \u0142a\u0144cuch\u00F3w zosta\u0142a zaokr\u0105glona do wielko\u015Bci strony.
SHRC551=Pami\u0119\u0107 podr\u0119czna "%s" jest oznaczona jako pe\u0142na. Niepowodzenie przydzia\u0142u wielko\u015Bci bloku \= %d.
SHRC556=Wy\u015Bwietl podsumowanie statystyki pami\u0119ci podr\u0119cznej. U\u017Cyj printstats\=help, aby pozna\u0107 dost\u0119pne opcje.
SHRC557=Nierozpoznana podopcja opcji printstats\=. U\u017Cyj printstats\=help, aby pozna\u0107 dost\u0119pne opcje.
SHRC558=Opcje dost\u0119pne dla -Xshareclasses\:printStats\=<opcje>. U\u017Cyj znaku '+', aby poda\u0107 wiele opcji, np\: printstats\=aot+url \n
SHRC559=Niepowodzenie utworzenia katalogu "%s" dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC580=B\u0142\u0105d podczas zwalniania blokady odczytu podczas przy\u0142\u0105czania wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC101=\tIndeks %1$d w \u015Bcie\u017Cce klasy 0x%2$p
SHRC585=B\u0142\u0105d podczas pozyskiwania blokady zapisu w nag\u0142\u00F3wku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC102=\tURL 0x%p
SHRC586=B\u0142\u0105d\: wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna klas dla wielu go\u015Bci ma niepoprawny nag\u0142\u00F3wek
SHRC103=\tToken 0x%p
SHRC587=B\u0142\u0105d podczas aktualizowania czasu ostatniego przy\u0142\u0105czenia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC104=%1$d\: CLASSPATH 0x%2$p
SHRC588=B\u0142\u0105d podczas zwalniania blokady odczytu nag\u0142\u00F3wka wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC581=B\u0142\u0105d podczas odwzorowania obiektu wsp\u00F3\u0142u\u017Cytkowanego dla wielu go\u015Bci
SHRC582=B\u0142\u0105d\: nie mo\u017Cna usun\u0105\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC583=B\u0142\u0105d podczas aktualizowania czasu ostatniego od\u0142\u0105czenia dla wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s w 0x%5$p.
SHRC584=B\u0142\u0105d podczas pozyskiwania blokady odczytu podczas przy\u0142\u0105czania wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC109=\!NIEAKTUALNE\!
SHRC105=%1$d\: URL 0x%2$p
SHRC589=Tworzenie pami\u0119ci podr\u0119cznej z obs\u0142ug\u0105 instrumentacji kodu bajtowego.
SHRC106=%1$d\: TOKEN 0x%2$p
SHRC107=\t%.*s
SHRC108=\t%.*s
SHRC574=W sieciowym systemie plik\u00F3w nie mo\u017Cna zlokalizowa\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla wielu go\u015Bci. Wybierz opcj\u0119 "nonpersistent" lub wybierz inny katalog cacheDir.
SHRC575=B\u0142\u0105d podczas uzyskiwania blokady dla nag\u0142\u00F3wka we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC576=Nie mo\u017Cna otworzy\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla wielu go\u015Bci w trybie tylko do odczytu, poniewa\u017C nie zosta\u0142a jeszcze zainicjowana
SHRC577=Nie mo\u017Cna utworzy\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla wielu go\u015Bci w trybie tylko do odczytu
SHRC570=Zniszczono wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 dla wielu go\u015Bci "%1$s"
SHRC571=Przy\u0142\u0105czono wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas dla wielu go\u015Bci %1$s
SHRC572=Znaleziono niepoprawn\u0105 specyfikacj\u0119 celu. Cel okre\u015Blony w nag\u0142\u00F3wku pami\u0119ci podr\u0119cznej\: %s, oczekiwano\: %s.
SHRC573=Opcja "-Xshareclasses\:%s" podana w wierszu komend wymaga opcji "-Xvirt"
SHRC578=B\u0142\u0105d podczas tworzenia nag\u0142\u00F3wka we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas dla wielu go\u015Bci
SHRC579=B\u0142\u0105d podczas inicjowania nag\u0142\u00F3wka danych wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla wielu go\u015Bci
SHRC123=%% klas nieaktualnych \= %1$d%%\n
SHRC124=Pami\u0119\u0107 podr\u0119czna jest zape\u0142niona w %1$d%%\n
SHRC125=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na bufor \u0142a\u0144cuch\u00F3w w SH_CacheMap
SHRC126=Za\u017C\u0105dano dodania zbyt wielu element\u00F3w do ClasspathItem
SHRC120=L. adres\u00F3w URL   \= %d
SHRC121=L. token\u00F3w       \= %d
SHRC122=L. klas nieakt.  \= %d
SHRC127=Niepowodzenie SH_CompositeCache\:\:enterMutex z kodem powrotu %d. Ostrze\u017Cenie\: pami\u0119\u0107 podr\u0119czna mo\u017Ce by\u0107 uszkodzona.
SHRC128=Niepowodzenie SH_CompositeCache\:\:exitMutex z kodem powrotu %d. Ostrze\u017Cenie\: pami\u0119\u0107 podr\u0119czna mo\u017Ce by\u0107 uszkodzona.
SHRC129=Pr\u00F3ba ustawienia warto\u015Bci readerCount na -1\!
SHRC590=Podano podopcj\u0119 "enableBCI", ale istniej\u0105ca pami\u0119\u0107 podr\u0119czna nie zosta\u0142a utworzona z podopcj\u0105 "enableBCI".
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
SHRC112=wska\u017Anik przydzielania \= 0x%p\n
SHRC596=Wykonaj dodatkowe sprawdzanie podczas zapisywania i przydzielania nieodpowiednich danych klasy.
SHRC113=Wielk. pam. pod. \= %d
SHRC597=-Xshareclasses\:rcdSize\=%u - liczba bajt\u00F3w jest wi\u0119ksza od %u bajt\u00F3w dost\u0119pnego miejsca, zamiast tego zostanie u\u017Cyta opcja -Xshareclasses\:rcdSize\=%u.
SHRC114=Wolne bajty      \= %d
SHRC598=Obszar danych surowych klasy jest uszkodzony, poniewa\u017C jego wielko\u015B\u0107 (%lu) przekracza pojemno\u015B\u0107 pami\u0119ci podr\u0119cznej (%lu).
SHRC115=Bajty ROMClass   \= %d
SHRC599=Wolne miejsce obszaru danych surowych klasy jest uszkodzone ('pocz\u0105tek wolnego miejsca'\=%p, 'koniec wolnego miejsca'\=%p, 'dost\u0119pne miejsce'\=%lu bajt\u00F3w)
SHRC592=W\u0142\u0105czono BCI        \= prawda
SHRC593=W\u0142\u0105czono BCI        \= fa\u0142sz
SHRC110=\nadres bazowy       \= 0x%p
SHRC594=Podopcja -Xshareclasses\:cacheRetransformed nie jest kompatybilna ze wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105 utworzon\u0105 z u\u017Cyciem podopcji enableBCI
SHRC111=adres ko\u0144cowy      \= 0x%p
SHRC595=Opcje wiersza komend "%s" i "%s" s\u0105 niekompatybilne
SHRC116=Bajty metadanych \= %d
SHRC117=%% wykorzystania metadanych \= %1$d%%\n
SHRC118=L. klas ROMClass  \= %d
SHRC119=L. \u015Bcie\u017Cek klas  \= %d
J9TI006=Porzu\u0107 rozszerzone mo\u017Cliwo\u015Bci z capabilities_ptr.
J9TI007=Pobierz bie\u017C\u0105cy zbi\u00F3r rozszerzonych mo\u017Cliwo\u015Bci poprzez capabilities_ptr.
J9TI004=Poprzez capabilities_ptr zwraca dost\u0119pne w danej chwili rozszerzone mo\u017Cliwo\u015Bci.
SHRC140=wielko\u015B\u0107\:\t%1$d\t\t\t%2$d\n
J9TI005=Dodaj nowe rozszerzone mo\u017Cliwo\u015Bci z capabilities_ptr.
J9TI008=Wskazuje pocz\u0105tek fazy kompilacji JIT. (Nie jest bezpieczny ze wzgl\u0119du na procedury zwrotne)
J9TI009=Wskazuje koniec fazy kompilacji JIT. (Nie jest bezpieczny ze wzgl\u0119du na procedury zwrotne)
SHRC145=Odnajdywanie klasy %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d o adresie URL %4$.*3$s...
SHRC146=Odnajdywanie klasy %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d z tokenem %4$.*3$s...
VMUT001=(w\u0105tek bez nazwy)
SHRC147=Znak %.*s jest niepoprawny w nazwie klasy
VMUT000=(brak pami\u0119ci)
SHRC148=Zezw\u00F3l na dost\u0119p grupowy do pami\u0119ci podr\u0119cznej (u\u017Cytkownik jest domy\u015Blny)
VMUT003=Nie znaleziono pliku opcji
SHRC141=niezgodne bajty\:
VMUT002=(b\u0142\u0105d dost\u0119pu)
SHRC142=\tw 0x%1$p\t\t%2$x \!\= %3$x
VMUT005=Zbyt du\u017Ca warto\u015B\u0107 opcji\: '%s'
SHRC143=Zapisywanie klasy %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d o adresie URL %5$.*4$s...
VMUT004=Zniekszta\u0142cona opcja\: '%s'
SHRC144=Zapisywanie klasy %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d z tokenem %5$.*4$s...
SHRC149=W\u0142\u0105cz szczeg\u00F3\u0142owe dane wyj\u015Bciowe znajdowania/zapisywania
J9TI002=Nie znaleziono Agent_OnLoad w bibliotece %s
J9TI003=Niepowodzenie Agent_OnLoad w bibliotece %s
J9TI000=Brak pami\u0119ci podczas pr\u00F3by za\u0142adowania biblioteki agent\u00F3w %s
J9TI001=Nie mo\u017Cna otworzy\u0107 biblioteki agent\u00F3w %1$s (%2$s)
J9TI017=Steruje r\u00F3\u017Cnymi opcjami maszyny wirtualnej i kompilacji.
J9TI018=Ustawia metod\u0119 selektywnego powiadamiania o wej\u015Bciach i wyj\u015Bciach.
J9TI015=Za\u017C\u0105daj zrzutu monitora JLM (Java Lock Monitor).
J9TI016=Zezwalaj na wstawianie w obecno\u015Bci zdarze\u0144 wej\u015Bcia i wyj\u015Bcia metod (mo\u017Ce powodowa\u0107 niepoprawne raportowanie wej\u015Bcia i wyj\u015Bcia)
J9TI019=Ustawia tryb powiadamiania dla zdarze\u0144 rozszerzonych, zapewniaj\u0105c selektywno\u015B\u0107 na poziomie w\u0105tk\u00F3w
SHRC134=Niepowodzenie utworzenia puli w SH_ROMClassManagerImpl
VMUT010=Zniekszta\u0142cona warto\u015B\u0107 opcji; opcja "%1$s%3$.*2$s" zawiera znaki ko\u0144cz\u0105ce "%4$s", kt\u00F3re zosta\u0142y zignorowane
SHRC135=Niepowodzenie utworzenia tabeli mieszaj\u0105cej w SH_ROMClassManagerImpl
SHRC136=Nie mo\u017Cna utworzy\u0107 monitora w SH_ROMClassManagerImpl
VMUT012=%2$.*1$s nie jest bezpo\u015Brednim nadinterfejsem %4$.*3$s.
VMUT011=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na tablic\u0119 opcji wiersza komend
SHRC137=TRYB BEZPIECZNY\: Ostrze\u017Cenie\: Klasa ROMClass %.*s jest niezgodna z klas\u0105 ROMClass w pami\u0119ci podr\u0119cznej
SHRC130=Pr\u00F3ba przydzia\u0142u w trakcie trwania zatwierdzania
VMUT014=Klasa odbiornika %2$.*1$s musi by\u0107 bie\u017C\u0105c\u0105 klas\u0105 lub podtypem interfejsu %4$.*3$s
SHRC131=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na element listy zwi\u0105zanej w ROMClassManagerImpl
VMUT013=Niepoprawny plik opcji\: %s
SHRC132=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na pozycj\u0119 tabeli mieszaj\u0105cej w ROMClassManagerImpl
SHRC133=Nie mo\u017Cna wej\u015B\u0107 do blokady mutex tabeli mieszaj\u0105cej ROMClassManager
VMUT007=Zniekszta\u0142cona warto\u015B\u0107 JAVA_TOOL_OPTIONS
VMUT006=Znaleziono zniekszta\u0142con\u0105 opcj\u0119 %s w -Xoptionsfile
VMUT009=Zniekszta\u0142cona warto\u015B\u0107 -Xservice
VMUT008=Zniekszta\u0142cona warto\u015B\u0107 IBM_JAVA_OPTIONS
SHRC138=Znaleziono wi\u0119cej ni\u017C jedn\u0105 osierocon\u0105 klas\u0119 ROMClass dla %.*s
SHRC139=\n\tZapisywana klasa ROMClass\tKlasa ROMClass w pami\u0119ci podr\u0119cznej
J9TI010=Pozycja metody z rozszerzonymi informacjami o typie metody.
J9TI013=Zezwala na funkcje zwrotne przydzia\u0142\u00F3w typu instrumentable (tych, kt\u00F3re nie s\u0105 raportowane przez VMObjectAlloc).
J9TI014=Steruje monitorem JLM (Java Lock Monitor) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI011=Dodaj opcj\u0119 dynamiczn\u0105 -Xtrace
J9TI012=Dodaj opcj\u0119 dynamiczn\u0105 -Xdump
SHRC160=Przekroczono limit czasu podczas oczekiwania na utworzenie blokady mutex podczas otwierania semafora
SHRC161=Przekroczono limit czasu podczas oczekiwania na utworzenie blokady mutex podczas tworzenia pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej
SHRC162=Przekroczono limit czasu podczas oczekiwania na utworzenie blokady mutex podczas otwierania pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej
SHRC167=Wy\u0142\u0105cza wsp\u00F3\u0142u\u017Cytkowanie klas
SHRC168=\u0141\u0105cznie odczytanych bajt\u00F3w klasy wsp\u00F3\u0142u\u017Cytkowanej \= %1$lld. \u0141\u0105cznie bajt\u00F3w zapisanych \= %2$d
SHRC169=Wykryto zmian\u0119 w %2$.*1$s...\n \t...oznaczono %3$d klas w pami\u0119ci podr\u0119cznej jako nieaktualne
SHRC163=[w\u0142\u0105czono szczeg\u00F3\u0142owe dane wyj\u015Bciowe -Xshareclasses]
SHRC164=[w\u0142\u0105czono szczeg\u00F3\u0142owe dane wyj\u015Bciowe we/wy -Xshareclasses]
SHRC165=[w\u0142\u0105czono szczeg\u00F3\u0142owe dane wyj\u015Bciowe API programu pomocy -Xshareclasses]
SHRC166=Przy\u0142\u0105czono do pami\u0119ci podr\u0119cznej "%1$s", wielko\u015B\u0107\=%2$d bajt\u00F3w
SHRC150=W\u0142\u0105cz szczeg\u00F3\u0142owe dane wyj\u015Bciowe API programu pomocy
SHRC151=Pomi\u0144 wszystkie komunikaty
SHRC156=B\u0142\u0105d podczas kopiowania nazwy grupy do nazwy pami\u0119ci podr\u0119cznej
SHRC157=Nie mo\u017Cna przydzieli\u0107 %1$d bajt\u00F3w \u017C\u0105danej pami\u0119ci wsp\u00F3\u0142u\u017Cytk.\n \tPomy\u015Blnie przydzielono maksymaln\u0105 dozwolon\u0105 ilo\u015B\u0107 pami\u0119ci \n \twsp\u00F3\u0142u\u017Cytkowanej (%2$d bajt\u00F3w). (Aby zwi\u0119kszy\u0107 dost\u0119pn\u0105 pami\u0119\u0107\n \twsp\u00F3\u0142u\u017Cytkowan\u0105, zmodyfikuj warto\u015B\u0107 systemow\u0105 SHMMAX.)
SHRC158=Utworzono wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas "%1$s"
SHRC159=Otwarto wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 klas "%1$s"
SHRC152=Zawsze uruchamiaj maszyn\u0119 JVM pomimo b\u0142\u0119d\u00F3w/ostrze\u017Ce\u0144
SHRC153=Podaj nazw\u0119 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej\n \t(U\u017Cyj %%g, aby dokona\u0107 podstawienia nazwy grupy, lub %%u - dla nazwy u\u017Cytkownika)
SHRC154=Znak zmiany znaczenia %.*s jest niepoprawny w nazwie pami\u0119ci podr\u0119cznej
SHRC155=B\u0142\u0105d podczas kopiowania nazwy u\u017Cytkownika do nazwy pami\u0119ci podr\u0119cznej
SHRC181=Nie mo\u017Cna wej\u015B\u0107 do blokady mutex ScopeManagerImpl
SHRC182=Nie mo\u017Cna utworzy\u0107 monitora w ScopeManagerImpl
SHRC183=Nie mo\u017Cna utworzy\u0107 tabeli mieszaj\u0105cej w ScopeManagerImpl
SHRC184=\tPartycja %.*s
SHRC180=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci dla pozycji tabeli mieszaj\u0105cej w ScopeManagerImpl
SHRC189=L. metod AOT       \= %d
SHRC185=\tModContext %.*s
SHRC186=\tPartycja %.*s w kontek\u015Bcie ModContext %.*s
SHRC187=Wy\u0142\u0105cz zapisywanie danych AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC188=Bajty AOT          \= %d
SHRC170=Podaj nazw\u0119 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej\n \t(U\u017Cyj %%u, aby dokona\u0107 podstawienia nazwy u\u017Cytkownika)
SHRC171=System z/OS nie mo\u017Ce utworzy\u0107 pami\u0119ci podr\u0119cznej o \u017C\u0105danej wielko\u015Bci\: Sprawd\u017A ustawienia BPXPRMxx w systemie z/OS
SHRC172=Nie mo\u017Cna utworzy\u0107 pami\u0119ci podr\u0119cznej o \u017C\u0105danej wielko\u015Bci z powodu ogranicze\u0144 systemu operacyjnego.
SHRC173=Ustaw katalog dla plik\u00F3w steruj\u0105cych JVM (zaawansowane)
SHRC178=Ignorowanie opcji noIncrementalUpdates z powodu u\u017Cycia opcji singleJVM
SHRC179=Segment ROMClass zosta\u0142 uszkodzony. B\u0142\u0105d podczas odczytu ROMClass z 0x%p
SHRC174=W\u0142\u0105cz optymalizacj\u0119 dla pojedynczego u\u017Cycia maszyny JVM
SHRC175=Trwanie pami\u0119ci podr\u0119cznej mi\u0119dzy restartami (tylko w systemie Windows)
SHRC176=W\u0142\u0105czono relokacj\u0119 niezmiennika \u0142a\u0144cucha
SHRC177=Nie mo\u017Cna uruchomi\u0107 trybu bezpiecznego z powodu u\u017Cycia opcji singleJVM
SHRC082=Nie mo\u017Cna utworzy\u0107 identifiedMutex w SH_ClasspathManagerImpl2
J9VM039=Opcja -Xscmx jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
SHRC083=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na tablic\u0119 identifiedClasspaths w SH_ClasspathManagerImpl2
SHRC084=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na element listy zwi\u0105zanej
SHRC085=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na nag\u0142\u00F3wek elementu listy zwi\u0105zanej
SHRC080=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na pozycj\u0119 tabeli mieszaj\u0105cej
SHRC081=Nie mo\u017Cna utworzy\u0107 cpeTableMutex w SH_ClasspathManagerImpl2
SHRC086=Nie mo\u017Cna wej\u015B\u0107 do blokady mutex tabeli mieszaj\u0105cej ClasspathManager
SHRC087=Niepowodzenie MarkStale podczas ClasspathManager\:\:update()
SHRC088=Niepowodzenie utworzenia pami\u0119ci podr\u0119cznej jako ROMImageSegment w SH_CacheMap
SHRC089=Nie mo\u017Cna utworzy\u0107 blokady mutex od\u015Bwie\u017Cania w SH_CacheMap
J9TI060=Tworzy subskrypcj\u0119 szczeg\u00F3\u0142owych rekord\u00F3w GC
J9TI061=Anuluje subskrypcj\u0119 szczeg\u00F3\u0142owych rekord\u00F3w GC
J9VM030=W funkcji JNI u\u017Cyto niepoprawnego UTF8
J9VM031=Klasa wymagana %2$.*1$s musi by\u0107 w \u015Bcie\u017Cce startowej classpath, ale znaleziono j\u0105 w \u015Bcie\u017Cce klas aplikacji %4$.*3$s
J9TI064=Funkcja inicjowania agenta %s nie powiod\u0142a si\u0119 dla biblioteki %s, kod powrotu %d
CDRT000=Nie mo\u017Cna znale\u017A\u0107 mapy stosu JIT - przerywanie dzia\u0142ania maszyny VM
J9VM032=B\u0142\u0105d nienaprawialny\: Nie mo\u017Cna za\u0142adowa\u0107 %1$s\: %2$s
J9TI065=Funkcja inicjowania agenta %s nie zosta\u0142a znaleziona w bibliotece %s
J9VM033=B\u0142\u0105d nienaprawialny\: Niepowodzenie inicjowania %s
J9TI062=Pobiera wska\u017Anik J9VMThread z jthread
CDRT002=Niepowodzenie PC\: %1$p (pozycja %2$p), metadane \= %3$p
J9VM034=JVMRI wymaga mechanizmu \u015Bledzenia\: Uruchom z opcj\u0105 -Xtrace
J9TI063=Pobiera wska\u017Anik J9Method z JMethodID
CDRT001=Metoda\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
J9VM035=Nie mo\u017Cna przydzieli\u0107 OutOfMemoryError
J9VM036=dzielenie przez zero
J9VM037=Niepowodzenie przydzia\u0142u monitora
J9TI066=Utw\u00F3rz subskrypcj\u0119 do punkt\u00F3w \u015Bledzenia VM
J9VM038=-Xthr\: nierozpoznana opcja --> '%s'
J9TI067=Anuluj subskrypcj\u0119 do punkt\u00F3w \u015Bledzenia VM
SHRC071=Opcja wiersza komend "%s" wymaga podopcji
J9VM028=\tw %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
SHRC072=Nierozpoznana opcja wiersza komend "%s"
J9VM029=\tw (nieznana metoda)
SHRC073=Zapisywanie klasy %2$.*1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %3$d o adresie URL %5$.*4$s (indeks %6$d)...
SHRC074=\ Powodzenie.
SHRC070=Wy\u0142\u0105czono aktualizacje przyrostowe
SHRC079=Nie mo\u017Cna utworzy\u0107 tabeli mieszaj\u0105cej w SH_ClasspathManagerImpl2
SHRC075=\ Niepowodzenie.
SHRC076=Odnajdywanie klasy %1$s we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej dla identyfikatora programu \u0142aduj\u0105cego klasy %2$d...
SHRC077=Niepowodzenie utworzenia puli linkedListImpl w SH_ClasspathManagerImpl2
SHRC078=Niepowodzenie utworzenia puli linkedListHdr w SH_ClasspathManagerImpl2
J9VM020=Poszukiwano w %.*s
J9VM021=Brak pami\u0119ci dla mapy stosu interpretera - przerywanie dzia\u0142ania maszyny VM
J9VM022=Niepowodzenie mapy stosu, rezultat \= %p - przerywanie dzia\u0142ania maszyny VM
J9VM023=Mo\u017Ce to wskazywa\u0107, \u017Ce zmienna JAVA_HOME jest niepoprawna lub \u017Ce nie zainstalowano bibliotek klas
J9VM024=Wyj\u0105tek w w\u0105tku "%.*s"\# START NON-TRANSLATABLE
J9VM025=\tw %2$.*1$s.%4$.*3$s (metoda rodzima)
J9VM026=\tw %2$.*1$s.%4$.*3$s (nieznane \u017Ar\u00F3d\u0142o)
J9VM027=\tw %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM050=-Xjni\: nierozpoznana opcja --> '%s'
J9VM051=Sk\u0142adnia\:\n
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] ustawienie maksymalnej wielko\u015Bci tablicy JNI w pami\u0119ci podr\u0119cznej\n
J9VM053=Znaleziono zniekszta\u0142con\u0105 opcj\u0119 %s w -Xoptionsfile
J9VM054=Utworzenie w\u0105tku nie powiod\u0142o si\u0119\: retVal %1$zd, numer_b\u0142\u0119du %2$zd
J9VM055=B\u0142\u0105d nienaprawialny\: Wersja g\u0142\u00F3wna JXE jest r\u00F3\u017Cna od %d
J9VM056=Wersja g\u0142\u00F3wna
J9VM057=Przekroczono limit pami\u0119ci podr\u0119cznej monitora
J9VM058=Opcja -Xscminaot jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
J9VM059=Opcja -Xscmaxaot jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
SHRC093=Podczas aktualizacji wykryto nieoczekiwane zako\u0144czenie innej maszyny JVM
SHRC094=Znaleziono element osierocony, ale lokalna klasa ROMClass zosta\u0142a przekazana do addROMClassToCache
SHRC095=Niepowodzenia pr\u00F3b wywo\u0142ania markStale na elementach wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC096=Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna "%s" jest pe\u0142na. U\u017Cyj opcji -Xscmx, aby ustawi\u0107 wielko\u015B\u0107 pami\u0119ci podr\u0119cznej.
SHRC090=Niepowodzenie uzyskania blokady mutex pami\u0119ci podr\u0119cznej podczas uruchamiania SH_CacheMap
SHRC091=Odczytano uszkodzone dane elementu 0x%p (niepoprawny typ danych)
SHRC092=Niepowodzenie dodawania podczas odczytywania pami\u0119ci podr\u0119cznej
SHRC097=Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna "%s" jest uszkodzona. Nowe maszyny JVM nie uzyskaj\u0105 zezwolenia na po\u0142\u0105czenie si\u0119 z t\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105.\n \tIstniej\u0105ce maszyny JVM mog\u0105 kontynuowa\u0107 dzia\u0142anie, ale nie mog\u0105 aktualizowa\u0107 tej pami\u0119ci podr\u0119cznej.
SHRC098=\nBie\u017C\u0105ce statystyki pami\u0119ci podr\u0119cznej "%s"\: \n
SHRC099=%1$d\: 0x%2$p ELEMENT OSIEROCONY\: %4$.*3$s w 0x%5$p.
JITM031=Warto\u015B\u0107 dla '%s' nie jest poprawna
JITM032=Opcja '%1$s' nie jest pe\u0142na, nale\u017Cy poda\u0107 parametr '%2$s'.
J9VM040=przepe\u0142nienie stosu systemu operacyjnego
JITM030=Podana warto\u015B\u0107 parametru %s jest zbyt du\u017Ca
J9VM041=b\u0142\u0119dna liczba argument\u00F3w
JITM035=Wielko\u015B\u0107 du\u017Cych stron %1$zu%2$s nie jest obs\u0142ugiwan\u0105 wielko\u015Bci\u0105 stron dla pami\u0119ci podr\u0119cznej kodu JIT; zostanie u\u017Cyte %3$zu%4$s (%5$s)
J9VM042=Konfiguracja przetwarzania w\u0105tkowego
JITM036=Wielko\u015B\u0107 du\u017Cych stron %1$zu%2$s (%3$s) nie jest obs\u0142ugiwan\u0105 wielko\u015Bci\u0105 strony dla pami\u0119ci podr\u0119cznej kodu JIT; zamiast tego zostanie u\u017Cyta warto\u015B\u0107 %4$zu%5$s
J9VM043=------------------------------------
JITM033=W opcji '-Xlp' wykryto dodatkowe znaki przecinka - zignorowano
J9VM044=Obs\u0142uga tr\u00F3jwarstwowych monitor\u00F3w systemu
JITM034=Wielko\u015B\u0107 du\u017Cych stron %1$zu%2$s nie jest obs\u0142ugiwan\u0105 wielko\u015Bci\u0105 stron dla pami\u0119ci podr\u0119cznej kodu JIT; zostanie u\u017Cyte %3$zu%4$s
J9VM045=Brak obs\u0142ugi tr\u00F3jwarstwowych monitor\u00F3w systemu
J9VM046=Obs\u0142uga JLM
J9VM047=Brak obs\u0142ugi JLM
JITM037=Wielko\u015B\u0107 du\u017Cych stron %1$zu%2$s (%3$s) nie jest obs\u0142ugiwan\u0105 wielko\u015Bci\u0105 strony dla pami\u0119ci podr\u0119cznej kodu JIT; zamiast tego zostanie u\u017Cyta warto\u015B\u0107 %4$zu%5$s (%6$s)
J9VM048=Obs\u0142uga czas\u00F3w wstrzymywania JLM
J9VM049=Brak obs\u0142ugi czas\u00F3w wstrzymywania JLM
J9TI028=Raportuj zako\u0144czenie zrzutu RAS.
J9TI029=Odpytaj konfiguracj\u0119 agenta zrzutu RAS.
JITM019=Niezgodno\u015B\u0107 funkcji wsp\u00F3\u0142bie\u017Cnego zbierania. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI026=Wywo\u0142aj zrzut przy u\u017Cyciu danej konfiguracji RAS.
J9TI027=Raportuj rozpocz\u0119cie zrzutu RAS.
J9RI019=jvmri->InjectOutOfMemory nie jest obs\u0142ugiwane.
J9RI017=Nie mo\u017Cna przydzieli\u0107 agenta zrzutu w jvmri->SetOutOfMemoryHook; nie zarejestrowano funkcji.
J9RI018=jvmri->NotifySignal wysy\u0142a sygna\u0142 %d.
JITM020=Niezgodno\u015B\u0107 funkcji programowej bariery odczytu. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
JITM021=Niezgodno\u015B\u0107 funkcji TM. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
JITM024=Niezgodno\u015B\u0107 przesuni\u0119cia compressedrefs. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI020=Pobiera identyfikator w\u0105tku systemu operacyjnego z jthread
J9RI015=jvmri->RunDumpRoutine\: componentId jest poza zakresem.
JITM025=SCC jest za du\u017Ce, aby mechanizm JIT poprawnie m\u00F3g\u0142 zakodowa\u0107 przesuni\u0119cia.  Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI021=Pobierz rozszerzone informacje o ramce.
J9RI016=jvmri->SetOutOfMemoryHook wywo\u0142ano z procedur\u0105 zwrotn\u0105 o warto\u015Bci NULL; nie zarejestrowano funkcji.
JITM022=Niezgodno\u015B\u0107 lockword. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9RI013=jvmri->ReleaseRasInfo\: struktura ma pole nieobs\u0142ugiwanego typu.
JITM023=Niezgodno\u015B\u0107 wielko\u015Bci arraylet. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9RI014=jvmri->RunDumpRoutine\: nie mo\u017Cna odczyta\u0107 danych komponentu.
JITM028=Konfiguracja systemu nie obs\u0142uguje parametru '%.*s' w opcji '-Xlp'
J9TI024=Wyj\u015Bcie z metody bez zwr\u00F3cenia warto\u015Bci.
J9RI011=Struktura RasInfo ma pole nieobs\u0142ugiwanego typu.
JITM029=Po parametrze %s musi nast\u0119powa\u0107 liczba
J9TI025=Zezwalaj na bezpo\u015Brednie JNI w obecno\u015Bci zdarze\u0144 wej\u015Bcia i wyj\u015Bcia metod (mo\u017Ce powodowa\u0107 niepoprawne raportowanie wej\u015Bcia i wyj\u015Bcia)
J9RI012=jvmri->ReleaseRasInfo wywo\u0142ano ze struktur\u0105 RasInfo o warto\u015Bci NULL.
JITM026=Nieznany problem. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI022=Pobierz rozszerzone informacje o ramce dla wszystkich \u015Bledze\u0144 stosu.
JITM027=Przydzielenie pami\u0119ci przez JIT nie powiod\u0142o si\u0119
J9TI023=Pobierz rozszerzone informacje o ramce dla listy w\u0105tk\u00F3w.
J9RI010=jvmri->GetRasInfo nie mo\u017Ce przydzieli\u0107 pami\u0119ci.
J9TI039=Zniszcz nazwan\u0105 wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105.
JITM008=Weryfikacja nag\u0142\u00F3wka AOT si\u0119 nie powiod\u0142a; zakodowany bit kontroli poprawno\u015Bci pocz\u0105tku flagi funkcji. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI037=Pobierz \u0142\u0105czn\u0105 pami\u0119\u0107 sterty.
JITM009=Weryfikacja nag\u0142\u00F3wka AOT si\u0119 nie powiod\u0142a; zakodowany bit kontroli poprawno\u015Bci ko\u0144ca flagi funkcji. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI038=Wykonaj iteracj\u0119 dla wsp\u00F3\u0142u\u017Cytkowanych pami\u0119ci podr\u0119cznych.
J9RI008=jvmri->GetRasInfo nie mo\u017Ce pobra\u0107 komponent\u00F3w.
J9RI009=jvmri->GetRasInfo nie mo\u017Ce przydzieli\u0107 pami\u0119ci.
J9RI006=jvmri->GetRasInfo wywo\u0142ano ze struktur\u0105 RasInfo o warto\u015Bci NULL.
J9RI007=jvmri->GetRasInfo nie mo\u017Ce przydzieli\u0107 pami\u0119ci.
JITM010=Niezgodno\u015B\u0107 funkcji SMP. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
JITM013=Niezgodno\u015B\u0107 funkcji wy\u0142\u0105czenia pu\u0142apek. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI031=Anuluj zdarzenie asynchroniczne w pojedynczym w\u0105tku lub we wszystkich w\u0105tkach
J9RI004=jvmri->DynamicVerbosegc nie jest obs\u0142ugiwane.
JITM014=Niezgodno\u015B\u0107 funkcji wst\u0119pnego pobierania TLH. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI032=Wskazuje, \u017Ce w\u0105tek przetworzy\u0142 zdarzenie asynchroniczne
J9RI005=jvmri->GetComponentDataArea\: komponent %s nie ma dataArea w tej maszynie vm.
JITM011=Niezgodno\u015B\u0107 funkcji skompresowanych referencji. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9RI002=jvmri->DumpRegister wywo\u0142ano z procedur\u0105 zwrotn\u0105 o warto\u015Bci NULL; nie zarejestrowano funkcji.
JITM012=Niezgodno\u015B\u0107 funkcji DFP. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI030=Zasygnalizuj zdarzenie asynchroniczne w pojedynczym w\u0105tku lub we wszystkich w\u0105tkach
J9RI003=Nie mo\u017Cna przydzieli\u0107 agenta zrzutu w jvmri->DumpRegister; nie zarejestrowano funkcji.
JITM017=Niezgodno\u015B\u0107 funkcji w\u0142\u0105czenia SIMD. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI035=Zako\u0144czono cykl czyszczenia pami\u0119ci.
J9RI000=jvmri->CreateThread nie mo\u017Ce przydzieli\u0107 pami\u0119ci argument\u00F3w w\u0105tk\u00F3w
JITM018=Niezgodno\u015B\u0107 funkcji kompilacji asynchronicznej. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI036=Pobierz woln\u0105 pami\u0119\u0107 bie\u017C\u0105cej sterty.
J9RI001=B\u0142\u0105d wewn\u0119trzny podczas usuwania agenta zrzutu w jvmri->DumpDeregister; nie mo\u017Cna wyrejestrowa\u0107 funkcji zrzutu.
JITM015=Niezgodno\u015B\u0107 funkcji trampoliny metody. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI033=Resetuj opcje zrzutu maszyny wirtualnej.
JITM016=Niezgodno\u015B\u0107 funkcji w\u0142\u0105czenia HCR. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI034=Uruchomiono cykl czyszczenia pami\u0119ci.
J9VM017=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na tablic\u0119 opcji wiersza komend
J9VM018=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na pul\u0119 tabel \u0142adowania bibliotek wsp\u00F3\u0142u\u017Cytkowanych
J9VM019=B\u0142\u0105d nienaprawialny\: Nie mo\u017Cna znale\u017A\u0107 i zainicjowa\u0107 wymaganej klasy %.*s
J9TI048=Pobiera metadane \u015Bledzenia, kt\u00F3rych mo\u017Cna u\u017Cy\u0107 z formaterem do przetworzenia bufor\u00F3w \u015Bledzenia
J9TI049=Nazwy klasy powrotu, metody i pakietu dla zestawu wska\u017Anik\u00F3w metody RAM
JITM002=Niepowodzenie zapisania kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas. Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna klas mo\u017Ce by\u0107 uszkodzona. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9TI042=Sygnalizuj elementy autotag dla nowo przydzielonego obiektu i jego klasy.
JITM003=Niepowodzenie podczas inicjowania \u015Brodowiska wykonawczego AOT. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9VM010=Niepowodzenie inicjowania %s
J9TI043=Sygnalizuj \u0142adowanie klasy tylko dla klas tablicy.
JITM000=Nieobs\u0142ugiwany sprz\u0119t [%d].
J9VM011=Nie mo\u017Cna za\u0142adowa\u0107 %1$s\: %2$s
J9TI040=Dodaje rozszerzon\u0105 mo\u017Cliwo\u015B\u0107 can_autotag_objects.
JITM001=Zabrak\u0142o miejsca na kod AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas. Nowy kod AOT nie zostanie wygenerowany.
J9VM012=Nie mo\u017Cna za\u0142adowa\u0107 %1$s\: %2$s
J9TI041=Sygnalizuj zdarzenie zmiany nazwy obiekt\u00F3w (przeniesienie lub usuni\u0119cie).
JITM006=Kod AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas nie mo\u017Ce dzia\u0142a\u0107 z bie\u017C\u0105c\u0105 strategi\u0105 czyszczenia pami\u0119ci. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9VM013=B\u0142\u0105d inicjowania w funkcji %1$s(%2$d)\: %3$s
J9TI046=Anuluj subskrypcj\u0119 zewn\u0119trznych rekord\u00F3w \u015Bledzenia
JITM007=Kod AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas nie mo\u017Ce dzia\u0142a\u0107 z bie\u017C\u0105cymi ustawieniami JVMPI lub JVMTI. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9VM014=B\u0142\u0105d zamkni\u0119cia w funkcji %1$s(%2$d)\: %3$s
J9TI047=Wszystkie u\u017Cywane rekordy \u015Bledzenia s\u0105 wy\u0142\u0105czane i przekazywane do subskrybent\u00F3w \u015Bledzenia
JITM004=Nie mo\u017Cna wykona\u0107 kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas na bie\u017C\u0105cym procesorze. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9VM015=B\u0142\u0105d inicjowania biblioteki %1$s(%2$d)\: %3$s
J9TI044=Usu\u0144 wszystkie znaczniki obiekt\u00F3w.
JITM005=Kod AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas nie mo\u017Ce dzia\u0142a\u0107 w bie\u017C\u0105cej wersji maszyny JVM. Ignorowanie kodu AOT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas.
J9VM016=B\u0142\u0105d zamkni\u0119cia biblioteki %1$s(%2$d)\: %3$s
J9TI045=Utw\u00F3rz subskrypcj\u0119 zewn\u0119trznych rekord\u00F3w \u015Bledzenia
MECK001=Nierozpoznana opcja programu -Xcheck\:memory\: %s
J9VM006=Niepoprawna opcja wiersza komend\: %s
MECK000=B\u0142\u0105d podczas inicjowania programu narz\u0119dziowego -Xcheck\:memory
J9VM007=Nierozpoznana opcja wiersza komend\: %s
J9VM008=Nie znaleziono J9VMDllMain
J9TI059=Uzyskuje ilo\u015B\u0107 pami\u0119ci rodzimej u\u017Cywanej przez \u015Brodowisko JVM z podzia\u0142em na kategorie pami\u0119ci.
MECK002=B\u0142\u0105d podczas tworzenia struktury danych wywo\u0142ywanego serwisu. Informacje o wywo\u0142ywanym serwisie nie zostan\u0105 wy\u015Bwietlone.
J9VM009=Niepowodzenie J9VMDllMain
J9TI050=Pobierz kod mieszaj\u0105cy dla monitora obiektu.
J9TI053=Ustaw opcje dziennika VM.
J9TI054=Za\u017C\u0105daj zrzutu monitora JLM (Java Lock Monitor) ze specyfikatorem formatu.
J9VM000=Zniekszta\u0142cona warto\u015B\u0107 IBM_JAVA_OPTIONS
J9TI051=Wyczy\u015B\u0107 flag\u0119 metody selektywnego powiadamiania o wej\u015Bciach i wyj\u015Bciach.
J9VM001=Zniekszta\u0142cona warto\u015B\u0107 -Xservice
J9TI052=Zapytaj o bie\u017C\u0105ce opcje dziennika VM.
J9VM002=Nie znaleziono pliku opcji
J9TI057=Nie mo\u017Cna przekszta\u0142ci\u0107 rodzimego \u0142a\u0144cucha opcji dziennika JVM.
J9VM003=Nie znaleziono kompilatora JIT "%s". U\u017Cywany b\u0119dzie interpreter.
J9TI058=Nie mo\u017Cna ustawi\u0107 opcji dziennika JVM.
J9VM004=Nie mo\u017Cna za\u0142adowa\u0107 biblioteki wymaganej przez %s
J9TI055=Nie mo\u017Cna przydzieli\u0107 buforu dla opcji dziennika JVM.
J9VM005=Niepoprawna warto\u015B\u0107 zmiennej \u015Brodowiskowej %s
J9TI056=Nie mo\u017Cna sprawdzi\u0107 opcji dziennika JVM.
PORT033=Nie mo\u017Cna wykry\u0107 obs\u0142ugiwanego hiperwizora.
PORT032=Operacja zwi\u0105zana z hiperwizorem nie powiod\u0142a si\u0119.
PORT031=Odebrano warunek LE %s%i, kt\u00F3ry odnosi si\u0119 do programowo wygenerowanego sygna\u0142u POSIX
PORT030=Ustawienie %s "%s" okre\u015Bla, \u017Ce zrzut pami\u0119ci ma by\u0107 przekazywany przez potok do programu zewn\u0119trznego.  Pr\u00F3ba zmiany pliku zrzutu core lub core.%d.\n
PORT037=Nie dzia\u0142a w hiperwizorze.
PORT036=Nieoczekiwany kod powrotu z us\u0142ugi CSRSI w systemie z/OS
PORT035=__malloc31 nie mog\u0142o przydzieli\u0107 buforu w systemie z/OS
PORT034=Pr\u00F3ba przy\u0142\u0105czenia do wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci utworzonej z u\u017Cyciem klucza ochrony pami\u0119ci masowej %lu, obecnie dzia\u0142aj\u0105cej z u\u017Cyciem klucza %lu.
PORT039=Aktualizacja HYPFS nie powiod\u0142a si\u0119
PORT038=Zniekszta\u0142cona warto\u015B\u0107 IBM_JAVA_HYPERVISOR_SETTINGS
PORT022=Do\u0142\u0105czanie .X&DS do szablonu zrzutu podanego przez u\u017Cytkownika w celu umo\u017Cliwienia zrzut\u00F3w wielocz\u0119\u015Bciowych.
PORT021=Otwarto nieaktualny semafor wsp\u00F3\u0142u\u017Cytkowany System V\: plik\:%1$s semid\:%2$d
PORT020=Otwarto nieaktualn\u0105 pami\u0119\u0107 wsp\u00F3\u0142u\u017Cytkowan\u0105 System V\: plik\:%1$s shmid\:%2$d
PORT026=Podany plik jest katalogiem
PORT025=Niepoprawny typ blokady dla operacji blokowania pliku. lockFlags\: %1$d
PORT024=Wykonanie IEATDUMP nie powiod\u0142o si\u0119, poniewa\u017C nie powiod\u0142o si\u0119 przydzielenie zestawu danych zrzutu (sprawd\u017A miejsce na dysku i uprawnienia pola).
PORT023=Wykonanie IEATDUMP nie powiod\u0142o si\u0119, poniewa\u017C szablon zrzutu podany przez u\u017Cytkownika by\u0142 za d\u0142ugi. Pr\u00F3ba zrzutu zostanie ponowiona z szablonem domy\u015Blnym.
PORT029=Niepoprawny uchwyt. Uchwyt pliku\: %1$d.
PORT028=mmap nie powiod\u0142o si\u0119 z powodu niepoprawnych opcji odwzorowania.
PORT027=mmap nie powiod\u0142o si\u0119 z powodu niepoprawnego parametru ochrony pami\u0119ci.
PORT011=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci podczas pr\u00F3by za\u0142adowania biblioteki wsp\u00F3\u0142u\u017Cytkowanej
PORT010=Nie nadano uprawnienia do za\u0142adowania biblioteki wsp\u00F3\u0142u\u017Cytkowanej
PORT015=Nie mo\u017Cna rozstrzygn\u0105\u0107 referencji biblioteki - by\u0107 mo\u017Ce bra\u0107 wymaganej wst\u0119pnie biblioteki wsp\u00F3\u0142u\u017Cytkowanej
PORT014=Niepowodzenie za\u0142adowania pliku DLL, poniewa\u017C nie zosta\u0142 on znaleziony
PORT013=B\u0142\u0105d \u0142adowania biblioteki wsp\u00F3\u0142u\u017Cytkowanej - nie mo\u017Cna znale\u017A\u0107 tabeli dll
PORT012=B\u0142\u0105d \u0142adowania biblioteki wsp\u00F3\u0142u\u017Cytkowanej z powodu ustawienia bitu PACE
PORT019=Nie mo\u017Cna utworzy\u0107 katalogu %s.  Klasy wsp\u00F3\u0142u\u017Cytkowane zostan\u0105 wy\u0142\u0105czone do czasu utworzenia tego katalogu.
PORT018=Niepowodzenie operacji\: %1$d (niepowodzenie %2$s\: %3$d)
PORT017=Niepowodzenie operacji\: %d
PORT016=B\u0142\u0105d wewn\u0119trzny %i
PORT000=
ZIPS000=Nie mo\u017Cna otworzy\u0107 %1$s (%2$s)
ZIPS001=Nie mo\u017Cna otworzy\u0107 %s (Brakuje eksportu)
PORT009=Podana biblioteka wsp\u00F3\u0142u\u017Cytkowana nie zosta\u0142a znaleziona
PORT004=Niepowodzenie rozstrzygni\u0119cia symbolu
PORT003=Nie mo\u017Cna za\u0142adowa\u0107 modu\u0142u zale\u017Cnego %s
PORT002=Nieznany b\u0142\u0105d podczas \u0142adowania biblioteki wsp\u00F3\u0142u\u017Cytkowanej
PORT001=Niepowodzenie przydzia\u0142u pami\u0119ci podczas pr\u00F3by zapisania pliku.
PORT008=Architektura modu\u0142u nie jest poprawna
J9RI022=Inicjowany interfejs JVMRI nie mo\u017Ce przydzieli\u0107 monitora zrzutu jvmri
PORT007=Podany modu\u0142 nie jest modu\u0142em
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister i TraceListener nie s\u0105 ju\u017C obs\u0142ugiwane; u\u017Cyj nowych  wersji w JVMRAS_VERSION_1_5
PORT006=Niepoprawny format modu\u0142u
J9RI020=jvmri->CreateThread nie mo\u017Ce przydzieli\u0107 monitora prywatnego
PORT005=Nie mo\u017Cna za\u0142adowa\u0107 biblioteki wsp\u00F3\u0142u\u017Cytkowanej
J9RI021=jvmri->RunDumpRoutine nie jest obs\u0142ugiwane.
J9VM070=rodzima pami\u0119\u0107 zosta\u0142a wyczerpana podczas powi\u0105zania rodzimej metody %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM071=pr\u00F3ba rekurencyjnego powi\u0105zania rodzimej metody %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM072=rodzima pami\u0119\u0107 zosta\u0142a wyczerpana
J9VM073=Klasa %2$.*1$s w spos\u00F3b niedozwolony uzyskuje dost\u0119p do sk\u0142adowej %3$s klasy %5$.*4$s
J9VM074=Klasa %2$.*1$s w spos\u00F3b niedozwolony uzyskuje dost\u0119p do klasy %3$s %5$.*4$s
J9VM075=niedozwolona operacja w w\u0105tku eventron
J9VM076=rodzima pami\u0119\u0107 zosta\u0142a wyczerpana podczas przydzielania pozycji listy dla obiektu finalizacji lub referencji
J9VM077=Uwaga\: opcja -Xdfpbd nie odnosi \u017Cadnego skutku w tej wersji Java
J9VM078=Zniekszta\u0142cona warto\u015B\u0107 JAVA_TOOL_OPTIONS
J9VM079=triggerOneOffDump(%1$s) wymaga %2$s
J9VM060=runNamedDump(%1$s) wymaga %2$s
J9VM061=insertDumpAgent wymaga %s
J9VM062=removeDumpAgent wymaga %s
J9VM063=seekDumpAgent wymaga %s
J9VM064=setDumpOption wymaga %s
J9VM065=obiekt nie jest instancj\u0105 deklaruj\u0105cej klasy
J9VM066=niezgodno\u015B\u0107 typ\u00F3w argument\u00F3w
J9VM067=Nie w\u0142\u0105czono -Xshareclasses; opcja -Xzero\:sharezip zosta\u0142a zignorowana
J9VM068=Nie w\u0142\u0105czono -Xshareclasses; opcja -Xzero\:sharestring zosta\u0142a zignorowana
J9VM069=naruszenie ograniczenia \u0142adowania\: program \u0142aduj\u0105cy "%2$.*1$s@%3$x" poprzednio zainicjowa\u0142 \u0142adowanie dla innego typu z nazw\u0105 "%5$.*4$s" zdefiniowan\u0105 przez program \u0142aduj\u0105cy "%7$.*6$s@%8$x"
SHRC500=Obszar debugowania jest uszkodzony, poniewa\u017C dolny adres wolnego miejsca %p jest wi\u0119kszy od g\u00F3rnego adresu wolnego miejsca %p
SHRC505=Obszar debugowania jest uszkodzony, poniewa\u017C g\u00F3rny adres wolnego miejsca %p pomniejszony o dolny adres wolnego miejsca %p przekracza wielko\u015B\u0107 regionu debugowania (%lu bajt\u00F3w)
SHRC506=Obszar debugowania jest uszkodzony, poniewa\u017C jego wielko\u015B\u0107  (%lu) jest wi\u0119ksza od \u0142\u0105cznej wielko\u015Bci pami\u0119ci podr\u0119cznej (%u) zapisanej w nag\u0142\u00F3wku pami\u0119ci podr\u0119cznej
J9VM090=Wolna odpowied\u017A na zapytanie sieciowe (%d s), sprawd\u017A konfiguracj\u0119 DNS IP
SHRC507=Wykonaj dodatkowe sprawdzanie podczas zapisywania i przydzielania danych debugowania klas
J9VM091=Technologia Adaptive spinning jest obs\u0142ugiwana
SHRC508=Uzyskano semafor, kt\u00F3ry jest inny ni\u017C semafor poprzednio u\u017Cywany z t\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105. Stary semid\=%d, nowy semid\=%d.
J9VM092=Technologia Adaptive spinning nie jest obs\u0142ugiwana
SHRC501=Obszar debugowania jest uszkodzony, poniewa\u017C dolny adres danych tabeli numer\u00F3w wierszy %p jest wi\u0119kszy od g\u00F3rnego adresu %p
J9VM093=Ta wersja \u015Brodowiska Java wymaga procesora obs\u0142uguj\u0105cego rozszerzenie SSE2 lub nowsze.  Patrz sekcja 'Supported Environments' (obs\u0142ugiwane \u015Brodowiska) w podr\u0119czniku IBM Java User Guide.
SHRC502=Obszar debugowania jest uszkodzony, poniewa\u017C dolny adres danych tabeli zmiennych lokalnych %p jest wi\u0119kszy od g\u00F3rnego adresu %p
J9VM094=W\u0105tek "%s" jest nadal aktywny po uruchomieniu punkt\u00F3w zaczepienia zamykania.
SHRC503=Obszar debugowania jest uszkodzony, poniewa\u017C zachowanie tabeli numer\u00F3w wierszy (%d bajt\u00F3w) i tabeli zmiennych lokalnych (%d bajt\u00F3w) spowodowa\u0142oby ustawienie g\u00F3rnego adresu danych tabeli numer\u00F3w wierszy %p wi\u0119kszego od nowego dolnego adresu danych tabeli zmiennych lokalnych %p
J9VM095=naruszenie ograniczenia \u0142adowania podczas t\u0142umaczenia metody "%2$.*1$s.%4$.*3$s%6$.*5$s"\: program \u0142aduj\u0105cy "%8$.*7$s@%9$x" klasy "%11$.*10$s" i program \u0142aduj\u0105cy "%13$.*12$s@%14$x" klasy "%16$.*15$s" maj\u0105 inne typy dla sygnatury metody
SHRC504=Pocz\u0105tek danych pami\u0119ci podr\u0119cznej ma warto\u015B\u0107 null. Pocz\u0105tek danych\: %p
J9VM096=Opcja -Xscdmx jest ignorowana, gdy nie jest okre\u015Blona opcja -Xshareclasses
J9VM097=\nSk\u0142adnia\:\n
J9VM098=-Xsyslog\:help              Wy\u015Bwietla pomoc dla opcji JVM -Xsyslog.
J9VM099=-Xsyslog\:none              Wy\u0142\u0105cza podane poprzednio opcje dziennika JVM, r\u00F3wnie\u017C domy\u015Blne.
SHRC509=Utw\u00F3rz pami\u0119\u0107 podr\u0119czn\u0105 starsz\u0105 o jedn\u0105 generacj\u0119 w por\u00F3wnaniu z bie\u017C\u0105c\u0105 generacj\u0105.
PORT040=Odczyt HYPFS nie powi\u00F3d\u0142 si\u0119
PORT044=Niepowodzenie przydzia\u0142u pami\u0119ci podczas pobierania informacji o hiperwizorze.
PORT043=%1$d\: Niepowodzenie pobrania informacji o %2$s.
PORT042=Nie mo\u017Cna odczyta\u0107 /proc/sysinfo
PORT041=Nie pod\u0142\u0105czono HYPFS
J9VM080=queryVmDump wymaga %s
J9VM081=Zniekszta\u0142cona warto\u015B\u0107 opcji; opcja "%1$s%3$.*2$s" zawiera znaki ko\u0144cz\u0105ce "%4$s", kt\u00F3re zosta\u0142y zignorowane
J9VM082=Nie mo\u017Cna prze\u0142\u0105czy\u0107 na procesor IFA - wprowad\u017A "extattr +a lib%s.so"
J9VM083=B\u0142\u0105d prze\u0142\u0105czenia na procesor IFA; kod powrotu\: %08x
J9VM084=B\u0142\u0105d IFA\: nieoczekiwany kod powrotu %08x z us\u0142ugi prze\u0142\u0105cznika IFA
J9VM085=Zniekszta\u0142cona opcja\: '%s'
PORT048=Utworzenie zrzutu systemowego si\u0119 nie powiod\u0142o, poniewa\u017C istnieje ju\u017C plik "%s" o takiej samej nazwie, jak nazwa pliku zrzutu
J9VM086=Zbyt du\u017Ca warto\u015B\u0107 opcji\: '%s'
PORT047=Niewystarczaj\u0105ca pami\u0119\u0107 bufor\u00F3w podczas pr\u00F3by za\u0142adowania biblioteki wsp\u00F3\u0142u\u017Cytkowanej
J9VM087=resetDumpOption wymaga %s
PORT046=Nie mo\u017Cna otworzy\u0107 pliku wykonywalnego
J9VM088=Ostrze\u017Cenie\: syscorepath nie zosta\u0142a skonfigurowana, co mo\u017Ce uniemo\u017Cliwi\u0107 wygenerowanie pliku core systemu (je\u015Bli b\u0119dzie potrzebny).\n\t\tZapoznaj si\u0119 z instrukcjami instalacji WebSphere Real Time dotycz\u0105cymi w\u0142a\u015Bciwych ustawie\u0144 konfiguracji syscorepath.\n\t\tUWAGA\: syscorepath nale\u017Cy konfigurowa\u0107 dla ka\u017Cdego uruchomienia maszyny.
PORT045=Niepowodzenie przydzia\u0142u pami\u0119ci podczas pobierania informacji systemowych.
J9VM089=Ostrze\u017Cenie\: nie mo\u017Cna zweryfikowa\u0107 ustawie\u0144 syscorepath za pomoc\u0105 sysconfig\: %s.
SHRC400=bajty pami\u0119ci podr\u0119cznej zip        %*c\= %d
SHRC401=liczba pami\u0119ci podr\u0119cznych zip      %*c\= %d
SHRC406=pocz\u0105tkowy adres metadanych         %*c\= 0x%p
SHRC407=flagi \u015Brodowiska wykonawczego       %*.c\= 0x%.16llX
SHRC408=generowanie pami\u0119ci podr\u0119cznej      %*.c\= %d\n
SHRC409=Bajty kodu AOT                      %*c\= %d
SHRC402=bajty danych JIT                    %*c\= %d
SHRC403=U\u017Cyte bajty obszaru debug. klas     %*c\= %u
SHRC404=Niepowodzenie uzyskania katalogu dla pami\u0119ci podr\u0119cznej
SHRC405=Niepowodzenie utworzenia katalogu dla pami\u0119ci podr\u0119cznej
SHRC420=liczba pozycji danych AOT           %*c\= %d
SHRC421=liczba hierarchii klas AOT          %*c\= %d
SHRC422=liczba AOT thunk                    %*c\= %d
SHRC423=liczba podpowiedzi JIT              %*c\= %d
SHRC428=Usuni\u0119to starsz\u0105 generacj\u0119 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas "%s"
SHRC429=Usuni\u0119cie starszej generacji wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas "%s" nie powiod\u0142o si\u0119
SHRC424=liczba profili JIT                  %*c\= %d
SHRC425=liczba obiekt\u00F3w Java                %*c\= %d
SHRC426=liczba pozycji JCL                  %*c\= %d
SHRC427=Modyfikator u\u017Cywany do wy\u015Bwietlania szczeg\u00F3\u0142owych statystyk pami\u0119ci podr\u0119cznej
SHRC410=Bajty danych AOT                    %*c\= %d
SHRC411=Bajty hierarchii klasy AOT          %*c\= %d
SHRC412=Bajty AOT thunk                     %*c\= %d
SHRC417=Bajty danych JCL                    %*c\= %d
SHRC418=Bajty danych bajtowych              %*c\= %d
SHRC419=Bajty klasy LocalVariableTable      %*c\= %u
SHRC413=Bajty podpowiedzi JIT               %*c\= %d
SHRC414=Bajty profilu JIT                   %*c\= %d
SHRC415=Bajty obiektu Java                  %*c\= %d
SHRC416=Bajty odczytu/zapisu                %*c\= %d
SHRC442=Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna "%s" jest uszkodzona. Kod uszkodzenia to %d. Uszkodzona warto\u015B\u0107\: 0x%p. Nowe maszyny JVM nie uzyskaj\u0105 zezwolenia na po\u0142\u0105czenie si\u0119 z t\u0105 pami\u0119ci\u0105 podr\u0119czn\u0105.\n \tIstniej\u0105ce maszyny JVM mog\u0105 kontynuowa\u0107 dzia\u0142anie, ale nie mog\u0105 aktualizowa\u0107 tej pami\u0119ci podr\u0119cznej.
SHRC443=Warto\u015B\u0107 sumy kontrolnej CRC pami\u0119ci podr\u0119cznej jest niepoprawna, co wskazuje na uszkodzenie pami\u0119ci podr\u0119cznej. Warto\u015B\u0107 CRC niepoprawnej pami\u0119ci podr\u0119cznej\: 0x%x.
SHRC444=Odczytano uszkodzone dane dla nag\u0142\u00F3wka pozycji pami\u0119ci podr\u0119cznej 0x%p (niepoprawna d\u0142ugo\u015B\u0107 elementu)
SHRC445=Wielko\u015B\u0107 pami\u0119ci podr\u0119cznej jest zbyt ma\u0142a, aby by\u0142a ona u\u017Cyteczna. Niepoprawna wielko\u015B\u0107 pami\u0119ci podr\u0119cznej\: 0x%x.
SHRC440=Warto\u015B\u0107 opcji -XscminJIT jest wi\u0119ksza ni\u017C warto\u015B\u0107 opcji -Xscmx, dlatego zosta\u0142a ona ustawiona na warto\u015B\u0107 r\u00F3wn\u0105 warto\u015Bci opcji -Xscmx
SHRC441=Warto\u015B\u0107 opcji -XscmaxJIT jest wi\u0119ksza ni\u017C warto\u015B\u0107 opcji -Xscmx, dlatego zosta\u0142a ona ustawiona na warto\u015B\u0107 nieograniczon\u0105
SHRC446=Niepowodzenie uzyskania blokady zapisu nag\u0142\u00F3wka podczas uruchamiania pami\u0119ci podr\u0119cznej, kod b\u0142\u0119du\: %d.
SHRC447=Warto\u015B\u0107 eyecatcher nag\u0142\u00F3wka pami\u0119ci podr\u0119cznej nie jest poprawna. Adres \u0142a\u0144cucha eyecatcher w nag\u0142\u00F3wku pami\u0119ci podr\u0119cznej\: 0x%p.
SHRC448=Pole wielko\u015Bci pami\u0119ci podr\u0119cznej w jej nag\u0142\u00F3wku nie jest poprawne. Wielko\u015B\u0107 pami\u0119ci podr\u0119cznej w jej nag\u0142\u00F3wku\: 0x%x.
SHRC449=Dope\u0142nienie jest niezerowe. Bajty dope\u0142nienia w nag\u0142\u00F3wku pami\u0119ci podr\u0119cznej\: %u.
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC432=\ Podpis\: %2$.*1$s Adres\: 0x%3$p
SHRC433=\tdla ROMClass %2$.*1$s w 0x%3$p.
SHRC434=Warto\u015B\u0107\=%d przekazana w opcji -Xitsn jest spoza zakresu liczb pierwszych obs\u0142ugiwanych przez maszyn\u0119 wirtualn\u0105. Obs\u0142ugiwany zakres to 0 - %u
SHRC430=Usuni\u0119cie bie\u017C\u0105cej generacji wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas "%s" nie powiod\u0142o si\u0119
SHRC439=Warto\u015B\u0107 opcji -XscminJIT nie powinna by\u0107 wi\u0119ksza od warto\u015Bci opcji -XscmaxJIT
SHRC435=-Xitsn%2$u u\u017Cywa %1$u bajt\u00F3w pami\u0119ci, co przekracza wielko\u015B\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas o wielko\u015Bci %3$u bajt\u00F3w
SHRC436=B\u0142\u0105d podczas nak\u0142adania blokady zapisu nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC437=B\u0142\u0105d podczas zwalniania blokady odczytu nag\u0142\u00F3wka pliku wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC438=Wy\u0142\u0105cz zapisywanie danych JIT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
JNCK101=B\u0142\u0105d JNI w %1$s\: Oczekiwano statycznego argumentu \#%2$d, do JNI przekazano jednak identyfikator niestatycznego pola
JNCK102=B\u0142\u0105d JNI w %1$s\: Oczekiwano niestatycznego argumentu \#%2$d, do JNI przekazano jednak identyfikator statycznego pola
JNCK100=Porada JNI w %1$s\: Ta funkcja nie mo\u017Ce by\u0107 u\u017Cywana z upakowanymi obiektami. Zamiast tego u\u017Cyj\: %2$s
SHRC464=W\u0142\u0105cz szczeg\u00F3\u0142owe dane wyj\u015Bciowe danych JIT
SHRC465=[W\u0142\u0105czono szczeg\u00F3\u0142owe dane wyj\u015Bciowe danych JIT -Xshareclasses]
SHRC466=Znaleziono przy\u0142\u0105czone dane (%1$s) dla %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC467=Niepowodzenie znalezienia przy\u0142\u0105czonych danych (%1$s) dla %8$.*7$s.%4$.*3$s.%6$.*5$s, przyczyna\: %2$s
SHRC460=Wy\u0142\u0105cz zapisywanie danych JIT we wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC461=Warto\u015B\u0107 opcji -Xscminjitdata nie powinna by\u0107 wi\u0119ksza od warto\u015Bci opcji -Xscmaxjitdata
SHRC462=Warto\u015B\u0107 opcji -Xscminjitdata jest wi\u0119ksza ni\u017C warto\u015B\u0107 opcji -Xscmx, dlatego zosta\u0142a ona ustawiona na warto\u015B\u0107 r\u00F3wn\u0105 warto\u015Bci opcji -Xscmx
SHRC463=Warto\u015B\u0107 opcji -Xscmaxjitdata jest wi\u0119ksza ni\u017C warto\u015B\u0107 opcji -Xscmx, dlatego zosta\u0142a ona ustawiona na warto\u015B\u0107 nieograniczon\u0105
SHRC468=Zapisano przy\u0142\u0105czone dane (%1$s) dla %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC469=Niepowodzenie zapisania przy\u0142\u0105czonych danych (1$s) dla %8$.*7$s.%4$.*3$s%6$.*5$s, przyczyna\: %2$s
J9GC084=Rozdzielczo\u015B\u0107 zegara systemu operacyjnego nie obs\u0142uguje \u017C\u0105danego czasu wstrzymania.  Nadpisane przez opcj\u0119 -Xgc\:overrideHiresTimerCheck.
J9GC083=Niepowodzenie zainicjowania, multitenancy obs\u0142uguje tylko -Xgcpolicy\:balanced
J9GC086=Nie mo\u017Cna utworzy\u0107 instancji metadanych skompresowanych referencji; za\u017C\u0105dano %1$zu%2$s
J9GC085=Pocz\u0105tkowa wielko\u015B\u0107 skompresowanych metadanych referencji
J9GC088=Nie mo\u017Cna spe\u0142ni\u0107 \u017C\u0105danej wielko\u015Bci strony sterty obiekt\u00F3w\: %1$zu%2$s; zostanie u\u017Cyta wielko\u015B\u0107\: %3$zu%4$s.
J9GC087=Nie mo\u017Cna spe\u0142ni\u0107 \u017C\u0105dania wielko\u015Bci sterty %1$zu%2$s ze stron\u0105 o wielko\u015Bci %3$zu%4$s. Wielko\u015B\u0107 sterty mo\u017Cna poda\u0107 w opcji -Xmx.
J9GC089=Opcja -Xgc\:preferredHeapBase nie jest obs\u0142ugiwana w systemie z/OS.
SHRC453=Wy\u015Bwietl wszystkie elementy w pami\u0119ci podr\u0119cznej, w tym klasy osierocone
SHRC454=Wy\u0142\u0105cz sprawdzanie, je\u015Bli identyfikator bie\u017C\u0105cego semafora SysV jest taki sam jak identyfikator semafora SysV w buforze
SHRC455=Wymu\u015B sprawdzanie podczas uruchamiania tabeli \u0142a\u0144cuch\u00F3w tekstowych
SHRC456=Wymu\u015B wykrywanie zmian identyfikatora kompilacji maszyny wirtualnej
SHRC450=Pole d\u0142ugo\u015Bci danych w nag\u0142\u00F3wku pami\u0119ci podr\u0119cznej nie jest poprawne. D\u0142ugo\u015B\u0107 danych w nag\u0142\u00F3wku pami\u0119ci podr\u0119cznej\: %u.
SHRC451=Pole pocz\u0105tku danych w nag\u0142\u00F3wku pami\u0119ci podr\u0119cznej nie jest poprawne. Adres pocz\u0105tku danych w nag\u0142\u00F3wku pami\u0119ci podr\u0119cznej\: 0x%p.
SHRC452=Wy\u0142\u0105cz ochron\u0119 pami\u0119ci obszaru do odczytu/zapisu (tabela \u0142a\u0144cuch\u00F3w tekstowych)
SHRC457=Niepoprawna nazwa pami\u0119ci podr\u0119cznej, nazwa "%.*s" zawiera same spacje lub jest pusta
SHRC458=Wy\u0142\u0105cza wsp\u00F3\u0142u\u017Cytkowanie klas bez wy\u0142\u0105czania u\u017Cytkowych interfejs\u00F3w API
SHRC459=Wy\u0142\u0105cza wsp\u00F3\u0142u\u017Cytkowanie klas oraz u\u017Cytkowe interfejsy API
SHRC480=zbyt wiele aktualizacji podczas odczytywania
SHRC481=pami\u0119\u0107 podr\u0119czna jest uszkodzona
J9GC071=Warto\u015B\u0107 dla '%s' nie jest poprawna
J9GC070=Niepowodzenie uruchomienia komponentu Garbage Collector
SHRC002=w u\u017Cyciu
SHRC486=Zarezerwowane miejsce na bajty danych JIT %*c\= %d
SHRC003=czas ostatniego od\u0142\u0105czenia
SHRC487=Maksymalne miejsce na bajty danych JIT %*c\= %d
SHRC004=Nie mo\u017Cna zniszczy\u0107 pami\u0119ci podr\u0119cznej "%s"
SHRC488=Suma warto\u015Bci -Xscminaot i -Xscminjitdata nie mo\u017Ce by\u0107 wi\u0119ksza od wielko\u015Bci dost\u0119pnej pami\u0119ci podr\u0119cznej
SHRC005=Brak dost\u0119pnej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC489=Je\u015Bli otwarta pami\u0119\u0107 podr\u0119czna jest oznaczona jako uszkodzona, wyzw\u00F3l zdarzenie zrzutu pami\u0119ci podr\u0119cznej
SHRC482=adres nie wyst\u0119puje w pami\u0119ci podr\u0119cznej
SHRC483=niepowodzenie od\u015Bwie\u017Cenia pami\u0119ci podr\u0119cznej
SHRC000=Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna
SHRC484=Zarezerwowane miejsce na bajty AOT  %*c\= %d
SHRC001=Identyfikator shmid systemu operacyjnego
SHRC485=Maksymalne miejsce na bajty AOT     %*c\= %d
J9GC069=Niepowodzenie zainicjowania w\u0105tku Finalize
SHRC006=Liczba pami\u0119ci podr\u0119cznych, kt\u00F3re utraci\u0142y wa\u017Cno\u015B\u0107 w ci\u0105gu ostatnich %1$d minut, wynosi %2$d
SHRC007=Niepowodzenie usuni\u0119cia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas "%s"
SHRC008=Utworzono wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105\: %1$s wielko\u015B\u0107\: %2$d bajt\u00F3w
SHRC009=Otwarto wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105\: %1$s wielko\u015B\u0107\: %2$d bajt\u00F3w
J9GC062=Warto\u015B\u0107 parametru %s musi by\u0107 pot\u0119g\u0105 liczby dwa
J9GC061=maksymalna wielko\u015B\u0107 obszaru pami\u0119ci o ograniczonym zasi\u0119gu
J9GC064=Niepowodzenie przydzia\u0142u starego obszaru
J9GC063=Nie mo\u017Cna otworzy\u0107 pliku '%s' do zapisu
J9GC066=Nie mo\u017Cna przydzieli\u0107 geometrii pami\u0119ci sterty podzia\u0142u
J9GC065=Niepowodzenie przydzia\u0142u nowego obszaru
J9GC068=Przerwano ScopedMemory.join/joinAndEnter
J9GC067=Niepowodzenie utworzenia instancji sterty podzia\u0142u\: %1$s (nowa wielko\u015B\u0107 %2$zu%3$s, stara wielko\u015B\u0107 %4$zu%5$s)
SHRC470=Zaktualizowano przy\u0142\u0105czone dane (%1$s) dla %7$.*6$s.%3$.*2$s%5$.*4$s
J9GC080=Konfiguracja systemu nie obs\u0142uguje parametru '%.*s' w opcji '-Xlp'
J9GC082=Za\u017C\u0105dana dla %1$s wielko\u015B\u0107 strony %2$zu%3$s (%4$s) nie jest obs\u0142ugiwana, zamiast tego zostanie u\u017Cyta warto\u015B\u0107 %5$zu%6$s (%7$s)
J9GC081=W opcji '-Xlp' wykryto dodatkowe znaki przecinka - zignorowano
SHRC475=\u017Cadne dane nie istniej\u0105
SHRC476=dane ju\u017C istniej\u0105
SHRC477=brak miejsca w pami\u0119ci podr\u0119cznej na %d bajt\u00F3w
SHRC478=wielko\u015B\u0107 danych %d przekracza dost\u0119pn\u0105 wielko\u015B\u0107 %d
SHRC471=Niepowodzenie zaktualizowania przy\u0142\u0105czonych danych (%1$s) dla %8$.*7$s.%4$.*3$s%6$.*5$s, przyczyna\: %2$s
SHRC472=brak dost\u0119pu do zasobu
SHRC473=enterWriteMutex nie powiod\u0142o si\u0119
SHRC474=enterReadMutex nie powiod\u0142o si\u0119
SHRC479=niepowodzenie przydzia\u0142u pami\u0119ci %d bajt\u00F3w
J9GC073=Wielko\u015B\u0107 du\u017Cej strony %1$zu%2$s (%3$s) nie jest obs\u0142ugiwan\u0105 wielko\u015Bci\u0105 strony; zamiast tego zostanie u\u017Cyta warto\u015B\u0107 %4$zu%5$s
J9GC072=Wielko\u015B\u0107 du\u017Cej strony %1$zu%2$s nie jest obs\u0142ugiwan\u0105 wielko\u015Bci\u0105 strony; zamiast tego zostanie u\u017Cyta warto\u015B\u0107 %3$zu%4$s (%5$s)
J9GC075=Wyst\u0105pi\u0142 b\u0142\u0105d podczas analizowania opcji '-Xlp'
J9GC074=Wielko\u015B\u0107 du\u017Cej strony %1$zu%2$s (%3$s) nie jest obs\u0142ugiwan\u0105 wielko\u015Bci\u0105 strony; zamiast tego zostanie u\u017Cyta warto\u015B\u0107 %4$zu%5$s (%6$s)
J9GC077=Konfiguracja systemu nie obs\u0142uguje \u017C\u0105danej wielko\u015Bci du\u017Cej strony %1$zu%2$s (%3$s)
J9GC076=Konfiguracja systemu nie obs\u0142uguje \u017C\u0105danej wielko\u015Bci du\u017Cej strony %1$zu%2$s
J9GC079=Opcja '%1$s' nie jest pe\u0142na, nale\u017Cy poda\u0107 parametr '%2$s'.
J9GC078=Parametr '%1$s' nie zosta\u0142 podany jako pierwszy w opcji '%2$s'
SHRC024=B\u0142\u0105d od\u0142\u0105czenia pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej
SHRC025=B\u0142\u0105d podczas przy\u0142\u0105czania pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej
SHRC026=Nie mo\u017Cna utworzy\u0107 pami\u0119ci podr\u0119cznej o \u017C\u0105danej wielko\u015Bci\: Sprawd\u017A ustawienia SHMMAX i SHMMIN
SHRC027=Nazwa wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej jest zbyt d\u0142uga
SHRC020=Wyst\u0105pi\u0142 b\u0142\u0105d podczas otwierania semafora
SHRC021=Zwr\u00F3cony zosta\u0142 nieznany kod b\u0142\u0119du
SHRC022=B\u0142\u0105d podczas tworzenia regionu pami\u0119ci wsp\u00F3\u0142u\u017Cytkowanej
SHRC023=Pami\u0119\u0107 podr\u0119czna nie istnieje
J9GC048=przyrost starej pami\u0119ci
J9GC047=maksymalna wielko\u015B\u0107 starego obszaru
J9GC049=zapami\u0119tana ustawiona wielko\u015B\u0107
SHRC028=Odmowa uprawnie\u0144
SHRC029=W systemie pozosta\u0142o zbyt ma\u0142o pami\u0119ci
J9GC040=Nieznana opcja\: %s
J9GC042=Suma warto\u015Bci %1$s i %2$s jest za ma\u0142a dla %3$s
J9GC041=Nieznany typ fvtest\: %s
J9GC044=maksymalna wielko\u015B\u0107 nowego obszaru
J9GC043=pocz\u0105tkowa wielko\u015B\u0107 nowego obszaru
J9GC046=pocz\u0105tkowa wielko\u015B\u0107 starego obszaru
J9GC045=pocz\u0105tkowa wielko\u015B\u0107 pami\u0119ci
SHRC490=Wymu\u015B wykrywanie uszkodzonej wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC491=Niepowodzenie zapisania przy\u0142\u0105czonych danych (%1$s) dla %8$.*7$s.%4$.*3$s%6$.*5$s, przyczyna\: %2$s
SHRC492=Niepowodzenie zaktualizowania przy\u0142\u0105czonych danych (%1$s) dla %8$.*7$s.%4$.*3$s%6$.*5$s, przyczyna\: %2$s
J9GC060=wielko\u015B\u0107 obszaru pami\u0119ci niegin\u0105cej
SHRC013=Niepowodzenie usuni\u0119cia wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC497=Placeholder, not used
SHRC014=Niepowodzenie usuni\u0119cia semafora wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s"
SHRC498=Placeholder, not used
SHRC015=B\u0142\u0105d wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas\: Niepoprawna opcja
SHRC499=Placeholder, not used
SHRC016=B\u0142\u0105d wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas\:
SHRC493=Niepowodzenie odnalezienia przy\u0142\u0105czonych danych (%1$s) dla %8$.*7$s.%4$.*3$s%6$.*5$s, przyczyna\: %2$s
SHRC010=Wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna "%s" jest zniszczona
SHRC494=Niepowodzenie znalezienia przy\u0142\u0105czonych danych %1$s dla adresu 0x%2$p, przyczyna\: %3$s
SHRC011=B\u0142\u0105d\: Nie mo\u017Cna otworzy\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej klas
SHRC495=Niepowodzenie zapisania przy\u0142\u0105czonych danych %1$s dla adresu 0x%2$p, przyczyna\: %3$s
SHRC012=Nie mo\u017Cna usun\u0105\u0107 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej "%s", poniewa\u017C wci\u0105\u017C s\u0105 do niej przy\u0142\u0105czone maszyny JVM
SHRC496=Niepowodzenie zaktualizowania przy\u0142\u0105czonych danych %1$s dla adresu 0x%2$p, przyczyna\: %3$s
J9GC059=Opcja -Xgcpolicy\:metronome nie jest dozwolona bez opcji -Xrealtime
J9GC058=Niepowodzenie przydzia\u0142u obszaru pami\u0119ci niegin\u0105cej
SHRC017=Kod b\u0142\u0119du\: %d
SHRC018=nie mo\u017Cna przydzieli\u0107 pami\u0119ci
SHRC019=d\u0142ugo\u015B\u0107 \u017C\u0105dania jest zbyt ma\u0142a
J9GC051=przyrost segmentu klasy RAM
J9GC050=mi\u0119kka maksymalna wielko\u015B\u0107 pami\u0119ci
J9GC053=maksymalna wielko\u015B\u0107 pami\u0119ci
J9GC052=przyrost segmentu klasy ROM
J9GC055=wielko\u015B\u0107 du\u017Cych stron
J9GC054=Wielko\u015B\u0107 du\u017Cych stron %1$zu%2$s nie jest obs\u0142ugiwan\u0105 wielko\u015Bci\u0105 stron; zostanie u\u017Cyte %3$zu%4$s
J9GC057=%1$s nie mo\u017Ce by\u0107 wi\u0119ksze ni\u017C %2$s
J9GC056=dost\u0119pne wielko\u015Bci du\u017Cych stron
SHRC040=Okre\u015Bl nazw\u0119 wsp\u00F3\u0142u\u017Cytkowanej pami\u0119ci podr\u0119cznej
SHRC041=Zniszcz wsp\u00F3\u0142u\u017Cytkowan\u0105 pami\u0119\u0107 podr\u0119czn\u0105 (u\u017Cyj parametru nazwy lub nazwy domy\u015Blnej)
SHRC046=Wy\u015Bwietl wszystkie wsp\u00F3\u0142u\u017Cytkowane pami\u0119ci podr\u0119czne i ich statystyk\u0119
SHRC047=Wypisz podsumowanie statystyki pami\u0119ci podr\u0119cznych
SHRC048=Wypisz wszystkie elementy znajduj\u0105ce si\u0119 w pami\u0119ci podr\u0119cznej
SHRC049=Tryb debugowania sprawdzaj\u0105cy wszystkie nadchodz\u0105ce kody bajtowe
SHRC042=Zniszcz wszystkie wsp\u00F3\u0142u\u017Cytkowane pami\u0119ci podr\u0119czne
SHRC043=W\u0142\u0105cz wsp\u00F3\u0142u\u017Cytkowanie zmodyfikowanego kodu bajtowego.\n \t<modContext> jest deskryptorem u\u017Cytkownika opisuj\u0105cym typ modyfikacji.\n \tMaszyny JVM u\u017Cywaj\u0105ce tego samego <modContext> musz\u0105 u\u017Cywa\u0107 tych samych\n \tmodyfikacji.
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC045=Zniszcz pami\u0119ci podr\u0119czne, kt\u00F3re nie by\u0142y u\u017Cywane od <t> min
J9GC026=Opcja -Xverbosegclog nie przydzieli\u0142a struktur wewn\u0119trznych
J9GC025=Suma %1$s i %2$s
J9GC028=Zbyt du\u017Ca warto\u015B\u0107 opcji\: '%s'
J9GC027=Zniekszta\u0142cona opcja\: '%s'
J9GC029=B\u0142\u0105d opcji\: '%s'
J9GC020=Warto\u015B\u0107 parametru %s jest zbyt du\u017Ca dla sterty
J9GC022=Suma warto\u015Bci %1$s i %2$s jest za du\u017Ca dla %3$s
J9GC021=%1$s musi by\u0107 r\u00F3wne %2$s
J9GC024=Suma warto\u015Bci %1$s i %2$s jest za du\u017Ca dla sterty
J9GC023=Suma warto\u015Bci %1$s i %2$s musi by\u0107 r\u00F3wna %3$s
SHRC030=Przy\u0142\u0105czana wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna klas ma niepoprawny nag\u0142\u00F3wek.
SHRC035=Wy\u0142\u0105czono lokalne buforowanie \u015Bcie\u017Cek klas
SHRC036=Wy\u0142\u0105czono zmniejszanie rywalizacji w zapisywaniu wsp\u00F3\u0142bie\u017Cnym
SHRC037=Wy\u0142\u0105czono aktualizacje przyrostowe
SHRC038=Sk\u0142adnia\:\n\njava -Xshareclasses[\:opcja,...]\n\n Poprawne opcje (z kr\u00F3tkim opisem) s\u0105 nast\u0119puj\u0105ce\:\n\n
SHRC031=Przy\u0142\u0105czana wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna klas ma niekompatybiln\u0105 wersj\u0119 maszyny JVM.
SHRC032=Przy\u0142\u0105czana wsp\u00F3\u0142u\u017Cytkowana pami\u0119\u0107 podr\u0119czna klas ma b\u0142\u0119dny poziom modyfikacji.
SHRC033=Wy\u0142\u0105czono blokowanie lokalnych tabel mieszaj\u0105cych
SHRC034=Wy\u0142\u0105czono sprawdzanie znacznika czasu
J9GC037=Parametr %1$s nie jest obs\u0142ugiwany z warto\u015Bciami innymi ni\u017C %2$zu
J9GC036=Warto\u015B\u0107 parametru %1$s musi by\u0107 wi\u0119ksza ni\u017C %2$zu
J9GC039=Parametr %1$s jest nieaktualny; zamiast niego u\u017Cyj parametru %2$s
J9GC038=Podana warto\u015B\u0107 parametru %s jest zbyt du\u017Ca
SHRC039=Wypisz og\u00F3ln\u0105 pomoc wsp\u00F3\u0142u\u017Cytkowan\u0105
J9GC031=Nie mo\u017Cna poda\u0107 jednocze\u015Bnie parametr\u00F3w %1$s i %2$s
J9GC030=Warto\u015B\u0107 %2$.2f parametru %1$s musi by\u0107 mniejsza o co najmniej %3$s ni\u017C warto\u015B\u0107 %5$.2f parametru %4$s
J9GC033=Warto\u015B\u0107 parametru %1$s musi si\u0119 mie\u015Bci\u0107 w zakresie od %2$.2f do %3$.2f (w\u0142\u0105cznie)
J9GC032=Konfiguracja systemu nie obs\u0142uguje opcji '%s'
J9GC035=Po parametrze %s musi nast\u0119powa\u0107 liczba
J9GC034=Warto\u015B\u0107 parametru %1$s musi si\u0119 mie\u015Bci\u0107 w zakresie od %2$zu do %3$zu (w\u0142\u0105cznie)
SHRC060=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na bufor \u0142a\u0144cuch\u00F3w w shrinit\:\:hookFindSharedClass
SHRC061=Nazwa pami\u0119ci podr\u0119cznej nie powinna mie\u0107 wi\u0119cej ni\u017C 64 znak\u00F3w. Nie utworzono pami\u0119ci podr\u0119cznej.
SHRC062=B\u0142\u0105d podczas kopiowania nazwy u\u017Cytkownika do domy\u015Blnej nazwy pami\u0119ci podr\u0119cznej
SHRC063=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na sharedClassConfig w shrinit
SHRC068=Wy\u0142\u0105czono lokalne buforowanie \u015Bcie\u017Cek klas
SHRC069=Wy\u0142\u0105czono zmniejszanie rywalizacji w zapisywaniu wsp\u00F3\u0142bie\u017Cnym
SHRC064=Niepowodzenie utworzenia configMonitor w shrinit
SHRC065=Nie mo\u017Cna przydzieli\u0107 puli w shrinit
SHRC066=Wy\u0142\u0105czono blokowanie lokalnych tabel mieszaj\u0105cych
SHRC067=Wy\u0142\u0105czono sprawdzanie znacznika czasu
J9GC004=Niepowodzenie utworzenia instancji globalnego procesu czyszczenia pami\u0119ci
J9GC003=Niepowodzenie utworzenia instancji programu rozsy\u0142aj\u0105cego zadania
J9GC006=Niepowodzenie inicjowania; brak pami\u0119ci
J9GC005=Niepowodzenie inicjowania
J9GC008=Niepowodzenie inicjowania rozszerze\u0144 modu\u0142u
J9GC007=Niepowodzenie inicjowania; nie mo\u017Cna przeanalizowa\u0107 wiersza komend
J9GC009=Niepowodzenie inicjowania blokady mutex dla statystyki GC
J9GC000=B\u0142\u0105d wewn\u0119trzny; brak pami\u0119ci
J9GC002=Niepowodzenie utworzenia instancji sterty; za\u017C\u0105dano %1$zu%2$s
J9GC001=Niepowodzenie utworzenia instancji sterty
SHRC050=W\u0142\u0105cz szczeg\u00F3\u0142owe dane wyj\u015Bciowe
SHRC051=Wy\u0142\u0105cz aktualizacje dynamiczne
SHRC052=Wy\u0142\u0105cz lokalne buforowanie \u015Bcie\u017Cek klas
SHRC057=B\u0142\u0119dne parametry opcji utraty wa\u017Cno\u015Bci
SHRC058=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na ClasspathItem w shrinit\:\:hookStoreSharedClass
SHRC059=Nie mo\u017Cna przydzieli\u0107 pami\u0119ci na ClasspathItem w shrinit\:\:hookFindSharedClass
SHRC053=Wy\u0142\u0105cz blokowanie lokalnych tabel mieszaj\u0105cych
SHRC054=Wy\u0142\u0105cz algorytm zmniejszaj\u0105cy rywalizacj\u0119 podczas zapisywania
SHRC055=Wy\u0142\u0105cz przyrostowe aktualizacje pami\u0119ci podr\u0119cznej
SHRC056=Nierozpoznana opcja wiersza komend "%s"
J9GC015=Niepowodzenie przydzia\u0142u domy\u015Blnego obszaru pami\u0119ci
J9GC014=Niepowodzenie przydzia\u0142u segment\u00F3w pami\u0119ci klas maszyny VM
J9GC017=Za ma\u0142a warto\u015B\u0107 %1$s; musi mie\u0107 warto\u015B\u0107 co najmniej %2$zu %3$sB
J9GC016=Niepowodzenie przydzia\u0142u segmentu przetrwania w domy\u015Blnym obszarze pami\u0119ci
J9GC019=Za du\u017Ca warto\u015B\u0107 %1$s dla %2$s
J9GC018=Za ma\u0142a warto\u015B\u0107 %1$s dla %2$s
J9GC011=Niepowodzenie inicjowania puli obszar\u00F3w pami\u0119ci
J9GC010=Niepowodzenie inicjowania zarz\u0105dzania finalizacj\u0105
J9GC013=Niepowodzenie przydzia\u0142u segment\u00F3w pami\u0119ci obiekt\u00F3w maszyny VM
J9GC012=Niepowodzenie przydzia\u0142u segment\u00F3w pami\u0119ci maszyny VM
