#Thu Jan 21 02:08:20 CST 2021
EXEL070=Obraz ROM m\u00E1 nespr\u00E1vnu verziu
EXEL079=\  -Xscmx<x>       nastavenie ve\u013Ekosti novej zdie\u013Eanej vyrovn\u00E1vacej pam\u00E4te tried na <x>
J9VM151=Zlyhalo otv\u00E1ranie kni\u017Enice jimage
J9VM150=-Xscsoftmx sa ignoruje, ak nie je zadan\u00E9 -Xshareclasses
J9VM153=JVM nem\u00F4\u017Ee pou\u017Ei\u0165 kni\u017Enicu jimage, preto sa prep\u00EDna na intern\u00E9ho \u010Ditate\u013Ea jimage
EXEL071=Nebolo mo\u017En\u00E9 n\u00E1js\u0165 triedu s n\u00E1zvom main
J9VM152=Zlyhalo vyh\u013Ead\u00E1vanie symbolu %s v kni\u017Enici jimage
EXEL072=Chyba pri sp\u00FA\u0161\u0165an\u00ED VM\: Nedostatok pam\u00E4te
J9VM155=Nespr\u00E1vna hodnota pre -Xpatch; cesta k d\u00E1vke nie je zadan\u00E1 vo vlastnosti %s\=%s
EXEL073=Intern\u00E1 chyba VM\: Zlyhalo vytvorenie Java VM
J9VM154=Nespr\u00E1vna hodnota pre -Xpatch; nie je zadan\u00E1 hodnota vlastnosti %s
EXEL074=
J9VM157=Trieda %2$.*1$s(%3$s) nem\u00F4\u017Ee pristupova\u0165 k triede %5$.*4$s(%6$s), preto\u017Ee modul %3$s ne\u010D\u00EDta modul %6$s
EXEL075=\  -Xquickstart    zr\u00FDchli\u0165 sp\u00FA\u0161\u0165anie oneskoren\u00EDm optimaliz\u00E1ci\u00ED
J9VM156=Ak nie je zadan\u00E9 -Xshareclasses, -XX\:SharedCacheHardLimit\= sa ignoruje
EXEL076=JIT  - %s\n
J9VM159=Chyba\: %s vy\u017Eaduje \u0161pecifik\u00E1ciu cesty k modulu
EXEL077=\  -Xssi<x>        nastavenie pr\u00EDrastku pre z\u00E1sobn\u00EDk vl\u00E1kien Java na <x>
J9VM158=Trieda %2$.*1$s(%3$s) nem\u00F4\u017Ee prist\u00FApi\u0165 k triede %5$.*4$s(%6$s), preto\u017Ee modul %6$s neexportuje bal\u00EDk %7$s do modulu %3$s
EXEL078=\  -Xshareclasses[\:vo\u013Eby] Povoli\u0165 zdie\u013Eanie \u00FAdajov tried (ak chcete z\u00EDska\u0165 detaily, zadajte help)\n
J9VM149=%s u\u017E nie je podporovan\u00E9. Pridajte vy\u017Eadovan\u00E9 kni\u017Enice/s\u00FAbory jar na cestu k triedam.
EXEL068=Intern\u00E1 chyba VM\: Zlyhalo nastavenie prvku po\u013Ea pre %s
EXEL069=Obraz ROM nebolo mo\u017En\u00E9 n\u00E1js\u0165
J9VM140=Volaj\u00FAci nie je anotovan\u00FD ako @sun.reflect.CallerSensitive.
J9VM142=Vo\u013Eba pr\u00EDkazov\u00E9ho riadka -Xrealtime nie je podporovan\u00E1 v tejto verzii IBM SDK
EXEL060=Intern\u00E1 chyba VM\: Zlyhalo vytvorenie po\u013Ea bajtov pre triedu s n\u00E1zvom %s
J9VM141=konfliktn\u00E9 predvolen\u00E9 met\u00F3dy pre '%2$.*1$s%4$.*3$s' v %6$.*5$s z tried [%7$s]
EXEL061=Intern\u00E1 chyba VM\: Zlyhalo vytvorenie java/lang/String pre triedu s n\u00E1zvom %s
J9VM144=prive\u013Ea parametrov\: 255 + 1
EXEL062=Intern\u00E1 chyba VM\: Nedostatok pam\u00E4te pri konverzii re\u0165azca na znaky UTF pre n\u00E1zov triedy %s
J9VM143=Vo\u013Eba pr\u00EDkazov\u00E9ho riadka %s nie je podporovan\u00E1 v tejto verzii IBM SDK
EXEL063=Trieda %s neimplementuje main()
J9VM146=vyvolanie rozhrania neverejnej met\u00F3dy '%4$.*3$s%6$.*5$s' v %2$.*1$s
EXEL064=Met\u00F3da main mus\u00ED by\u0165 deklarovan\u00E1 ako public, static a void.
J9VM145=%s nie je podporovan\u00E9 v opera\u010Dnom syst\u00E9me z/OS.
EXEL065=Intern\u00E1 chyba VM\: Zlyhalo vytvorenie po\u013Ea argumentov
J9VM148=%s u\u017E nie je podporovan\u00E9. Mechanizmus nahradenia schv\u00E1len\u00FDch \u0161tandardov je podporovan\u00FD iba cez aktualizovate\u013En\u00E9 moduly.
EXEL066=Intern\u00E1 chyba VM\: Zlyhalo vytvorenie po\u013Ea bajtov pre argument %s
J9VM147=Nemo\u017Eno pripoji\u0165 aktu\u00E1lne vl\u00E1kno
EXEL067=Intern\u00E1 chyba VM\: Zlyhalo vytvorenie java/lang/String pre argument %s
SMAP000=
EXEL090=\  -Xscmaxaot<x>   nastavi\u0165 maxim\u00E1lny priestor pam\u00E4te cache zdie\u013Ean\u00FDch tried povolen\u00FD pre \u00FAdaje AOT na <x>
EXEL091=\n  -Xcheck[\:vo\u013Eba[\:...]]  riadi\u0165 kontrolu, na zobrazenie viac podrobnost\u00ED pou\u017Eite -Xcheck\:help
EXEL092=\n  -Xdump[\:vo\u013Eba,...]  riadi\u0165 v\u00FDpisy, na zobrazenie viac podrobnost\u00ED pou\u017Eite -Xdump\:help
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP005=
J9VM171=Pokus o nastavenie po\u013Ea instance final %2$.*1$s.%4$.*3$s z met\u00F3dy "%6$.*5$s", ktor\u00E1 nie je <init>
J9VM170=Pokus o nastavenie po\u013Ea static final %2$.*1$s.%4$.*3$s z met\u00F3dy "%6$.*5$s", ktor\u00E1 nie je <clinit>
J9VM173=Trieda %2$.*1$s a jej hostite\u013E vnorenia %4$.*3$s musia ma\u0165 rovnak\u00FD bal\u00EDk.
J9VM172=Trieda %2$.*1$s a jej hostite\u013E vnorenia %4$.*3$s musia ma\u0165 rovnak\u00FD zav\u00E1dza\u010D tried.
J9VM175=Zlyhalo na\u010D\u00EDtavanie kni\u017Enice %1$s, ktor\u00FA vy\u017Eaduje modul\: %2$s
EXEL093=Nasleduj\u00FAce vo\u013Eby riadia glob\u00E1lnu konfigur\u00E1ciu VM\:
J9VM174=Trieda %2$.*1$s mus\u00ED by\u0165 z\u00EDskan\u00E1 jej hostite\u013Eom vnorenia %4$.*3$s
EXEL094=\  -Xcompressedrefs              pou\u017Ei\u0165 komprimovan\u00E9 referencie na haldu
J9VM177=Trieda %2$.*1$s mus\u00ED dok\u00E1za\u0165 na\u010D\u00EDta\u0165 jej hostite\u013Ea vnorenia %4$.*3$s.
EXEL095=\  -Xrealtime                    povoli\u0165 roz\u0161\u00EDrenia v re\u00E1lnom \u010Dase
J9VM176=na\u010D\u00EDtava sa poru\u0161enie obmedzenia pri nahradzovan\u00ED met\u00F3dy "%2$.*1$s.%4$.*3$s%6$.*5$s" po\u010Das vytv\u00E1rania triedy "%18$.*17$s"\: zav\u00E1dza\u010D "%8$.*7$s@%9$x" triedy "%11$.*10$s" a zav\u00E1dza\u010D "%13$.*12$s@%14$x" triedy "%16$.*15$s" maj\u00FA r\u00F4zne typy pre podpis met\u00F3dy
EXEL096=\  -Xgcpolicy\:metronome          povoli\u0165 roz\u0161\u00EDrenia v re\u00E1lnom \u010Dase
J9VM179=Modul nem\u00E1 n\u00E1zov.
EXEL097=\  -Xrealtime                    povoli\u0165 mierny re\u00E1lny \u010Das
J9VM178=Modul je null.
EXEL098=\  -Xgcpolicy\:metronome          povoli\u0165 mierny re\u00E1lny \u010Das
EXEL099=\  -Xrealtime -Xnortsj           povoli\u0165 mierny re\u00E1lny \u010Das
EXEL080=verzia java "%s"
EXEL081=verzia java "%1$s/%2$s"
J9VM160=Chyba\: %s vy\u017Eaduje, aby boli zadan\u00E9 moduly
J9VM162=\tat %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s)
J9VM161=\tat %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s\:%9$u)
J9VM164=\tat %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s)
EXEL082=\  -Xlp<x>         nastavi\u0165 ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky na <x>
J9VM163=\tat %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s\:%8$u)
EXEL083=Nebolo mo\u017En\u00E9 otvori\u0165 s\u00FAbor\: %s
J9VM166=\tat %2$.*1$s.%4$.*3$s (%5$.*6$s)
EXEL084=Nemo\u017Eno vytvori\u0165 z\u00E1lo\u017En\u00FA k\u00F3piu s\u00FAboru\: %s
J9VM165=\tna %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
EXEL085=\nUPOZORNENIE\: Argument pr\u00EDkazov\u00E9ho riadka "%s" je zastaral\u00FD. \nVAROVANIE\: Namiesto toho pou\u017Eite "-jxe <cesta>".\n
J9VM168=
EXEL086=\n  -Xtrace[\:vo\u013Eba,...]  riadi\u0165 sledovanie, na zobrazenie viac podrobnost\u00ED pou\u017Eite -Xtrace\:help
J9VM167=Optimaliz\u00E1cie GC pri ne\u010Dinnosti nie s\u00FA podporovan\u00E9
EXEL087=\  -Xjni\:<vo\u013Eby>               nastavi\u0165 vo\u013Eby JNI
EXEL088=
J9VM169=
EXEL089=\  -Xscminaot<x>   nastavi\u0165 minim\u00E1lny priestor pam\u00E4te cache zdie\u013Ean\u00FDch tried rezervovan\u00FD pre \u00FAdaje AOT na <x>
J9VM117=Ak nie je zadan\u00E9 -Xshareclasses, -Xitsn sa ignoruje
J9VM116=\u017Eiadne uzamykacie slovo\:%.*s
J9VM119=Ak nie je zadan\u00E9 -Xshareclasses, -Xscmaxjit sa ignoruje
J9VM118=Ak nie je zadan\u00E9 -Xshareclasses, -Xscminjit sa ignoruje
J9VM111=Zadan\u00E1 neplatn\u00E1 oper\u00E1cia uzamykacieho slova\: %s
J9VM110=Zadan\u00FD neplatn\u00FD re\u017Eim uzamykacieho slova\: %s
J9VM113=-----------------------------
J9VM112=Konfigur\u00E1cia uzamykacieho slova
J9VM115=uzamykacie slovo\:%.*s
J9VM114=Re\u017Eim uzamykacieho slova\=%s
J9VM106=Vo\u013Eby info, warn, error, vital a config mo\u017Eno kombinova\u0165 pomocou zna\u010Dku ',', napr\u00EDklad\:\n
J9VM105=-Xsyslog\:config            Protokolova\u0165 konfigura\u010Dn\u00E9 spr\u00E1vy JVM.\n
J9VM108=-Xsyslog\:info,warn,error\n
J9VM107=-Xsyslog\:error,warn
J9VM109=Nepodporovan\u00FD opera\u010Dn\u00FD syst\u00E9m (%s)\: Vy\u017Eaduje sa Windows XP alebo nov\u0161ia verzia.
J9VM100=-Xsyslog\:all               Protokolova\u0165 v\u0161etky spr\u00E1vy JVM.
J9VM102=-Xsyslog\:warn              Protokolova\u0165 varovn\u00E9 spr\u00E1vy JVM.
J9VM101=-Xsyslog\:info              Protokolova\u0165 informa\u010Dn\u00E9 spr\u00E1vy JVM.
J9VM104=-Xsyslog\:vital             Protokolova\u0165 k\u013E\u00FA\u010Dov\u00E9 spr\u00E1vy JVM. Toto je predvolene zapnut\u00E9.
J9VM103=-Xsyslog\:error             Protokolova\u0165 chybov\u00E9 spr\u00E1vy JVM. Toto je predvolene zapnut\u00E9.
J9VM139=
J9VM138=
J9VM131=Ukon\u010Duje sa proces pomocou CEE3AB2() s abnorm\u00E1lnym ukon\u010Den\u00EDm %1$u, pr\u00ED\u010Dinou %2$u, vy\u010Disten\u00EDm %3$u.
J9VM130=Aplik\u00E1cia obnovila vykon\u00E1vanie po spracovan\u00ED neopravite\u013En\u00E9ho stavu a ileg\u00E1lne sa vr\u00E1tila, alebo sa zavolala, do Java (k\u00F3d JIT)
J9VM133=Pevn\u00FD ulimit ve\u013Ekos\u0165 jadra syst\u00E9mu je nastaven\u00FD na %d, syst\u00E9mov\u00E9 v\u00FDpisy sa m\u00F4\u017Eu oreza\u0165.
J9VM132=Je zadan\u00E9 neplatn\u00FD re\u017Eim uzamykacieho slova; java/lang/Class a java/lang/String nem\u00F4\u017Eu ma\u0165 uzamykacie slov\u00E1, ke\u010F je pr\u00EDtomn\u00E9 -Xtenant\: %s
J9VM135=Nastavenie /proc/sys/kernel/core_pattern "%s" ur\u010Duje, \u017Ee v\u00FDpisy pam\u00E4te jadra sa maj\u00FA posla\u0165 do extern\u00E9ho programu. JVM mo\u017Eno nevie n\u00E1js\u0165 v\u00FDpisy pam\u00E4te jadra a premenova\u0165 ich.
J9VM134=Vo\u013Eba \u00FApln\u00E9ho jadra syst\u00E9mu je nastaven\u00E1 na hodnotu FALSE, syst\u00E9mov\u00E9 v\u00FDpisy sa m\u00F4\u017Eu oreza\u0165.
J9VM137=trieda %2$.*1$s m\u00E1 konfliktn\u00E9 predvolen\u00E9 hodnoty pre met\u00F3du %4$.*3$s%6$.*5$s
J9VM136=Nastavenie /proc/sys/kernel/core_pattern "%s" ur\u010Duje form\u00E1tovac\u00ED re\u0165azec pre premenovanie v\u00FDpisov pam\u00E4te jadra. JVM mo\u017Eno nevie n\u00E1js\u0165 v\u00FDpisy pam\u00E4te jadra a premenova\u0165 ich.
J9VM128=Priestor haldy Java
J9VM127=Po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165 32-bitov\u00E9ho subalok\u00E1tora nem\u00F4\u017Ee by\u0165 nastaven\u00E1 na nulu.
J9VM129=Aplik\u00E1cia obnovila vykon\u00E1vanie po spracovan\u00ED neopravite\u013En\u00E9ho stavu a ileg\u00E1lne sa vr\u00E1tila, alebo sa zavolala, do Java
J9VM120=Ak nie je zadan\u00E9 -Xshareclasses, -Xscminjitdata sa ignoruje
J9VM122=Zlyhalo z\u00EDskavanie rozsahu adresy user32.dll, ktor\u00FD sa vy\u017Eaduje pre -Xprotectcontiguous.
J9VM121=Ak nie je zadan\u00E9 -Xshareclasses, -Xscmaxjitdata sa ignoruje
J9VM124=Nemo\u017Eno definova\u0165 triedu %.*s - '%.*s' je chr\u00E1nen\u00FD syst\u00E9mov\u00FD bal\u00EDk
J9VM123=Spravil sa pokus o spustenie na nepodporovanom procesore. JVM sa ukon\u010D\u00ED.
J9VM126=Ve\u013Ekos\u0165 potvrdenia 32-bitov\u00E9ho subalok\u00E1tora nem\u00F4\u017Ee by\u0165 nastaven\u00E1 na nulu.
J9VM125=Ve\u013Ekos\u0165 potvrdenia 32-bitov\u00E9ho subalok\u00E1tora je v\u00E4\u010D\u0161ia ako po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165. Ve\u013Ekos\u0165 potvrdenia \= %1$u, po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165 \= %2$u.
SHRC802=Pam\u00E4\u0165 cache je vo\u013Ene zaplnen\u00E1, %1$d%%\n
SHRC803=Povo\u013Ete ochranu pam\u00E4te pre \u010Diasto\u010Dne zaplnen\u00E9 str\u00E1nky pri spusten\u00ED.
SHRC804=JVM povolilo ochranu \u010Diasto\u010Dn\u00FDch str\u00E1nok zdie\u013Eanej pam\u00E4te cache pri spusten\u00ED, preto\u017Ee existuj\u00FAca zdie\u013Ean\u00E1 pam\u00E4\u0165 cache bola vytvoren\u00E1 s povolenou ochranou \u010Diasto\u010Dn\u00FDch str\u00E1nok pri spusten\u00ED.
SHRC805=JVM nepovolilo ochranu \u010Diasto\u010Dne zaplnen\u00FDch str\u00E1nok zdie\u013Eanej pam\u00E4te cache pri spusten\u00ED.
SHRC800=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache je pln\u00E1. Minim\u00E1lny vyhraden\u00FD a maxim\u00E1lny povolen\u00FD priestor AOT alebo d\u00E1tov\u00FD priestor JIT a vo\u013En\u00FD maxim\u00E1lny limit u\u017E nemo\u017Eno upravova\u0165.
SHRC801=bajty vo\u013En\u00E9ho maxima                %*c\= %d
SHRC806=Perzistentn\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache komprimovan\u00FDch referenci\u00ED "%1$s" bola zni\u010Den\u00E1. Ak chcete zni\u010Di\u0165 pam\u00E4\u0165 cache nekomprimovan\u00FDch referenci\u00ED, pou\u017Eite vo\u013Ebu -Xnocompressedrefs.
SHRC807=Perzistentn\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache nekomprimovan\u00FDch referenci\u00ED "%1$s" bola zni\u010Den\u00E1. Ak chcete zni\u010Di\u0165 pam\u00E4\u0165 cache komprimovan\u00FDch referenci\u00ED, pou\u017Eite vo\u013Ebu -Xcompressedrefs.
SHRC808=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache komprimovan\u00FDch referenci\u00ED "%s" je zni\u010Den\u00E1. Ak chcete zni\u010Di\u0165 pam\u00E4\u0165 cache nekomprimovan\u00FDch referenci\u00ED, pou\u017Eite vo\u013Ebu -Xnocompressedrefs.
SHRC809=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache nekomprimovan\u00FDch referenci\u00ED "%s" je zni\u010Den\u00E1. Ak chcete zni\u010Di\u0165 pam\u00E4\u0165 cache komprimovan\u00FDch referenci\u00ED, pou\u017Eite vo\u013Ebu -Xcompressedrefs.
DUMP001=Nezn\u00E1ma udalos\u0165 v\u00FDpisu\: ...%s
DUMP000=Nezn\u00E1ma vo\u013Eba v\u00FDpisu\: -Xdump\:%s
DUMP003=Nezn\u00E1my agent v\u00FDpisov\: %s
DUMP002=Nezn\u00E1my symbol\: %%%1$c
DUMP012=Chyba vo v\u00FDpise %1$s\: %2$s
DUMP011=V\u00FDpis %1$s vytvoril proces %2$d
DUMP014=Nezn\u00E1ma akcia VM\: ...%s
DUMP013=Spracovala sa udalos\u0165 v\u00FDpisu "%1$s", podrobnosti "%3$.*2$s".
DUMP010=V\u00FDpis %1$s sa zap\u00EDsal do %2$s
SHRC824=Pr\u00EDznaky STARTUP HINTS DETAIL\: %1$zu DATA1\: %2$zu DATA2\: %3$zu
DUMP009=V\u00FDpis %s nie je dostupn\u00FD
SHRC825=\t startuphint       Vytla\u010D\u00ED iba typy r\u00E1d pri sp\u00FA\u0161\u0165an\u00ED v zdie\u013Eanej pam\u00E4ti cache.
DUMP008=pou\u017E\u00EDvanie '%s'
SHRC826=Bajty r\u00E1d pri sp\u00FA\u0161\u0165an\u00ED %*c\= %d
SHRC827=\# Rady pri sp\u00FA\u0161\u0165an\u00ED  %*c\= %d
SHRC820=Zak\u00E1\u017Ete pou\u017Eitie pam\u00E4te cache pre triedy na\u010D\u00EDtan\u00E9 zav\u00E1dza\u010Dom syst\u00E9mov\u00FDch tried.
DUMP005=Ch\u00FDba extern\u00FD n\u00E1stroj
SHRC821=Zak\u00E1za\u0165 pou\u017Eitie pam\u00E4te cache pre triedy na\u010D\u00EDtan\u00E9 zav\u00E1dza\u010Dmi in\u00FDmi ako bootstrap. T\u00E1to vo\u013Eba tie\u017E aktivuje vo\u013Ebu "nonfatal".
DUMP004=Ch\u00FDba n\u00E1zov s\u00FAboru
SHRC822=Nespusti\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 cache pri v\u00FDskyte chyby.
DUMP007=JVM \u017Eiada o v\u00FDpis %1$s pomocou '%2$s'
SHRC823=%1$d\: 0x%2$p STARTUP HINTS KEY\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
DUMP006=Sprac\u00FAva sa udalos\u0165 v\u00FDpisu "%1$s", podrobnosti "%3$.*2$s". \u010Cakajte.
SHRC828=Cesta k adres\u00E1ru zdie\u013Eanej pam\u00E4te cache je pridlh\u00E1.
SHRC829=Zlyhalo pou\u017Eitie domovsk\u00E9ho adres\u00E1ra pou\u017E\u00EDvate\u013Ea ako predvolen\u00E9ho adres\u00E1ra zdie\u013Eanej pam\u00E4te cache. Nemo\u017Eno z\u00EDska\u0165 domovsk\u00FD adres\u00E1r. Nastavte in\u00FD adres\u00E1r cez premenn\u00FA prostredia "HOME" alebo vo\u013Ebu pr\u00EDkazov\u00E9ho riadka "cacheDir\=" alebo opravte domovsk\u00FD adres\u00E1r v polo\u017Eke s\u00FAboru hesiel.
DUMP023=Po\u017Eadovan\u00E1 pr\u00EDprava haldy sa nevykonala, preto\u017Ee nevznikla po\u017Eiadavka o pr\u00EDstup typu exclusive, alebo nebolo mo\u017En\u00E9 z\u00EDska\u0165 pr\u00EDstup.
DUMP022=Po\u017Eadovan\u00E1 kompakcia haldy sa nevykonala, preto\u017Ee nevznikla po\u017Eiadavka o pr\u00EDstup typu exclusive, alebo nebolo mo\u017En\u00E9 z\u00EDska\u0165 pr\u00EDstup.
DUMP025=Zlyhanie IEATDUMP pre DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=Bolo vy\u017Eadovan\u00FDch viacero v\u00FDpisov haldy, ale z n\u00E1vestia s\u00FAboru ch\u00FDba %%id\: v\u00FDpisy sa prep\u00ED\u0161u
DUMP021=Po\u017Eadovan\u00E9 heapdump sa nevytvorilo, preto\u017Ee nevznikla po\u017Eiadavka o pr\u00EDstup typu exclusive, alebo nebolo mo\u017En\u00E9 z\u00EDska\u0165 pr\u00EDstup.
DUMP020=V\u00FDpis %s sa zap\u00EDsal
SHRC813=Celkov\u00FD po\u010Det neulo\u017Een\u00FDch bajtov z d\u00F4vodu pou\u017Eitia nastavenia -Xscsoftmx je %u. Po\u010Det neulo\u017Een\u00FDch bajtov AOT z d\u00F4vodu pou\u017Eitia nastavenia -Xscmaxaot je %u. Po\u010Det neulo\u017Een\u00FDch bajtov JIT z d\u00F4vodu pou\u017Eitia nastavenia -Xscmaxjitdata je %u.
SHRC814=\t stale           Vytla\u010D\u00ED zastaran\u00E9 polo\u017Eky v zdie\u013Eanej pam\u00E4ti cache.
DUMP019=JVM \u017Eiada o v\u00FDpis %s
SHRC815=zastaran\u00E9 bajty                     %*c\= %u
SHRC816=Hodnota %s je v\u00E4\u010D\u0161ia ako ve\u013Ekos\u0165 zdie\u013Eanej pam\u00E4te cache, preto bola nastaven\u00E1 na ve\u013Ekos\u0165 zdie\u013Eanej pam\u00E4te cache.
DUMP016=Ru\u0161enie\: S\u00FAbor (%s) sa ned\u00E1 vytvori\u0165
SHRC810=Sn\u00EDmka zdie\u013Eanej pam\u00E4te cache komprimovan\u00FDch referenci\u00ED "%s" je zni\u010Den\u00E1. Ak chcete zni\u010Di\u0165 sn\u00EDmku pam\u00E4te cache nekomprimovan\u00FDch referenci\u00ED, pou\u017Eite vo\u013Ebu -Xnocompressedrefs.
DUMP015=Ru\u0161enie\: (%s) sa ned\u00E1 otvori\u0165 alebo \u010D\u00EDta\u0165
SHRC811=Sn\u00EDmka zdie\u013Eanej pam\u00E4te cache nekomprimovan\u00FDch referenci\u00ED "%s" je zni\u010Den\u00E1. Ak chcete zni\u010Di\u0165 sn\u00EDmku pam\u00E4te cache komprimovan\u00FDch referenci\u00ED, pou\u017Eite vo\u013Ebu -Xcompressedrefs.
DUMP018=Po\u017Eadovan\u00E1 udalos\u0165 je nedostupn\u00E1, spustite program s prep\u00EDna\u010Dom -Xdump\:dynamic
SHRC812=Funkcia                              \= %s
DUMP017=Ru\u0161enie\: S\u00FAbor (%s) sa ned\u00E1 skomprimova\u0165
SHRC817=Hodnota %s je v\u00E4\u010D\u0161ia ako ve\u013Ekos\u0165 zdie\u013Eanej pam\u00E4te cache, preto bola nastaven\u00E1 na neobmedzen\u00FA ve\u013Ekos\u0165
SHRC818=Celkov\u00FD po\u010Det neulo\u017Een\u00FDch bajtov z d\u00F4vodu mierneho maxima zdie\u013Eanej pam\u00E4te cache je %u. Po\u010Det neulo\u017Een\u00FDch bajtov AOT z d\u00F4vodu pou\u017Eitia nastavenia -Xscmaxaot je %u. Po\u010Det neulo\u017Een\u00FDch bajtov JIT z d\u00F4vodu pou\u017Eitia nastavenia -Xscmaxjitdata je %u.
SHRC819=Zlyhalo sp\u00FA\u0161\u0165anie zdie\u013Eanej pam\u00E4te cache. Existuj\u00FAca zdie\u013Ean\u00E1 pam\u00E4\u0165 cache bola vytvoren\u00E1 in\u00FDm zostaven\u00EDm JVM a nezhoduje sa so spusten\u00FDm JVM.
SHRC840=Zlyhalo sp\u00FA\u0161\u0165anie zdie\u013Eanej pam\u00E4te cache.
SHRC841=Zadajte \u010D\u00EDslo najvy\u0161\u0161ej vrstvy. Ak uveden\u00E1 vrstva neexistuje, vytvorte nov\u00FA vrstvu zdie\u013Eanej pam\u00E4te cache.
SHRC846=\nAktu\u00E1lna \u0161tatistika pre najvy\u0161\u0161iu vrstvu pam\u00E4te cache "%s"\: \n
SHRC847=vrstva pam\u00E4te cache                 %*.c\= %d
SHRC848=\nAktu\u00E1lna \u0161tatistika pre v\u0161etky vrstvy pam\u00E4te cache "%s"\: \n
J9VM191=%2$.*1$s nie je vidite\u013En\u00E9
SHRC849=Vytla\u010Di\u0165 s\u00FAhrn \u0161tatistiky pam\u00E4te cache iba z najvy\u0161\u0161ej vrstvy. Na zobrazenie dostupn\u00FDch volieb pou\u017Eite printTopLayerStats\=help.
J9VM190=Supertrieda %2$.*1$s nem\u00F4\u017Ee by\u0165 rozhranie
SHRC842=Vytvori\u0165 nov\u00FA vrstvu zdie\u013Eanej pam\u00E4te cache.
J9VM193=Po\u010Dn\u00FAc verziou Java 13, vo\u013Eby -Xverify\:none a -noverify s\u00FA ozna\u010Den\u00E9 na odstr\u00E1nenie a v bud\u00FAcnosti nemusia by\u0165 akceptovan\u00E9.
SHRC843=Na\u0161lo sa neplatn\u00E9 \u010D\u00EDslo vrstvy %d pre "%s". \u010C\u00EDslo vrstvy by malo by\u0165 men\u0161ie ako %d.
J9VM192=%2$.*1$s nie je rozhranie
SHRC844=Neplatn\u00E9 \u010D\u00EDslo vrstvy %d. Existuj\u00FAca najvy\u0161\u0161ia vrstva je %d. \u010C\u00EDslo novej vrstvy by malo by\u0165 %d.
J9VM195=Pole bal\u00EDkov m\u00E1 hodnotu null.
SHRC845=Nekontrolova\u0165 vo\u013En\u00FD diskov\u00FD priestor pred vytvoren\u00EDm perzistentnej pam\u00E4te cache.
J9VM194=Neplatn\u00FD vz\u0165ah na\u010D\u00EDtania triedy pre potomka\: %2$.*1$s, rodi\u010Da\: %4$.*3$s
J9VM197=%1$s nie je podporovan\u00E9 s %2$s.
J9VM196=Re\u0165azec bal\u00EDka m\u00E1 hodnotu null.
J9VM199=trieda %2$.*1$s nem\u00E1 dovolen\u00E9 dedi\u0165 z jej zape\u010Daten\u00E9ho superrozhrania.
J9VM198=trieda %2$.*1$s nem\u00E1 dovolen\u00E9 dedi\u0165 z jej zape\u010Datenej supertriedy.
SHRC830=Zlyhalo pou\u017Eitie domovsk\u00E9ho adres\u00E1ra pou\u017E\u00EDvate\u013Ea ako predvolen\u00E9ho adres\u00E1ra zdie\u013Eanej pam\u00E4te cache. Cesta je pridlh\u00E1. Nemo\u017Eno z\u00EDska\u0165 domovsk\u00FD adres\u00E1r. Nastavte in\u00FD adres\u00E1r cez premenn\u00FA prostredia "HOME" alebo vo\u013Ebu pr\u00EDkazov\u00E9ho riadka "cacheDir\=" alebo opravte domovsk\u00FD adres\u00E1r v polo\u017Eke s\u00FAboru hesiel.
SHRC835=Skontrolova\u0165 \u010Dasov\u00E9 zna\u010Dky s\u00FAborov jar/zip v adrese URL inej ako bootstrap pri ka\u017Edom na\u010D\u00EDtavan\u00ED triedy.
SHRC836=Zni\u010Di\u0165 v\u0161etky vrstvy zdie\u013Eanej pam\u00E4te cache s rovnak\u00FDm n\u00E1zvom (pou\u017Ei\u0165 parameter n\u00E1zvu alebo predvolen\u00FA hodnotu)
SHRC837=Zlyhalo vyhradovanie popisova\u010Da pam\u00E4te cache
J9VM180=N\u00E1zov modulu je neplatn\u00FD.
SHRC838=Zlyhalo sp\u00FA\u0161\u0165anie zdie\u013Eanej pam\u00E4te cache. Modifik\u00E1cia zdie\u013Eanej pam\u00E4te cache na ni\u017E\u0161ej vrstve bola vymazan\u00E1. O\u010Dak\u00E1van\u00E9 jedine\u010Dn\u00E9 ID pam\u00E4te cache je %s
SHRC831=Zlyhalo pou\u017Eitie domovsk\u00E9ho adres\u00E1ra pou\u017E\u00EDvate\u013Ea ako predvolen\u00E9ho adres\u00E1ra zdie\u013Eanej pam\u00E4te cache. Je v sie\u0165ovom s\u00FAborovom syst\u00E9me. Nemo\u017Eno z\u00EDska\u0165 domovsk\u00FD adres\u00E1r. Nastavte in\u00FD adres\u00E1r cez premenn\u00FA prostredia "HOME" alebo vo\u013Ebu pr\u00EDkazov\u00E9ho riadka "cacheDir\=" alebo opravte domovsk\u00FD adres\u00E1r v polo\u017Eke s\u00FAboru hesiel.
J9VM182=Iba zav\u00E1dza\u010D syst\u00E9mov\u00FDch tried alebo tried platformy m\u00F4\u017Ee definova\u0165 bal\u00EDk java alebo java.*.
SHRC832=Zlyhalo pou\u017Eitie domovsk\u00E9ho adres\u00E1ra pou\u017E\u00EDvate\u013Ea ako predvolen\u00E9ho adres\u00E1ra zdie\u013Eanej pam\u00E4te cache. K\u00F3d chyby je %1$d.
J9VM181=Iba zav\u00E1dza\u010D syst\u00E9mov\u00FDch tried m\u00F4\u017Ee definova\u0165 modul java.base.
SHRC833=Zlyhalo vyhradzovanie nat\u00EDvnej pam\u00E4te vy\u017Eadovanej na z\u00EDskanie adres\u00E1ra zdie\u013Eanej pam\u00E4te cache.
J9VM184=nespr\u00E1vna trieda %2$.*1$s\: pole in\u0161tancie Qtype nem\u00E1 typ hodnoty
SHRC834=Minimalizova\u0165 kontrolu \u010Dasovej zna\u010Dky s\u00FAborov jar/zip v adrese URL.
J9VM183=\u010Clen vnorenia %2$.*1$s mus\u00ED dok\u00E1za\u0165 na\u010D\u00EDta\u0165 hostite\u013Ea vnorenia %4$.*3$s
J9VM186=nespr\u00E1vny typ objektu %2$.*1$s\: objekt v z\u00E1sobn\u00EDku nie je typ hodnoty
J9VM185=nespr\u00E1vna trieda %2$.*1$s\: classref nie je typ hodnoty
J9VM188=Zlyhalo vytv\u00E1ranie vl\u00E1kna\: n\u00E1vratov\u00E1 hodnota %1$zd, \u010D\u00EDslo chyby %2$zd (0x%3$zx), \u010D\u00EDslo chyby 2 0x%4$x
J9VM187=nespr\u00E1vny typ objektu %2$.*1$s\: synchronizovan\u00FD objekt je typ hodnoty
SHRC839=Zlyhalo sp\u00FA\u0161\u0165anie zdie\u013Eanej pam\u00E4te cache. Nastala chyba pri z\u00EDskavan\u00ED jedine\u010Dn\u00E9ho ID vy\u017Eadovanej pam\u00E4te cache na ni\u017E\u0161ej vrstve.
J9VM189=Kone\u010Dn\u00FA supertriedu %2$.*1$s nemo\u017Eno roz\u0161\u00EDri\u0165
SHRC850=Dostupn\u00E9 vo\u013Eby pre -Xshareclasses\:%1$s<options>. Na zadanie viacer\u00FDch volieb pou\u017Eite '+'. t.j. %2$saot+url \n
SHRC851=Vypne kontrolu \u010Dasovej zna\u010Dky pri h\u013Eadan\u00ED tried v zdie\u013Eanej pam\u00E4ti cache. Zo zdie\u013Eanej pam\u00E4te cache sa m\u00F4\u017Eu na\u010D\u00EDta\u0165 zastaran\u00E9 triedy.
SHRC852=Najvy\u0161\u0161ia vrstva (vrstva %d) pam\u00E4te cache je zni\u010Den\u00E1. Bola zisten\u00E1 modifik\u00E1cia vrstvy %d zdie\u013Eanej pam\u00E4te cache. O\u010Dak\u00E1van\u00E9 jedine\u010Dn\u00E9 ID pam\u00E4te cache je %s, aktu\u00E1lne jedine\u010Dn\u00E9 ID pam\u00E4te cache je %s.
SHRC853=Funkcie procesora                    \= %s
VRFY007=fin\u00E1lna met\u00F3da nahraden\u00E1
VRFY008=index po\u013Ea nie je typ integer
VRFY009=pole nie je typovo kompatibiln\u00E9
SHRC761=Zlyhalo nastavovanie opr\u00E1vnenia na pr\u00EDstup skupiny, o ktor\u00E9 bolo po\u017Eiadan\u00E9 podvo\u013Ebou 'groupAccess', pre s\u00FAbor sn\u00EDmok zdie\u013Eanej pam\u00E4te cache.
VRFY000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC762=Nastala chyba pri z\u00EDskavan\u00ED \u0161tatistiky s\u00FAboru zdie\u013Eanej pam\u00E4te cache tried pri kontrolovan\u00ED jeho opr\u00E1vnenia na pr\u00EDstup skupiny.
VRFY001=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s
SHRC763=S\u00FA\u010Det v\u0161etk\u00FDch podvolieb zdie\u013Ean\u00FDch tried by nemal ma\u0165 viac ako %u znakov.
VRFY002=postupnos\u0165 bajtov\u00E9ho k\u00F3du neplatn\u00E1
SHRC764=Nemo\u017Eno vytvori\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 s ve\u013Ekos\u0165ou %1$d bajtov, ako bolo po\u017Eadovan\u00E9. \n \tBola spraven\u00E1 \u00FAprava na povolen\u00FA maxim\u00E1lnu zdie\u013Ean\u00FA pam\u00E4\u0165 (%2$d bajtov) \n \t(Ak chcete zv\u00E4\u010D\u0161i\u0165 dostupn\u00FA zdie\u013Ean\u00FA pam\u00E4\u0165, upravte syst\u00E9mov\u00FA hodnotu SHMMAX) \n \t Ak sa pou\u017E\u00EDva -Xscdmx, oblas\u0165 atrib\u00FAtu ladenia sa uprav\u00ED proporcion\u00E1lne pod\u013Ea \n \t jej p\u00F4vodn\u00E9ho pomeru vo\u010Di hodnote -Xscmx.
VRFY003=trieda neobsahuje \u00FAdaje predbe\u017En\u00E9ho overenia
VRFY004=v\u010Dle\u0148ovanie jsr zaznamenalo pr\u00EDli\u0161 ve\u013Ek\u00FD po\u010Det jsr
VRFY005=lok\u00E1l nie je typovo kompatibiln\u00FD
VRFY006=nov\u00E1 ve\u013Ekos\u0165 po\u013Ea nie je typ integer
SHRC760=Zlyhalo nastavovanie opr\u00E1vnenia na pr\u00EDstup skupiny, o ktor\u00E9 bolo po\u017Eiadan\u00E9 podvo\u013Ebou 'groupAccess', pre s\u00FAbor ovl\u00E1dac\u00EDch prvkov zdie\u013Eanej pam\u00E4te priraden\u00FD k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC769=JVM povolilo ochranu \u010Diasto\u010Dn\u00FDch str\u00E1nok zdie\u013Eanej pam\u00E4te cache, preto\u017Ee existuj\u00FAca zdie\u013Ean\u00E1 pam\u00E4\u0165 cache bola vytvoren\u00E1 s povolenou ochranou \u010Diasto\u010Dn\u00FDch str\u00E1nok.
SHRC765=Ochrana pam\u00E4\u0165ov\u00FDch str\u00E1nok pre runtime \u00FAdaje, re\u0165azcov\u00E9 \u00FAdaje na \u010D\u00EDtanie/z\u00E1pis a \u010Diasto\u010Dne zaplnen\u00E9 str\u00E1nky je \u00FAspe\u0161ne povolen\u00E1
SHRC766=Ochrana pam\u00E4\u0165ov\u00FDch str\u00E1nok pre runtime \u00FAdaje a \u010Diasto\u010Dne zaplnen\u00E9 str\u00E1nky je \u00FAspe\u0161ne povolen\u00E1
SHRC767=Ochrana pam\u00E4\u0165ov\u00FDch str\u00E1nok pre runtime \u00FAdaje a re\u0165azcov\u00E9 \u00FAdaje na \u010D\u00EDtanie/z\u00E1pis je \u00FAspe\u0161ne povolen\u00E1
SHRC768=Ochrana pam\u00E4\u0165ov\u00FDch str\u00E1nok pre runtime \u00FAdaje je \u00FAspe\u0161ne povolen\u00E1
VRFY018=maximum z\u00E1sobn\u00EDku prekro\u010Den\u00E9
VRFY019=zavedenie triedy zlyhalo
VRFY010=viacer\u00E9 jsr pou\u017E\u00EDvaj\u00FA jeden n\u00E1vrat
SHRC750=\u017Diadne met\u00F3dy AOT nevyhovuj\u00FA \u0161pecifik\u00E1ci\u00E1m met\u00F3dy
VRFY011=parameter lookupswitch nie je typ integer
SHRC751=Zlyhalo analyzovanie \u0161pecifik\u00E1ci\u00ED met\u00F3dy. Nie je povolen\u00FDch viac ako %d \u0161pecifik\u00E1ci\u00ED met\u00F3dy.
VRFY012=tvar z\u00E1sobn\u00EDka nie je konzistentn\u00FD
SHRC752=Zlyhalo analyzovanie \u0161pecifik\u00E1ci\u00ED met\u00F3dy
VRFY013=obmedzenie zav\u00E1dzania triedy poru\u0161en\u00E9
SHRC753=Zlyhalo z\u00EDskavanie mutexu z\u00E1pisu pre pam\u00E4\u0165 cache
VRFY014=bajtov\u00FD k\u00F3d n\u00E1vratu nekompatibiln\u00FD s typom n\u00E1vratu
VRFY015=viacer\u00E9 n\u00E1vraty do jedn\u00E9ho jsr
VRFY016=parameter posunu bajtov\u00E9ho k\u00F3du nie je typ integer
VRFY017=<init> nevol\u00E1 tento <init> alebo nadriaden\u00FD <init>
SHRC758=Zlyhalo nastavovanie opr\u00E1vnenia na pr\u00EDstup skupiny, o ktor\u00E9 bolo po\u017Eiadan\u00E9 podvo\u013Ebou 'groupAccess', pre zdie\u013Ean\u00FA pam\u00E4\u0165 so shmid\=%d priraden\u00FA k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC759=Zlyhalo nastavovanie opr\u00E1vnenia na pr\u00EDstup skupiny, o ktor\u00E9 bolo po\u017Eiadan\u00E9 podvo\u013Ebou 'groupAccess', pre s\u00FAbor ovl\u00E1dac\u00EDch prvkov semafora priraden\u00FD k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC754=Nie je povolen\u00E9 opakovan\u00E9 vytvorenie riadiaceho s\u00FAboru zdie\u013Eanej pam\u00E4te.
SHRC755=\t invalidatedaot Vytla\u010D\u00ED iba anulovan\u00E9 typy aot v zdie\u013Eanej pam\u00E4ti cache.
SHRC756=Zlyhalo nastavovanie opr\u00E1vnenia na pr\u00EDstup skupiny pre s\u00FAbor zdie\u013Eanej pam\u00E4te cache, o ktor\u00E9 bolo po\u017Eiadan\u00E9 podvo\u013Ebou 'groupAccess'.
VRFY020=argumenty vyvolania nie s\u00FA typovo kompatibiln\u00E9
SHRC757=Zlyhalo nastavovanie opr\u00E1vnenia na pr\u00EDstup skupiny, o ktor\u00E9 bolo po\u017Eiadan\u00E9 podvo\u013Ebou 'groupAccess', pre mno\u017Einu semaforov so semid\=%d priraden\u00FA k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC783=Maxim\u00E1lny povolen\u00FD d\u00E1tov\u00FD priestor JIT by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako vo\u013En\u00FD maxim\u00E1lny limit %u bajtov, ktor\u00FD je nastaven\u00FD pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache.
SHRC300=Zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy pou\u017E\u00EDva in\u00E9 VM. Vnoren\u00FA pam\u00E4\u0165 cache nemo\u017Eno zv\u00E4\u010D\u0161i\u0165.
SHRC784=Nemo\u017Eno nastavi\u0165 po\u017Eadovan\u00FD minim\u00E1lny vyhraden\u00FD priestor AOT a/alebo d\u00E1tov\u00FD priestor JIT. Vo\u013En\u00FD maxim\u00E1lny limit nastaven\u00FD pre pou\u017Eitie zdie\u013Eanej pam\u00E4te alebo celkov\u00E1 ve\u013Ekos\u0165 pam\u00E4te cache nie je dostato\u010Dne ve\u013Ek\u00E1.
SHRC301=Nemo\u017Eno zv\u00E4\u010D\u0161i\u0165 vnoren\u00FA pam\u00E4\u0165 cache "%s". Zlyhalo vyhradzovanie novej supertriedy pre rady
SHRC785=Minim\u00E1lny po\u010Det vyhraden\u00FDch bajtov AOT je nastaven\u00FD na %d.
SHRC302=Nemo\u017Eno zv\u00E4\u010D\u0161i\u0165 vnoren\u00FA pam\u00E4\u0165 cache "%s". Zlyhalo vyhradzovanie bloku pre rady
SHRC786=Maxim\u00E1lny povolen\u00FD po\u010Det bajtov AOT je nastaven\u00FD na %d.
SHRC780=Ve\u013Ekos\u0165 maxim\u00E1lneho priestoru AOT by nemala by\u0165 men\u0161ia ako po\u010Det bajtov AOT (%d), ktor\u00E9 u\u017E s\u00FA ulo\u017Een\u00E9 v pam\u00E4ti cache.
SHRC781=Maxim\u00E1lny povolen\u00FD priestor AOT by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako vo\u013En\u00FD maxim\u00E1lny limit %u bajtov, ktor\u00FD je nastaven\u00FD pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache.
SHRC782=Ve\u013Ekos\u0165 maxim\u00E1lneho d\u00E1tov\u00E9ho priestoru JIT by nemala by\u0165 men\u0161ia ako po\u010Det bajtov JIT (%d), ktor\u00E9 u\u017E s\u00FA ulo\u017Een\u00E9 v pam\u00E4ti cache.
SHRC307=\tROMMETHOD\: %2$.*1$s, podpis\: %4$.*3$s, adresa\: 0x%5$p
SHRC308=Zlyhala serializ\u00E1cia pam\u00E4te cache "%s". Zlyhala aktualiz\u00E1cia posunut\u00ED ROM Class v met\u00F3dach AOT.
SHRC309=Vo\u013Eby "grow" a "readonly" nemo\u017Eno pou\u017Ei\u0165 s\u00FA\u010Dasne.
SHRC303=Zlyhalo vytv\u00E1ranie vnorenej pam\u00E4te cache "%s"
SHRC787=Minim\u00E1lny po\u010Det vyhraden\u00FDch bajtov \u00FAdajov JIT je nastaven\u00FD na %d.
SHRC304=Zlyhalo nahradzovanie pam\u00E4te cache "%s"
SHRC788=Maxim\u00E1lny povolen\u00FD po\u010Det bajtov \u00FAdajov JIT je nastaven\u00FD na %d.
SHRC305=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre vyh\u013Ead\u00E1vaciu tabu\u013Eku r\u00E1d v SH_ClasspathManagerImpl2
SHRC789=Vo\u013En\u00FD maxim\u00E1lny po\u010Det bajtov je nastaven\u00FD na %u.
SHRC306=\ Podpis\: %2$.*1$s, adresa\: 0x%3$p
SHRC772=Bol dosiahnut\u00FD vo\u013En\u00FD maxim\u00E1lny limit pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache "%s". Zv\u00FD\u0161te vo\u013En\u00FD maxim\u00E1lny limit pomocou vo\u013Eby "%s".
SHRC773=Priestor pre \u00FAdaje AOT v zdie\u013Eanej pam\u00E4ti cache "%s" je pln\u00FD.
SHRC774=Priestor pre \u00FAdaje JIT v zdie\u013Eanej pam\u00E4ti cache "%s" je pln\u00FD.
SHRC775=Vo\u013En\u00FD maxim\u00E1lny limit nastaven\u00FD pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache je v\u00E4\u010D\u0161\u00ED ako celkov\u00E1 ve\u013Ekos\u0165 pam\u00E4te cache, %u bajtov. Nastav\u00ED sa na hodnotu celkovej ve\u013Ekosti pam\u00E4te cache.
SHRC770=JVM zak\u00E1zalo ochranu \u010Diasto\u010Dne zaplnen\u00FDch str\u00E1nok. Ak je zadan\u00E9 '-Xshareclasses\:mprotect\=onfind', tie\u017E sa ignoruje.
SHRC771=Povo\u013Ete ochranu pam\u00E4te pre \u010Diasto\u010Dne zaplnen\u00E9 str\u00E1nky. V z/OS to je ekvivalent k 'partialpagesonstartup'.
SHRC776=Vo\u013En\u00FD maxim\u00E1lny limit pou\u017Eitia zdie\u013Eanej pam\u00E4te cache je men\u0161\u00ED ako po\u010Det bajtov %u v zdie\u013Eanej pam\u00E4ti cache, ktor\u00E9 sa u\u017E pou\u017E\u00EDvaj\u00FA.
SHRC777=Vo\u013En\u00FD maxim\u00E1lny limit pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache je men\u0161\u00ED ako minim\u00E1lna pr\u00EDpustn\u00E1 hodnota %u bajtov.
SHRC778=Minim\u00E1lny vyhraden\u00FD priestor AOT by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako maxim\u00E1lny povolen\u00FD priestor AOT.
SHRC779=Minim\u00E1lny vyhraden\u00FD d\u00E1tov\u00FD priestor JIT by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako maxim\u00E1lny povolen\u00FD d\u00E1tov\u00FD priestor JIT.
SHRC321=Obnova po chybe\: zatvorenie semaforov zdie\u013Eanej pam\u00E4te.
SHRC322=Zlyhala inicializ\u00E1cia semaforov pre zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre s\u00FAbory. Varovanie\: Va\u0161a pam\u00E4\u0165 cache je mo\u017Eno po\u0161koden\u00E1. Ak vznikn\u00FA probl\u00E9my pri pou\u017E\u00EDvan\u00ED zdie\u013Eanej pam\u00E4te cache, m\u00F4\u017Ee by\u0165 potrebn\u00E9 zni\u010Di\u0165 ju a znova vytvori\u0165.
SHRC323=CHYBA\: Zlyhanie pri vstupe do mutexu pre hlavi\u010Dku zdie\u013Eanej pam\u00E4te cache pre triedy. Varovanie\: Va\u0161a pam\u00E4\u0165 cache je mo\u017Eno po\u0161koden\u00E1. Ak vznikn\u00FA probl\u00E9my pri pou\u017E\u00EDvan\u00ED zdie\u013Eanej pam\u00E4te cache, m\u00F4\u017Ee by\u0165 potrebn\u00E9 zni\u010Di\u0165 ju a znova vytvori\u0165.
SHRC324=CHYBA\: Zlyhanie pri v\u00FDstupe z mutexu pre hlavi\u010Dku zdie\u013Eanej pam\u00E4te cache pre triedy. Varovanie\: Va\u0161a pam\u00E4\u0165 cache je mo\u017Eno po\u0161koden\u00E1. Ak vznikn\u00FA probl\u00E9my pri pou\u017E\u00EDvan\u00ED zdie\u013Eanej pam\u00E4te cache, m\u00F4\u017Ee by\u0165 potrebn\u00E9 zni\u010Di\u0165 ju a znova vytvori\u0165.
SHRC320=Obnova po chybe\: zni\u010Denie semaforov zdie\u013Eanej pam\u00E4te.
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex nemohlo z\u00EDska\u0165 mutex tabu\u013Eky re\u0165azcov (n\u00E1vratov\u00FD k\u00F3d %d).
SHRC325=Zlyhalo odoslanie z\u00E1mku hlavi\u010Dky zdie\u013Eanej pam\u00E4te cache pre triedy po\u010Das inicializ\u00E1cie. Varovanie\: Va\u0161a pam\u00E4\u0165 cache je mo\u017Eno po\u0161koden\u00E1. Ak vznikn\u00FA probl\u00E9my pri pou\u017E\u00EDvan\u00ED zdie\u013Eanej pam\u00E4te cache, m\u00F4\u017Ee by\u0165 potrebn\u00E9 zni\u010Di\u0165 ju a znova vytvori\u0165.
SHRC326=Zlyhalo odoslanie z\u00E1mku u\u017E\u00EDvate\u013Ea zdie\u013Eanej pam\u00E4te cache pre triedy po\u010Das inicializ\u00E1cie. Varovanie\: Va\u0161a pam\u00E4\u0165 cache je mo\u017Eno po\u0161koden\u00E1. Ak vznikn\u00FA probl\u00E9my pri pou\u017E\u00EDvan\u00ED zdie\u013Eanej pam\u00E4te cache, m\u00F4\u017Ee by\u0165 potrebn\u00E9 zni\u010Di\u0165 ju a znova vytvori\u0165.
SHRC327=Volanie SH_OSCachesysv\:\:acquireWriteLock() pre j9shsem_wait zlyhalo s chybou %d.
SHRC328=System V IPC nahl\u00E1silo t\u00FAto chybu\: '%s'
VERB032=minimum rezervovan\u00E9ho priestoru zdie\u013Eanej pam\u00E4te cache pre \u00FAdaje JIT
SHRC310=Perzistentn\u00FA pam\u00E4\u0165 cache nemo\u017Eno n\u00E1js\u0165 v sie\u0165ovom s\u00FAborovom syst\u00E9me. Vyberte in\u00E9 cacheDir.
SHRC794=Upravte maxim\u00E1lny priestor zdie\u013Eanej pam\u00E4te cache povolen\u00FD pre \u00FAdaje JIT na <size>.
VERB033=maximum povolen\u00E9ho priestoru zdie\u013Eanej pam\u00E4te cache pre \u00FAdaje JIT
SHRC311=Nastala chyba pri uvo\u013E\u0148ovan\u00ED z\u00E1mku na z\u00E1pis pripojenia s\u00FAboru zdie\u013Eanej pam\u00E4te cache pre triedy
SHRC795=S\u00FA\u010Det minim\u00E1lneho po\u010Dtu vyhraden\u00FDch bajtov AOT %d a minim\u00E1lneho po\u010Dtu vyhraden\u00FDch bajtov \u00FAdajov JIT %d by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako vo\u013En\u00FD maxim\u00E1lny po\u010Det bajtov %d.
VERB034=ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky pre pam\u00E4\u0165 cache pre k\u00F3d JIT
SHRC312=Nastala chyba pri uvo\u013E\u0148ovan\u00ED z\u00E1mku na z\u00E1pis hlavi\u010Dky s\u00FAboru zdie\u013Eanej pam\u00E4te cache pre triedy
SHRC796=Minim\u00E1lny vyhraden\u00FD priestor AOT by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako vo\u013En\u00FD maxim\u00E1lny limit %d nastaven\u00FD pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache.
VERB035=dostupn\u00E9 ve\u013Ekosti ve\u013Ekej str\u00E1nky pre pam\u00E4\u0165 cache pre k\u00F3d JIT\:
SHRC313=Zlyhalo vytv\u00E1ranie jclCacheMutex v shrinit
SHRC797=Minim\u00E1lny vyhraden\u00FD d\u00E1tov\u00FD priestor JIT by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako vo\u013En\u00FD maxim\u00E1lny limit %d nastaven\u00FD pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache.
VERB036=po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165 komprimovan\u00FDch meta\u00FAdajov referenci\u00ED
SHRC790=Upravte maxim\u00E1lnu vo\u013En\u00FA ve\u013Ekos\u0165 pre pam\u00E4\u0165 cache na <size>.
VERB037=Ve\u013Ekos\u0165 pam\u00E4te cache zdie\u013Ean\u00FDch tried
SHRC791=Upravte minim\u00E1lny priestor zdie\u013Eanej pam\u00E4te cache vyhraden\u00FD pre \u00FAdaje AOT na <size>.
VERB038=ve\u013Ekos\u0165 mierneho maxima zdie\u013Eanej pam\u00E4te cache tried
SHRC792=Upravte maxim\u00E1lny priestor zdie\u013Eanej pam\u00E4te cache povolen\u00FD pre \u00FAdaje AOT na <size>.
SHRC793=Upravte minim\u00E1lny priestor zdie\u013Eanej pam\u00E4te cache vyhraden\u00FD pre \u00FAdaje JIT na <size>.
SHRC318=Obnova po chybe\: zni\u010Denie zdie\u013Eanej pam\u00E4te.
SHRC319=Obnova po chybe\: zatvorenie zdie\u013Eanej pam\u00E4te.
SHRC314=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre vyh\u013Ead\u00E1vaciu tabu\u013Eku r\u00E1d v SH_Manager
SHRC798=Maxim\u00E1lny povolen\u00FD priestor AOT by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako vo\u013En\u00FD maxim\u00E1lny limit %d, ktor\u00FD je nastaven\u00FD pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache.
SHRC315=Nemo\u017Eno inicializova\u0165 pam\u00E4\u0165ov\u00E9 segmenty tried cachelet
SHRC799=Maxim\u00E1lny povolen\u00FD d\u00E1tov\u00FD priestor JIT by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako vo\u013En\u00FD maxim\u00E1lny limit %d nastaven\u00FD pre pou\u017Eitie zdie\u013Eanej pam\u00E4te cache.
VERB030=maximum povolen\u00E9ho priestoru zdie\u013Eanej pam\u00E4te cache pre triedy pre JIT
SHRC316=Nemo\u017Eno serializova\u0165 pam\u00E4\u0165 cache, preto\u017Ee neexistuje aktu\u00E1lne vl\u00E1kno VM.
VERB031=rezervovan\u00FD priestor zdie\u013Eanej pam\u00E4te cache pre atrib\u00FAty ladenia tried
SHRC317=Vytla\u010Dte n\u00E1zov s\u00FAboru zdie\u013Eanej pam\u00E4te cache pre triedy, ktor\u00FD sa pou\u017Eije.
VRFY029=neplatn\u00E1 returnAddress pre in\u0161trukciu ret
VRFY021=vyvolan\u00FD objekt nie je vyvolate\u013En\u00FD
SHRC343=Na\u0161la sa trieda %1$s v zdie\u013Eanej pam\u00E4ti cache pre zav\u00E1dza\u010D tried s ID %2$d a adresou URL %4$.*3$s.
VRFY022=podprogramy sa musia znova prejs\u0165 pre ka\u017Ed\u00FD jsr
SHRC344=Nena\u0161la sa trieda %1$s v zdie\u013Eanej pam\u00E4ti cache pre zav\u00E1dza\u010D tried s ID %2$d a adresou URL %4$.*3$s.
VRFY023=parameter tableswitch nie je typu integer
SHRC345=Na\u0161la sa trieda %1$s v zdie\u013Eanej pam\u00E4ti cache pre zav\u00E1dza\u010D tried s ID %2$d a symbolom %4$.*3$s.
VRFY024=argumenty nie s\u00FA typovo kompatibiln\u00E9
SHRC346=Nena\u0161la sa trieda %1$s v zdie\u013Eanej pam\u00E4ti cache pre zav\u00E1dza\u010D tried s ID %2$d a symbolom %4$.*3$s.
VRFY025=zl\u00FD pr\u00EDstup ku chr\u00E1nen\u00FDm \u00FAdajom
VRFY026=neo\u010Dak\u00E1van\u00FD EOF
SHRC340=Zlyhala kontrola CRC zdie\u013Eanej pam\u00E4te cache. Ulo\u017Een\u00E9 CRC\: %1$x, vypo\u010D\u00EDtan\u00E9 CRC\: %2$x.
VRFY027=prij\u00EDma\u010D nie je kompatibiln\u00FD s triedou deklar\u00E1cie
SHRC341=Na\u0161la sa trieda %1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %2$d.
VRFY028=zl\u00FD rozmer
SHRC342=Nena\u0161la sa trieda %1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %2$d.
SHRC347=Ulo\u017Eila sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a adresou URL %5$.*4$s (index %6$d).
SHRC348=Neulo\u017Eila sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a adresou URL %5$.*4$s (index %6$d).
VRFY030=zl\u00FD typ z\u00E1sobn\u00EDka
SHRC349=Ulo\u017Eila sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a adresou URL %5$.*4$s.
VRFY031=pokus o iinc in\u00E9ho typu ako integer
J2SE000=\n
VRFY032=zl\u00FD prij\u00EDma\u010D pre <init>
SHRC332=Ochrana \u00FAdajovej pam\u00E4\u0165ovej str\u00E1nky \u00FAspe\u0161ne povolen\u00E1 pre pam\u00E4\u0165 cache
VRFY033=pole nie je typovo kompatibiln\u00FD
SHRC333=Predvolen\u00E1 ochrana pam\u00E4\u0165ovej str\u00E1nky \u00FAspe\u0161ne povolen\u00E1 pre pam\u00E4\u0165 cache
VRFY034=cie\u013Eov\u00FD PC neplatn\u00FD
SHRC334=Zlyhala obnova po chybe\: zlyhalo ni\u010Denie zdie\u013Eanej pam\u00E4te.
VRFY035=bez chyby
SHRC335=Zlyhala obnova po chybe\: zlyhalo ni\u010Denie semafora zdie\u013Eanej pam\u00E4te.
VRFY036=z\u00E1sobn\u00EDk podte\u010Den\u00FD
VRFY037=neinicializovan\u00FD objekt po\u010Das sp\u00E4tnej vetvy
VRFY038=invokespecial na neplatnom cieli
SHRC330=SH_CompositeCacheImpl\:\:runExitCode nemohlo z\u00EDska\u0165 mutex zapisovacej oblasti (n\u00E1vratov\u00FD k\u00F3d %d).
VRFY039=nezn\u00E1my bajtov\u00FD k\u00F3d
SHRC331=Z\u00EDskal sa in\u00FD semafor, ako sa v minulosti pou\u017E\u00EDval pre t\u00FAto pam\u00E4\u0165 cache
SHRC336=K\u00F3d chyby vrstvy Port\: %1$d
VRFY040=kontrol\u00F3r nem\u00F4\u017Ee vyhradi\u0165 nat\u00EDvnu pam\u00E4\u0165
SHRC337=Chybov\u00E1 spr\u00E1va platformy\: %1$s
SHRC338=K\u00F3d chyby vrstvy Port\: %1$d
VRFY041=invokespecial na nespr\u00E1vnom inicializ\u00E1tore
VRFY042=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u; Nezhoda typov, argument %9$d v podpise %11$.*10$s.%13$.*12$s\:%15$.*14$s nevyhovuje
SHRC339=Chybov\u00E1 spr\u00E1va platformy\: %1$s
VERB007=ve\u013Ekos\u0165 z\u00E1sobn\u00EDka vl\u00E1kna opera\u010Dn\u00E9ho syst\u00E9mu
VERB008=po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165 z\u00E1sobn\u00EDka vl\u00E1kien Java
VERB009=Pr\u00EDrastok z\u00E1sobn\u00EDka vl\u00E1kien Java
SHRC360=Nena\u0161li sa bajtov\u00E9 \u00FAdaje pre k\u013E\u00FA\u010D %.*s v zdie\u013Eanej pam\u00E4ti cache.
SHRC365=Povol\u00ED ulo\u017Eenie inform\u00E1ci\u00ED o laden\u00ED triedy do zdie\u013Eanej triedy.
EXEL109=\  -XX\:ShareClassesEnableBCI   vytvori\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy s podporou pre in\u0161trument\u00E1ciu bajtov\u00E9ho k\u00F3du
SHRC366=povolen\u00E9 ladenie \= true
VERB000=Podrobn\u00FD z\u00E1sobn\u00EDk\: "%2$.*1$s" pou\u017Eilo %3$zd/%4$zd bajtov v z\u00E1sobn\u00EDkoch Java/C
SHRC367=povolen\u00E9 ladenie \= false
VERB001=
SHRC368=Vyp\u00EDna sa zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre triedy s nepovolen\u00FDm laden\u00EDm.
VERB002=Podrobn\u00FD z\u00E1sobn\u00EDk\: maxim\u00E1lne pou\u017Eitie z\u00E1sobn\u00EDka bolo %1$zd/%2$zd bajtov v z\u00E1sobn\u00EDkoch Java/C
SHRC361=Nastala chyba pri prip\u00E1jan\u00ED zdie\u013Eanej pam\u00E4te po\u010Das otv\u00E1rania/vytv\u00E1rania
VERB003=Chyba\: Po\u010Det s\u00FAborov pre -Xverbosegclog mus\u00ED by\u0165 v\u00E4\u010D\u0161\u00ED ako 0
SHRC362=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre ClasspathItem
VERB004=Chyba\: Po\u010Det cyklov pre -Xverbosegclog mus\u00ED by\u0165 v\u00E4\u010D\u0161\u00ED ako 0
SHRC363=Nemo\u017Eno vyhradi\u0165 rozhranie API pre zdie\u013Ean\u00E9 triedy v shrinit
VERB005=Chyba\: Pre -Xverbosegclog ch\u00FDba n\u00E1zov s\u00FAboru
SHRC364=Volanie SH_OSCachesysv\:\:acquireWriteLock() pre j9shsem_wait v semafore s ID %d zlyhalo s chybou %d.
VERB006=Inicializ\u00E1cia zlyhala
EXEL112=\  -Xscsoftmx<x>   nastavi\u0165 vo\u013En\u00FA maxim\u00E1lnu ve\u013Ekos\u0165 novej zdie\u013Eanej pam\u00E4te cache tried na <x>
EXEL113=\  -Xscmx<x>       nastavi\u0165 ve\u013Ekos\u0165 (alebo ve\u013Ekos\u0165 mierneho maxima, ak je pr\u00EDtomn\u00E1 vo\u013Eba -XX\:SharedCacheHardLimit\=) novej zdie\u013Eanej pam\u00E4te cache tried na <x>
EXEL114=\  -XX\:SharedCacheHardLimit<x>       nastavi\u0165 ve\u013Ekos\u0165 novej zdie\u013Eanej pam\u00E4te cache tried na <x>
EXEL115=\  -XX\:+ShareAnonymousClasses   povoli\u0165 ukladanie a h\u013Eadanie anonymn\u00FDch tried v zdie\u013Eanej pam\u00E4ti cache tried
SHRC369=-Xnolinenumbers    \= true
EXEL116=\  -XX\:-ShareAnonymousClasses   zak\u00E1za\u0165 ukladanie a h\u013Eadanie anonymn\u00FDch tried v zdie\u013Eanej pam\u00E4ti cache tried
EXEL117=\  -XX\:+ShareUnsafeClasses   povoli\u0165 ukladanie a h\u013Eadanie neanonymn\u00FDch nebezpe\u010Dn\u00FDch tried v zdie\u013Eanej pam\u00E4ti cache tried
EXEL118=\  -XX\:-ShareUnsafeClasses   zak\u00E1za\u0165 ukladanie a h\u013Eadanie neanonymn\u00FDch nebezpe\u010Dn\u00FDch tried v zdie\u013Eanej pam\u00E4ti cache tried
EXEL119=\  -XX\:+UseGCStartupHints   povoli\u0165 ukladanie a h\u013Eadanie r\u00E1d pri spusten\u00ED GC v  zdie\u013Eanej pam\u00E4ti cache tried
EXEL110=\  -XX\:ShareClassesDisableBCI   vytvori\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy bez podpory pre in\u0161trument\u00E1ciu bajtov\u00E9ho k\u00F3du
EXEL111=\  -XX\:+StoreIntermediateClassfile   vytvori\u0165 nespracovan\u00E9 \u00FAdaje triedy na pou\u017Eitie po\u010Das opakovanej transform\u00E1cie
SHRC354=Nena\u0161iel sa k\u00F3d AOT pre ROMMethod 0x%1$p v zdie\u013Eanej pam\u00E4ti cache.
SHRC355=Ulo\u017Eil sa k\u00F3d AOT pre ROMMethod 0x%1$p v zdie\u013Eanej pam\u00E4ti cache.
SHRC356=Neulo\u017Eil sa k\u00F3d AOT pre ROMMethod 0x%1$p v zdie\u013Eanej pam\u00E4ti cache.
SHRC357=Ulo\u017Eili sa bajtov\u00E9 \u00FAdaje pre k\u013E\u00FA\u010D %.*s v zdie\u013Eanej pam\u00E4ti cache.
SHRC350=Neulo\u017Eila sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a adresou URL %5$.*4$s.
SHRC351=Ulo\u017Eila sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a symbolom %5$.*4$s.
SHRC352=Neulo\u017Eila sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a symbolom %5$.*4$s.
SHRC353=Na\u0161iel sa k\u00F3d AOT pre ROMMethod 0x%1$p v zdie\u013Eanej pam\u00E4ti cache.
EXEL101=\n  -Xhealthcenter  povoli\u0165 agenta Health Center
EXEL102=
EXEL103=\  -Xscdmx<x>      nastavi\u0165 ve\u013Ekos\u0165 oblasti atrib\u00FAtov pam\u00E4te cache zdie\u013Ean\u00FDch tried na <x>
EXEL104=\  -Xscminjit<x>   nastavi\u0165 minim\u00E1lny priestor pam\u00E4te cache zdie\u013Ean\u00FDch tried rezervovan\u00FD pre \u00FAdaje JIT na <x>
SHRC358=Neulo\u017Eili sa bajtov\u00E9 \u00FAdaje pre k\u013E\u00FA\u010D %.*s v zdie\u013Eanej pam\u00E4ti cache.
EXEL105=\  -Xscmaxjit<x>   nastavi\u0165 maxim\u00E1lny priestor pam\u00E4te cache zdie\u013Ean\u00FDch tried povolen\u00FD pre \u00FAdaje JIT na <x>
SHRC359=Na\u0161li sa bajtov\u00E9 \u00FAdaje pre k\u013E\u00FA\u010D %.*s v zdie\u013Eanej pam\u00E4ti cache.
EXEL106=\  -Xscminjitdata<x>   nastavi\u0165 minim\u00E1lny priestor pam\u00E4te cache zdie\u013Ean\u00FDch tried rezervovan\u00FD pre \u00FAdaje JIT na <x>
EXEL107=\  -Xscmaxjitdata<x>   nastavi\u0165 maxim\u00E1lny priestor pam\u00E4te cache zdie\u013Ean\u00FDch tried povolen\u00FD pre \u00FAdaje JIT na <x>
EXEL108=\  -Xzero\:nosharebootzip   nezdie\u013Ea\u0165 pam\u00E4te cache polo\u017Eiek jar bootstrap v zdie\u013Eanej pam\u00E4ti cache pre triedy
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj povoli\u0165 mierny re\u00E1lny \u010Das
VERB029=minimum rezervovan\u00E9ho priestoru zdie\u013Eanej pam\u00E4te cache pre triedy pre JIT
SHRC380=%% pou\u017Eitia oblasti ladenia tried        %*c\= %u%%
SHRC381=LineNumberTable bajtov triedy    %*c\= %u
SHRC382=LocalVariableTable bajtov oblasti ladenia tried   %*c\= %u\n
VERB021=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (nepodporovan\u00FD typ s\u00FAboru)
SHRC387=vo\u013En\u00E9 bajty                         %*c\= %d
VERB022=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (nezn\u00E1my typ s\u00FAboru)
SHRC388=ROMClass bajty                      %*c\= %d
VERB023=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (nezn\u00E1ma chyba)
SHRC389=Bajty meta\u00FAdajov                    %*c\= %d
VERB024=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (jxe ch\u00FDbaj\u00FA rom.classes)
VERB025=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (jxe po\u0161koden\u00E1 hlavi\u010Dka obrazu)
SHRC383=\nz\u00E1kladn\u00E1 adresa                     %*c\= 0x%p
VERB026=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (opa\u010Dn\u00FD endian jxe nie je podporovan\u00FD)
SHRC384=koncov\u00E1 adresa                      %*c\= 0x%p
VERB027=Podrobn\u00FD z\u00E1sobn\u00EDk\: Spusten\u00E9 vl\u00E1kno "%2$.*1$s" pou\u017E\u00EDva %3$zd/%4$zd bajtov v z\u00E1sobn\u00EDkoch Java/C
SHRC385=ukazovate\u013E vyhradenia               %*c\= 0x%p\n
VERB028=Podrobn\u00FD z\u00E1sobn\u00EDk\: Nemo\u017Eno vytla\u010Di\u0165 inform\u00E1cie o z\u00E1sobn\u00EDku pre aktu\u00E1lne spusten\u00E9 vl\u00E1kna
SHRC386=ve\u013Ekos\u0165 pam\u00E4te cache                %*c\= %d
VERB020=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (s\u00FAbor je po\u0161koden\u00FD)
VERB018=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (I/O s\u00FAboru zlyhal)
VERB019=Neplatn\u00E1 polo\u017Eka cesty k triede\: %s (\u010D\u00EDtanie s\u00FAboru zlyhalo)
SHRC370=-Xnolinenumbers    \= false
SHRC371=Bajty komprimovanej pam\u00E4te cache \= %d
VERB010=maxim\u00E1lna ve\u013Ekos\u0165 z\u00E1sobn\u00EDka vl\u00E1kien Java
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC377=Hodnota -Xscdmx %u bajtov je v\u00E4\u010D\u0161ia ako %u bajtov dostupn\u00E9ho vo\u013En\u00E9ho priestoru. Pre -Xscdmx sa namiesto nej pou\u017Eije hodnota %u bajtov.
VERB011=ve\u013Ekos\u0165 z\u00E1sobn\u00EDka vl\u00E1kien Java
VERB012=pr\u00EDrastok segmentu triedy RAM
SHRC378=\nS\u00FAvisiace vo\u013Eby pr\u00EDkazov\u00E9ho riadka\:\n
VERB013=pr\u00EDrastok segmentu triedy ROM
SHRC379=Ve\u013Ekos\u0165 oblasti ladenia tried       %*c\= %u
VERB014=maxim\u00E1lne mno\u017Estvo pam\u00E4te
SHRC372=\# komprimovan\u00FDch pam\u00E4t\u00ED cache \= %d
VERB015=Ve\u013Ekos\u0165 pam\u00E4te cache zdie\u013Ean\u00FDch tried
SHRC373=Bajty \u00FAdajov JIT \= %d
SHRC374=Pam\u00E4\u0165 sa vytvorila s\:
VERB016=minimum vyhraden\u00E9ho priestoru pam\u00E4te cache zdie\u013Eanej triedy pre AOT
SHRC375=N\u00E1zov pam\u00E4te cache je pridlh\u00FD, ak sa zahrnie meno pou\u017E\u00EDvate\u013Ea. V tejto vyrovn\u00E1vacej pam\u00E4ti zost\u00E1va %d vo\u013En\u00FDch bajtov a va\u0161e meno u\u017E\u00EDvate\u013Ea m\u00E1 %d bajtov.
VERB017=maximum povolen\u00E9ho priestoru pam\u00E4te cache zdie\u013Eanej triedy pre AOT
EXEL120=\  -XX\:-UseGCStartupHints   zak\u00E1za\u0165 ukladanie a h\u013Eadanie r\u00E1d pri spusten\u00ED GC v  zdie\u013Eanej pam\u00E4ti cache tried
EXEL121=\  -XX\:+PortableSharedCache   povoli\u0165 funkciu, ktor\u00E1 sk\u00FAsi maximalizova\u0165 prenosite\u013Enos\u0165 zdie\u013Eanej pam\u00E4te cache medzi po\u010D\u00EDta\u010Dmi
EXEL122=\  -XX\:-PortableShareCache   zak\u00E1za\u0165 funkciu, ktor\u00E1 sk\u00FAsi maximalizova\u0165 prenosite\u013Enos\u0165 zdie\u013Eanej pam\u00E4te cache medzi po\u010D\u00EDta\u010Dmi
SHRC390=%% pou\u017Eit\u00FDch meta\u00FAdajov              %*c\= %d%%
SHRC391=\# ROMClasses                        %*c\= %d
SHRC392=\# ciest k triedam                   %*c\= %d
SHRC393=\# adries URL                        %*c\= %d
SHRC398=\# met\u00F3d AOT                         %*c\= %d
SHRC399=\u00DAdajov\u00E9 bajty                       %*c\= %d
SHRC394=\# symbolov                          %*c\= %d
SHRC395=\# zastaran\u00FDch tried                 %*c\= %d
SHRC396=%% zastaran\u00FDch tried                 %*c\= %d%%\n
SHRC397=AOT bajty                           %*c\= %d
CFRE100=v bajtovom k\u00F3de multianewarray sa \u017Eiada o prive\u013Ea rozmerov
CFRE101=posunutie je mimo rozsahu v bajtovom k\u00F3de prep\u00EDna\u010Da
CFRE102=neplatn\u00FD podpis po\u013Ea
CFRE103=abstraktn\u00E1 met\u00F3da nem\u00F4\u017Ee by\u0165 s\u00FAkromn\u00E1, statick\u00E1, kone\u010Dn\u00E1, nat\u00EDvna, synchronizovan\u00E1 ani striktn\u00E1
CFRE104=pole m\u00F4\u017Ee by\u0165 bu\u010F verejn\u00E9, s\u00FAkromn\u00E9, alebo chr\u00E1nen\u00E9
CFRE110=nekompatibiln\u00E1 kon\u0161tanta pre pole
CFRE111=chybne vytvoren\u00E9 UTF8
CFRE112=VM nepodporuje dynamick\u00FA kontrolu
CFRE113=neo\u010Dak\u00E1van\u00FD EOF
CFRE114=n\u00E1zov po\u013Ea je neplatn\u00FD
CFRE115=rozmery po\u013Ea > 255
CFRE105=superClass mus\u00ED by\u0165 trieda
CFRE106=duplicitn\u00E1 met\u00F3da
CFRE107=posunutie je mimo rozsahu v bajtovom k\u00F3de skoku
CFRE108=index met\u00F3dy uzatv\u00E1racej met\u00F3dy mus\u00ED referencova\u0165 n\u00E1zov a typ
CFRE109=neplatn\u00FD podpis met\u00F3dy
CFRE141=method_info m\u00E1 viac ako jeden atrib\u00FAt RuntimeInvisibleParameterAnnotations alebo RuntimeVisibleParameterAnnotations
CFRE142=Trieda m\u00E1 viac ako jeden atrib\u00FAt RuntimeInvisibleAnnotations alebo RuntimeVisibleAnnotations
CFRE143=Viacero atrib\u00FAtov partnerov vnorenia
CFRE144=\u010Clen hostite\u013Ea vnorenia atrib\u00FAtu vnorenia mus\u00ED by\u0165 kon\u0161tantn\u00E1 trieda
CFRE145=Hostite\u013E vnorenia mus\u00ED by\u0165 kon\u0161tantn\u00E1 trieda
CFRE146=Met\u00F3da <clinit> nie je statick\u00E1
CFRE147=Met\u00F3da <clinit> m\u00E1 neplatn\u00FD podpis
CFRE148=Rozhranie nem\u00F4\u017Ee ma\u0165 met\u00F3du s n\u00E1zvom <init>
CFRE140=method_info m\u00E1 viac ako jeden atrib\u00FAt AnnotationDefault
CFRE138=Atrib\u00FAt s\u00FAboru tried referencuje neexistuj\u00FAcu polo\u017Eku oblasti kon\u0161t\u00E1nt
CFRE139=Trieda m\u00E1 viac ako jeden atrib\u00FAt SourceDebugExtension
CFRE152=inform\u00E1cie o module nie s\u00FA trieda, preto\u017Ee je nastaven\u00E9 access_flag ACC_MODULE
CFRE153=Polo\u017Eka oblasti kon\u0161t\u00E1nt je neplatn\u00E1 v s\u00FAboroch tried s verziami men\u0161\u00EDmi ako 55.0
CFRE154=Bajtov\u00E9 k\u00F3dy ldc a ldc_2 musia referencova\u0165 kon\u0161tantu alebo  Constant_Dynamic
CFRE155=Bajtov\u00FD k\u00F3d ldc2_w mus\u00ED referencova\u0165 kon\u0161tantu alebo Constant_Dynamic
CFRE156=Polo\u017Eky Constant_Dynamic referencovan\u00E9 bajtov\u00FDmi k\u00F3dmi ldc a ldc_w nesm\u00FA vraca\u0165 'long' ani 'double'
CFRE157=Polo\u017Eky Constant_Dynamic referencovan\u00E9 bajtov\u00FDm k\u00F3dom ldc2_w musia vraca\u0165 'long' alebo 'double'
CFRE158=Polo\u017Eka oblasti kon\u0161t\u00E1nt je neplatn\u00E1 v s\u00FAboroch tried s verziami men\u0161\u00EDmi ako 49.0
CFRE159=Polo\u017Eka oblasti kon\u0161t\u00E1nt je neplatn\u00E1 v s\u00FAboroch tried s verziami men\u0161\u00EDmi ako 51.0
CFRE150=Nezn\u00E1ma zna\u010Dka kon\u0161tanty 20 v s\u00FAbore tried
CFRE151=Polo\u017Eka oblasti kon\u0161t\u00E1nt je neplatn\u00E1 v s\u00FAboroch tried s verziami men\u0161\u00EDmi ako 53.0
CFRE149=Nezn\u00E1ma zna\u010Dka kon\u0161tanty 19 v s\u00FAbore tried
CFRE120=opera\u010Dn\u00E9 k\u00F3dy jsr a jsr_w opcodes s\u00FA neplatn\u00E9 v s\u00FAboroch tried s verziami >\= 51.0
CFRE121=neplatn\u00FD n\u00E1zov po\u013Ea
CFRE122=trieda m\u00F4\u017Ee by\u0165 bu\u010F verejn\u00E1 alebo modul
CFRE123=Kon\u0161tanty MethodHandle musia referencova\u0165 pole alebo referenciu met\u00F3dy
CFRE124=zna\u010Dka hodnoty elementu anot\u00E1cie je neplatn\u00E1
CFRE125=bajtov\u00FD k\u00F3d invokedynamic mus\u00ED referencova\u0165 kon\u0161tantn\u00FA polo\u017Eku oblasti InvokeDynamic
CFRE126=rezervovan\u00E9 sloty bajtov\u00E9ho k\u00F3du invokedynamic nie s\u00FA nulov\u00E9
CFRE116=bajtov\u00FD k\u00F3d vyvolania mus\u00ED odkazova\u0165 na Methodref
CFRE117=pole nem\u00F4\u017Ee by\u0165 kone\u010Dn\u00E9 aj nest\u00E1le
CFRE118=bajty navy\u0161e po EOF
CFRE119=viacero atrib\u00FAtov SourceFile
CFRE130=viacero atrib\u00FAtov BootstrapMethods
CFRE131=Atrib\u00FAt BootstrapMethods, ktor\u00FD sa vy\u017Eaduje pre invokedynamic, ch\u00FDba alebo je primal\u00FD
CFRE132=Nerozpoznan\u00E9 type_annotation target_type
CFRE133=Met\u00F3da m\u00E1 dva atrib\u00FAty MethodParameters
CFRE134=Parameter met\u00F3dy m\u00E1 neplatn\u00FD pr\u00EDznak.
CFRE135=N\u00E1zov parametra met\u00F3dy nem\u00E1 k\u00F3dovanie UTF8
CFRE136=neplatn\u00E9 modifik\u00E1tory pre met\u00F3du rozhrania
CFRE137=Trieda m\u00E1 viac ako jeden atrib\u00FAt RuntimeVisibleTypeAnnotations alebo RuntimeInvisibleTypeAnnotations
CFRE127=index met\u00F3dy bootstrap mus\u00ED referencova\u0165 kon\u0161tantn\u00FA polo\u017Eku oblasti MethodHandle
CFRE128=neplatn\u00FD podpis methodtype
CFRE129=kon\u0161tantn\u00E1 polo\u017Eka oblasti je neplatn\u00E1 v s\u00FAboroch tried s verziou < 51.0
CFRE163=S\u00FAbor tried je verzia n\u00E1h\u013Eadu, ale m\u00E1 nespr\u00E1vnu hlavn\u00FA verziu alebo nie je povolen\u00FD n\u00E1h\u013Ead.
CFRE164=Index v LocalVariableTable je mimo rozsah
CFRE165=Index v LocalVariableTypeTable je mimo rozsah
CFRE166=Duplicitn\u00E9 polo\u017Eky v LocalVariableTypeTable nie s\u00FA povolen\u00E9
CFRE167=viacero atrib\u00FAtov z\u00E1znamu
CFRE168=Triedy z\u00E1znamu nem\u00F4\u017Eu by\u0165 abstraktn\u00E9
CFRE169=N\u00E1zov z\u00E1znamu mus\u00ED by\u0165 re\u0165azec
CFRE160=Polo\u017Eka oblasti kon\u0161t\u00E1nt je neplatn\u00E1 v s\u00FAboroch tried s verziami men\u0161\u00EDmi ako 55.0
CFRE161=Argumenty BootstrapMethod (%1$d) obsahuj\u00FA neplatn\u00FA polo\u017Eku oblasti kon\u0161t\u00E1nt na indexe (\#%2$u) typu (%3$u); trieda\=%5$.*4$s, posunutie\=%6$u
CFRE162=ValueTypes s\u00FA povolen\u00E9 iba s vo\u013Ebou -XX\:+EnableValhalla
SHRC703=Zlyhalo otv\u00E1ranie s\u00FAboru sn\u00EDmky zdie\u013Eanej pam\u00E4te cache "%s"
SHRC704=K\u00F3d chyby vrstvy Port\: %1$d
SHRC705=Chybov\u00E1 spr\u00E1va platformy\: %1$s
SHRC706=Zlyhalo z\u00EDskavanie z\u00E1mka s\u00FAboru pre s\u00FAbor sn\u00EDmky zdie\u013Eanej pam\u00E4te cache
SHRC700=Sn\u00EDmka neperzistentnej zdie\u013Eanej pam\u00E4te cache "%s" bola vytvoren\u00E1
SHRC701=Zlyhalo vytv\u00E1ranie sn\u00EDmky neperzistentnej zdie\u013Eanej pam\u00E4te cache "%s"
SHRC702=Zlyhalo z\u00EDskavanie adres\u00E1ra pre sn\u00EDmku zdie\u013Eanej pam\u00E4te cache
SHRC707=Zlyhalo z\u00EDskavanie mutexu pam\u00E4te cache "%s"
SHRC708=Zlyhalo orez\u00E1vanie sn\u00EDmky s\u00FAboru "%s" neperzistentnej zdie\u013Eanej pam\u00E4ti cache
SHRC709=JVM vytv\u00E1ra sn\u00EDmku neperzistentnej zdie\u013Eanej pam\u00E4te "%s", ale s\u00FAbor sn\u00EDmky "%s" u\u017E existuje a prep\u00ED\u0161e sa
CFRE174=viacero atrib\u00FAtov PermittedSubclasses
CFRE175=fin\u00E1lne triedy nem\u00F4\u017Eu by\u0165 uzatvoren\u00E9
CFRE176=N\u00E1zov permittedSubclasses mus\u00ED by\u0165 re\u0165azec
CFRE177=Polo\u017Eka triedy permittedSubclasses nie je typ triedy
CFRE178=Uzatvoren\u00E9 triedy musia ma\u0165 aspo\u0148 jednu povolen\u00FA podtriedu
CFRE170=N\u00E1zov RecordComponent mus\u00ED by\u0165 re\u0165azec
CFRE171=Popisova\u010D RecordComponent mus\u00ED by\u0165 re\u0165azec
CFRE172=Z\u00E1znam je implicitne kone\u010Dn\u00FD
CFRE173=Polo\u017Eka LocalVariableTypeTable sa nezhoduje so \u017Eiadnou polo\u017Ekou LocalVariableTable
SHRC720=Pri vytv\u00E1ran\u00ED sn\u00EDmky pam\u00E4te cache nie je povolen\u00E9 op\u00E4tovn\u00E9 vytvorenie riadiaceho s\u00FAboru zdie\u013Eanej pam\u00E4te
SHRC725=D\u013A\u017Eka s\u00FAboru sn\u00EDmky "%s" neperzistentnej zdie\u013Eanej pam\u00E4te cache je neplatn\u00E1. D\u013A\u017Eka s\u00FAboru je %lld bajtov. Platn\u00FD s\u00FAbor sn\u00EDmky m\u00E1 minim\u00E1lne %d bajtov a maxim\u00E1lne %lld bajtov.
SHRC726=Neperzistentn\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache "%s" u\u017E existuje. Nemo\u017Eno ju obnovi\u0165 zo sn\u00EDmky.
SHRC727=Nastala chyba pri vytv\u00E1ran\u00ED novej neperzistentnej zdie\u013Eanej pam\u00E4te cache
SHRC728=Zlyhalo \u010D\u00EDtanie s\u00FAboru sn\u00EDmky neperzistentnej zdie\u013Eanej pam\u00E4te cache "%s"
SHRC721=JVM nie je nakonfigurovan\u00E9 na pr\u00EDstup k s\u00FAboru sn\u00EDmky neperzistentnej zdie\u013Eanej pam\u00E4ti cache "%s". Ak chcete otvori\u0165 s\u00FAbor, pou\u017Eite podvo\u013Ebu 'groupAccess'.
SHRC722=JVM nepovo\u013Euje pr\u00EDstup k s\u00FAboru sn\u00EDmky zdie\u013Eanej pam\u00E4te cache "%s", preto\u017Ee ID pou\u017E\u00EDvate\u013Ea a ID skupiny procesu JVM sa l\u00ED\u0161ia od ID pou\u017E\u00EDvate\u013Ea a ID skupiny vlastn\u00EDka s\u00FAboru sn\u00EDmky zdie\u013Eanej pam\u00E4te cache a ID pou\u017E\u00EDvate\u013Ea procesu JVM nepatr\u00ED do skupiny vlastn\u00EDka s\u00FAboru sn\u00EDmky zdie\u013Eanej pam\u00E4te cache.
SHRC723=JVM nemohlo skontrolova\u0165 opr\u00E1vnenia s\u00FAboru sn\u00EDmky "%s" zdie\u013Eanej pam\u00E4te cache
SHRC724=S\u00FAbor sn\u00EDmky zdie\u013Eanej pam\u00E4te cache "%s" neexistuje
SHRC729=Sn\u00EDmka bola vytvoren\u00E1 in\u00FDm zostaven\u00EDm JVM a nezhoduje sa so spusten\u00EDm JVM
SHRC714=Nie s\u00FA k dispoz\u00EDcii \u017Eiadne sn\u00EDmky zdie\u013Eanej pam\u00E4te cache
SHRC715=Bola odstr\u00E1nen\u00E1 star\u0161ia gener\u00E1cia sn\u00EDmky zdie\u013Eanej pam\u00E4te cache "%s"
SHRC716=Zlyhalo odstra\u0148ovanie star\u0161ej gener\u00E1cie sn\u00EDmky zdie\u013Eanej pam\u00E4te cache "%s"
SHRC717=Zlyhalo odstra\u0148ovanie aktu\u00E1lnej gener\u00E1cie sn\u00EDmky zdie\u013Eanej pam\u00E4te cache "%s"
SHRC710=Zlyhalo zapisovanie do s\u00FAboru sn\u00EDmky "%s" neperzistentnej zdie\u013Eanej pam\u00E4te cache
SHRC711=Zlyhalo pres\u00FAvanie posunu deskriptora s\u00FAboru v s\u00FAbore sn\u00EDmky "%s" neperzistentnej zdie\u013Eanej pam\u00E4te cache
SHRC712=Pokus o zni\u010Denie v\u0161etk\u00FDch sn\u00EDmok zdie\u013Eanej pam\u00E4te cache v cacheDir "%s"
SHRC713=Zlyhalo z\u00EDskavanie d\u013A\u017Eky s\u00FAboru sn\u00EDmky "%s" zdie\u013Eanej pam\u00E4te cache
SHRC718=Neexistuje sn\u00EDmka zdie\u013Eanej pam\u00E4te cache
SHRC719=Sn\u00EDmka zdie\u013Eanej pam\u00E4te cache "%s" bola zni\u010Den\u00E1
SHRC740=Pou\u017Eitie\: %s{<\u0161pecifik\u00E1cia_met\u00F3dy>[,<\u0161pecifik\u00E1cia_met\u00F3dy>]}
SHRC741=Form\u00E1t pre <\u0161pecifik\u00E1cia_met\u00F3dy> je [\!]{*|[*]<n\u00E1zov_bal\u00EDka/n\u00E1zov_triedy>[*]}[.{*|[*]<n\u00E1zov_met\u00F3dy>[*]}[({*|[*]<parametre>[*]})]], napr\u00EDklad\:\n\n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC742=D\u00D4LE\u017DIT\u00C9\: M\u00F4\u017Eete poskytn\u00FA\u0165 viacero \u0161pecifik\u00E1ci\u00ED met\u00F3dy oddelen\u00FDch \u010Diarkou. Ke\u010F hodnota vo\u013Eby obsahuje \u010Diarky, mus\u00ED by\u0165 uzatvoren\u00E1 v mno\u017Einov\u00FDch z\u00E1tvork\u00E1ch.\n\tM\u00F4\u017Ee by\u0165 potrebn\u00E9 uzatvori\u0165 vo\u013Eby do \u00FAvodzoviek, aby shell nepreru\u0161il a nefragmentoval \u010Diarkou oddelen\u00E9 pr\u00EDkazov\u00E9 riadky, napr\u00EDklad\: \n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" alebo\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC747=Zlyhalo anulovanie met\u00F3d AOT
SHRC748=Zlyhalo opakovan\u00E9 validovanie met\u00F3d AOT
SHRC749=Nena\u0161li sa met\u00F3dy AOT
SHRC743=Neplatn\u00E9 \u0161pecifik\u00E1cie met\u00F3dy pre vo\u013Ebu "%s"
SHRC744=Anulovalo sa %d AOT met\u00F3d
SHRC745=Opakovane sa validovalo %d AOT met\u00F3d
SHRC746=Na\u0161lo sa %d AOT met\u00F3d
SHRC730=JVM vytvorilo zdie\u013Ean\u00FA pam\u00E4\u0165 cache s vo\u013Ebou '-Xshareclasses\:restrictClasspaths'. \u010Eal\u0161ie vyvolania JVM nebud\u00FA ma\u0165 povolen\u00E9 ulo\u017Ei\u0165 cesty k triedam do zdie\u013Eanej pam\u00E4te cache
SHRC731=JVM naimportovalo vo\u013Ebu '-Xshareclasses\:restrictClasspaths', preto\u017Ee existuj\u00FAca zdie\u013Ean\u00E1 pam\u00E4\u0165 cache bola vytvoren\u00E1 bez vo\u013Eby '-Xshareclasses\:restrictClasspaths'
SHRC736=Anulova\u0165 met\u00F3dy AOT, ktor\u00E9 sa zhoduj\u00FA so \u0161pecifik\u00E1ciami met\u00F3dy.
SHRC737=Znova validova\u0165 met\u00F3dy AOT, ktor\u00E9 sa zhoduj\u00FA so \u0161pecifik\u00E1ciami met\u00F3dy.
SHRC738=Vytla\u010Di\u0165 met\u00F3dy AOT, ktor\u00E9 sa zhoduj\u00FA so \u0161pecifik\u00E1ciami met\u00F3dy.\n\t<\u0161pecifik\u00E1cia_met\u00F3dy> je definovan\u00E1 takto\: [\!]{*|[*]<n\u00E1zov_bal\u00EDka/n\u00E1zov_triedy>[*]}[.{*|[*]<n\u00E1zov_met\u00F3dy>[*]}[({*|[*]<parametre>[*]})]].
SHRC739=ANULOVAN\u00C9
SHRC732=JVM m\u00F4\u017Ee ulo\u017Ei\u0165 cesty k triedam do zdie\u013Eanej pam\u00E4te cache, ktor\u00E1 bola vytvoren\u00E1 s vo\u013Ebou '-Xshareclasses\:restrictClasspaths'
SHRC733=JVM nem\u00F4\u017Ee ulo\u017Ei\u0165 cesty k triedam do zdie\u013Eanej pam\u00E4te cache, preto\u017Ee pam\u00E4\u0165 cache bola vytvoren\u00E1 s vo\u013Ebou '-Xshareclasses\:restrictClasspaths'
SHRC734=Vytla\u010Dte n\u00E1zov s\u00FAboru sn\u00EDmky zdie\u013Eanej pam\u00E4te cache tried, ktor\u00FD sa pou\u017Eije.
SHRC735=Pou\u017Eite %d-bitov\u00E9 JVM na vykonanie po\u017Eadovanej oper\u00E1cie na %d-bitovej zdie\u013Eanej pam\u00E4ti cache "%s", preto\u017Ee %d-bitov\u00E9 JVM nem\u00F4\u017Ee skontrolova\u0165, \u010Di bola zdie\u013Ean\u00E1 pam\u00E4\u0165 vytvoren\u00E1 cez JVM
SHRC640=JVM pou\u017E\u00EDva existuj\u00FAcu zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy v diagnostickom re\u017Eime mprotect (pomocou vo\u013Eby -Xshareclasses\:mprotect\=diagnostic), ale pam\u00E4\u0165 cache nebola vytvoren\u00E1 v tomto re\u017Eime. Pou\u017Eite pam\u00E4te cache v tomto re\u017Eime m\u00F4\u017Ee ovplyvni\u0165 v\u00FDkon.
SHRC641=JVM sk\u00FA\u0161a pou\u017Ei\u0165 existuj\u00FAcu zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy v diagnostickom re\u017Eime mprotect (pomocou vo\u013Eby -Xshareclasses\:mprotect\=diagnostic), ale pam\u00E4\u0165 cache nebola vytvoren\u00E1 v tomto re\u017Eime. V tomto pr\u00EDpade sa vo\u013Eba mprotect\=diagnostic ignoruje v opera\u010Dnom syst\u00E9me z/OS.
SHRC642=JVM vytvorilo zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy v diagnostickom re\u017Eime mprotect (pomocou vo\u013Eby -Xshareclasses\:mprotect\=diagnostic). Pou\u017Eite pam\u00E4te cache v tomto re\u017Eime m\u00F4\u017Ee ovplyvni\u0165 v\u00FDkon.
SHRC643=JVM sa pripojilo k zdie\u013Eanej pam\u00E4ti cache pre triedy, ktor\u00E1 bola vytvoren\u00E1 v diagnostickom re\u017Eime mprotect (pomocou vo\u013Eby -Xshareclasses\:mprotect\=diagnostic). Pou\u017Eite pam\u00E4te cache v tomto re\u017Eime m\u00F4\u017Ee ovplyvni\u0165 v\u00FDkon.
SHRC648=JVM nie je nakonfigurovan\u00E9 na pr\u00EDstup k mno\u017Eine semaforov, ktor\u00E1 je priraden\u00E1 k existuj\u00FAcej neperzistentnej zdie\u013Eanej pam\u00E4ti cache pre triedy. Ak sa chcete pripoji\u0165 k neperzistentnej zdie\u013Eanej pam\u00E4ti cache pre triedy, pou\u017Eite podvo\u013Ebu 'groupAccess'.
SHRC649=JVM nepovo\u013Euje pr\u00EDstup k mno\u017Eine semaforov zdie\u013Eanej pam\u00E4te cache, ktor\u00E1 bola vytvoren\u00E1 a ktor\u00FA vlastn\u00ED in\u00FD u\u017E\u00EDvate\u013E, ktor\u00FD nie je v jej skupine.
J9CL030=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre nat\u00EDvne \u00FAdaje vlastn\u00EDka
J9CL031=Nebolo mo\u017En\u00E9 zaregistrova\u0165 dbgwrapper.dll ako kni\u017Enicu bootstrap. K\u00F3d chyby \= %zu
J9CL032=%1$d\: Zlyhalo z\u00EDskavanie inform\u00E1ci\u00ED %2$s.
SHRC644=JVM sa pripojilo k zdie\u013Eanej pam\u00E4ti cache pre triedy, ktor\u00E1 bola vytvoren\u00E1 v diagnostickom re\u017Eime mprotect (pomocou vo\u013Eby -Xshareclasses\:mprotect\=diagnostic). Vo\u013Eba -Xshareclasses\:mprotect\=none sa bude ignorova\u0165.
SHRC645=Povoli\u0165 diagnostick\u00FD re\u017Eim mprotect
SHRC646=JVM nemohlo skontrolova\u0165 opr\u00E1vnenia mno\u017Einy semaforov, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache.
SHRC647=JVM zistilo, \u017Ee efekt\u00EDvne ID u\u017E\u00EDvate\u013Ea procesu je vlastn\u00EDk, ale nie tvorca mno\u017Einy semaforov, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache. JVM sa nepripoj\u00ED k zdie\u013Eanej pam\u00E4ti cache, aby sa predi\u0161lo pr\u00EDstupu k nepl\u00E1novanej zdie\u013Eanej pam\u00E4ti cache.
J9CL037=Ke\u010F je zadan\u00E9 -XX\:-EnableCPUMonitor, nemo\u017Eno z\u00EDska\u0165 inform\u00E1cie o pou\u017Eit\u00ED CPU JVM.
J9CL038=Nastala chyba pri z\u00EDskavan\u00ED inform\u00E1ci\u00ED o pou\u017Eit\u00ED CPU JVM.
J9CL039=\u010Casov\u00E1 zna\u010Dka je neplatn\u00E1 pri z\u00EDskavan\u00ED inform\u00E1ci\u00ED o pou\u017Eit\u00ED CPU JVM.
J9CL033=Nebolo mo\u017En\u00E9 zaregistrova\u0165 %s ako kni\u017Enicu bootstrap. K\u00F3d chyby \= %zu
J9CL034=%1$d\: Zlyhalo z\u00EDskavanie inform\u00E1ci\u00ED %2$s. %3$s
J9CL035=S\u00FAkromn\u00E9 met\u00F3dy rozhrania vy\u017Eaduj\u00FA invokespecial
J9CL036=na\u010D\u00EDtava sa naru\u0161enie obmedzenia\: %2$.*1$s nie je vidite\u013En\u00E9 z %4$.*3$s
J9CL019=Nemo\u017Eno vyhradi\u0165 vyrovn\u00E1vaciu pam\u00E4\u0165 SIOCGIFCONF
SHRC630=Priestor je pln\u00FD pre ulo\u017Eenie \u00FAdajov in\u00FDch ako AOT/JIT, ako s\u00FA triedy, v zdie\u013Eanej pam\u00E4ti cache "%s".
SHRC631=Priestor vyhraden\u00FD pre \u00FAdaje AOT v zdie\u013Eanej pam\u00E4ti cache "%s" je pln\u00FD. Pou\u017Eite -Xscminaot na zv\u00E4\u010D\u0161enie priestoru vyhraden\u00E9ho pre \u00FAdaje AOT.
SHRC632=Priestor vyhraden\u00FD pre \u00FAdaje JIT v zdie\u013Eanej pam\u00E4ti cache "%s" je pln\u00FD. Pou\u017Eite -Xscminjitdata na zv\u00E4\u010D\u0161enie priestoru vyhraden\u00E9ho pre \u00FAdaje JIT.
SHRC637=Podvo\u013Eba -Xshareclasses\:cacheRetransformed nie je kompatibiln\u00E1 s existuj\u00FAcou zdie\u013Eanou pam\u00E4\u0165ou cache s povolen\u00FDm BCI.
SHRC638=Vytvorenie pam\u00E4te cache s vo\u013Ebou cacheRetransformed vn\u00FAti re\u017Eim disableBCI.
SHRC639=V kombin\u00E1cii s vo\u013Ebou -Xmt mo\u017Eno pou\u017Ei\u0165 iba vo\u013Eby pomocn\u00E9ho programu zdie\u013Eanej pam\u00E4te cache. Ostatn\u00E9 vo\u013Eby zdie\u013Eanej pam\u00E4te cache umiestnite do s\u00FAboru javad.options.
J9CL020=Nedostatok pam\u00E4te na pre\u010D\u00EDtanie \u00FAdajov lok\u00E1lu
J9CL021=Nedostatok pam\u00E4te na vytvorenie zoznamu indexov
SHRC633=Je zadan\u00E1 vo\u013Eba "-XX\:+StoreIntermediateClassfile", ale existuj\u00FAca pam\u00E4\u0165 cache nebola vytvoren\u00E1 s vo\u013Ebou "-XX\:+StoreIntermediateClassfile".
SHRC634=Je zadan\u00E1 vo\u013Eba "-XX\:-StoreIntermediateClassfile", ale existuj\u00FAca pam\u00E4\u0165 cache bola vytvoren\u00E1 s vo\u013Ebou "-XX\:+StoreIntermediateClassfile".
SHRC635=Ulo\u017Ei\u0165 pomocn\u00FD s\u00FAbor tried \= true
SHRC636=Podvo\u013Eba "disableBCI" nie je kompatibiln\u00E1 s existuj\u00FAcou zdie\u013Eanou pam\u00E4\u0165ou cache s povolen\u00FDm BCI.
J9CL026=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre obsah POST HTTP
J9CL027=Chyba \u010D\u00EDtania s\u00FAboru Zip
J9CL028=Nastala intern\u00E1 chyba pri \u010D\u00EDtan\u00ED s\u00FAboru zip. K\u00F3d chyby %d
J9CL029=na\u0161li sa nespr\u00E1vne znaky alebo znaky, ktor\u00E9 nemo\u017Eno mapova\u0165
J9CL022=Nedostatok pam\u00E4te na zobrazenie skladov z\u00E1znamov
J9CL023=Nedostatok pam\u00E4te na pre\u010D\u00EDtanie z\u00E1znamu
J9CL024=Nedostatok pam\u00E4te
J9CL025=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre hlavi\u010Dky odpovede HTTP
SHRC662=Obnova po chybe\: zni\u010Den\u00E1 mno\u017Eina semaforov priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC663=Obnova po chybe\: zni\u010Den\u00E1 mno\u017Eina semaforov s id\=%d, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC664=Zlyhalo obnovovanie po chybe\: Zlyhalo ni\u010Denie mno\u017Einy so semid\=%d, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried. Iba tvorca alebo vlastn\u00ED alebo pou\u017E\u00EDvate\u013E s administrat\u00EDvnymi privil\u00E9giami m\u00F4\u017Eu zni\u010Di\u0165 mno\u017Einu semaforov.
SHRC665=Zlyhalo obnovovanie po chybe\: Zlyhalo ni\u010Denie mno\u017Einy so semid\=%d, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC660=JVM nemohlo priradi\u0165 mno\u017Einu semaforov id\=%d k zdie\u013Eanej pam\u00E4ti cache pre triedy.
SHRC661=JVM nemohlo priradi\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 id\=%d k zdie\u013Eanej pam\u00E4ti cache pre triedy.
SHRC666=Obnova po chybe\: zni\u010Den\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC667=Obnova po chybe\: zni\u010Den\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 s id\=%d, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC668=Zlyhalo obnovovanie po chybe\: Zlyhalo ni\u010Denie zdie\u013Eanej pam\u00E4te so shmid\=%d, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried. Iba tvorca alebo vlastn\u00ED alebo pou\u017E\u00EDvate\u013E s administrat\u00EDvnymi privil\u00E9giami m\u00F4\u017Eu zni\u010Di\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165.
SHRC669=Zlyhalo obnovovanie po chybe\: Zlyhalo ni\u010Denie zdie\u013Eanej pam\u00E4te so shmid\=%d, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
SHRC651=JVM zistilo, \u017Ee efekt\u00EDvne ID u\u017E\u00EDvate\u013Ea procesu je vlastn\u00EDk, ale nie tvorca zdie\u013Eanej pam\u00E4te, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache. JVM sa nepripoj\u00ED k zdie\u013Eanej pam\u00E4ti cache, aby sa predi\u0161lo pr\u00EDstupu k nepl\u00E1novanej zdie\u013Eanej pam\u00E4ti cache.
SHRC652=JVM nie je nakonfigurovan\u00E9 na pr\u00EDstup k zdie\u013Eanej pam\u00E4ti, ktor\u00E1 je priraden\u00E1 k existuj\u00FAcej neperzistentnej zdie\u013Eanej pam\u00E4ti cache pre triedy. Ak sa chcete pripoji\u0165 k neperzistentnej zdie\u013Eanej pam\u00E4ti cache pre triedy, pou\u017Eite podvo\u013Ebu 'groupAccess'.
SHRC653=JVM nie je nakonfigurovan\u00E9 na pr\u00EDstup k zdie\u013Eanej pam\u00E4ti, ktor\u00E1 je priraden\u00E1 k existuj\u00FAcej neperzistentnej zdie\u013Eanej pam\u00E4ti cache pre triedy. Ak sa chcete pripoji\u0165 k neperzistentnej zdie\u013Eanej pam\u00E4ti cache pre triedy, pou\u017Eite podvo\u013Ebu 'groupAccess' a 'readonly'.
SHRC654=JVM nepovo\u013Euje pr\u00EDstup k regi\u00F3nu zdie\u013Eanej pam\u00E4te zdie\u013Eanej pam\u00E4te cache, ktor\u00E1 bola vytvoren\u00E1 a ktor\u00FA vlastn\u00ED in\u00FD u\u017E\u00EDvate\u013E, ktor\u00FD nie je v jej skupine.
SHRC650=JVM nemohlo skontrolova\u0165 opr\u00E1vnenia zdie\u013Eanej pam\u00E4te, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache.
SHRC659=Nastala chyba po\u010Das otv\u00E1rania zdie\u013Eanej pam\u00E4te
J9CL040=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre nov\u00FA glob\u00E1lnu referenciu JNI
J9CL041=Hostite\u013Esk\u00E1 trieda %2$.*1$s a anonymn\u00E1 trieda %4$.*3$s s\u00FA v odli\u0161n\u00FDch bal\u00EDkoch
J9CL042=\u010Clen vnorenia %2$.*1$s v %4$.*3$s deklaruje in\u00E9ho hostite\u013Ea vnorenia %6$.*5$s
SHRC655=Pam\u00E4\u0165 cache je pr\u00EDstupn\u00E1 pre aktu\u00E1lneho u\u017E\u00EDvate\u013Ea \= %s
SHRC656=JVM nie je nakonfigurovan\u00E9 na pr\u00EDstup k s\u00FAboru zdie\u013Eanej pam\u00E4te cache. Ak sa chcete pripoji\u0165 k zdie\u013Eanej pam\u00E4ti cache pre triedy, pou\u017Eite podvo\u013Ebu 'groupAccess'.
SHRC657=JVM nepovo\u013Euje pr\u00EDstup k s\u00FAboru zdie\u013Eanej pam\u00E4te cache, preto\u017Ee ID u\u017E\u00EDvate\u013Ea a ID skupiny procesu JVM sa l\u00ED\u0161ia od ID u\u017E\u00EDvate\u013Ea a ID skupiny vlastn\u00EDka s\u00FAboru zdie\u013Eanej pam\u00E4te cache a ID u\u017E\u00EDvate\u013Ea procesu JVM nepatr\u00ED do skupiny vlastn\u00EDka s\u00FAboru zdie\u013Eanej pam\u00E4te cache.
SHRC658=JVM nemohlo skontrolova\u0165 opr\u00E1vnenia s\u00FAboru zdie\u013Eanej pam\u00E4te cache.
SHRC200=\ H\u013Eadanie %2$.*1$s bolo \u00FAspe\u0161n\u00E9.
SHRC684=Nastala chyba po\u010Das otv\u00E1rania semafora. Nebolo mo\u017En\u00E9 zamkn\u00FA\u0165 riadiaci s\u00FAbor.
DUMP034=U\u017E\u00EDvate\u013E po\u017Eiadal o v\u00FDpis %1$s pomocou '%2$s' prostredn\u00EDctvom %3$s
SHRC201=\ Nahradenie %2$.*1$s bolo \u00FAspe\u0161n\u00E9.
SHRC685=Nastala chyba po\u010Das otv\u00E1rania zdie\u013Eanej pam\u00E4te. Nebolo mo\u017En\u00E9 zamkn\u00FA\u0165 riadiaci s\u00FAbor.
DUMP033=JVM po\u017Eiadalo o v\u00FDpis %1$s v odpovedi na udalos\u0165
SHRC202=Zlyhala inicializ\u00E1cia oblast\u00ED v mana\u017E\u00E9rovi zdie\u013Ean\u00FDch tried
SHRC686=Zlyhalo sp\u00FA\u0161\u0165anie zdie\u013Eanej pam\u00E4te cache tried. Pokra\u010Duje sa bez jej pou\u017Eitia, preto\u017Ee je zadan\u00E9 -Xshareclasses\:nonfatal
DUMP036=Neplatn\u00FD alebo ch\u00FDbaj\u00FAci filter -Xdump
SHRC203=Nemo\u017Eno vytvori\u0165 ha\u0161ovaciu tabu\u013Eku v mana\u017E\u00E9rovi zdie\u013Ean\u00FDch tried
SHRC687=Pri spusten\u00ED s vo\u013Ebou -Xshareclasses\:readonly nemo\u017Eno vytvori\u0165 nov\u00FA zdie\u013Ean\u00FA pam\u00E4\u0165 cache tried
DUMP035=U\u017E\u00EDvate\u013E po\u017Eiadal o v\u00FDpis %1$s prostredn\u00EDctvom %2$s
SHRC680=Zlyhanie obnovovania po chybe\: Zlyhalo odstra\u0148ovanie odstra\u0148ovanie riadiaceho s\u00FAboru mno\u017Einy semaforov %s, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
DUMP030=Nemo\u017Eno zap\u00EDsa\u0165 v\u00FDpis do s\u00FAboru %s\: %s
SHRC681=Bol dosiahnut\u00FD syst\u00E9mov limit pre maxim\u00E1lny po\u010Det semaforov alebo maxim\u00E1lny po\u010Det semaforov na \u00FArovni syst\u00E9mu.
SHRC682=Bol dosiahnut\u00FD syst\u00E9mov\u00FD limit pre maxim\u00E1lny po\u010Det regi\u00F3nov zdie\u013Eanej pam\u00E4te alebo limit pam\u00E4te vyhradenej regi\u00F3nom zdie\u013Eanej pam\u00E4te na \u00FArovni syst\u00E9mu.
DUMP032=JVM po\u017Eiadalo o v\u00FDpis %1$s pomocou '%2$s' v odpovedi na udalos\u0165
SHRC683=Bol dosiahnut\u00FD syst\u00E9mov\u00FD limit celkov\u00E9ho po\u010Dtu otvoren\u00FDch s\u00FAborov.
DUMP031=Po\u017Eadovan\u00E9 heapdump sa nevytvorilo, preto\u017Ee nevznikla po\u017Eiadavka o z\u00E1mok VM typu exclusive. Pridajte request\=exclusive+prepwalk+compact do vo\u013Eby pr\u00EDkazov\u00E9ho riadka -Xdump\:heap\:.
SHRC208=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre oblas\u0165 polo\u017Eiek ha\u0161ovacej tabu\u013Eky v CompiledMethodManagerImpl
SHRC209=Povoli\u0165 podrobn\u00FD v\u00FDstup bajtov\u00FDch \u00FAdajov
SHRC204=Nie je mo\u017En\u00E9 vytvori\u0165 mutex ha\u0161ovacej tabu\u013Eky v spr\u00E1vcovi zdie\u013Ean\u00FDch tried
SHRC688=Cesty k triedam m\u00F4\u017Ee prida\u0165 iba prv\u00E9 JVM, ktor\u00E9 inicializuje pam\u00E4\u0165 cache.
DUMP027=Po\u017Eadovan\u00E9 heapdump sa nevytvorilo, preto\u017Ee in\u00FD komponent vlastn\u00ED z\u00E1mok VM typu exclusive.
SHRC205=Zlyhalo vytv\u00E1ranie novej polo\u017Eky ha\u0161ovacej tabu\u013Eky v CompiledMethodManagerImpl
SHRC689=Umo\u017E\u0148uje JVM ulo\u017Ei\u0165 cesty k triedam v pam\u00E4ti cache vytvorenej s vo\u013Ebou "restrictClasspaths".
DUMP026=N\u00E1zov IEATDUMP prekra\u010Duje maxim\u00E1lnu povolen\u00FA d\u013A\u017Eku. Pou\u017Eije sa predvolen\u00FD n\u00E1zov.
SHRC206=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre polo\u017Eku ha\u0161ovacej tabu\u013Eky v CompiledMethodManagerImpl
DUMP029=Po\u017Eiadavka o prepwalk alebo compact pred vytvoren\u00EDm v\u00FDpisu syst\u00E9mu sa bude ignorova\u0165, preto\u017Ee nevznikla po\u017Eiadavka o z\u00E1mok VM typu exclusive.
SHRC207=Nemo\u017Eno vst\u00FApi\u0165 do mutexu ha\u0161ovacej tabu\u013Eky CompiledMethodManager
DUMP028=Nebolo mo\u017En\u00E9 z\u00EDska\u0165 z\u00E1mok VM typu exclusive pred vytvoren\u00EDm v\u00FDpisu syst\u00E9mu.
SHRC673=Zlyhalo ni\u010Denie mno\u017Einy semaforov so semid\=%d, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
DUMP045=Po\u010Det volieb v\u00FDpisu pam\u00E4te mus\u00ED by\u0165 men\u0161\u00ED ako %d vr\u00E1tane predvolene nastaven\u00FDch volieb.
SHRC674=Pou\u017E\u00EDvate\u013E nem\u00E1 povolen\u00E9 zni\u010Di\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 so shmid\=%d. Iba tvorca alebo vlastn\u00ED alebo pou\u017E\u00EDvate\u013E s administrat\u00EDvnymi privil\u00E9giami m\u00F4\u017Eu zni\u010Di\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165.
DUMP044=Neplatn\u00E1 alebo vyhraden\u00E1 platn\u00E1 hodnota pre %s
SHRC675=Zlyhalo ni\u010Denie zdie\u013Eanej pam\u00E4te priradenej k zdie\u013Eanej pam\u00E4ti cache tried.
DUMP047=VM sa vyp\u00EDna. Pr\u00ED\u010Dina\: Nezn\u00E1ma
SHRC676=Zlyhalo ni\u010Denie zdie\u013Eanej pam\u00E4te so shmid\=%d, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
DUMP046=VM sa vyp\u00EDna. Pr\u00ED\u010Dina\: %2$.*1$s
DUMP041=Nespr\u00E1vne pou\u017Eitie filtra -Xdump msg_filter
SHRC670=Obnova po chybe\: pokus o pou\u017Eitie zdie\u013Eanej pam\u00E4te cache v re\u017Eime len na \u010D\u00EDtanie, ak existuje regi\u00F3n zdie\u013Eanej pam\u00E4te, ako reakcia na vo\u013Ebu "-Xshareclasses\:nonfatal".
DUMP040=V\u00FDpis %1$s sa zap\u00EDsal do mno\u017E\u00EDn \u00FAdajov pomocou \u0161abl\u00F3ny n\u00E1zvu %2$s
SHRC671=Pou\u017E\u00EDvate\u013E nem\u00E1 povolen\u00E9 zni\u010Di\u0165 mno\u017Einu semaforov so semid\=%d. Iba tvorca alebo vlastn\u00ED alebo pou\u017E\u00EDvate\u013E s administrat\u00EDvnymi privil\u00E9giami m\u00F4\u017Eu zni\u010Di\u0165 mno\u017Einu semaforov.
DUMP043=%s nie je podporovan\u00E9 v tejto platforme
SHRC672=Zlyhalo ni\u010Denie mno\u017Einy semaforov priradenej k zdie\u013Eanej pam\u00E4ti cache tried.
DUMP042=Po\u010Das vykon\u00E1vania z\u00E1sobn\u00EDka Java bol prijat\u00FD sign\u00E1l zru\u0161enia. Nebolo mo\u017En\u00E9 spusti\u0165 agentov v\u00FDpisu pam\u00E4te JVM.
SHRC677=K\u00F3d chyby vrstvy Port\: %1$d
DUMP038=Zachyten\u00FD v\u00FDpis sa nezap\u00EDsal z d\u00F4vodu sledovania do s\u00FAboru\: %1$s
SHRC678=Chybov\u00E1 spr\u00E1va platformy\: %1$s
DUMP037=Chyba vo v\u00FDpise %1$s\: %2$s zlyhalo, k\u00F3d chyby %3$d
SHRC679=Zlyhanie obnovovania po chybe\: Zlyhalo odstra\u0148ovanie odstra\u0148ovanie riadiaceho s\u00FAboru mno\u017Einy semaforov %s, ktor\u00E1 je priraden\u00E1 k zdie\u013Eanej pam\u00E4ti cache tried.
DUMP039=Sprac\u00FAva sa udalos\u0165 v\u00FDpisu "%1$s", podrobnosti "%3$.*2$s" v %4$s. \u010Cakajte.
J9CL008=hodnota \u010Dasov\u00E9ho limitu v nanosekund\u00E1ch je mimo rozsahu
J9CL009=Vl\u00E1kno je u\u017E spusten\u00E9
SHRC222=Trval\u00E9 pam\u00E4te cache zdie\u013Eanej triedy nemo\u017Eno vytvori\u0165/pou\u017Ei\u0165, ke\u010F\u017Ee mapovanie pam\u00E4te nepodporuje vy\u017Eadovan\u00E9 schopnosti
SHRC223=Trval\u00E9 pam\u00E4te cache zdie\u013Eanej triedy nemo\u017Eno vytvori\u0165/pou\u017Ei\u0165, ke\u010F\u017Ee uzamykanie s\u00FAboru nie je podporovan\u00E9
SHRC224=Nedostatok pam\u00E4te pre lok\u00E1lnu k\u00F3piu n\u00E1zvu pam\u00E4te cache
SHRC225=Nastala chyba pri z\u00EDskavan\u00ED cesty k s\u00FAboru pam\u00E4te cache
SHRC220=K\u00F3d chyby vrstvy Port\: %1$d
SHRC221=Chybov\u00E1 spr\u00E1va platformy\: %1$s
J9CL010=Vyhradenie JNIEnv zlyhalo
SHRC226=Chyba pri otv\u00E1ran\u00ED s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC227=Chyba pri z\u00EDskavan\u00ED z\u00E1mku z\u00E1pisu hlavi\u010Dky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC228=Chyba pri aktualiz\u00E1cii pam\u00E4te cache zdie\u013Eanej triedy po\u010Das posledn\u00E9ho pripojenia
SHRC229=Chyba\: s\u00FAbor pam\u00E4te cache zdie\u013Eanej triedy m\u00E1 neplatn\u00FA hlavi\u010Dku
J9CL015=Zlyhalo vytvorenie sledovania z\u00E1sobn\u00EDka (s najv\u00E4\u010D\u0161ou pravdepodobnos\u0165ou kv\u00F4li nedostatku pam\u00E4te OS)
J9CL016=nemo\u017Eno vytvori\u0165 nov\u00FA polo\u017Eku cesty k triedam
J9CL017=nemo\u017Eno vyhradi\u0165 pre prostriedok \u010Dasov\u00E9ho p\u00E1sma
J9CL018=nemo\u017Eno vyhradi\u0165 pre polo\u017Eku \u010Dasov\u00E9ho p\u00E1sma
J9CL011=Vytvorenie vl\u00E1kna OS rozdelen\u00EDm zlyhalo
J9CL012=
J9CL013=Vyhradenie monitora OS zlyhalo
J9CL014=Neplatn\u00FD argument pr\u00EDkazov\u00E9ho riadka JCL
SHRC690=Obmedzi\u0165 cesty k triedam \= true
SHRC211=H\u013Eadaj\u00FA sa bajtov\u00E9 \u00FAdaje pre k\u013E\u00FA\u010D %.*s v zdie\u013Eanej pam\u00E4ti cache...
SHRC695=Obnovi\u0165 nov\u00FA neperzistentn\u00FA zdie\u013Ean\u00FA pam\u00E4\u0165 cache zo sn\u00EDmky
SHRC212=Ukladaj\u00FA sa bajtov\u00E9 \u00FAdaje pre k\u013E\u00FA\u010D %.*s v zdie\u013Eanej pam\u00E4ti cache...
SHRC696=Podvo\u013Eby "%s" a "%s" s\u00FA nekompatibiln\u00E9. Podvo\u013Eba "%s" sa ignoruje
SHRC213=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre polo\u017Eku ha\u0161ovacej tabu\u013Eky v ByteDataManagerImpl
SHRC697=Zlyhalo z\u00EDskavanie adres\u00E1ra pre zdie\u013Ean\u00FA pam\u00E4\u0165 cache
SHRC214=Nemo\u017Eno vst\u00FApi\u0165 do mutexu ha\u0161ovacej tabu\u013Eky ByteDataManager
SHRC698=Neperzistentn\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache "%s" bola \u00FAspe\u0161ne obnoven\u00E1 zo sn\u00EDmky
SHRC691=Obmedzi\u0165 cesty k triedam \= false
SHRC692=Vytvori\u0165 sn\u00EDmku existuj\u00FAcej neperzistentnej zdie\u013Eanej pam\u00E4te cache
SHRC693=Zni\u010Di\u0165 sn\u00EDmku zdie\u013Eanej pam\u00E4te (pou\u017Ei\u0165 parameter n\u00E1zvu alebo predvolen\u00FA hodnotu)
SHRC210=[povolen\u00FD podrobn\u00FD v\u00FDstup bajtov\u00FDch \u00FAdajov -Xshareclasses]
SHRC694=Zni\u010Di\u0165 v\u0161etky sn\u00EDmky zdie\u013Eanej pam\u00E4te cache
SHRC219=[povolen\u00FD skupinov\u00FD pr\u00EDstup -Xshareclasses pre nov\u00E9 pam\u00E4te cache]
SHRC215=Vytvori\u0165 trval\u00FA pam\u00E4\u0165 cache zdie\u013Eanej triedy
SHRC699=Zlyhalo obnovovanie neperzistentnej zdie\u013Eanej pam\u00E4te cache "%s" zo sn\u00EDmky
SHRC216=Vytvori\u0165 nest\u00E1lu pam\u00E4\u0165 cache zdie\u013Eanej triedy
SHRC217=[povolen\u00E1 perzistentn\u00E1 pam\u00E4\u0165 cache -Xshareclasses]
SHRC218=[zak\u00E1zan\u00E1 perzistentn\u00E1 pam\u00E4\u0165 cache -Xshareclasses]
J9CL004=Nekompatibiln\u00E1 verzia kni\u017Enice tried. O\u010Dak\u00E1va sa JCL v%1$i, na\u0161lo sa v%2$i
J9CL005=Nekompatibiln\u00E1 verzia kni\u017Enice tried. Vy\u017Eaduje sa VM v%1$i, na\u0161lo sa v%2$i
J9CL006=\u017Diadne vopred overen\u00E9 \u00FAdaje pre java/lang/Object
J9CL007=hodnota \u010Dasov\u00E9ho limitu je z\u00E1porn\u00E1
J9CL000=Nekompatibiln\u00E1 kni\u017Enica tried
J9CL001=Sk\u00FAste program spusti\u0165 s -jcl\:%s
J9CL002=Triedy s\u00FA z kni\u017Enice inej ako J9, alebo je JXE nespr\u00E1vne zredukovan\u00E9
J9CL003=Nekompatibiln\u00E1 verzia kni\u017Enice tried\: JCL %1$x, VM %2$x
SHRC244=Chyba pri z\u00EDskavan\u00ED d\u013A\u017Eky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC245=Chyba pri mapovan\u00ED s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC246=Pripojila sa perzistentn\u00E1 pam\u00E4\u0165 cache pre zdie\u013Ean\u00E9 triedy %1$s
SHRC247=Chyba\: P\u00FAta\u010D hlavi\u010Dky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy je neplatn\u00FD
SHRC240=Chyba\: nie je mo\u017En\u00E9 z\u00EDska\u0165 z\u00E1mok z\u00E1pisu pripojenia s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC241=Chyba\: nie je mo\u017En\u00E9 vymaza\u0165 s\u00FAbor pam\u00E4te cache zdie\u013Eanej triedy
SHRC242=Chyba pri aktualiz\u00E1cii s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy po\u010Das posledn\u00E9ho oddelenia
SHRC243=Chyba pri uvo\u013Enen\u00ED z\u00E1mku \u010D\u00EDtania pripojenia s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC248=Chyba\: Verzia hlavi\u010Dky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy je neplatn\u00E1
SHRC249=Chyba\: \u00DArove\u0148 modifik\u00E1cie hlavi\u010Dky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy je neplatn\u00E1
SHRC233=Chyba pri vytv\u00E1ran\u00ED hlavi\u010Dky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC234=Chyba pri z\u00EDskavan\u00ED z\u00E1mku \u010D\u00EDtania pripojenia s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC235=Chyba pri uvo\u013Enen\u00ED z\u00E1mku \u010D\u00EDtania pripojenia s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC236=Vytvorila sa perzistentn\u00E1 pam\u00E4\u0165 cache pre zdie\u013Ean\u00E9 triedy %1$s
SHRC230=Nastala chyba pri inicializovan\u00ED hlavi\u010Dky \u00FAdajov zdie\u013Eanej pam\u00E4te cache
SHRC231=Chyba pri nastavovan\u00ED d\u013A\u017Eky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC232=Nie je mo\u017En\u00E9 vytvori\u0165 pam\u00E4\u0165 cache v re\u017Eime len na \u010D\u00EDtanie
SHRC237=Otvorila sa perzistentn\u00E1 pam\u00E4\u0165 cache pre zdie\u013Ean\u00E9 triedy %1$s
SHRC238=Chyba\: pam\u00E4\u0165 cache zdie\u013Eanej triedy nie je pripojen\u00E1
SHRC239=Chyba\: nie je mo\u017En\u00E9 z\u00EDska\u0165 z\u00E1mok z\u00E1pisu hlavi\u010Dky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC260=Zlyhalo vytvorenie oblasti v ByteDataManager
SHRC261=Povoli\u0165 podrobn\u00FD v\u00FDstup pre internovan\u00E9 re\u0165azce
SHRC266=[povolen\u00E9 pou\u017Eitie pam\u00E4te cache -Xshareclasses pre opakovane transformovan\u00E9 triedy]
SHRC267=Zak\u00E1za\u0165 pou\u017Eitie pam\u00E4te cache tried z bootclasspath
SHRC268=[zak\u00E1zan\u00E9 pou\u017Eitie pam\u00E4te cache -Xshareclasses pre polo\u017Eky bootclasspath]
SHRC269=Syst\u00E9m nepodporuje ochranu pam\u00E4\u0165ovej str\u00E1nky
SHRC262=Bajty \u00FAdajov       \= %d
SHRC263=Povoli\u0165 podrobn\u00E9 str\u00E1nky CompositeCache
SHRC264=Oblasti pam\u00E4te cache nezaokr\u00FAh\u013Eova\u0165 na hranice str\u00E1nky
SHRC265=Triedy pam\u00E4te cache, ktor\u00E9 sa opakovane transformovali prostredn\u00EDctvom JVMTI
EXEL013=\  -Xmn<x>         nastavenie ve\u013Ekosti nov\u00E9ho priestoru na <x>
EXEL014=\  -Xmn<x>         nastavenie po\u010Diato\u010Dnej/maxim\u00E1lnej ve\u013Ekosti nov\u00E9ho priestoru na <x>
EXEL015=\  -Xmns<x>        nastavenie po\u010Diato\u010Dnej ve\u013Ekosti nov\u00E9ho priestoru na <x>
EXEL016=\  -Xmnx<x>        nastavenie maxim\u00E1lnej ve\u013Ekosti nov\u00E9ho priestoru na <x>
EXEL017=\  -Xmo<x>         nastavenie ve\u013Ekosti star\u00E9ho priestoru na <x>
EXEL018=\  -Xmo<x>         nastavenie po\u010Diato\u010Dnej/maxim\u00E1lnej ve\u013Ekosti star\u00E9ho priestoru na <x>
EXEL019=\  -Xmos<x>        nastavenie po\u010Diato\u010Dnej ve\u013Ekosti star\u00E9ho priestoru na <x>
EXEL010=Ber\u00FA sa do \u00FAvahy aj hodnoty s pr\u00EDponou "k" (kilo) alebo "m" (mega). \n
EXEL011=\  -Xmca<x>        nastavenie pr\u00EDrastku segmentu tried RAM na <x>
EXEL012=\  -Xmco<x>        nastavenie pr\u00EDrastku segmentu tried ROM na <x>
SHRC250=Pam\u00E4\u0165 cache nemo\u017Eno otvori\u0165 len na \u010D\u00EDtanie, preto\u017Ee e\u0161te nebola inicializovan\u00E1
SHRC255=Chyba pri aktualiz\u00E1cii s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy po\u010Das posledn\u00E9ho oddelenia pri ukon\u010Den\u00ED JVM
SHRC256=Trval\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache "%1$s" bola zru\u0161en\u00E1
SHRC257=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre polo\u017Eku pripojen\u00E9ho zoznamu v spr\u00E1vcovi
SHRC258=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre polo\u017Eku ha\u0161ovacej tabu\u013Eky v spr\u00E1vcovi
SHRC251=Automaticky nevymaz\u00E1va\u0165 pam\u00E4te cache z r\u00F4znych identifik\u00E1torov zostavenia
SHRC252=Chyba pri vyh\u013Ead\u00E1van\u00ED v s\u00FAbore pam\u00E4te cache zdie\u013Eanej triedy
SHRC253=Chyba pri z\u00E1pise hlavi\u010Dky do s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC254=Chyba pri nastavovan\u00ED d\u013A\u017Eky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
EXEL002=\  -Xbootclasspath/p\:<cesta> pred classpath pre zavedenie sa vlo\u017E\u00ED <cesta>
EXEL003=\  -Xbootclasspath/a\:<cesta> ku classpath pre zavedenie sa prid\u00E1 <cesta>
EXEL004=\n  -Xrun<kni\u017Enica>[\:vo\u013Eby]  na\u010D\u00EDta\u0165 nat\u00EDvnu kni\u017Enicu agenta\n                            (neschv\u00E1len\u00E9 v prospech -agentlib)\n
EXEL005=\  -Xint           vykona\u0165 len interpretovanie (ekvivalent -Xnojit -Xnoaot)
SHRC259=Nie je mo\u017En\u00E9 zada\u0165 mutex ha\u0161ovacej tabu\u013Eky spr\u00E1vcu
EXEL006=\  -Xnojit         deaktivovnie JIT
EXEL007=\  -Xnoaot         nevykon\u00E1va\u0165 predkompilovan\u00FD k\u00F3d
EXEL008=\  -Xfuture        povolenie striktnej\u0161\u00EDch kontrol, predpoklad bud\u00FAcej predvolenej hodnoty
EXEL009=\nArgumenty pre tieto vo\u013Eby sa vyjadruj\u00FA v bajtoch.
EXEL000=Tieto vo\u013Eby nie s\u00FA \u0161tandardn\u00E9 a m\u00F4\u017Eu sa zmeni\u0165 bez ozn\u00E1menia. \n
EXEL001=\  -Xbootclasspath\:<cesta>   nastavenie classpath pre zavedenie na <cesta>
SHRC280=Vyp\u00EDsanie zoznamu v\u0161etk\u00FDch pam\u00E4t\u00ED cache v cacheDir %s
SHRC281=Pokus o zru\u0161enie v\u0161etk\u00FDch pam\u00E4t\u00ED cache v cacheDir %s
SHRC282=Ve\u013Ekos\u0165 str\u00E1nky opera\u010Dn\u00E9ho syst\u00E9mu je nekompatibiln\u00E1 s touto pam\u00E4\u0165ou cache. Prebieha pokus o op\u00E4tovn\u00E9 vytvorenie pam\u00E4te cache.
SHRC283=Otvorte pam\u00E4\u0165 cache s opr\u00E1vneniami len na \u010D\u00EDtanie
SHRC288=ID zdie\u013Eanej pam\u00E4te \= %d
SHRC289=Nezis\u0165ova\u0165, ke\u010F je pam\u00E4\u0165 cache umiestnen\u00E1 vo vzdialenom sie\u0165ovom s\u00FAborovom syst\u00E9me
SHRC284=Nie je mo\u017En\u00E9 vytvori\u0165 pam\u00E4\u0165 cache v re\u017Eime len na \u010D\u00EDtanie
SHRC285=Otvoren\u00E1 zdie\u013Ean\u00E1 trval\u00E1 pam\u00E4\u0165 cache triedy len na \u010D\u00EDtanie %1$s
SHRC286=Otvoren\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache triedy len na \u010D\u00EDtanie %1$s
SHRC287=Perzistentn\u00FA pam\u00E4\u0165 cache nemo\u017Eno n\u00E1js\u0165 v sie\u0165ovom s\u00FAborovom syst\u00E9me. Bu\u010F vyberte vo\u013Ebu "nonpersistent", alebo in\u00E9 cacheDir.
EXEL035=\  -Xminf<x>       minim\u00E1lna percentu\u00E1lna hodnota vo\u013Enej kopy po GC
EXEL036=\  -Xmaxf<x>       maxim\u00E1lna percentu\u00E1lna hodnota vo\u013Enej kopy po GC
EXEL037=\nArgumenty pre tieto vo\u013Eby sa vyjadruj\u00FA ako desiatkov\u00E9 \u010D\u00EDsla.\n
EXEL038=\  -Xgcthreads<x>                nastavenie po\u010Dtu vl\u00E1kien GC
EXEL039=\  -Xnoclassgc                   deaktivovanie dynamick\u00E9ho ru\u0161enia zavedenia tried
EXEL030=\  -Xss<x>         nastavenie ve\u013Ekosti z\u00E1sobn\u00EDka vl\u00E1kien na <x>
EXEL031=\  -Xmine<x>       nastavenie minim\u00E1lnej ve\u013Ekosti pre roz\u0161\u00EDrenie kopy na <x>
EXEL032=\  -Xmaxe<x>       nastavenie maxim\u00E1lnej ve\u013Ekosti pre roz\u0161\u00EDrenie kopy na <x>
EXEL033=\nArgumenty pre tieto vo\u013Eby sa vyjadruj\u00FA ako desatinn\u00E9 hodnoty od 0 do 1.
EXEL034=Hodnota 0.3 reprezentuje po\u017Eiadavku o 30%%\n
SHRC270=Konfigurova\u0165 ochranu pam\u00E4\u0165ovej str\u00E1nky pam\u00E4te cache
SHRC271=Nerozpoznan\u00E1 podvo\u013Eba pre vo\u013Ebu mprotect\=
SHRC272=\u00DApln\u00E1 ochrana pam\u00E4\u0165ovej str\u00E1nky \u00FAspe\u0161ne povolen\u00E1 pre pam\u00E4\u0165 cache
SHRC277=Ak chcete spusti\u0165 pomocn\u00FD program "%s" na neperzistentnej zdie\u013Eanej pam\u00E4ti cache "%s", mus\u00EDte tie\u017E pou\u017Ei\u0165 podvo\u013Ebu "nonpersistent"
SHRC278=Upozor\u0148ujeme, \u017Ee pomocn\u00FD program "%s" nem\u00F4\u017Ee fungova\u0165 v nekompatibilnej pam\u00E4ti cache triedy "%s". Pou\u017Eite JVM na spr\u00E1vnej \u00FArovni.
SHRC279=Znova vytvori\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 cache pri spusten\u00ED
SHRC273=Predvolen\u00E1 ochrana pam\u00E4\u0165ovej str\u00E1nky \u00FAspe\u0161ne povolen\u00E1 pre pam\u00E4\u0165 cache
SHRC274=Ochrana pam\u00E4\u0165ovej str\u00E1nky zak\u00E1zan\u00E1 pre pam\u00E4\u0165 cache
SHRC275=Nastavi\u0165 umiestnenie s\u00FAborov pam\u00E4te cache JVM
SHRC276=Ak chcete spusti\u0165 pomocn\u00FD program "%s" v trvalej pam\u00E4ti cache triedy "%s", nepou\u017E\u00EDvajte podvo\u013Ebu "nonpersistent"
EXEL024=\  -Xmx<x>         nastavenie maxim\u00E1lnej ve\u013Ekosti pam\u00E4te na <x>
EXEL025=\  -Xmr<x>         nastavenie ve\u013Ekosti ulo\u017Eenej mno\u017Einy na <x>
EXEL026=\  -Xmrx<x>        nastavenie maxim\u00E1lnej ve\u013Ekosti ulo\u017Eenej mno\u017Einy na <x>
EXEL027=\  -Xmso<x>        nastavenie ve\u013Ekosti z\u00E1sobn\u00EDka vl\u00E1kien OS na <x>
EXEL028=\  -Xiss<x>        nastavenie po\u010Diato\u010Dnej ve\u013Ekosti z\u00E1sobn\u00EDka vl\u00E1kien Java na <x>
EXEL029=\  -Xss<x>         nastavenie maxim\u00E1lnej ve\u013Ekosti z\u00E1sobn\u00EDka vl\u00E1kien Java na <x>
EXEL020=\  -Xmox<x>        nastavenie maxim\u00E1lnej ve\u013Ekosti star\u00E9ho priestoru na <x>
EXEL021=\  -Xmoi<x>        nastavenie pr\u00EDrastku pre star\u00FD priestor na <x>
EXEL022=\  -Xms<x>         nastavenie ve\u013Ekosti star\u00E9ho priestoru na <x>
EXEL023=\  -Xms<x>         nastavenie po\u010Diato\u010Dnej ve\u013Ekosti pam\u00E4te na <x>
EXEL057=
EXEL058=Intern\u00E1 chyba VM\: Nedostatok pam\u00E4te
EXEL059=Intern\u00E1 chyba VM\: Nebolo mo\u017En\u00E9 n\u00E1js\u0165 triedu java/lang/String
EXEL050=\  -Xrdbginfo\:<host>\:<port>      povoli\u0165 vzdialen\u00FD informa\u010Dn\u00FD server ladenia
EXEL051=\nUPOZORNENIE\: Argument pr\u00EDkazov\u00E9ho riadka "%s" je zastaral\u00FD. \nVAROVANIE\: Pou\u017Eitie "-classpath <cesta>" alebo "-cp <cesta>".
EXEL052=\nUPOZORNENIE\: Argument pr\u00EDkazov\u00E9ho riadka "%s" je zastaral\u00FD. \nUPOZORNENIE\: Pou\u017Eite ekvivalent -X.
EXEL053=
EXEL054=
EXEL055=Cie\u013E\: %s
EXEL056=
SHRC291=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre polo\u017Eku ha\u0161ovacej tabu\u013Eky v ROMClassResourceManager
SHRC292=Nemo\u017Eno vst\u00FApi\u0165 do mutexu ha\u0161ovacej tabu\u013Eky ROMClassResourceManager
SHRC293=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 pre oblas\u0165 polo\u017Eiek ha\u0161ovacej tabu\u013Eky v ROMClassResourceManager
SHRC294=%1$d\: 0x%2$p CHARARRAY\: na 0x%3$p.
SHRC290=Zlyhalo vytv\u00E1ranie novej polo\u017Eky ha\u0161ovacej tabu\u013Eky v ROMClassResourceManager
SHRC299=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre triedy "%s" sa nevytvorila s vo\u013Ebou vnorenia a pam\u00E4\u0165 cache nemo\u017Eno zv\u00E4\u010D\u0161i\u0165
SHRC295=Vypn\u00FA\u0165 z\u00E1vislos\u0165 ma\u0165 CORE_MMAP v AIX
SHRC296=Spustenie s vo\u013Ebou "noCoreMmap" bude znamena\u0165, \u017Ee spolo\u010Dnos\u0165 IBM v\u00E1m pravdepodobne nepom\u00F4\u017Ee pri hav\u00E1ri\u00E1ch, preto\u017Ee \u00FAdaje triedy nebud\u00FA obsahova\u0165 syst\u00E9mov\u00E9 v\u00FDpisy
SHRC297=Ak chcete pou\u017E\u00EDva\u0165 perzistentn\u00E9 pam\u00E4te cache pre zdie\u013Ean\u00E9 triedy v opera\u010Dnom syst\u00E9me AIX, premenn\u00E1 prostredia CORE_MMAP mus\u00ED by\u0165 nastaven\u00E1 na hodnotu "yes"
SHRC298=Ak chcete spusti\u0165 pomocn\u00FD program "%s" na perzistentnej pam\u00E4ti cache pre triedy "%s", pou\u017Eite podvo\u013Ebu "persistent"
EXEL046=\  -Xlp                          povolenie podpory ve\u013Ek\u00FDch str\u00E1nok
EXEL047=\n  -Xdbg\:<vo\u013Eby>               povolenie ladenia, \u0161tandardn\u00E9 vo\u013Eby JDWP
EXEL048=\  -Xrunjdwp\:<vo\u013Eby>           povolenie ladenia, \u0161tandardn\u00E9 vo\u013Eby JDWP
EXEL049=\  -Xdbginfo\:<cesta k s\u00FAboru so symbolmi> povolenie servera ladiacich inform\u00E1ci\u00ED
EXEL040=\  -Xclassgc                     povolenie dynamick\u00E9ho ru\u0161enia zavedenia tried
EXEL041=\  -Xalwaysclassgc               povolenie dynamick\u00E9ho ru\u0161enia zavedenia tried pri ka\u017Edom GC
EXEL042=\  -Xnocompactexplicitgc         deaktivovanie kompakcie pri syst\u00E9movom GC
EXEL043=\  -Xcompactexplicitgc           povolenie kompakcie pri ka\u017Edom syst\u00E9movom GC
EXEL044=\  -Xcompactgc                   povolenie kompakcie
EXEL045=\  -Xnocompactgc                 deaktivovanie kompakcie
SHRC192=Hodnota -Xscmaxaot je v\u00E4\u010D\u0161ia ako hodnota -Xscmx a preto bola nastaven\u00E1 na neobmedzen\u00FA
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC194=\tpre ROMClass %2$.*1$s na 0x%3$p.
SHRC195=Povoli\u0165 podrobn\u00FD v\u00FDstup AOT
SHRC190=Hodnota -Xscminaot by nemala by\u0165 v\u00E4\u010D\u0161ia ako hodnota -Xscmaxaot
SHRC191=Hodnota -Xscminaot je v\u00E4\u010D\u0161ia ako hodnota -Xscmx a preto bola nastaven\u00E1 na rovnak\u00FA hodnotu -Xscmx
SHRC196=[povolen\u00FD podrobn\u00FD v\u00FDstup AOT -Xshareclasses]
SHRC197=H\u013Ead\u00E1 sa k\u00F3d AOT pre ROMMethod 0x%1$p v zdie\u013Eanej pam\u00E4ti cache...
SHRC198=Uklad\u00E1 sa k\u00F3d AOT pre ROMMethod 0x%1$p v zdie\u013Eanej pam\u00E4ti cache...
SHRC199=\ Ukladanie %2$.*1$s bolo \u00FAspe\u0161n\u00E9.
TRCE020=Uplynul \u010Dasov\u00FD limit po\u010Das ukon\u010Dovania sledovacieho mechanizmu
JNCK097=\tadvice         zobrazi\u0165 odpor\u00FA\u010Danie
JNCK098=Chyba JNI v %1$s\: argument \#%2$d o\u010Dak\u00E1va %3$s %4$s, skuto\u010Dn\u00FD argument je %5$s %6$s
JNCK095=Chyba JNI vo vr\u00E1tenej hodnote\: typ n\u00E1vratu je referencia, ale hodnota (0x%1$p) nie je platn\u00E1 referencia na objekt. Jej typ je\: %2$s
JNCK096=\twarn           zobrazi\u0165 varovania
JNCK099=Chyba JNI v %1$s\: argument \#%2$d vy\u017Eaduje typ in\u00FD ako pole
JNCK090=Zistilo sa varovanie v r\u00E1mci obslu\u017En\u00E9ho programu udalosti JVMPI alebo JVMTI\n
JNCK093=Chyba JNI v %s\: Met\u00F3da nie je kon\u0161truktor
JNCK094=Chyba JNI v %1$s\: \u00DAdaje, na ktor\u00E9 ukazuje argument \#%2$d, boli zmenen\u00E9 po\u010Das vykon\u00E1vania %3$s. \u00DAdaje mohlo zmeni\u0165 in\u00E9 vl\u00E1kno alebo vnoren\u00E9 volanie. V\u00FDsledok %4$s m\u00F4\u017Ee by\u0165 nespr\u00E1vny a VM sa m\u00F4\u017Ee sta\u0165 nestabiln\u00FDm.
JNCK091=Zistilo sa odpor\u00FA\u010Danie v r\u00E1mci obslu\u017En\u00E9ho programu udalosti JVMPI alebo JVMTI\n
JNCK092=\tvalist         skontrolova\u0165 opakovan\u00E9 pou\u017Eitie va_list
JNCK086=Varovanie JNI v %1$s\: Argument \#%2$d nie je java/nio/Buffer. %3$s vr\u00E1ti k\u00F3d chyby
JNCK087=Chyba JNI v %1$s\: Argument \#%2$d nie je java/lang/reflect/Method alebo java/lang/reflect/Constructor
JNCK084=Pre JNI_OnLoad kni\u017Enice %.*s sa zistilo upozornenie\n
JNCK085=Pre JNI_OnLoad kni\u017Enice %.*s sa zistilo odpor\u00FA\u010Danie\n
JNCK088=Varovanie JNI v %1$s\: Argument \#%2$d je slab\u00FD odkaz. Zo slab\u00E9ho odkazu sa m\u00F4\u017Ee kedyko\u013Evek sta\u0165 NULL. Dan\u00FD odkaz by sa mal e\u0161te pred volan\u00EDm %3$s podpori\u0165 prostredn\u00EDctvom NewLocalRef alebo NewGlobalRef a potom porovna\u0165 s NULL
JNCK089=Nastala chyba v r\u00E1mci obslu\u017En\u00E9ho programu udalosti JVMPI alebo JVMTI\n
CFRE020=PC za\u010Diatku obslu\u017En\u00E9ho programu v\u00FDnimky je neplatn\u00E9
CFRE021=duplicitn\u00E9 pole
CFRE022=thisClass mus\u00ED by\u0165 trieda
CFRE023=oblas\u0165 kon\u0161t\u00E1nt je pr\u00E1zdna
CFRE024=n\u00E1zov triedy mus\u00ED by\u0165 re\u0165azec
CFRE025=pole m\u00E1 dva atrib\u00FAty ConstantValue
CFRE026=typ bajtov\u00E9ho k\u00F3du newarray je nezn\u00E1my
CFRE027=bajtov\u00FD k\u00F3d multianewarray mus\u00ED referencova\u0165 triedu po\u013Ea
CFRE017=viacero atrib\u00FAtov StackMap/StackMapTable
CFRE018=vn\u00FAtorn\u00E1 trieda mus\u00ED by\u0165 trieda
CFRE019=neplatn\u00FD za\u010Diatok PC lok\u00E1lnej premennej
CFRE031=vygenerovan\u00E1 v\u00FDnimka mus\u00ED by\u0165 trieda
CFRE032=supertrieda rozhrania mus\u00ED by\u0165 java.lang.Object
CFRE033=rozsah obslu\u017En\u00E9ho programu v\u00FDnimky je pr\u00E1zdny
CFRE034=ne\u00FApln\u00FD bajtov\u00FD k\u00F3d
CFRE035=nov\u00FD bajtov\u00FD k\u00F3d mus\u00ED odkazova\u0165 na triedu
CFRE036=cie\u013E nie je in\u0161trukcia v bajtovom k\u00F3de skoku
CFRE037=temp obsahuje nespr\u00E1vny typ
CFRE038=met\u00F3da m\u00E1 dva atrib\u00FAty Exceptions
CFRE030=supertrieda s hodnotou null
CFRE028=bajtov\u00FD k\u00F3d ldc* mus\u00ED referencova\u0165 kon\u0161tantu
CFRE029=bajtov\u00FD k\u00F3d multianewarray mus\u00ED referencova\u0165 triedu
CFRE000=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u
CFRE001=%1$s; trieda \= %3$.*2$s, posunutie \= %4$u
CFRE002=neplatn\u00FD n\u00E1zov met\u00F3dy
CFRE003=nespr\u00E1vna hlavn\u00E1 verzia
CFRE004=nezn\u00E1my bajtov\u00FD k\u00F3d
CFRE005=duplicitn\u00E9 rozhranie
CFRE010=z\u00E1porn\u00FD po\u010Det pre p\u00E1ry zhody a posunutia v bajtovom k\u00F3de lookupswitch
CFRE011=bajtov\u00FD k\u00F3d anewarray mus\u00ED referencova\u0165 triedu
CFRE012=kon\u0161tantn\u00E1 hodnota mus\u00ED by\u0165 hodnota
CFRE013=neplatn\u00E1 d\u013A\u017Eka PC lok\u00E1lnej premennej
CFRE014=atrib\u00FAt Code zadan\u00FD len pre nat\u00EDvnu alebo abstraktn\u00FA met\u00F3du
CFRE015=rozhrania musia by\u0165 triedy
CFRE016=index lok\u00E1lnej premennej je mimo rozsahu v pr\u00EDrastku
CFRE006=neplatn\u00FD atrib\u00FAt StackMap/StackMapTable
CFRE007=neplatn\u00FD podpis po\u013Ea
CFRE008=v bajtovom k\u00F3de tableswitch je v\u00E4\u010D\u0161ia hodnota < men\u0161ia hodnota
CFRE009=pole rozhrania mus\u00ED by\u0165 statick\u00E9 a kone\u010Dn\u00E9
CFRE064=popisova\u010D mus\u00ED by\u0165 re\u0165azec UTF8
CFRE065=viacero atrib\u00FAtov uzatv\u00E1racej met\u00F3dy
CFRE066=viacero atrib\u00FAtov InnerClasses
CFRE067=nezn\u00E1ma zna\u010Dka polo\u017Eky oblasti kon\u0161t\u00E1nt
CFRE068=n\u00E1zov triedy je neplatn\u00FD
CFRE069=d\u013A\u017Eka atrib\u00FAtu je v\u00E4\u010D\u0161ia ako \u00FAdaje atrib\u00FAtu
CFRE060=PC konca obslu\u017En\u00E9ho programu v\u00FDnimky nie je in\u0161trukcia alebo koniec po\u013Ea bajtov\u00E9ho k\u00F3du
CFRE061=n\u00E1zov mus\u00ED by\u0165 re\u0165azec UTF8
CFRE062=maximum lok\u00E1lov je men\u0161ie ako ve\u013Ekos\u0165 argumentov
CFRE063=bajtov\u00FD k\u00F3d vyvolania vol\u00E1 neplatn\u00FA met\u00F3du
JNCK039=Chyba JNI v %1$s\: Argument \#%2$d m\u00E1 hodnotu NULL
JNCK037=Chyba JNI v %1$s\: Argument \#%2$d (0x%3$p) nie je lok\u00E1lna referencia. Jeho typ je\: %4$s
JNCK038=Chyba JNI v %1$s\: Argument \#%2$d (0x%3$p) nie je platn\u00E1 referencia na objekt. Jeho typ je\: %4$s\n
JNCK031=Chyba JNI v %1$s\: Argument \#%2$d m\u00E1 hodnotu NULL
JNCK032=Chyba JNI v %1$s\: Argument \#%2$d nie je jobjectArray
JNCK030=Chyba JNI v %s\: T\u00FAto funkciu nemo\u017Eno zavola\u0165, k\u00FDm je zak\u00E1zan\u00E9 GC (pravdepodobne bola volan\u00E1 z udalosti JVMPI alebo JVMTI)
JNCK035=Chyba JNI v %1$s\: Argument \#%2$d (0x%3$p) nie je glob\u00E1lna referencia. Jeho typ je\: %4$s
JNCK036=Chyba JNI v %1$s\: Argument \#%2$d (0x%3$p) nie je slab\u00E1 glob\u00E1lna referencia. Jeho typ je\: %4$s
JNCK033=Chyba JNI v %1$s\: Argument \#%2$d nie je jarray
JNCK034=Chyba JNI v %1$s\: Argument \#%2$d nie je %3$s
CFRE075=neplatn\u00FD podpis lok\u00E1lnej premennej
CFRE076=nespr\u00E1vne magick\u00E9 \u010D\u00EDslo
CFRE077=rozhrania musia by\u0165 abstraktn\u00E9
CFRE078=index triedy uzatv\u00E1racej met\u00F3dy mus\u00ED referencova\u0165 triedu
CFRE079=PC obslu\u017En\u00E9ho programu v\u00FDnimky je neplatn\u00E9
CFRE070=neplatn\u00E9 PC \u010D\u00EDsla riadka
CFRE071=pole bajtov\u00FDch k\u00F3dov je pr\u00E1zdne
CFRE072=polo\u017Eky nie s\u00FA zoraden\u00E9 v bajtovom k\u00F3de lookupswitch
CFRE073=atrib\u00FAt StackMap/StackMapTable bol vyh\u013Eadan\u00FD mimo atrib\u00FAtu Code
CFRE074=nebol zadan\u00FD \u017Eiadny atrib\u00FAt Code
JNCK028=Chyba JNI v %s\: T\u00FAto funkciu nie je mo\u017En\u00E9 vola\u0165, ke\u010F je nevybaven\u00E1 v\u00FDnimka
JNCK029=Chyba JNI v %s\: T\u00FAto funkciu nie je mo\u017En\u00E9 vola\u0165 vn\u00FAtri kritickej \u010Dasti
JNCK026=Chyba JNI v %s\: Zd\u00E1 sa, \u017Ee JNIEnv nie je platn\u00E9 vl\u00E1kno, alebo pam\u00E4\u0165 bola po\u0161koden\u00E1, alebo toto nie je virtu\u00E1lny po\u010D\u00EDta\u010D J9
JNCK027=Chyba JNI v %s\: JNIEnv nie je JNIEnv pre akt\u00EDvne vl\u00E1kno
JNCK020=referencia pre ladiaci program
JNCK021=lok\u00E1lna referencia v inom vl\u00E1kne
JNCK024=Zistila sa chyba JNI. Zru\u0161enie.
JNCK025=Ak chcete pokra\u010Dova\u0165 pri zisten\u00ED ch\u00FDb, pou\u017Eite -Xcheck\:jni\:nonfatal.
JNCK022=uvo\u013Enen\u00E1 lok\u00E1lna referencia
JNCK023=Zistila sa chyba JNI. Pokra\u010Dovanie...
CFRE042=ve\u013Ekos\u0165 po\u013Ea bajtov\u00E9ho k\u00F3du > 65535
CFRE043=bajtov\u00FD k\u00F3d nem\u00F4\u017Ee by\u0165 \u0161irok\u00FD
CFRE044=bajtov\u00FD k\u00F3d invokeinterface vyhradil in\u00FD ako nulov\u00FD slot
CFRE045=index oblasti kon\u0161t\u00E1nt je mimo rozsahu
CFRE046=nespr\u00E1vna v\u00FDpl\u0148 bajtov\u00E9ho k\u00F3du prep\u00EDna\u010Da
CFRE047=trieda rozhrania m\u00F4\u017Ee by\u0165 iba verejn\u00E1, abstraktn\u00E1 alebo anot\u00E1cia
CFRE048=index lok\u00E1lnej premennej je mimo rozsahu pri ukladan\u00ED
CFRE049=bajtov\u00FD k\u00F3d checkcast mus\u00ED referencova\u0165 triedu
CFRE040=d\u013A\u017Eka atrib\u00FAtu je men\u0161ia ako \u00FAdaje atrib\u00FAtu
CFRE041=nespr\u00E1vna ved\u013Eaj\u0161ia verzia
JNCK017=lok\u00E1lna referencia
JNCK018=glob\u00E1lna referencia
JNCK015=\thelp           vytla\u010D\u00ED t\u00FAto obrazovku
JNCK016=NULL
JNCK019=slab\u00E1 glob\u00E1lna referencia
CFRE039=index lok\u00E1lnej premennej je mimo rozsahu pri na\u010D\u00EDtavan\u00ED
JNCK010=\tnonfatal       neukon\u010Di\u0165 pri zisten\u00ED ch\u00FDb
JNCK013=\tnovalist       nekontrolova\u0165 op\u00E4tovn\u00E9 pou\u017Eitie va_list
JNCK014=\tpedantic       vykon\u00E1va\u0165 d\u00F4kladnej\u0161ie ale pomal\u0161ie kontroly
JNCK011=\tnowarn         nezobrazi\u0165 varovania
JNCK012=\tnoadvice       nezobrazi\u0165 radu
CFRE053=met\u00F3da m\u00E1 viac ako 255 slotov argumentov
CFRE054=bajtov\u00FD k\u00F3d po\u013Ea mus\u00ED odkazova\u0165 na Fieldref
CFRE055=PC konca obslu\u017En\u00E9ho programu v\u00FDnimky je neplatn\u00E9
CFRE056=po\u010Det argumentov bajtov\u00E9ho k\u00F3du invokeinterface je nespr\u00E1vny
CFRE057=typ obslu\u017En\u00E9ho programu v\u00FDnimky mus\u00ED by\u0165 trieda
CFRE058=index lok\u00E1lnej premennej je mimo rozsahu v n\u00E1vrate z podrutiny
CFRE059=PC obslu\u017En\u00E9ho programu v\u00FDnimky nie je in\u0161trukcia
CFRE050=met\u00F3da rozhrania mus\u00ED by\u0165 verejn\u00E1 a abstraktn\u00E1
CFRE051=re\u0165azcov\u00E1 kon\u0161tanta mus\u00ED by\u0165 re\u0165azec
CFRE052=vonkaj\u0161ia trieda mus\u00ED by\u0165 trieda
JNCK006=\tall            skontrolova\u0165 v\u0161etky aplik\u00E1cie a syst\u00E9mov\u00E9 triedy
JNCK007=\tverbose        sledova\u0165 ur\u010Dit\u00E9 funkcie a aktivity JNI
JNCK004=jnichk - JNI Check utility for J9, verzia %s
JNCK005=Pou\u017Eitie\: -Xcheck\:jni\:[vo\u013Eba[,vo\u013Eba[,...]]]
JNCK008=\ttrace          sledova\u0165 v\u0161etky funkcie JNI
JNCK009=\tnobounds       nevykona\u0165 kontrolu hran\u00EDc v re\u0165azcoch a poliach
JNCK002=N\u00E1stroj na kontrolu JNI\: ned\u00E1 sa vytvori\u0165 zah\u00E1knutie pre udalos\u0165
JNCK003=N\u00E1stroj na kontrolu JNI\: ned\u00E1 sa vyhradi\u0165 lok\u00E1lna pam\u00E4\u0165 pre VM
JNCK000=-Xcheck\:jni\: nezn\u00E1ma vo\u013Eba --> '%s'
JNCK001=N\u00E1stroj na kontrolu JNI je nain\u0161talovan\u00FD. Ak chcete opis pou\u017Eitia, zadajte -Xcheck\:jni\:help
JNCK082=Pre krajn\u00FD r\u00E1mec pripojen\u00E9ho vl\u00E1kna sa zistilo odpor\u00FA\u010Danie\n
JNCK083=V JNI_OnLoad kni\u017Enice %.*s sa zistila chyba\n
JNCK080=V krajnom r\u00E1mci pripojen\u00E9ho vl\u00E1kna sa zistila chyba\n
JNCK081=Pre krajn\u00FD r\u00E1mec pripojen\u00E9ho vl\u00E1kna sa zistilo upozornenie\n
SHRC604=Rezervova\u0165 <ve\u013Ekos\u0165> bajtov priestoru pam\u00E4te cache pre nov\u00E9 \u00FAdaje nespracovanej triedy
TRCE009=Nastala chyba pri zapisovan\u00ED do s\u00FAboru sn\u00EDmky.
SHRC605=Ve\u013Ekos\u0165 pam\u00E4te pre "%s" je prive\u013Ek\u00E1 alebo ur\u010Duje jednotky in\u00E9 ako 'K','M' alebo 'G'.
TRCE008=Nastala chyba pri pos\u00FAvan\u00ED v s\u00FAbore sledovania\: %s
SHRC606=Prida\u0165 nefunk\u010Dn\u00E9 rady JIT do met\u00F3d pre testovanie; pou\u017Eite s -Xint a vopred zaplnenou pam\u00E4\u0165ou cache.
SHRC607=Ulo\u017Eilo sa %1$s pripojen\u00FDch \u00FAdajov %2$s pre %8$.*7$s.%4$.*3$s%6$.*5$s
SHRC600=Oblas\u0165 \u00FAdajov nespracovanej triedy je po\u0161koden\u00E1, preto\u017Ee ulo\u017Eenie %u bajtov prekro\u010D\u00ED dostupn\u00FD vo\u013En\u00FD priestor v oblasti ('za\u010Diatok vo\u013En\u00E9ho priestoru'\=%p, 'koniec vo\u013En\u00E9ho priestoru'\=%p).
SHRC601=Ve\u013Ekos\u0165 oblasti \u00FAdajov nespracovanej triedy      %*c\= %lu
SHRC602=Pou\u017Eit\u00E9 %% oblasti \u00FAdajov nespracovanej tried   %*c\= %lu%%
SHRC603=Pou\u017Eit\u00E9 bajty oblasti \u00FAdajov nespracovanej triedy      %*c\= %lu
JNCK075=Intern\u00E1 chyba jnichk v %1$s\: nezn\u00E1my popisova\u010D 0x%2$x
TRCE001=Nastala chyba pri sprac\u00FAvan\u00ED vo\u013Eby sledovania\: -Xtrace\:%s
JNCK076=Intern\u00E1 chyba jnichk v %s\: nedostatok pam\u00E4te
TRCE000=Nezn\u00E1ma vo\u013Eba sledovania\: -Xtrace\:%s
JNCK073=Odpor\u00FA\u010Danie JNI v %1$s\: je zadan\u00E9 JNI_ABORT, ale nemo\u017Eno to akceptova\u0165, preto\u017Ee \u00FAdaje s\u00FA upraven\u00E9.\n(P\u00F4vodn\u00E9 CRC \= 0x%2$x, nov\u00E9 CRC \= 0x%3$x).\nMet\u00F3da %4$s vr\u00E1tila skuto\u010Dn\u00FD obsah po\u013Ea, preto sa zmeny zru\u0161ia. Mo\u017Eno to nie je to, \u010Do ste zam\u00FD\u0161\u013Eali.
TRCE003=Nastala chyba pri sprac\u00FAvan\u00ED vo\u013Eby sledovania, podrobnosti\: %s
JNCK074=Odpor\u00FA\u010Danie pre JNI v %s\: Pam\u00E4\u0165ov\u00FD blok sa jav\u00ED ako nemodifikovan\u00FD. Zv\u00E1\u017Ete pou\u017Eitie JNI_ABORT namiesto re\u017Eimu 0.
TRCE002=Nastala chyba pri sprac\u00FAvan\u00ED vo\u013Eby sledovania\: -Xtrace\:%s\=%s
TRCE005=Nastala chyba pri zapisovan\u00ED hlavi\u010Dky do s\u00FAboru sledovania\: %s
SHRC608=Na\u0161lo sa %1$s pripojen\u00FDch \u00FAdajov %2$s pre %8$.*7$s.%4$.*3$s%6$.*5$s
JNCK079=Zistilo sa odpor\u00FA\u010Danie v %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE004=Nastala chyba pri otv\u00E1ran\u00ED s\u00FAboru sledovania\: %s
SHRC609=Aktualizovalo sa %1$s pripojen\u00FDch \u00FAdajov %2$s pre %8$.*7$s.%4$.*3$s%6$.*5$s
TRCE007=Nastala chyba pri otv\u00E1ran\u00ED generovania \u010Fal\u0161ieho s\u00FAboru sledovania\: %s
JNCK077=Nastala chyba v %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE006=Nastala chyba pri zapisovan\u00ED %d bajtov do s\u00FAboru sledovania\: %s, n\u00E1vratov\u00FD k\u00F3d\: %d
JNCK078=Zistilo sa varovanie v %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK071=Varovanie JNI\: Pam\u00E4\u0165 na adrese 0x%1$p, ktor\u00FA vy\u017Eadovala %2$s, nebola uvo\u013Enen\u00E1 pred n\u00E1vratom z nat\u00EDvnej met\u00F3dy. Pravdepodobne sa jedn\u00E1 o trhlinu v pam\u00E4ti.
JNCK072=Odpor\u00FA\u010Danie JNI v %1$s\: je zadan\u00E9 JNI_COMMIT, ale bude sa ignorova\u0165.\nMet\u00F3da %2$s vr\u00E1tila skuto\u010Dn\u00FD obsah po\u013Ea, preto sa po tomto volan\u00ED ozna\u010D\u00ED obsah vyrovn\u00E1vacej pam\u00E4te ako neplatn\u00FD. Mo\u017Eno to nie je to, \u010Do ste zam\u00FD\u0161\u013Eali.
TRCE010=Zlyhanie vyhradzovania nat\u00EDvnej pam\u00E4te, pou\u017Eij\u00FA sa nastavenia nedynamick\u00E9ho sledovania.
JNCK070=Varovanie JNI v %1$s\: P\u00F4vodn\u00E9 \u00FAdaje po\u013Ea boli upraven\u00E9 medzi %2$s a %3$s.\n(P\u00F4vodn\u00E9 CRC \= 0x%4$x, nov\u00E9 CRC \= 0x%5$x).\nMet\u00F3da %6$s vr\u00E1tila k\u00F3piu obsahu po\u013Ea, preto sa nov\u00FD obsah strat\u00ED.
TRCE019=Nebolo mo\u017En\u00E9 spr\u00E1vne inicializova\u0165 mechanizmus sledovania, n\u00E1vratov\u00FD k\u00F3d \= %d
JNCK064=Varovanie JNI v %1$s\: Kapacita oblasti slab\u00FDch odkazov automaticky nar\u00E1stla z %2$d na %3$d.\nM\u00F4\u017Ee to by\u0165 pr\u00EDznakom trhliny v pam\u00E4ti.
TRCE012=Ned\u00E1 sa otvori\u0165 s\u00FAbor %s s po\u010D\u00EDtadlom bodov sledovania, po\u010D\u00EDtadl\u00E1 sa presmerovali na stderr.
JNCK065=Varovanie JNI v %1$s\: Kapacita r\u00E1mca lok\u00E1lnych odkazov automaticky nar\u00E1stla z %2$d na %3$d. %4$d odkazov sa pou\u017E\u00EDva.\nAk chcete explicitne zv\u00E4\u010D\u0161i\u0165 r\u00E1mec, pou\u017Eite EnsureLocalCapacity alebo PushLocalFrame.
TRCE011=Modul nie je nakonfigurovan\u00FD pre sledovanie\: %s
JNCK062=Upozornenie pre JNI v %s\: T\u00E1to funkcia by sa nemala vola\u0165 vn\u00FAtri kritickej \u010Dasti
TRCE014=Zlyhala inicializ\u00E1cia mechanizmu sledovania, sledovanie nie je povolen\u00E9
JNCK063=Varovanie JNI v %1$s\: Kapacita oblasti glob\u00E1lnych odkazov automaticky nar\u00E1stla z %2$d na %3$d.\nM\u00F4\u017Ee to by\u0165 pr\u00EDznakom trhliny v pam\u00E4ti.
TRCE013=Zapisuj\u00FA sa inform\u00E1cie o po\u010Dte sledovan\u00ED do %s
TRCE016=Nie je dostupn\u00FD \u00FAlo\u017En\u00FD priestor pre RasGlobalStorage, sledovanie nie je povolen\u00E9
JNCK068=Varovanie JNI v %1$s\: Za\u010Diatok alebo index je mimo rozsahu (%2$d >\= %3$d)
JNCK069=Varovanie JNI v %1$s\: Koniec je mimo rozsahu (%2$d + %3$d > %4$d)
TRCE015=Nastala chyba pri registr\u00E1cii odberate\u013Ea z\u00E1pisu sledovania
TRCE018=Ned\u00E1 sa vyhradi\u0165 lok\u00E1lny pam\u00E4\u0165ov\u00FD k\u013E\u00FA\u010D vl\u00E1kna UTE
JNCK066=Varovanie JNI v %1$s\: Je zadan\u00FD z\u00E1porn\u00FD za\u010Diatok alebo index (%2$d)
TRCE017=Ned\u00E1 sa vyhradi\u0165 lok\u00E1lny pam\u00E4\u0165ov\u00FD k\u013E\u00FA\u010D vl\u00E1kna RAS
JNCK067=Varovanie JNI v %1$s\: Je zadan\u00E1 z\u00E1porn\u00E1 d\u013A\u017Eka regi\u00F3nu (%2$d)
CFRE086=met\u00F3da m\u00E1 dva atrib\u00FAty Code
CFRE087=bajtov\u00FD k\u00F3d met\u00F3dy rozhrania mus\u00ED odkazova\u0165 na InterfaceMethodref
CFRE088=n\u00E1zov lok\u00E1lnej premennej mus\u00ED by\u0165 re\u0165azec
CFRE089=o\u010Dak\u00E1va sa n\u00E1zov a typ
JNCK060=Varovanie JNI v %1$s\: Argument \#%2$d je chybne vytvoren\u00FD podpis met\u00F3dy ("%3$s")
JNCK061=Varovanie JNI v %1$s\: Argument \#%2$d je chybne vytvoren\u00FD podpis po\u013Ea ("%3$s")
SHRC620=Nastala chyba pri otv\u00E1ran\u00ED regi\u00F3nu zdie\u013Eanej pam\u00E4te. Riadiaci s\u00FAbor je po\u0161koden\u00FD.
CFRE080=podpis met\u00F3dy je neplatn\u00FD
SHRC621=Nastala chyba pri otv\u00E1ran\u00ED regi\u00F3nu zdie\u013Eanej pam\u00E4te. Nezhoda v ID zdie\u013Eanej pam\u00E4te.
CFRE081=zdrojov\u00FD s\u00FAbor mus\u00ED by\u0165 UTF8
CFRE082=met\u00F3da <init> nemus\u00ED by\u0165 statick\u00E1, kone\u010Dn\u00E1, synchronizovan\u00E1, nat\u00EDvna alebo abstraktn\u00E1
CFRE083=trieda je abstraktn\u00E1 a kone\u010Dn\u00E1
CFRE084=bez chyby
CFRE085=vn\u00FAtorn\u00FD n\u00E1zov mus\u00ED by\u0165 re\u0165azec
SHRC626=Nemo\u017Eno z\u00EDska\u0165 \u0161tatistiku zdie\u013Eanej pam\u00E4te cache, preto\u017Ee neexistuje platn\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache.
SHRC627=Op\u00E4tovn\u00E9 vytvorenie riadiaceho s\u00FAboru zdie\u013Eanej pam\u00E4te nie je povolen\u00E9 v re\u017Eime len na \u010D\u00EDtanie.
SHRC628=Riadiaci s\u00FAbor zdie\u013Eanej pam\u00E4te je ne\u010Ditate\u013En\u00FD.
JNCK059=Varovanie JNI v %1$s\: Argument \#%2$d je chybne vytvoren\u00FD identifik\u00E1tor ("%3$s")
SHRC629=Riadiaci s\u00FAbor zdie\u013Eanej pam\u00E4te je len na \u010D\u00EDtanie.
SHRC622=Nastala chyba pri otv\u00E1ran\u00ED regi\u00F3nu zdie\u013Eanej pam\u00E4te. Nezhoda v k\u013E\u00FA\u010Di zdie\u013Eanej pam\u00E4te.
SHRC623=Nastala chyba pri otv\u00E1ran\u00ED regi\u00F3nu zdie\u013Eanej pam\u00E4te. Zlyhala kontrola ID skupiny.
SHRC624=Nastala chyba pri otv\u00E1ran\u00ED regi\u00F3nu zdie\u013Eanej pam\u00E4te. Zlyhala kontrola ID u\u017E\u00EDvate\u013Ea.
SHRC625=Nastala chyba pri otv\u00E1ran\u00ED regi\u00F3nu zdie\u013Eanej pam\u00E4te. Zlyhala kontrola ve\u013Ekosti zdie\u013Eanej pam\u00E4te.
JNCK053=Chyba JNI\: Kritick\u00E1 oblas\u0165 sa mus\u00ED uvo\u013Eni\u0165 sk\u00F4r, ne\u017E sa vykon\u00E1 n\u00E1vrat z funkcie
JNCK054=Chyba JNI v %1$s\: Nezn\u00E1ma vo\u013Eba re\u017Eimu %2$d
JNCK051=Intern\u00E1 chyba VM v %1$s\: %2$p prenesen\u00FDch bajtov je men\u0161\u00ED ako %3$p bajtov odkazu JNI
JNCK052=Chyba JNI v %1$s\: Trieda %3$.*2$s je zastaral\u00E1
JNCK057=Chyba JNI v %1$s\: Nepou\u017E\u00EDvajte %2$s na uvo\u013Enenie pam\u00E4te 0x%3$p, ktor\u00E1 sa z\u00EDskala pomocou %4$s
JNCK058=Varovanie JNI v %1$s\: Po zavolan\u00ED %2$s mus\u00EDte skontrolova\u0165 v\u00FDnimky pomocou ExceptionCheck, ExceptionClear alebo ExceptionOccurred pred zavolan\u00EDm %3$s
JNCK055=Chyba JNI v %1$s\: \u017Diadna funkcia JNI nevr\u00E1tila ukazovate\u013E 0x%2$p alebo u\u017E bol uvo\u013Enen\u00FD
JNCK056=Chyba JNI v %1$s\: Z\u00EDskala sa pam\u00E4\u0165 0x%2$p z objektu 0x%3$p, uvo\u013E\u0148uje sa z 0x%4$p
CFRE097=duplicitn\u00E1 polo\u017Eka vn\u00FAtornej triedy v atrib\u00FAte InnerClasses
CFRE098=podpis lok\u00E1lnej premennej mus\u00ED by\u0165 re\u0165azec
CFRE099=neplatn\u00E9 modifik\u00E1tory met\u00F3dy
JNCK050=Chyba JNI v %s\: Zavolalo sa PopLocalFrame bez lok\u00E1lneho r\u00E1mca v z\u00E1sobn\u00EDku
CFRE090=nov\u00FD bajtov\u00FD k\u00F3d nesmie vytv\u00E1ra\u0165 polia
CFRE091=PC za\u010Diatku obslu\u017En\u00E9ho programu v\u00FDnimky nie je in\u0161trukcia
SHRC610=Zak\u00E1za\u0165 podporou pre in\u0161trument\u00E1ciu bajtov\u00E9ho k\u00F3du.
CFRE092=neplatn\u00FD podpis
CFRE093=met\u00F3da m\u00F4\u017Ee by\u0165 bu\u010F verejn\u00E1, s\u00FAkromn\u00E1, alebo chr\u00E1nen\u00E1
CFRE094=bajtov\u00FD k\u00F3d instanceof mus\u00ED referencova\u0165 triedu
CFRE095=anot\u00E1cie musia by\u0165 rozhrania
CFRE096=cie\u013E nie je in\u0161trukcia v bajtovom k\u00F3de prep\u00EDna\u010Da
SHRC615=Nastala chyba po\u010Das otv\u00E1rania semafora. Nezhoda v k\u013E\u00FA\u010Di semafora.
SHRC616=Nastala chyba po\u010Das otv\u00E1rania semafora. Nezhoda v po\u010Dte semaforov v mno\u017Eine semaforov.
SHRC617=Nastala chyba po\u010Das otv\u00E1rania semafora. Zna\u010Dka semafora sa nena\u0161la v mno\u017Eine semaforov.
JNCK048=Chyba JNI v %s\: Nevhodn\u00FD prij\u00EDma\u010D
SHRC618=Riadiaci s\u00FAbor semafora je ne\u010Ditate\u013En\u00FD.
JNCK049=Chyba JNI v %s\: Zistilo sa opakovan\u00E9 pou\u017Eitie va_list
SHRC611=Je zadan\u00E1 podvo\u013Eba "disableBCI", ale existuj\u00FAca pam\u00E4\u0165 cache sa vytvorila s podvo\u013Ebou "enableBCI".
SHRC612=Umelo nastavte k\u013E\u00FA\u010D pam\u00E4\u0165ov\u00FD k\u013E\u00FA\u010D (0 - 15) v z/OS pre testovanie.
SHRC613=Nastala chyba po\u010Das otv\u00E1rania semafora. Riadiaci s\u00FAbor je po\u0161koden\u00FD.
SHRC614=Nastala chyba po\u010Das otv\u00E1rania semafora. Nezhoda v ID semafora.
JNCK042=Chyba JNI v %1$s\: Argument \#%2$d nie je podtriedou %3$s
JNCK043=Chyba JNI v %1$s\: Argument \#%2$d, nemo\u017Eno n\u00E1js\u0165 %3$s
JNCK040=Chyba JNI v %1$s\: Argument \#%2$d je mimo rozsahu pre %3$s (0x%4$x < 0x%5$x)
JNCK041=Chyba JNI v %1$s\: Argument \#%2$d je mimo rozsahu pre %3$s (0x%4$x > 0x%5$x)
SHRC619=Riadiaci s\u00FAbor semafora je len na \u010D\u00EDtanie.
JNCK046=Chyba JNI v %1$s\: Met\u00F3da m\u00E1 zl\u00FD typ n\u00E1vratu ('%2$c')
JNCK047=Chyba JNI v %s\: Nespr\u00E1vny argument triedy
JNCK044=Chyba JNI v %s\: Met\u00F3da je statick\u00E1
JNCK045=Chyba JNI v %s\: Met\u00F3da nie je statick\u00E1
SHRC520=\t classpath   Vytla\u010D\u00ED iba typy cesty k triedam v zdie\u013Eanej pam\u00E4ti cache
SHRC521=\t url               Vytla\u010D\u00ED v\u0161etky typy adresy URL v zdie\u013Eanej pam\u00E4ti cache.
SHRC522=\t token           Vytla\u010D\u00ED iba typy token v zdie\u013Eanej pam\u00E4ti cache.
SHRC527=\t zipcache     Vytla\u010D\u00ED iba typy zipcache v zdie\u013Eanej pam\u00E4ti cache.
SHRC528=\t extra           Vytla\u010D\u00ED v\u0161etky nasleduj\u00FAce s\u00FAkromn\u00E9 typy v zdie\u013Eanej pam\u00E4ti cache.
SHRC529=\t orphan         Vytla\u010D\u00ED iba typy orphan v zdie\u013Eanej pam\u00E4ti cache.
SHRC523=\t romclass     Vytla\u010D\u00ED iba typy romclass v zdie\u013Eanej pam\u00E4ti cache.
SHRC524=\t rommethod   Vytla\u010D\u00ED iba typy rommethod v zdie\u013Eanej pam\u00E4ti cache.
SHRC525=\t aot               Vytla\u010D\u00ED iba typy aot v zdie\u013Eanej pam\u00E4ti cache.
SHRC526=\t jitprofile Vytla\u010D\u00ED iba typy jitprofile v zdie\u013Eanej pam\u00E4ti cache.
SHRC510=Zak\u00E1za\u0165 vytvorenie v\u00FDpisov pre po\u0161koden\u00E9 pam\u00E4te cache
SHRC511=Kompozitn\u00E1 pam\u00E4\u0165 cache m\u00E1 zl\u00FA hodnotu inicializa\u010Dn\u00E9ho pr\u00EDznaku. Hodnota ccInitComplete je %lu
SHRC516=Predvolene zobrazi\u0165 v\u0161etky elementy v pam\u00E4ti cache. Na zobrazenie dostupn\u00FDch volieb pou\u017Eite printallstats\=help.
SHRC517=Nerozpoznan\u00E1 podvo\u013Eba pre vo\u013Ebu printallstats\= Na zobrazenie dostupn\u00FDch volieb pou\u017Eite printallstats\=help.
SHRC518=Dostupn\u00E9 vo\u013Eby pre -Xshareclasses\:printAllStats\=<vo\u013Eby>. Na zadanie viacer\u00FDch volieb pou\u017Eite '+'. t.j. printallstats\=aot+url \n
SHRC519=\t all               Vytla\u010D\u00ED v\u0161etky nasleduj\u00FAce typy v zdie\u013Eanej pam\u00E4ti cache.
SHRC512=\u017Eiadne \u00FAdaje v pam\u00E4ti cache
SHRC513=Nastavi\u0165 opr\u00E1vnenia v \u0161t\u00FDle unix pre vytv\u00E1ranie adres\u00E1rov pam\u00E4te cache
SHRC514=Neplatn\u00E9 nastavenie pre vo\u013Ebu cacheDirPerm. Mus\u00ED to by\u0165 opr\u00E1vnenie na s\u00FAbor v \u0161t\u00FDle unix z rozsahu 0700 - 0777 alebo 1700 - 1777 (v osmi\u010Dkovej reprezent\u00E1cii).
SHRC515=Zlyhalo z\u00EDskavanie predvolen\u00E9ho adres\u00E1ra pam\u00E4te cache.
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC549=-Xshareclasses\:checkStringTableReset m\u00F4\u017Ee zlyha\u0165. Tabu\u013Eka re\u0165azcov nie je dostato\u010Dne ve\u013Ek\u00E1. Mus\u00ED by\u0165 v\u00E4\u010D\u0161ia ako ve\u013Ekos\u0165 str\u00E1nky OS. Ve\u013Ekos\u0165 tabu\u013Eky\: %d, ve\u013Ekos\u0165 str\u00E1nky\: %d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC547=Nie je mo\u017En\u00E9 vyhradi\u0165 pam\u00E4\u0165 pre znakov\u00E9 pole v shrinit
SHRC548=Vn\u00FAti\u0165 kontrolu pre prestavenie tabu\u013Eky re\u0165azcov, ke\u010F je ozna\u010Den\u00E1 ako po\u0161koden\u00E1.
SHRC530=\t jithint       Vytla\u010D\u00ED iba typy jithint v zdie\u013Eanej pam\u00E4ti cache.
SHRC531=\t aotch           Vytla\u010D\u00ED iba typy aotch v zdie\u013Eanej pam\u00E4ti cache.
SHRC532=\t aotthunk     Vytla\u010D\u00ED iba typy aotthunk v zdie\u013Eanej pam\u00E4ti cache.
SHRC533=\t aotdata       Vytla\u010D\u00ED iba typy aotdata v zdie\u013Eanej pam\u00E4ti cache.
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC534=\t jcl               Vytla\u010D\u00ED iba typy jcl v zdie\u013Eanej pam\u00E4ti cache.
SHRC535=\t bytedata     Vytla\u010D\u00ED v\u0161etky in\u00E9 typy bajtov\u00E9ho k\u00F3du v zdie\u013Eanej pam\u00E4ti cache.
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s, adresa\: 0x%5$p, ve\u013Ekos\u0165\: %6$d
SHRC563=Otv\u00E1ra sa pam\u00E4\u0165 cache v re\u00E1lnom \u010Dase, \u010Do nie je kompatibiln\u00E9 s t\u00FDmto JVM. Na pr\u00EDstup k tejto pam\u00E4ti cache pou\u017Eite vo\u013Ebu -Xrealtime JVM
SHRC564=[povolen\u00E1 pam\u00E4\u0165 cache zdie\u013Ean\u00E1 pre host\u00ED -Xshareclasses]
SHRC565=Vytvori\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy pre host\u00ED
SHRC566=eyecatcher hlavi\u010Dky zdie\u013Eanej pam\u00E4te cache pre triedy pre host\u00ED je neplatn\u00E9
SHRC560=N\u00E1zov internej pam\u00E4te cache je nespr\u00E1vny.
SHRC561=Zlyhala inicializ\u00E1cia zdie\u013Eanej pam\u00E4te cache pre triedy, preto\u017Ee v s\u00FAborovom syst\u00E9me je nedostatok miesta. Dostupn\u00E9 vo\u013En\u00E9 bajty diskov\u00E9ho priestoru\: %lld, vy\u017Eadovan\u00E9 bajty\: %lld.
SHRC562=\u010C\u00EDtanie po\u0161koden\u00FDch \u00FAdajov pre hlavi\u010Dku 0x%p z\u00E1znamu pam\u00E4te cache (neplatn\u00E1 d\u013A\u017Eka polo\u017Eky, %u bajtov)
SHRC567=Otvorila sa zdie\u013Ean\u00E1 pam\u00E4\u0165 cache %1$s pre triedy pre host\u00ED len na \u010D\u00EDtanie
SHRC568=Otvorila sa zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre triedy pre host\u00ED %1$s
SHRC569=Vytvorila sa zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre triedy pre host\u00ED %1$s
SHRC552=Nemo\u017Eno vyhradi\u0165 blok po\u017Eadovanej ve\u013Ekosti pre pam\u00E4\u0165 cache "%s". Dostupn\u00E9 bajty\: %d, po\u017Eadovan\u00E9 bajty\: %d
SHRC553=Pam\u00E4\u0165 cache obsahuje iba triedy s \u010D\u00EDslami riadkov
SHRC554=Pam\u00E4\u0165 cache obsahuje iba triedy bez \u010D\u00EDsiel riadkov
SHRC555=Pam\u00E4\u0165 cache obsahuje triedy s \u010D\u00EDslami riadkov a triedy bez \u010D\u00EDsiel riadkov
SHRC550=Ch\u00FDba pr\u00EDznak pre \u010Das vykon\u00E1vania ROUND_TO_PAGE_SIZE. -Xshareclasses\:checkStringTableReset vy\u017Eaduje, aby bola tabu\u013Eka re\u0165azcov zaokr\u00FAhlen\u00E1 na ve\u013Ekos\u0165 str\u00E1nky.
SHRC551=Pam\u00E4\u0165 cache "%s" je ozna\u010Den\u00E1 ako pln\u00E1. Zlyhalo vyhradzovanie bloku s ve\u013Ekos\u0165ou %d.
SHRC556=Vytla\u010Di\u0165 sum\u00E1r \u0161tatistiky vyrovn\u00E1vacej pam\u00E4te Na zobrazenie dostupn\u00FDch volieb pou\u017Eite printstats\=help.
SHRC557=Nerozpoznan\u00E1 podvo\u013Eba pre vo\u013Ebu printstats\= Na zobrazenie dostupn\u00FDch volieb pou\u017Eite printstats\=help.
SHRC558=Dostupn\u00E9 vo\u013Eby pre -Xshareclasses\:printStats\=<vo\u013Eby>. Na zadanie viacer\u00FDch volieb pou\u017Eite '+'. t.j. printstats\=aot+url \n
SHRC559=Zlyhalo vytv\u00E1ranie adres\u00E1ra "%s" pre zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy
SHRC580=Chyba pri uvo\u013E\u0148ovan\u00ED pripojen\u00E9ho z\u00E1mku \u010D\u00EDtania zdie\u013Eanej pam\u00E4te cache pre triedy pre host\u00ED
SHRC101=\tIndex %1$d v ceste k triedam 0x%2$p
SHRC585=Nastala chyba pri z\u00EDskavan\u00ED z\u00E1mku z\u00E1pisu hlavi\u010Dky zdie\u013Eanej pam\u00E4te cache pre triedy pre host\u00ED
SHRC102=\tURL 0x%p
SHRC586=Chyba\: Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre triedy pre host\u00ED m\u00E1 neplatn\u00FA hlavi\u010Dku
SHRC103=\tSymbol 0x%p
SHRC587=Nastala chyba pri aktualiz\u00E1cii \u010Dasu posledn\u00E9ho pripojenia zdie\u013Eanej pam\u00E4te cache pre triedy pre host\u00ED
SHRC104=%1$d\: 0x%2$p CLASSPATH
SHRC588=Chyba pri uvo\u013E\u0148ovan\u00ED z\u00E1mku \u010D\u00EDtania hlavi\u010Dky zdie\u013Eanej pam\u00E4te cache pre triedy pre host\u00ED
SHRC581=Nastala chyba pri mapovan\u00ED v zdie\u013Eanom objekte pre host\u00ED
SHRC582=Chyba\: Nemo\u017Eno vymaza\u0165 zdie\u013Ean\u00FA pam\u00E4te cache pre triedy pre host\u00ED
SHRC583=Nastala chyba pri z\u00EDskavan\u00ED \u010Dasu "posledn\u00E9ho odpojenia" pre zdie\u013Ean\u00FA pam\u00E4\u0165 cache pre triedy pre host\u00ED
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s na 0x%5$p.
SHRC584=Nastala chyba pri z\u00EDskavan\u00ED pripojen\u00E9ho z\u00E1mku \u010D\u00EDtania zdie\u013Eanej pam\u00E4te cache pre triedy pre host\u00ED
SHRC109=\!ZASTARAN\u00C9\!
SHRC105=%1$d\: 0x%2$p URL
SHRC589=Vytvori\u0165 pam\u00E4\u0165 cache s podporou pre in\u0161trument\u00E1ciu bajtov\u00E9ho k\u00F3du
SHRC106=%1$d\: 0x%2$p TOKEN
SHRC107=\t%.*s
SHRC108=\t%.*s
SHRC574=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre host\u00ED sa nena\u0161la v sie\u0165ovom s\u00FAborovom syst\u00E9me. Bu\u010F vyberte vo\u013Ebu "nonpersistent", alebo in\u00E9 cacheDir.
SHRC575=Nastala chyba pri z\u00EDskavan\u00ED z\u00E1mka z\u00E1pisu pre hlavi\u010Dku v zdie\u013Eanej pam\u00E4ti cache pre triedy pre host\u00ED
SHRC576=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre host\u00ED sa ned\u00E1 otvori\u0165 len na \u010D\u00EDtanie, preto\u017Ee e\u0161te nebola inicializovan\u00E1
SHRC577=Ned\u00E1 sa vytvori\u0165 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre host\u00ED v re\u017Eime len na \u010D\u00EDtanie
SHRC570=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache "%1$s" pre host\u00ED bola zni\u010Den\u00E1
SHRC571=Pripojila sa zdie\u013Ean\u00E1 pam\u00E4\u0165 cache pre host\u00ED pre triedy %1$s
SHRC572=Na\u0161la sa nespr\u00E1vna \u0161pecifik\u00E1cia cie\u013Ea. Cie\u013E zadan\u00FD v hlavi\u010Dke pam\u00E4te cache je %s, ale o\u010Dak\u00E1valo sa %s.
SHRC573=Vo\u013Eba pr\u00EDkazov\u00E9ho riadka "-Xshareclasses\:%s" vy\u017Eaduje "-Xvirt"
SHRC578=Nastala chyba pri vytv\u00E1ran\u00ED hlavi\u010Dky v zdie\u013Eanej pam\u00E4ti cache pre triedy pre host\u00ED
SHRC579=Nastala chyba pri inicializovan\u00ED hlavi\u010Dky \u00FAdajov zdie\u013Eanej pam\u00E4te cache pre host\u00ED
SHRC123=%% zastaral\u00FDch tried \= %1$d%%\n
SHRC124=Pam\u00E4\u0165 cache je pln\u00E1 na %1$d %%\n
SHRC125=Nebolo mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre vyrovn\u00E1vaciu pam\u00E4\u0165 re\u0165azca v SH_CacheMap
SHRC126=Bola vytvoren\u00E1 po\u017Eiadavka na pridanie pr\u00EDli\u0161 ve\u013Ek\u00E9ho mno\u017Estva polo\u017Eiek do ClasspathItem
SHRC120=\# Odkazy URL         \= %d
SHRC121=\# Symboly        \= %d
SHRC122=\# Zastaran\u00FDch tried \= %d
SHRC127=SH_CompositeCache\:\:enterMutex zlyhalo s n\u00E1vratov\u00FDm k\u00F3dom %d. Varovanie\: Va\u0161a pam\u00E4\u0165 cache je mo\u017Eno po\u0161koden\u00E1.
SHRC128=SH_CompositeCache\:\:exitMutex zlyhalo s n\u00E1vratov\u00FDm k\u00F3dom %d. Varovanie\: Va\u0161a pam\u00E4\u0165 cache je mo\u017Eno po\u0161koden\u00E1.
SHRC129=Pokus o nastavenie po\u010Dtu \u010D\u00EDta\u010Diek na -1\!
SHRC590=Je zadan\u00E1 podvo\u013Eba "enableBCI", ale existuj\u00FAca pam\u00E4\u0165 cache sa nevytvorila s podvo\u013Ebou "enableBCI".
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
SHRC112=ukazovate\u013E vyhradenia \= 0x%p\n
SHRC596=Vykona\u0165 extra kontroly pri ukladan\u00ED a vyhradzovan\u00ED \u00FAdajov tried mimo radu.
SHRC113=ve\u013Ekos\u0165 vyrovn\u00E1vacej pam\u00E4te \= %d
SHRC597=-Xshareclasses\:rcdSize\=%u bajtov je viac ako %u bajtov dostupn\u00E9ho vo\u013En\u00E9ho priestoru; pou\u017Eije sa -Xshareclasses\:rcdSize\=%u.
SHRC114=vo\u013En\u00FDch bajtov   \= %d
SHRC598=Oblas\u0165 \u00FAdajov nespracovanej triedy je po\u0161koden\u00E1, preto\u017Ee jej ve\u013Ekos\u0165 %lu je v\u00E4\u010D\u0161ia ako celkov\u00E1 ve\u013Ekos\u0165 pam\u00E4te cache %lu.
SHRC115=bajtov ROMClass  \= %d
SHRC599=Vo\u013En\u00FD priestor v oblasti \u00FAdajov nespracovanej triedy je po\u0161koden\u00FD ('za\u010Diatok vo\u013En\u00E9ho priestoru'\=%p, 'koniec vo\u013En\u00E9ho priestoru'\=%p, 'vo\u013En\u00FD priestor'\=%lu bajtov)
SHRC592=Povolen\u00E9 BCI \= true
SHRC593=Povolen\u00E9 BCI \= false
SHRC110=\nz\u00E1kladn\u00E1 adresa    \= 0x%p
SHRC594=Podvo\u013Eba -Xshareclasses\:cacheRetransformed je nekompatibiln\u00E1 so zdie\u013Eanou pam\u00E4\u0165ou cache, ktor\u00E1 sa vytvorila s vo\u013Ebou enableBCI
SHRC111=koncov\u00E1 adresa     \= 0x%p
SHRC595=Vo\u013Eby pr\u00EDkazov\u00E9ho riadka "%s" a "%s" s\u00FA nekompatibiln\u00E9
SHRC116=Bajtov meta\u00FAdajov \= %d
SHRC117=%% pou\u017Eit\u00FDch meta\u00FAdajov \= %1$d%%\n
SHRC118=\# Triedy ROM     \= %d
SHRC119=\# Cesty classpath \= %d
J9TI006=Uvo\u013Enenie roz\u0161\u00EDren\u00FDch schopnost\u00ED z capabilities_ptr.
J9TI007=Z\u00EDskanie aktu\u00E1lnej mno\u017Einy roz\u0161\u00EDren\u00FDch schopnost\u00ED pomocou capabilities_ptr.
J9TI004=Pomocou capabilities_ptr vracia moment\u00E1lne dostupn\u00E9 roz\u0161\u00EDren\u00E9 atrib\u00FAty.
SHRC140=ve\u013Ekos\u0165\:\t%1$d\t\t\t%2$d\n
J9TI005=Pridanie nov\u00FDch roz\u0161\u00EDren\u00FDch schopnost\u00ED z capabilities_ptr.
J9TI008=Ozna\u010Duje za\u010Diatok f\u00E1zy kompil\u00E1cie JIT. (Nie je bezpe\u010Dn\u00E9 pre sp\u00E4tn\u00E9 volania)
J9TI009=Ozna\u010Duje koniec f\u00E1zy kompil\u00E1cie JIT. (Nie je bezpe\u010Dn\u00E9 pre sp\u00E4tn\u00E9 volania)
SHRC145=H\u013Ead\u00E1 sa trieda %1$s v zdie\u013Eanej pam\u00E4ti cache pre zav\u00E1dza\u010D tried s ID %2$d a adresou URL %4$.*3$s...
SHRC146=H\u013Ead\u00E1 sa trieda %1$s v zdie\u013Eanej pam\u00E4ti cache pre zav\u00E1dza\u010D tried s ID %2$d a symbolom %4$.*3$s...
VMUT001=(nepomenovan\u00E9 vl\u00E1kno)
SHRC147=Znak %.*s nie je platn\u00FD pre n\u00E1zov vyrovn\u00E1vacej pam\u00E4te
VMUT000=(nedostatok pam\u00E4te)
SHRC148=Povoli\u0165 pr\u00EDstup skupiny k vyrovn\u00E1vacej pam\u00E4ti (predvolen\u00E1 hodnota je u\u017E\u00EDvate\u013E)
VMUT003=S\u00FAbor volieb sa nena\u0161iel
SHRC141=nezhoduj\u00FAce sa bajty\:
VMUT002=(chyba pr\u00EDstupu)
SHRC142=\tna 0x%1$p\t\t%2$x \!\= %3$x
VMUT005=Vo\u013Eba je pr\u00EDli\u0161 ve\u013Ek\u00E1\: '%s'
SHRC143=Uklad\u00E1 sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a adresou URL %5$.*4$s...
VMUT004=Chybne vytvoren\u00E1\: '%s'
SHRC144=Uklad\u00E1 sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a symbolom %5$.*4$s...
SHRC149=Povoli\u0165 podrobn\u00FD v\u00FDstup h\u013Eadania/ukladania
J9TI002=V kni\u017Enici %s sa nena\u0161lo Agent_OnLoad
J9TI003=Pre kni\u017Enicu %s zlyhalo Agent_OnLoad
J9TI000=Nedostatok pam\u00E4te pri pokuse o zavedenie kni\u017Enice agenta %s
J9TI001=Nebolo mo\u017En\u00E9 otvori\u0165 kni\u017Enicu agenta %1$s (%2$s)
J9TI017=Riadi r\u00F4zne vo\u013Eby VM a kompil\u00E1cie.
J9TI018=Nastavuje met\u00F3du pre v\u00FDberov\u00FA polo\u017Eku a ozn\u00E1menie o ukon\u010Den\u00ED.
J9TI015=Po\u017Eiada o v\u00FDpis monitora Java Lock Monitor (JLM).
J9TI016=Povoli\u0165 roz\u0161irovanie v rade za sebou v pr\u00EDtomnosti udalost\u00ED zadania a ukon\u010Denia met\u00F3dy (n\u00E1sledkom \u010Doho m\u00F4\u017Eu vznikn\u00FA\u0165 potenci\u00E1lne nepresn\u00E9 spr\u00E1vy o zadan\u00ED a ukon\u010Den\u00ED)
J9TI019=Nastav\u00ED re\u017Eim notifik\u00E1cie pre roz\u0161\u00EDren\u00E9 udalosti s mo\u017Enos\u0165ou v\u00FDberu na \u00FArovni vl\u00E1kna
SHRC134=Zlyhalo vytvorenie oblasti v SH_ROMClassManagerImpl
VMUT010=Chybne vytvoren\u00E1 hodnota vo\u013Eby. Vo\u013Eba "%1$s%3$.*2$s" obsahuje koncov\u00E9 znaky "%4$s", ktor\u00E9 sa ignorovali.
SHRC135=Zlyhalo vytvorenie ha\u0161ovacej tabu\u013Eky v SH_ROMClassManagerImpl
SHRC136=Nie je mo\u017En\u00E9 vytvori\u0165 monitor v SH_ROMClassManagerImpl
VMUT012=%2$.*1$s nie je priame superrozhranie %4$.*3$s.
VMUT011=Nebolo mo\u017En\u00E9 vyhradi\u0165 pam\u00E4\u0165 pre pole volieb pr\u00EDkazov\u00E9ho riadka
SHRC137=BEZPE\u010CN\u00DD RE\u017DIM\: Upozornenie\: Trieda ROMClass %.*s nezodpoved\u00E1 triede ROMClass vo vyrovn\u00E1vacej pam\u00E4ti
SHRC130=Pokus o alok\u00E1ciu po\u010Das potvrdzovania je st\u00E1le v procese \u010Dakania
VMUT014=Trieda prij\u00EDma\u010Da %2$.*1$s mus\u00ED by\u0165 aktu\u00E1lna trieda alebo podtyp rozhrania %4$.*3$s
SHRC131=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre polo\u017Eku pripojen\u00E9ho zoznamu v ROMClassManagerImpl
VMUT013=Neplatn\u00FD s\u00FAbor volieb %s
SHRC132=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre polo\u017Eku ha\u0161ovacej tabu\u013Eky v ROMClassManagerImpl
SHRC133=Nie je mo\u017En\u00E9 zada\u0165 mutex ha\u0161ovacej tabu\u013Eky ROMClassManager
VMUT007=Chybne vytvoren\u00E1 hodnota pre JAVA_TOOL_OPTIONS
VMUT006=V -Xoptionsfile sa na\u0161la chybne vytvoren\u00E1 vo\u013Eba %s
VMUT009=Chybne vytvoren\u00E1 hodnota pre -Xservice
VMUT008=Chybne vytvoren\u00E1 hodnota pre IBM_JAVA_OPTIONS
SHRC138=Bol vyh\u013Eadan\u00FD viac ako jeden sirotsk\u00FD ROMClass pre %.*s
SHRC139=\n\tUkladan\u00E9 ROMClass \tROMClass vo vyrovn\u00E1vacej pam\u00E4ti
J9TI010=Polo\u017Eka met\u00F3dy s roz\u0161\u00EDren\u00FDmi inform\u00E1ciami o type met\u00F3dy.
J9TI013=Povo\u013Euje sp\u00E4tn\u00E9 volania pre in\u0161trument\u00E1lne vyhradenia (tie, ktor\u00E9 nie s\u00FA hl\u00E1sen\u00E9 prostredn\u00EDctvom VMObjectAlloc).
J9TI014=Riadi monitor Java Lock Monitor (JLM) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI011=Pridanie dynamickej vo\u013Eby -Xtrace
J9TI012=Pridanie dynamickej vo\u013Eby -Xdump
SHRC160=Uplynulo \u010Dakanie na mutex vytvorenia po\u010Das otv\u00E1rania semafora
SHRC161=Uplynulo \u010Dakanie na mutex vytvorenia po\u010Das vytv\u00E1rania zdie\u013Eanej pam\u00E4te
SHRC162=Uplynulo \u010Dakanie na mutex vytvorenia po\u010Das otv\u00E1rania zdie\u013Eanej pam\u00E4te
SHRC167=Zak\u00E1\u017Ee zdie\u013Eanie tried
SHRC168=Celkovo pre\u010D\u00EDtan\u00FDch bajtov zdie\u013Ean\u00FDch tried. %1$lld. Celkovo ulo\u017Een\u00FDch bajtov\: %2$d.
SHRC169=Zistila sa zmena v %2$.*1$s...\n \t... %3$d tried v pam\u00E4ti cache sa ozna\u010Dilo ako zastaral\u00E9
SHRC163=[povolen\u00FD podrobn\u00FD v\u00FDstup -Xshareclasses]
SHRC164=[povolen\u00FD podrobn\u00FD v\u00FDstup I/O -Xshareclasses]
SHRC165=[povolen\u00FD podrobn\u00FD v\u00FDstup rozhrania API Helper -Xshareclasses]
SHRC166=Pripojen\u00E9 k pam\u00E4ti cache "%1$s", ve\u013Ekos\u0165 \= %2$d bajtov
SHRC150=Povoli\u0165 podrobn\u00FD v\u00FDstup pomocn\u00E9ho rozhrania API
SHRC151=Potla\u010Di\u0165 v\u0161etky spr\u00E1vy
SHRC156=Nastala chyba pri kop\u00EDrovan\u00ED n\u00E1zvu skupiny do n\u00E1zvu pam\u00E4te cache
SHRC157=Nemo\u017Eno vyhradi\u0165 po\u017Eadovan\u00FDch %1$d bajtov zdie\u013Eanej pam\u00E4te \n \t\u00DAspe\u0161ne sa vyhradila povolen\u00E1 maxim\u00E1lna zdie\u013Ean\u00E1 pam\u00E4\u0165 (%2$d bajtov) \n \t(Ak chcete zv\u00E4\u010D\u0161i\u0165 dostupn\u00FA zdie\u013Ean\u00FA pam\u00E4\u0165, upravte syst\u00E9mov\u00FA hodnotu SHMMAX)
SHRC158=Vytvoren\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache triedy "%1$s"
SHRC159=Otvoren\u00E1 zdie\u013Ean\u00E1 pam\u00E4\u0165 cache triedy "%1$s"
SHRC152=V\u017Edy spusti\u0165 JVM bez oh\u013Eadu na chyby/varovania
SHRC153=Zadajte n\u00E1zov zdie\u013Eanej pam\u00E4te cache\n \t(Pou\u017Eite %%g na nahradenie n\u00E1zvu skupiny a %%u pre meno u\u017E\u00EDvate\u013Ea)
SHRC154=Znak zmeny v\u00FDznamu %.*s nie je platn\u00FD pre n\u00E1zov pam\u00E4te cache
SHRC155=Nastala chyba pri kop\u00EDrovan\u00ED mena u\u017E\u00EDvate\u013Ea do n\u00E1zvu pam\u00E4te cache
SHRC181=Nie je mo\u017En\u00E9 zada\u0165 mutex ha\u0161ovacej tabu\u013Eky ScopeManagerImpl
SHRC182=Nie je mo\u017En\u00E9 vytvori\u0165 monitor v ScopeManagerImpl
SHRC183=Nie je mo\u017En\u00E9 vytvori\u0165 ha\u0161ovaciu tabu\u013Eku v ScopeManagerImpl
SHRC184=\tOddiel %.*s
SHRC180=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre polo\u017Eku ha\u0161ovacej tabu\u013Eky v ScopeManagerImpl
SHRC189=\# met\u00F3d AOT \= %d
SHRC185=\tModContext %.*s
SHRC186=\tOddiel %.*s v ModContext %.*s
SHRC187=Zak\u00E1za\u0165 ukladanie \u00FAdajov AOT v zdie\u013Eanej pam\u00E4ti cache
SHRC188=Bajtov AOT \= %d
SHRC170=Zadajte n\u00E1zov zdie\u013Eanej pam\u00E4te cache\n \t(Pou\u017Eite %%u na nahradenie mena u\u017E\u00EDvate\u013Ea)
SHRC171=z/OS nem\u00F4\u017Ee vytvori\u0165 pam\u00E4\u0165 cache po\u017Eadovanej ve\u013Ekosti. Skontrolujte syst\u00E9mov\u00E9 nastavenia BPXPRMxx z/OS
SHRC172=Nie je mo\u017En\u00E9 vytvori\u0165 pam\u00E4\u0165 cache v po\u017Eadovanej ve\u013Ekosti kv\u00F4li obmedzeniam opera\u010Dn\u00E9ho syst\u00E9mu
SHRC173=Nastavte adres\u00E1r pre riadiace s\u00FAbory JVM (roz\u0161\u00EDren\u00E9)
SHRC178=Vo\u013Eba noIncrementalUpdates sa ignoruje, preto\u017Ee sa pou\u017E\u00EDva vo\u013Eba singleJVM
SHRC179=Segment ROMClass bol po\u0161koden\u00FD. Chyba pri \u010D\u00EDtan\u00ED segmentu ROMClass na 0x%p
SHRC174=Povoli\u0165 optimaliz\u00E1cie pre pou\u017Eitie jedn\u00E9ho JVM
SHRC175=Spravi\u0165 pam\u00E4\u0165 cache perzistentnou medzi re\u0161tartmi (iba Windows)
SHRC176=Povolen\u00E9 premiestnenie invariantn\u00FDch re\u0165azcov
SHRC177=Nemo\u017Eno spusti\u0165 bezpe\u010Dn\u00FD re\u017Eim, preto\u017Ee sa pou\u017E\u00EDva vo\u013Eba singleJVM
SHRC082=Nie je mo\u017En\u00E9 vytvori\u0165 identifiedMutex v SH_ClasspathManagerImpl2
J9VM039=Ak nie je zadan\u00E9 -Xshareclasses, -Xscmx sa ignoruje
SHRC083=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre pole identifiedClasspaths v SH_ClasspathManagerImpl2
SHRC084=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre polo\u017Eku pripojen\u00E9ho zoznamu
SHRC085=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre hlavi\u010Dku polo\u017Eky pripojen\u00E9ho zoznamu
SHRC080=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre polo\u017Eku ha\u0161ovacej tabu\u013Eky
SHRC081=Nie je mo\u017En\u00E9 vytvori\u0165 cpeTableMutex v SH_ClasspathManagerImpl2
SHRC086=Nie je mo\u017En\u00E9 zada\u0165 mutex ha\u0161ovacej tabu\u013Eky ClasspathManager
SHRC087=MarkStale zlyhal po\u010Das ClasspathManager\:\:update()
SHRC088=Zlyhalo vytvorenie pam\u00E4te cache ako ROMImageSegment v SH_CacheMap
SHRC089=Nie je mo\u017En\u00E9 obnovi\u0165 mutex v SH_CacheMap
J9TI060=Vytvori\u0165 prihl\u00E1senie na odber podrobn\u00FDch z\u00E1znamov GC
J9TI061=Zru\u0161i\u0165 odber podrobn\u00FDch z\u00E1znamov GC
J9VM030=Vo funkcii JNI bolo pou\u017Eit\u00E9 neplatn\u00E9 UTF8
J9VM031=Vy\u017Eadovan\u00E1 trieda %2$.*1$s mus\u00ED by\u0165 v ceste k triedam zav\u00E1dzania, ale na\u0161la sa v ceste k triedam aplik\u00E1cie v %4$.*3$s
J9TI064=Zlyhala funkcia %s na inicializ\u00E1ciu agenta pre kni\u017Enicu %s, n\u00E1vratov\u00FD k\u00F3d %d
CDRT000=Mapa z\u00E1sobn\u00EDka JIT sa ned\u00E1 n\u00E1js\u0165 - ru\u0161enie VM
J9VM032=Neodstr\u00E1nite\u013En\u00E1 chyba\: nemo\u017Eno zavies\u0165 %1$s\: %2$s
J9TI065=Funkcia %s na inicializ\u00E1ciu agenta sa nena\u0161la v kni\u017Enici %s
J9VM033=Neodstr\u00E1nite\u013En\u00E1 chyba\: inicializ\u00E1cia %s zlyhala
J9TI062=Z\u00EDska smern\u00EDk J9VMThread z jthread
CDRT002=Zlyh\u00E1vaj\u00FAce PC\: %1$p (posunutie %2$p), meta\u00FAdaje \= %3$p
J9VM034=JVMRI vy\u017Eaduje mechanizmus na sledovanie\: spusti\u0165 s pr\u00EDznakom -Xtrace
J9TI063=Z\u00EDska smern\u00EDk J9Method z JMethodID
CDRT001=Met\u00F3da\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
J9VM035=OutOfMemoryError sa ned\u00E1 vyhradi\u0165
J9VM036=vydeli\u0165 nulou
J9VM037=Vyhradenie monitora zlyhalo
J9TI066=Vytvori\u0165 prihl\u00E1senie na odber bodov sledovania VM
J9VM038=-Xthr\: nezn\u00E1ma vo\u013Eba --> '%s'
J9TI067=Zru\u0161i\u0165 odber bodov sledovania VM
SHRC071=Vo\u013Eba pr\u00EDkazov\u00E9ho riadka "%s" vy\u017Eaduje podvo\u013Ebu
J9VM028=\tna %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
SHRC072=Nezn\u00E1ma vo\u013Eba pr\u00EDkazov\u00E9ho riadka "%s"
J9VM029=\tv (nezn\u00E1ma met\u00F3da)
SHRC073=Uklad\u00E1 sa trieda %2$.*1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %3$d a adresou URL %5$.*4$s (index %6$d)...
SHRC074=\ \u00DAspech.
SHRC070=Inkrement\u00E1lne aktualiz\u00E1cie s\u00FA deaktivovan\u00E9
SHRC079=Nie je mo\u017En\u00E9 vytvori\u0165 ha\u0161ovaciu tabu\u013Eku v SH_ClasspathManagerImpl2
SHRC075=\ Zlyhanie.
SHRC076=H\u013Ead\u00E1 sa trieda %1$s v zdie\u013Eanej pam\u00E4ti pre zav\u00E1dza\u010D tried s ID %2$d...
SHRC077=Zlyhalo vytvorenie oblasti linkedListImpl v SH_ClasspathManagerImpl2
SHRC078=Zlyhalo vytvorenie oblasti linkedListHdr v SH_ClasspathManagerImpl2
J9VM020=H\u013Eadanie v %.*s
J9VM021=Nedostatok pam\u00E4te pre mapu z\u00E1sobn\u00EDka interpretera - ru\u0161enie VM
J9VM022=Mapa z\u00E1sobn\u00EDka zlyhala, v\u00FDsledok \= %p - ru\u0161enie VM
J9VM023=Toto m\u00F4\u017Ee znamena\u0165, \u017Ee hodnota JAVA_HOME je nespr\u00E1vna, alebo \u017Ee kni\u017Enice tried nie s\u00FA nain\u0161talovan\u00E9
J9VM024=Do\u0161lo k v\u00FDnimke vo vl\u00E1kne "%.*s"\# START NON-TRANSLATABLE
J9VM025=\tna %2$.*1$s.%4$.*3$s (nat\u00EDvna met\u00F3da)
J9VM026=\tna %2$.*1$s.%4$.*3$s (nezn\u00E1my zdroj)
J9VM027=\tna %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM050=-Xjni\: nezn\u00E1ma vo\u013Eba --> '%s'
J9VM051=Pou\u017Eitie\:\n
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] nastav\u00ED maxim\u00E1lnu ve\u013Ekos\u0165 po\u013Ea v pam\u00E4ti cache JNI\n
J9VM053=V -Xoptionsfile sa na\u0161la chybne vytvoren\u00E1 vo\u013Eba %s
J9VM054=Zlyhalo vytv\u00E1ranie vl\u00E1kna\: n\u00E1vratov\u00E1 hodnota %1$zd, \u010D\u00EDslo chyby %2$zd
J9VM055=Neodstr\u00E1nite\u013En\u00E1 chyba\: hlavn\u00E1 verzia JXE je in\u00E1 ako %d
J9VM056=Hlavn\u00E1 verzia
J9VM057=Prekro\u010Den\u00FD limit pam\u00E4te cache monitora
J9VM058=Ak nie je zadan\u00E9 -Xshareclasses, -Xscminaot sa ignoruje
J9VM059=Ak nie je zadan\u00E9 -Xshareclasses, -Xscmaxaot sa ignoruje
SHRC093=Zisten\u00E9 neo\u010Dak\u00E1van\u00E9 ukon\u010Denie in\u00E9ho JVM po\u010Das aktualiz\u00E1cie
SHRC094=Sirotsk\u00FD s\u00FAbor bol n\u00E1jden\u00FD, ale lok\u00E1lny segment ROMClass bol odovzdan\u00FD do addROMClassToCache
SHRC095=Pokusy o volanie markStale v zdie\u013Ean\u00FDch polo\u017Ek\u00E1ch pam\u00E4te cache zlyhali
SHRC096=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache "%s" je pln\u00E1. Ve\u013Ekos\u0165 pam\u00E4te cache nastav\u00EDte prostredn\u00EDctvom -Xscmx.
SHRC090=Zlyhalo z\u00EDskanie mutexu pam\u00E4te cache v spusten\u00ED SH_CacheMap
SHRC091=\u010C\u00EDta\u0165 po\u0161koden\u00E9 \u00FAdaje pre polo\u017Eku 0x%p (neplatn\u00FD typ \u00FAdajov)
SHRC092=Zlyhanie ADD pri \u010D\u00EDtan\u00ED pam\u00E4te cache
SHRC097=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache "%s" je po\u0161koden\u00E1. K vyrovn\u00E1vacej pam\u00E4ti sa nebud\u00FA m\u00F4c\u0165 pripoji\u0165 \u017Eiadne nov\u00E9 virtu\u00E1lne stroje JVM.\n \tExistuj\u00FAce stroje JVM m\u00F4\u017Eu \u010Falej fungova\u0165, ale nem\u00F4\u017Eu aktualizova\u0165 pam\u00E4\u0165 cache.
SHRC098=\nAktu\u00E1lna \u0161tatistika pre pam\u00E4\u0165 cache "%s"\: \n
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s na 0x%5$p.
JITM031=Hodnota pre '%s' je nespr\u00E1vna
JITM032=Vo\u013Eba '%1$s' nie je \u00FApln\u00E1, mus\u00ED ur\u010Dova\u0165 parameter '%2$s'.
J9VM040=prete\u010Denie z\u00E1sobn\u00EDka opera\u010Dn\u00E9ho syst\u00E9mu
JITM030=Zadan\u00E1 hodnota %s je pr\u00EDli\u0161 ve\u013Ek\u00E1
J9VM041=nespr\u00E1vny po\u010Det argumentov
JITM035=Ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky pre pam\u00E4\u0165 cache pre k\u00F3d JIT; namiesto nej sa pou\u017Eije %3$zu%4$s %5$s
J9VM042=Konfigur\u00E1cia pou\u017Eitia vl\u00E1kien
JITM036=Ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s %3$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky pre pam\u00E4\u0165 cache pre k\u00F3d JIT; namiesto nej sa pou\u017Eije %4$zu%5$s
J9VM043=-----------------------------
JITM033=Vo vo\u013Ebe '-Xlp' sa na\u0161li extra znaky \u010Diarky - ignoruj\u00FA sa
J9VM044=Trojvrstvov\u00E9 syst\u00E9mov\u00E9 monitory s\u00FA podporovan\u00E9
JITM034=Ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky pre pam\u00E4\u0165 cache pre k\u00F3d JIT; namiesto nej sa pou\u017Eije %3$zu%4$s
J9VM045=Trojvrstvov\u00E9 syst\u00E9mov\u00E9 monitory nie s\u00FA podporovan\u00E9
J9VM046=Monitor JLM je podporovan\u00FD
J9VM047=Monitor JLM nie je podporovan\u00FD
JITM037=Ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s %3$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky pre pam\u00E4\u0165 cache pre k\u00F3d JIT; namiesto nej sa pou\u017Eije %4$zu%5$s %6$s
J9VM048=\u010Casy podr\u017Eania monitora JLM s\u00FA podporovan\u00E9
J9VM049=\u010Casy podr\u017Eania monitora JLM nie s\u00FA podporovan\u00E9
J9TI028=Nahl\u00E1si\u0165 koniec v\u00FDpisu RAS.
J9TI029=Zisti\u0165 konfigur\u00E1ciu agenta v\u00FDpisu RAS.
JITM019=Nezhoda komponentu S\u00FAbe\u017En\u00E9 \u010Distenie. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI026=Spusti\u0165 vytvorenie v\u00FDpisu pomocou danej konfigur\u00E1cie RAS.
J9TI027=Nahl\u00E1si\u0165 za\u010Diatok v\u00FDpisu RAS.
J9RI019=jvmri->InjectOutOfMemory nie je podporovan\u00E9.
J9RI017=Nemo\u017Eno vyhradi\u0165 agenta v\u00FDpisov v jvmri->SetOutOfMemoryHook, funkcia nie je registrovan\u00E1.
J9RI018=jvmri->NotifySignal vyvolalo sign\u00E1l %d.
JITM020=Nezhoda komponentu Softv\u00E9rov\u00E1 bari\u00E9ra \u010D\u00EDtania. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
JITM021=Nezhoda komponentu TM. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
JITM024=Nezhoda posunutia komprimovan\u00FDch referenci\u00ED. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI020=Z\u00EDska ID vl\u00E1kna OS z jthread
J9RI015=jvmri->RunDumpRoutine\: componentId je mimo hran\u00EDc.
JITM025=SCC je prive\u013Ek\u00E9, aby JIT spr\u00E1vne zak\u00F3dovalo posunutia. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI021=Z\u00EDska\u0165 inform\u00E1cie o roz\u0161\u00EDrenom r\u00E1mci
J9RI016=jvmri->SetOutOfMemoryHook sa volalo so sp\u00E4tn\u00FDm volan\u00EDm s hodnotou NULL, funkcia nie je registrovan\u00E1.
JITM022=Nezhoda uzamykacieho slova. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9RI013=jvmri->ReleaseRasInfo\: \u0161trukt\u00FAra m\u00E1 nepodporovan\u00E9 pole typu.
JITM023=Nezhoda ve\u013Ekosti Arraylet. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9RI014=jvmri->RunDumpRoutine\: nie je mo\u017En\u00E9 z\u00EDska\u0165 \u00FAdaje komponentov.
JITM028=Konfigur\u00E1cia syst\u00E9mu nepodporuje parameter '%.*s' vo vo\u013Ebe '-Xlp'
J9TI024=Ukon\u010Denie met\u00F3dy bez n\u00E1vratovej hodnoty.
J9RI011=\u0160trukt\u00FAra RasInfo m\u00E1 nepodporovan\u00E9 pole typu.
JITM029=Za %s mus\u00ED nasledova\u0165 \u010D\u00EDslo
J9TI025=Povoli\u0165 priame JNI v pr\u00EDtomnosti udalost\u00ED zadania a ukon\u010Denia met\u00F3dy (n\u00E1sledkom \u010Doho m\u00F4\u017Eu vznikn\u00FA\u0165 potenci\u00E1lne nepresn\u00E9 spr\u00E1vy o zadan\u00ED a ukon\u010Den\u00ED)
J9RI012=jvmri->ReleaseRasInfo sa volalo so \u0161trukt\u00FArou RasInfo s hodnotou NULL.
JITM026=Nezn\u00E1my probl\u00E9m. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI022=Z\u00EDska\u0165 inform\u00E1cie o roz\u0161\u00EDrenom r\u00E1mci pre v\u0161etky sledovania z\u00E1sobn\u00EDka.
JITM027=JIT zlyhalo pri vyhradzovan\u00ED pam\u00E4te
J9TI023=Z\u00EDska\u0165 inform\u00E1cie o roz\u0161\u00EDrenom r\u00E1mci pre zoznam vl\u00E1kien.
J9RI010=jvmri->GetRasInfo nem\u00F4\u017Ee vyhradi\u0165 pam\u00E4\u0165.
J9TI039=Zni\u010Di\u0165 ur\u010Den\u00FA zdie\u013Ean\u00FA pam\u00E4\u0165 cache.
JITM008=Zlyhala valid\u00E1cia hlavi\u010Dky AOT; po\u0161koden\u00FD za\u010Diato\u010Dn\u00FD sanity bit pr\u00EDznaku komponentu. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI037=Z\u00EDskal celkov\u00FA pam\u00E4\u0165 haldy.
JITM009=Zlyhala valid\u00E1cia hlavi\u010Dky AOT; po\u0161koden\u00FD koncov\u00FD sanity bit pr\u00EDznaku komponentu. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI038=Iterova\u0165 cez zdie\u013Ean\u00E9 pam\u00E4te cache.
J9RI008=jvmri->GetRasInfo nem\u00F4\u017Ee z\u00EDska\u0165 komponenty.
J9RI009=jvmri->GetRasInfo nem\u00F4\u017Ee vyhradi\u0165 pam\u00E4\u0165.
J9RI006=jvmri->GetRasInfo sa volalo so \u0161trukt\u00FArou RasInfo s hodnotou NULL.
J9RI007=jvmri->GetRasInfo nem\u00F4\u017Ee vyhradi\u0165 pam\u00E4\u0165.
JITM010=Nezhoda komponentu SMP. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
JITM013=Nezhoda komponentu Zak\u00E1za\u0165 preru\u0161enia. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI031=Zru\u0161i\u0165 asynchr\u00F3nnu udalos\u0165 v jednom alebo v\u0161etk\u00FDch vl\u00E1knach
J9RI004=jvmri->DynamicVerbosegc nie je odporovan\u00E9.
JITM014=Nezhoda komponentu Predv\u00FDber TLH. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI032=Ozna\u010Duje, \u017Ee vl\u00E1kno spracovalo asynchr\u00F3nnu udalos\u0165
J9RI005=Komponent jvmri->GetComponentDataArea %s pod t\u00FDmto VM nem\u00E1 dataArea.
JITM011=Nezhoda komponentu Komprimovan\u00E9 referencie. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9RI002=jvmri->DumpRegister sa volalo so sp\u00E4tn\u00FDm volan\u00EDm s hodnotou NULL, funkcia nie je registrovan\u00E1.
JITM012=Nezhoda komponentu DFP. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI030=Signalizova\u0165 asynchr\u00F3nnu udalos\u0165 v jednom alebo v\u0161etk\u00FDch vl\u00E1knach
J9RI003=Nemo\u017Eno vyhradi\u0165 agenta v\u00FDpisov v jvmri->DumpRegister, funkcia nie je registrovan\u00E1.
JITM017=Nezhoda komponentu Povolen\u00E9 SIMD. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI035=Dokon\u010Dil sa cyklus zhroma\u017E\u010Fovania odpadu.
J9RI000=jvmri->CreateThread nem\u00F4\u017Ee vyhradi\u0165 pam\u00E4\u0165 pre argumenty vl\u00E1kna
JITM018=Nezhoda komponentu Asynchr\u00F3nna kompil\u00E1cia. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI036=Z\u00EDska\u0165 aktu\u00E1lnu vo\u013En\u00FA pam\u00E4\u0165 haldy.
J9RI001=Nastala intern\u00E1 chyba pri odstra\u0148ovan\u00ED agenta v\u00FDpisov v jvmri->DumpDeregister. Registr\u00E1cia funkcie v\u00FDpisov sa mo\u017Eno nezru\u0161ila.
JITM015=Nezhoda komponentu Trampol\u00EDna met\u00F3dy. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI033=Vynulova\u0165 vo\u013Eby v\u00FDpisu VM.
JITM016=Nezhoda komponentu Povolen\u00E9 HCR. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI034=Spustil sa cyklus zhroma\u017E\u010Fovania odpadu.
J9VM017=Nebolo mo\u017En\u00E9 vyhradi\u0165 pam\u00E4\u0165 pre pole volieb pr\u00EDkazov\u00E9ho riadka
J9VM018=Nebolo mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre oblas\u0165 zav\u00E1dzacej tabu\u013Eky zdie\u013Eanej kni\u017Enice
J9VM019=Neodstr\u00E1nite\u013En\u00E1 \: Vy\u017Eadovan\u00E1 trieda %.*s sa ned\u00E1 n\u00E1js\u0165 a inicializova\u0165
J9TI048=Z\u00EDska meta\u00FAdaje sledovania, ktor\u00E9 mo\u017Eno pou\u017Ei\u0165 form\u00E1tova\u010Dom na spracovanie vyrovn\u00E1vac\u00EDch pam\u00E4t\u00ED sledovania
J9TI049=Vr\u00E1ti\u0165 n\u00E1zvy triedy, met\u00F3dy a bal\u00EDka pre mno\u017Einu ukazovate\u013Eov na met\u00F3du RAM
JITM002=Zlyhanie pri ukladan\u00ED k\u00F3du AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy. Pam\u00E4\u0165 cache zdie\u013Ean\u00FDch tried je mo\u017Eno po\u0161koden\u00E1. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9TI042=Signalizova\u0165 automatick\u00E9 zna\u010Dky pre nov\u00FD vyhraden\u00FD objekt a jeho triedu.
JITM003=Zlyhanie pri inicializ\u00E1cii AOT runtime. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9VM010=Inicializ\u00E1cia %s zlyhala
J9TI043=Signalizova\u0165 zavedenie triedy iba pre triedy po\u013Ea.
JITM000=Nepodporovan\u00FD hardv\u00E9r [%d].
J9VM011=Nemo\u017Eno zavies\u0165 %1$s\: %2$s
J9TI040=Prid\u00E1 roz\u0161\u00EDren\u00FA schopnos\u0165 can_autotag_objects.
JITM001=\u017Diadny priestor pre k\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy. Nov\u00FD k\u00F3d AOT sa nevygeneruje.
J9VM012=Nemo\u017Eno zru\u0161i\u0165 zavedenie %1$s\: %2$s
J9TI041=Signalizova\u0165 udalos\u0165 premenovan\u00FDch objektov (presunut\u00E9 alebo vymazan\u00E9).
JITM006=K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy nemo\u017Eno spusti\u0165 s aktu\u00E1lnou politiky zhroma\u017E\u010Fovania odpadu. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9VM013=Nastala chyba inicializ\u00E1cie vo funkcii %1$s(%2$d)\: %3$s
J9TI046=Zru\u0161i\u0165 prihl\u00E1senie na odber extern\u00FDch sledovac\u00EDch z\u00E1znamov
JITM007=K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy nemo\u017Eno spusti\u0165 s aktu\u00E1lnymi nastaveniami JVMPI alebo JVMTI. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9VM014=Nastala chyba vypnutia vo funkcii %1$s(%2$d)\: %3$s
J9TI047=V\u0161etky pou\u017E\u00EDvan\u00E9 sledovacie z\u00E1znamy sa vypn\u00FA a odovzdaj\u00FA odberate\u013Eom sledovania
JITM004=K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa ned\u00E1 spusti\u0165 na aktu\u00E1lnom procesore. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9VM015=Nastala chyba inicializ\u00E1cie pre kni\u017Enicu  %1$s(%2$d)\: %3$s
J9TI044=Vymaza\u0165 v\u0161etky zna\u010Dky objektu.
JITM005=K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy nemo\u017Eno spusti\u0165 v aktu\u00E1lnom vydan\u00ED JVM. K\u00F3d AOT v zdie\u013Eanej pam\u00E4ti cache pre triedy sa bude ignorova\u0165.
J9VM016=Nastala chyba vypnutia pre kni\u017Enicu %1$s(%2$d)\: %3$s
J9TI045=Vytvori\u0165 prihl\u00E1senie na odber extern\u00FDch sledovac\u00EDch z\u00E1znamov
MECK001=Nerozpoznan\u00E1 vo\u013Eba -Xcheck\:memory\: %s
J9VM006=Neplatn\u00E1 vo\u013Eba pr\u00EDkazov\u00E9ho riadka\: %s
MECK000=Po\u010Das inicializ\u00E1cie pomocn\u00E9ho programu -Xcheck\:memory nastala chyba
J9VM007=Nezn\u00E1ma vo\u013Eba pr\u00EDkazov\u00E9ho riadka\: %s
J9VM008=J9VMDllMain sa nena\u0161lo
J9TI059=Z\u00EDska\u0165 mno\u017Estvo nat\u00EDvnej pam\u00E4te, ktor\u00FA pou\u017E\u00EDva JVM, s rozdelen\u00EDm do kateg\u00F3ri\u00ED pam\u00E4te.
MECK002=Pri vytv\u00E1ran\u00ED \u0161trukt\u00FAry \u00FAdajov na str\u00E1nke volania nastala chyba. Inform\u00E1cie o str\u00E1nke volania nebud\u00FA zobrazen\u00E9
J9VM009=J9VMDllMain zlyhalo
J9TI050=Z\u00EDska\u0165 hodnotu hash pre monitor objektu.
J9TI053=Nastavi\u0165 vo\u013Eby protokolu VM.
J9TI054=Po\u017Eiada\u0165 o v\u00FDpis monitora JLM (Java Lock Monitor) so \u0161pecifik\u00E1torom form\u00E1tu.
J9VM000=Chybne vytvoren\u00E1 hodnota pre IBM_JAVA_OPTIONS
J9TI051=Zru\u0161i\u0165 pr\u00EDznak pre met\u00F3du pre selekt\u00EDvnu polo\u017Eku a ozn\u00E1menie o ukon\u010Den\u00ED.
J9VM001=Chybne vytvoren\u00E1 hodnota pre -Xservice
J9TI052=Zisti\u0165 aktu\u00E1lne vo\u013Eby protokolu VM.
J9VM002=S\u00FAbor volieb sa nena\u0161iel
J9TI057=Nebolo mo\u017En\u00E9 konvertova\u0165 nat\u00EDvny re\u0165azec volieb protokolu JVM.
J9VM003=Preklada\u010D JIT "%s" sa nena\u0161iel. Pou\u017Eije sa interpreter.
J9TI058=Nebolo mo\u017En\u00E9 nastavi\u0165 vo\u013Eby protokolu JVM.
J9VM004=Nie je mo\u017En\u00E9 zavies\u0165 kni\u017Enicu, ktor\u00FA potrebuje\: %s
J9TI055=Nebolo mo\u017En\u00E9 vyhradi\u0165 vyrovn\u00E1vaciu pam\u00E4\u0165 pre vo\u013Eby protokolu JVM.
J9VM005=Neplatn\u00E1 hodnota pre premenn\u00FA prostredia\: %s
J9TI056=Nebolo mo\u017En\u00E9 dotazova\u0165 vo\u013Eby protokolu JVM.
PORT033=Nena\u0161iel sa podporovan\u00FD hypervisor.
PORT032=Zlyhala oper\u00E1cia s\u00FAvisiaca s hypervisorom.
PORT031=Prijala sa podmienka LE %s%i, ktor\u00E1 zodpoved\u00E1 sign\u00E1lu POSIX zo softv\u00E9ru
PORT030=Nastavenie %s "%s" ur\u010Duje, \u017Ee v\u00FDpis pam\u00E4te jadra sa m\u00E1 posla\u0165 do extern\u00E9ho programu.  Rob\u00ED sa pokus o premenovanie core alebo core.%d.\n
PORT037=Nie je spusten\u00E9 v hypervisorovi.
PORT036=Neo\u010Dak\u00E1van\u00FD n\u00E1vratov\u00FD k\u00F3d zo slu\u017Eby CSRSI v z/OS
PORT035=__malloc31 zlyhalo pri vyhradzovan\u00ED vyrovn\u00E1vacej pam\u00E4te v z/OS
PORT034=Spravil sa pokus o priradenie zdie\u013Eanej pam\u00E4te vytvorenej ochrannom k\u013E\u00FA\u010Di %lu \u00FAlo\u017En\u00E9ho priestoru, ale v s\u00FA\u010Dasnosti sa pou\u017E\u00EDva v k\u013E\u00FA\u010Di %lu.
PORT039=Zlyhala aktualiz\u00E1cia HYPFS
PORT038=Chybne vytvoren\u00E1 hodnota pre IBM_JAVA_HYPERVISOR_SETTINGS
PORT022=Prid\u00E1va sa .X&DS k u\u017E\u00EDvate\u013Eom zadanej \u0161abl\u00F3ne v\u00FDpisu na povolenie viacdielnych v\u00FDpisov.
PORT021=Otvorili ste zastaral\u00FD zdie\u013Ean\u00FD semafor System V\: s\u00FAbor\:%1$s, semid\:%2$d
PORT020=Otvorili ste zastaral\u00FA zdie\u013Ean\u00FA pam\u00E4\u0165 System V\: s\u00FAbor\:%1$s, shmid\:%2$d
PORT026=Zadan\u00FD s\u00FAbor je adres\u00E1r
PORT025=Neplatn\u00FD typ z\u00E1mku pre oper\u00E1ciu zamknutia. Pr\u00EDznaky z\u00E1mku\: %1$d
PORT024=IEATDUMP zlyhalo, preto\u017Ee nebolo mo\u017En\u00E9 vyhradi\u0165 mno\u017Einu \u00FAdajov v\u00FDpisu (skontrolujte diskov\u00FD priestor a opr\u00E1vnenia pol\u00ED).
PORT023=IEATDUMP zlyhalo, preto\u017Ee u\u017E\u00EDvate\u013Eom zadan\u00E1 \u0161abl\u00F3na v\u00FDpisu bola pridlh\u00E1. Sprav\u00ED sa pokus o v\u00FDpis pomocou predvolenej \u0161abl\u00F3ny.
PORT029=Neplatn\u00FD identifik\u00E1tor. Identifik\u00E1tor s\u00FAboru\: %1$d.
PORT028=mmap zlyhalo, preto\u017Ee vo\u013Eby mapovania s\u00FA neplatn\u00E9.
PORT027=mmap zlyhalo, preto\u017Ee parameter ochrany pam\u00E4te je neplatn\u00FD.
PORT011=Nemo\u017Eno vyhradi\u0165 pam\u00E4\u0165 po\u010Das pokusu o na\u010D\u00EDtanie zdie\u013Eanej kni\u017Enice
PORT010=Nie je udelen\u00E9 opr\u00E1vnenia na na\u010D\u00EDtanie zdie\u013Eanej kni\u017Enice
PORT015=Nie je mo\u017En\u00E9 interpretova\u0165 odkazy na zdie\u013Ean\u00FA kni\u017Enicu - mo\u017Eno ch\u00FDba zdie\u013Ean\u00E1 kni\u017Enica nevyhnutnej podmienky
PORT014=Zlyhalo na\u010D\u00EDtavanie dll, preto\u017Ee sa nena\u0161lo
PORT013=Nastala chyba pri na\u010D\u00EDtavan\u00ED kni\u017Enice - nena\u0161la sa tabu\u013Eka dll
PORT012=Nastala chyba pri na\u010D\u00EDtavan\u00ED zdie\u013Eanej kni\u017Enice, preto\u017Ee je nastaven\u00FD bit PACE
PORT019=Nemo\u017Eno vytvori\u0165 adres\u00E1r %s.  Zdie\u013Ean\u00E9 triedy bud\u00FA zak\u00E1zan\u00E9, k\u00FDm sa nevytvor\u00ED tento adres\u00E1r.
PORT018=Oper\u00E1cia zlyhala\: %1$d (%2$s zlyhalo\: %3$d)
PORT017=Oper\u00E1cia zlyhala\: %d
PORT016=Intern\u00E1 chyba %i
PORT000=
ZIPS000=Nemo\u017Eno otvori\u0165 %1$s (%2$s)
ZIPS001=%s sa ned\u00E1 otvori\u0165 (ch\u00FDba export)
PORT009=Zadan\u00E1 zdie\u013Ean\u00E1 kni\u017Enica sa nena\u0161la
PORT004=Preklad symbolu zlyhal
PORT003=Nebolo mo\u017En\u00E9 zavies\u0165 z\u00E1visl\u00FD modul %s
PORT002=Nezn\u00E1ma chyba pri zav\u00E1dzan\u00ED zdie\u013Eanej kni\u017Enice
PORT001=Zlyhalo vyhradzovanie pam\u00E4te po\u010Das pokusu o z\u00E1pis do s\u00FAboru.
PORT008=Modul nem\u00E1 spr\u00E1vnu architekt\u00FAru
J9RI022=inicializ\u00E1cia JVMRI nedok\u00E1\u017Ee vyhradi\u0165 monitor v\u00FDpisov pam\u00E4te jvmri
PORT007=Zadan\u00FD model nie je modul
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister a TraceListener u\u017E nie s\u00FA podporovan\u00E9, pou\u017Eite nov\u00E9 verzie v JVMRAS_VERSION_1_5
PORT006=Form\u00E1t modulu je nespr\u00E1vny
J9RI020=jvmri->CreateThread nem\u00F4\u017Ee vyhradi\u0165 s\u00FAkromn\u00FD monitor
PORT005=Nebolo mo\u017En\u00E9 na\u010D\u00EDta\u0165 zdie\u013Ean\u00FA kni\u017Enicu
J9RI021=jvmri->RunDumpRoutine nie je podporovan\u00E9.
J9VM070=do\u0161lo k vy\u010Derpaniu nat\u00EDvnej pam\u00E4te pri viazan\u00ED nat\u00EDvnej met\u00F3dy %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM071=pokus o rekurz\u00EDvne viazanie nat\u00EDvnej met\u00F3dy %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM072=vy\u010Derpala sa nat\u00EDvna pam\u00E4\u0165
J9VM073=Trieda %2$.*1$s pristupuje neplatne k \u010Dlenovi %3$s triedy %5$.*4$s
J9VM074=Trieda %2$.*1$s pristupuje neplatne k %3$s trieda %5$.*4$s
J9VM075=neplatn\u00E1 oper\u00E1cia vo vl\u00E1kne eventron
J9VM076=vy\u010Derpala sa nat\u00EDvna pam\u00E4\u0165 pri vyhradzovan\u00ED polo\u017Eky zoznamu pre objekt na dokon\u010Denie alebo objekt referencie
J9VM077=Pozn\u00E1mka\: Vo\u013Eba -Xdfpbd nem\u00E1 v tomto vydan\u00ED Java \u017Eiadny \u00FA\u010Dinok
J9VM078=Chybne vytvoren\u00E1 hodnota pre JAVA_TOOL_OPTIONS
J9VM079=triggerOneOffDump(%1$s) vy\u017Eaduje %2$s
J9VM060=runNamedDump(%1$s) vy\u017Eaduje %2$s
J9VM061=insertDumpAgent vy\u017Eaduje %s
J9VM062=removeDumpAgent vy\u017Eaduje %s
J9VM063=seekDumpAgent vy\u017Eaduje %s
J9VM064=setDumpOption vy\u017Eaduje %s
J9VM065=objekt nie je in\u0161tanciou deklarovanej triedy
J9VM066=nezhoda typu argumentu
J9VM067=-Xshareclasses nie je povolen\u00E9, vo\u013Eba -Xzero\:sharezip sa ignoruje
J9VM068=-Xshareclasses nie je povolen\u00E9, vo\u013Eba -Xzero\:sharestring sa ignoruje
J9VM069=zav\u00E1dza sa naru\u0161enie obmedzenia\: zav\u00E1dza\u010D "%2$.*1$s@%3$x" u\u017E inicializoval zavedenie pre in\u00FD typ s n\u00E1zvom "%5$.*4$s", ktor\u00FD je definovan\u00FD zav\u00E1dza\u010Dom "%7$.*6$s@%8$x"
SHRC500=Oblas\u0165 ladenia je po\u0161koden\u00E1, preto\u017Ee n\u00EDzka adresa vo\u013En\u00E9ho priestoru %p je v\u00E4\u010D\u0161ia ako vysok\u00E1 adresa vo\u013En\u00E9ho priestoru %p
SHRC505=Oblas\u0165 ladenia je po\u0161koden\u00E1, preto\u017Ee vysok\u00E1 adresa vo\u013En\u00E9ho priestoru %p m\u00EDnus n\u00EDzka adresa vo\u013En\u00E9ho priestoru %p presahuje ve\u013Ekos\u0165 ladiaceho regi\u00F3nu %lu bajtov
SHRC506=Oblas\u0165 ladenia je po\u0161koden\u00E1, preto\u017Ee jej ve\u013Ekos\u0165 %lu je v\u00E4\u010D\u0161ia ako celkov\u00E1 ve\u013Ekos\u0165 pam\u00E4te cache %u, ktor\u00E1 je ulo\u017Een\u00E1 v hlavi\u010Dke pam\u00E4te cache
J9VM090=Pomal\u00E1 odpove\u010F na sie\u0165ov\u00FD dotaz (%d sek\u00FAnd). Skontrolujte konfigur\u00E1ciu IP DNS
SHRC507=Vykona\u0165 extra kontroly pri ukladan\u00ED a vyhradzovan\u00ED \u00FAdajov ladenia triedy
J9VM091=Adapt\u00EDvne rotovanie je podporovan\u00E9
SHRC508=Z\u00EDskal sa in\u00FD semafor, ako sa v minulosti pou\u017E\u00EDval pre t\u00FAto pam\u00E4\u0165 cache. ID star\u00E9ho semafora\: %d, ID nov\u00E9ho semafora\: %d
J9VM092=Adapt\u00EDvne rotovanie nie je podporovan\u00E9
SHRC501=Oblas\u0165 ladenia je po\u0161koden\u00E1, preto\u017Ee n\u00EDzka adresa '\u00FAdajov tabu\u013Eky \u010D\u00EDsiel riadkov' %p je v\u00E4\u010D\u0161ia ako vysok\u00E1 adresa %p
J9VM093=T\u00E1to verzia Java vy\u017Eaduje CPU s podporou SSE2 alebo nov\u0161\u00EDch roz\u0161\u00EDren\u00ED.  Pozrite si inform\u00E1cie Podporovan\u00E9 prostredia v u\u017E\u00EDvate\u013Eskej pr\u00EDru\u010Dke pre IBM Java, kde n\u00E1jdete viac podrobnost\u00ED.
SHRC502=Oblas\u0165 ladenia je po\u0161koden\u00E1, preto\u017Ee n\u00EDzka adresa '\u00FAdajov tabu\u013Eky lok\u00E1lnych premenn\u00FDch' %p je v\u00E4\u010D\u0161ia ako vysok\u00E1 adresa %p
J9VM094=Vl\u00E1kno "%s" st\u00E1le existuje aj po spusten\u00ED zah\u00E1knut\u00ED ukon\u010Denia.
SHRC503=Oblas\u0165 ladenia je po\u0161koden\u00E1, preto\u017Ee ukladanie %d bajtov 'tabu\u013Eky \u010D\u00EDsiel riadkov' a %d bajtov 'tabu\u013Eky lok\u00E1lnych premenn\u00FDch' sp\u00F4sob\u00ED, \u017Ee vysok\u00E1 adresa '\u00FAdajov tabu\u013Eky \u010D\u00EDsiel riadkov' %p bude v\u00E4\u010D\u0161ia ako nov\u00E1 n\u00EDzka adresa '\u00FAdajov tabu\u013Eky lok\u00E1lnych premenn\u00FDch' %p
J9VM095=zav\u00E1dzanie naru\u0161enia obmedzenia pri anal\u00FDze met\u00F3dy "%2$.*1$s.%4$.*3$s%6$.*5$s"\: zav\u00E1dza\u010D "%8$.*7$s@%9$x" triedy "%11$.*10$s" a zav\u00E1dza\u010D "%13$.*12$s@%14$x" triedy "%16$.*15$s" maj\u00FA r\u00F4zne typy pre podpis met\u00F3dy
SHRC504=Za\u010Diatok pam\u00E4te cache \u00FAdajov m\u00E1 hodnotu null. Za\u010Diatok \u00FAdajov\: %p
J9VM096=Ak nie je zadan\u00E9 -Xshareclasses, -Xscdmx sa ignoruje
J9VM097=\nPou\u017Eitie\:\n
J9VM098=-Xsyslog\:help              Vytla\u010Di\u0165 pomoc pre JVM -Xsyslog.
J9VM099=-Xsyslog\:none              Zak\u00E1za\u0165 u\u017E zadan\u00E9 vo\u013Eby protokolu JVM vr\u00E1tane predvolen\u00FDch nastaven\u00ED.
SHRC509=Vytvorte pam\u00E4\u0165 cache, ktor\u00E1 bude o gener\u00E1ciu star\u0161ia ako aktu\u00E1lna gener\u00E1cia.
PORT040=Zlyhalo \u010D\u00EDtanie HYPFS
PORT044=Zlyhalo vyhradzovanie pam\u00E4te po\u010Das z\u00EDskavania inform\u00E1ci\u00ED o hypervisore.
PORT043=%1$d\: Zlyhalo z\u00EDskavanie inform\u00E1ci\u00ED %2$s.
PORT042=Ned\u00E1 sa \u010D\u00EDta\u0165 /proc/sysinfo
PORT041=HYPFS nie je pripojen\u00E9
J9VM080=queryVmDump vy\u017Eaduje %s
J9VM081=Chybne vytvoren\u00E1 hodnota vo\u013Eby. Vo\u013Eba "%1$s%3$.*2$s" obsahuje koncov\u00E9 znaky "%4$s", ktor\u00E9 sa ignorovali.
J9VM082=Nemo\u017Eno vykona\u0165 prepnutie na procesor IFA - zadajte "extattr +a lib%s.so"
J9VM083=Nastala chyba pri prep\u00EDnan\u00ED na procesor IFA, n\u00E1vratov\u00FD k\u00F3d\: %08x
J9VM084=Chyba IFA\: neo\u010Dak\u00E1van\u00FD n\u00E1vratov\u00FD k\u00F3d %08x zo slu\u017Eby prep\u00EDna\u010Da IFA
J9VM085=Chybne vytvoren\u00E1\: '%s'
PORT048=Zlyhalo vytv\u00E1ranie v\u00FDpisu syst\u00E9movej pam\u00E4te, preto\u017Ee existuje neregul\u00E1rny s\u00FAbor "%s" s rovnak\u00FDm n\u00E1zvom, ktor\u00FD sa mal pou\u017Ei\u0165 pre s\u00FAbor v\u00FDpisu syst\u00E9movej pam\u00E4te.
J9VM086=Vo\u013Eba je pr\u00EDli\u0161 ve\u013Ek\u00E1\: '%s'
PORT047=Nedostatok pam\u00E4te vo vyrovn\u00E1vacej pam\u00E4ti po\u010Das pokusu o na\u010D\u00EDtanie zdie\u013Eanej kni\u017Enice
J9VM087=resetDumpOption vy\u017Eaduje %s
PORT046=Nebolo mo\u017En\u00E9 otvori\u0165 vykonate\u013En\u00FD s\u00FAbor
J9VM088=Varovanie\: nie je nakonfigurovan\u00E9 syscorepath, \u010Do m\u00F4\u017Ee br\u00E1ni\u0165 generovaniu s\u00FAboru jadra syst\u00E9mu (ak je potrebn\u00FD).\n\t\tPozrite si pokyny k in\u0161tal\u00E1cii WebSphere Real Time, kde n\u00E1jdete spr\u00E1vne nastavenia pre konfigur\u00E1ciu syscorepath.\n\t\tPOZN\u00C1MKA\: syscorepath je nutn\u00E9 nakonfigurova\u0165 pri ka\u017Edom re\u0161tarte stroja.
PORT045=Zlyhalo vyhradzovanie pam\u00E4te po\u010Das z\u00EDskavania inform\u00E1ci\u00ED o syst\u00E9me.
J9VM089=Varovanie\: nemo\u017Eno skontrolova\u0165 nastavenia syscorepath pomocou sysconfig\: %s.
SHRC400=Bajty pam\u00E4te cache Zip              %*c\= %d
SHRC401=\# pam\u00E4t\u00ED cache Zip                  %*c\= %d
SHRC406=za\u010Diato\u010Dn\u00E1 adresa meta\u00FAdajov        %*c\= 0x%p
SHRC407=pr\u00EDznaky pre \u010Das vykon\u00E1vania        %*.c\= 0x%.16llX
SHRC408=gener\u00E1cia pam\u00E4te cache            %*.c\= %d\n
SHRC409=Bajty k\u00F3du AOT                      %*c\= %d
SHRC402=\u00DAdajov\u00E9 bajty JIT                   %*c\= %d
SHRC403=Pou\u017Eit\u00E9 bajty oblasti ladenia tried %*c\= %u
SHRC404=Zlyhalo z\u00EDskavanie adres\u00E1ra pre pam\u00E4\u0165 cache
SHRC405=Zlyhalo vytv\u00E1ranie adres\u00E1ra pre pam\u00E4\u0165 cache
SHRC420=\# \u00FAdajov\u00FDch polo\u017Eiek AOT            %*c\= %d
SHRC421=\# hierarchia tried AOT              %*c\= %d
SHRC422=\# konverzn\u00FDch modulov               %*c\= %d
SHRC423=\# r\u00E1d JIT                           %*c\= %d
SHRC428=Odstr\u00E1nen\u00E1 star\u0161ia gener\u00E1cia zdie\u013Eanej pam\u00E4te cache pre triedy "%s"
SHRC429=Zlyhalo odstra\u0148ovanie star\u0161ej gener\u00E1cie zdie\u013Eanej pam\u00E4te cache pre triedy "%s"
SHRC424=\# profilov JIT                      %*c\= %d
SHRC425=\# objektov Java                     %*c\= %d
SHRC426=\# polo\u017Eiek JCL                      %*c\= %d
SHRC427=Modifik\u00E1tor pou\u017Eit\u00FD na tla\u010D podrobnej \u0161tatistiky pam\u00E4te cache
SHRC410=\u00DAdajov\u00E9 bajty AOT                   %*c\= %d
SHRC411=Bajty hierarchie tried AOT          %*c\= %d
SHRC412=Bajty konverzn\u00E9ho modulu AOT        %*c\= %d
SHRC417=\u00DAdajov\u00E9 bajty JCL                   %*c\= %d
SHRC418=Bajty bajtov\u00FDch \u00FAdajov              %*c\= %d
SHRC419=LocalVariableTable bajtov triedy    %*c\= %u
SHRC413=Bajty r\u00E1d JIT                       %*c\= %d
SHRC414=Bajty profilu JIT                   %*c\= %d
SHRC415=Bajty objektu Java                  %*c\= %d
SHRC416=Bajty ReadWrite                    %*c\= %d
SHRC442=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache "%s" je po\u0161koden\u00E1. K\u00F3d po\u0161kodenia je %d. Hodnota po\u0161kodenia je 0x%p. K vyrovn\u00E1vacej pam\u00E4ti sa nebud\u00FA m\u00F4c\u0165 pripoji\u0165 \u017Eiadne nov\u00E9 virtu\u00E1lne stroje JVM.\n \tExistuj\u00FAce stroje JVM m\u00F4\u017Eu \u010Falej fungova\u0165, ale nem\u00F4\u017Eu aktualizova\u0165 pam\u00E4\u0165 cache.
SHRC443=CRC pam\u00E4te cache je nespr\u00E1vne, \u010Do indikuje po\u0161koden\u00FA pam\u00E4\u0165 cache. Nespr\u00E1vne CRC pam\u00E4te cache\: 0x%x.
SHRC444=\u010C\u00EDtanie po\u0161koden\u00FDch \u00FAdajov pre hlavi\u010Dku 0x%p z\u00E1znamu pam\u00E4te cache (neplatn\u00E1 d\u013A\u017Eka polo\u017Eky)
SHRC445=Ve\u013Ekos\u0165 pam\u00E4te cache je pr\u00EDli\u0161 mal\u00E1, aby bola pam\u00E4\u0165 u\u017Eito\u010Dn\u00E1. Neplatn\u00E1 ve\u013Ekos\u0165 pam\u00E4te cache\: 0x%x.
SHRC440=Hodnota -XscminJIT je v\u00E4\u010D\u0161ia ako hodnota -Xscmx a preto bola nastaven\u00E1 na rovnak\u00FA hodnotu -Xscmx
SHRC441=Hodnota -XscmaxJIT je v\u00E4\u010D\u0161ia ako hodnota -Xscmx a preto bola nastaven\u00E1 na neobmedzen\u00FA
SHRC446=Zlyhalo z\u00EDskavanie z\u00E1mku pre z\u00E1pis hlavi\u010Dky po\u010Das sp\u00FA\u0161\u0165ania pam\u00E4te cache s k\u00F3dom chyby\: %d.
SHRC447=P\u00FAta\u010D hlavi\u010Dky pam\u00E4te cache je neplatn\u00FD. Adresa re\u0165azca p\u00FAta\u010Da v hlavi\u010Dke pam\u00E4te cache\: 0x%p.
SHRC448=Pole ve\u013Ekosti pam\u00E4te cache v hlavi\u010Dke pam\u00E4te cache je neplatn\u00E9. Ve\u013Ekos\u0165 pam\u00E4te cache v hlavi\u010Dke pam\u00E4te cache je\: 0x%x.
SHRC449=V\u00FDpl\u0148 nie je nulov\u00E1. Bajty v\u00FDplne v hlavi\u010Dke pam\u00E4te cache s\u00FA\: %u.
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC432=\ Podpis\: %2$.*1$s, adresa\: 0x%3$p
SHRC433=\tpre ROMClass %2$.*1$s na 0x%3$p.
SHRC434=Hodnota %d odovzdan\u00E1 vo\u013Ebou -Xitsn je mimo rozsahu hodn\u00F4t prvo\u010D\u00EDsiel, ktor\u00E9 podporuje VM. Podporovan\u00FD rozsah je 0 - %u
SHRC430=Zlyhalo odstra\u0148ovanie aktu\u00E1lnej gener\u00E1cie zdie\u013Eanej pam\u00E4te cache pre triedy "%s"
SHRC439=Hodnota -XscminJIT by nemala by\u0165 v\u00E4\u010D\u0161ia ako hodnota -XscmaxJIT
SHRC435=-Xitsn%2$u pou\u017E\u00EDva %1$u bajtov pam\u00E4te, \u010Do je viac ako ve\u013Ekos\u0165 zdie\u013Eanej pam\u00E4te cache s %3$u bajtami
SHRC436=Chyba pri z\u00EDskavan\u00ED z\u00E1mku z\u00E1pisu hlavi\u010Dky s\u00FAboru pam\u00E4te cache zdie\u013Eanej triedy
SHRC437=Nastala chyba pri uvo\u013E\u0148ovan\u00ED z\u00E1mku na \u010D\u00EDtanie hlavi\u010Dky s\u00FAboru zdie\u013Eanej pam\u00E4te cache pre triedy
SHRC438=Zak\u00E1za\u0165 ukladanie \u00FAdajov JIT v zdie\u013Eanej pam\u00E4ti cache
JNCK101=Chyba JNI v %1$s\: O\u010Dak\u00E1val sa statick\u00FD argument \#%2$d, ale do JNI bolo odovzdan\u00E9 ID nestatick\u00E9ho po\u013Ea
JNCK102=Chyba JNI v %1$s\: O\u010Dak\u00E1val sa nestatick\u00FD argument \#%2$d, ale do JNI bolo odovzdan\u00E9 ID statick\u00E9ho po\u013Ea
JNCK100=Rada JNI v %1$s\: T\u00E1to funkcia sa ned\u00E1 pou\u017Ei\u0165 so zbalen\u00FDmi objektmi. Namiesto toho pou\u017Eite %2$s
SHRC464=Povoli\u0165 podrobn\u00FD v\u00FDstup \u00FAdajov JIT
SHRC465=[-Xshareclasses Povolen\u00FD podrobn\u00FD v\u00FDstup \u00FAdajov JIT]
SHRC466=Na\u0161lo sa %1$s pripojen\u00FDch \u00FAdajov pre %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC467=Zlyhalo h\u013Eadanie %1$s pripojen\u00FDch \u00FAdajov pre %8$.*7$s.%4$.*3$s.%6$.*5$s, pr\u00ED\u010Dina \:%2$s
SHRC460=Zak\u00E1za\u0165 ukladanie \u00FAdajov JIT v zdie\u013Eanej pam\u00E4ti cache
SHRC461=Hodnota -Xscminjitdata by nemala by\u0165 v\u00E4\u010D\u0161ia ako hodnota -Xscmaxjitdata
SHRC462=Hodnota -Xscminjitdata je v\u00E4\u010D\u0161ia ako hodnota -Xscmx a preto bola nastaven\u00E1 na rovnak\u00FA hodnotu -Xscmx
SHRC463=Hodnota -Xscmaxjitdata je v\u00E4\u010D\u0161ia ako hodnota -Xscmx a preto bola nastaven\u00E1 na neobmedzen\u00FA
SHRC468=Ulo\u017Eilo sa %1$s pripojen\u00FDch \u00FAdajov pre %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC469=Zlyhalo ukladanie 1$s pripojen\u00FDch \u00FAdajov pre %8$.*7$s.%4$.*3$s%6$.*5$s, pr\u00ED\u010Dina\: %2$s
J9GC084=Rozl\u00ED\u0161enie hod\u00EDn OS indikuje, \u017Ee nepodporuje po\u017Eadovan\u00FD cie\u013Eov\u00FD \u010Das pozastavenia.  Hodnota sa nahrad\u00ED, preto\u017Ee sa pou\u017Eila vo\u013Eba pr\u00EDkazov\u00E9ho riadka -Xgc\:overrideHiresTimerCheck
J9GC083=Zlyhala incializ\u00E1cia, viacn\u00E1sobn\u00FD vlastn\u00EDk podporuje iba -Xgcpolicy\:balanced
J9GC086=Zlyhalo vytv\u00E1ranie in\u0161tancie skomprimovan\u00FDch meta\u00FAdajov referenci\u00ED; vy\u017Eaduje sa %1$zu%2$s
J9GC085=po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165 komprimovan\u00FDch meta\u00FAdajov referenci\u00ED
J9GC088=Nebolo mo\u017En\u00E9 vyhovie\u0165 po\u017Eadovanej ve\u013Ekosti str\u00E1nky objectheap %1$zu%2$s; namiesto toho sa pou\u017Eije %3$zu%4$s
J9GC087=Nemo\u017Eno vyhovie\u0165 ve\u013Ekosti haldy %1$zu%2$s pri ve\u013Ekosti str\u00E1nky %3$zu%4$s. Ve\u013Ekos\u0165 haldy mo\u017Eno zada\u0165 pomocou -Xmx
J9GC089=Vo\u013Eba -Xgc\:preferredHeapBase nie je podporovan\u00E1 v syst\u00E9me z/OS.
SHRC453=Zobrazi\u0165 v\u0161etky elementy v pam\u00E4ti cache vr\u00E1tane osirel\u00FDch tried
SHRC454=Zak\u00E1za\u0165 kontrolu, ak aktu\u00E1lne ID semafora SysV je rovnak\u00E9 ako ID semafora SysV v pam\u00E4ti cache
SHRC455=Vn\u00FAti\u0165 kontrolu tabu\u013Eky re\u0165azcov pri spusten\u00ED
SHRC456=Vn\u00FAti\u0165 n\u00E1jdenie zmeny v ID zostavenia VM
SHRC450=Pole d\u013A\u017Eky \u00FAdajov v hlavi\u010Dke pam\u00E4te cache je neplatn\u00E9. D\u013A\u017Eka \u00FAdajov v hlavi\u010Dke vyrovn\u00E1vacej pam\u00E4te je\: %u.
SHRC451=Pole za\u010Diatku \u00FAdajov v hlavi\u010Dke pam\u00E4te cache je neplatn\u00E9. Za\u010Diato\u010Dn\u00E1 adresa \u00FAdajov v hlavi\u010Dke pam\u00E4te cache je\: 0x%p.
SHRC452=Zak\u00E1za\u0165 ochranu pam\u00E4te oblasti na \u010D\u00EDtanie/z\u00E1pis (tabu\u013Eka re\u0165azcov)
SHRC457=Neplatn\u00FD n\u00E1zov pam\u00E4te cache; n\u00E1zov pam\u00E4te cache "%.*s" obsahuje iba biely znak alebo je pr\u00E1zdny
SHRC458=Zak\u00E1\u017Ee zdie\u013Eanie tried bez zak\u00E1zania pomocn\u00FDch rozhran\u00ED API
SHRC459=Zak\u00E1\u017Ee zdie\u013Eanie tried a pomocn\u00E9 rozhrania API
SHRC480=prive\u013Ea aktualiz\u00E1ci\u00ED po\u010Das \u010D\u00EDtania
SHRC481=pam\u00E4\u0165 cache je po\u0161koden\u00E1
J9GC071=Hodnota pre '%s' je nespr\u00E1vna
J9GC070=Zlyhalo sp\u00FA\u0161\u0165anie zbera\u010Da odpadu
SHRC002=pou\u017E\u00EDva sa
SHRC486=Vyhraden\u00FD priestor pre bajty \u00FAdajov JIT  %*c\= %d
SHRC003=\u010Das posledn\u00E9ho odpojenia
SHRC487=Maxim\u00E1lny priestor pre bajty \u00FAdajov JIT  %*c\= %d
SHRC004=Nemo\u017Eno zni\u010Di\u0165 pam\u00E4\u0165 cache "%s"
SHRC488=S\u00FA\u010Det hodn\u00F4t -Xscminaot a -Xscminjitdata by nemal by\u0165 v\u00E4\u010D\u0161\u00ED ako dostupn\u00E1 ve\u013Ekos\u0165 pam\u00E4te cache
SHRC005=Nie s\u00FA dostupn\u00E9 \u017Eiadne zdie\u013Ean\u00E9 pam\u00E4te cache pre triedy
SHRC489=Ak je otvoren\u00E1 pam\u00E4\u0165 cache ozna\u010Den\u00E1 ako po\u0161koden\u00E1, spust\u00ED sa udalos\u0165 v\u00FDpisu pam\u00E4te cache
SHRC482=adresa nie je v pam\u00E4ti cache
SHRC483=zlyhalo obnovovanie pam\u00E4te cache
SHRC000=Zdie\u013Ean\u00E1 vyrovn\u00E1vacia pam\u00E4\u0165
SHRC484=Vyhraden\u00FD priestor AOT bajtov       %*c\= %d
SHRC001=shmid OS
SHRC485=Maxim\u00E1lny priestor pre AOT bajty    %*c\= %d
J9GC069=Zlyhala inicializ\u00E1cia vl\u00E1kna dokon\u010Denia
SHRC006=Po\u010Det pam\u00E4t\u00ED cache, ktor\u00FDm skon\u010Dila platnos\u0165 v posledn\u00FDch %1$d min\u00FAtach, je %2$d
SHRC007=Zlyhalo odstra\u0148ovanie zdie\u013Eanej pam\u00E4te cache pre triedy "%s"
SHRC008=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache je vytvoren\u00E1\: %1$s ve\u013Ekos\u0165\: %2$d bajtov
SHRC009=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache je otvoren\u00E1\: %1$s ve\u013Ekos\u0165\: %2$d bajtov
J9GC062=Hodnota vo\u013Eby %s mus\u00ED by\u0165 mocninou \u010D\u00EDsla 2
J9GC061=maxim\u00E1lna ve\u013Ekos\u0165 pam\u00E4\u0165ov\u00E9ho priestoru s rozsahom
J9GC064=Zlyhalo vyhradzovanie star\u00E9ho priestoru
J9GC063=Nemo\u017Eno otvori\u0165 s\u00FAbor '%s' na z\u00E1pis
J9GC066=Nebolo mo\u017En\u00E9 vyhradi\u0165 po\u017Eadovan\u00FA geometriu rozdelenia pam\u00E4te haldy
J9GC065=Zlyhalo vyhradzovanie nov\u00E9ho priestoru
J9GC068=Preru\u0161ilo sa ScopedMemory.join/joinAndEnter
J9GC067=Zlyhalo vytv\u00E1ranie in\u0161tancie rozdelenej haldy\: %1$s (nov\u00E1 ve\u013Ekos\u0165\: %2$zu %3$s, star\u00E1 ve\u013Ekos\u0165\: %4$zu %5$s)
SHRC470=Aktualizovalo sa %1$s pripojen\u00FDch \u00FAdajov pre %7$.*6$s.%3$.*2$s%5$.*4$s
J9GC080=Konfigur\u00E1cia syst\u00E9mu nepodporuje parameter '%.*s' vo vo\u013Ebe '-Xlp'
J9GC082=Po\u017Eadovan\u00E1 hodnota pre ve\u013Ekos\u0165 str\u00E1nky %1$s %2$zu%3$s%4$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky; namiesto nej sa pou\u017Eije %5$zu%6$s%7$s
J9GC081=Vo vo\u013Ebe '-Xlp' sa na\u0161li extra znaky \u010Diarky - ignoruj\u00FA sa
SHRC475=neexistuj\u00FA \u017Eiadne \u00FAdaje
SHRC476=\u00FAdaje u\u017E existuj\u00FA
SHRC477=\u017Eiadny priestor v pam\u00E4ti cache pre %d bajtov
SHRC478=Ve\u013Ekos\u0165 \u00FAdajov %d je v\u00E4\u010D\u0161ia ako dostupn\u00FDch %d
SHRC471=Zlyhala aktualiz\u00E1cia %1$s pripojen\u00FDch \u00FAdajov pre %8$.*7$s.%4$.*3$s%6$.*5$s, pr\u00ED\u010Dina\: %2$s
SHRC472=\u017Eiadny pr\u00EDstup k prostriedku
SHRC473=Zlyhalo enterWriteMutex
SHRC474=Zlyhalo enterReadMutex
SHRC479=zlyhalo vyhradzovanie pam\u00E4te %d bajtov
J9GC073=Ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s %3$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky; namiesto nej sa pou\u017Eije %4$zu%5$s
J9GC072=Ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky; namiesto nej sa pou\u017Eije %3$zu%4$s %5$s
J9GC075=Nastala chyba pri analyzovan\u00ED vo\u013Eby '-Xlp'
J9GC074=Ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s %3$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky; namiesto nej sa pou\u017Eije %4$zu%5$s %6$s
J9GC077=Konfigur\u00E1cia syst\u00E9mu nepodporuje vy\u017Eadovan\u00FA ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s %3$s
J9GC076=Konfigur\u00E1cia syst\u00E9mu nepodporuje vy\u017Eadovan\u00FA ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s
J9GC079=Vo\u013Eba '%1$s' nie je \u00FApln\u00E1, mus\u00ED ur\u010Dova\u0165 parameter '%2$s'.
J9GC078='%1$s' nie je zadan\u00E9 ako prv\u00FD parameter vo vo\u013Ebe '%2$s'
SHRC024=chyba pri odp\u00E1jan\u00ED zdie\u013Eanej pam\u00E4te
SHRC025=chyba pri prip\u00E1jan\u00ED zdie\u013Eanej pam\u00E4te
SHRC026=Ned\u00E1 sa vytvori\u0165 vyrovn\u00E1vacia pam\u00E4\u0165 po\u017Eadovanej ve\u013Ekosti\: Skontrolujte va\u0161e nastavenia SHMMAX a SHMMIN
SHRC027=N\u00E1zov zdie\u013Eanej vyrovn\u00E1vacej pam\u00E4te je pr\u00EDli\u0161 dlh\u00FD
SHRC020=Nastala chyba po\u010Das otv\u00E1rania semafora
SHRC021=Bol vr\u00E1ten\u00FD nezn\u00E1my k\u00F3d chyby
SHRC022=Chyba pri vytv\u00E1ran\u00ED regi\u00F3nu zdie\u013Eanej pam\u00E4te
SHRC023=Vyrovn\u00E1vacia pam\u00E4\u0165 neexistuje
J9GC048=pr\u00EDrastok star\u00E9ho priestoru
J9GC047=maxim\u00E1lna ve\u013Ekos\u0165 star\u00E9ho priestoru
J9GC049=zapam\u00E4tan\u00E1 ve\u013Ekos\u0165 mno\u017Einy
SHRC028=Pr\u00EDstup odmietnut\u00FD
SHRC029=V syst\u00E9me neostal dostatok pam\u00E4te
J9GC040=Nezn\u00E1ma vo\u013Eba\: %s
J9GC042=S\u00FA\u010Det volieb %1$s a %2$s je primal\u00FD pre %3$s
J9GC041=Nezn\u00E1my typ fvtest\: %s
J9GC044=maxim\u00E1lna ve\u013Ekos\u0165 nov\u00E9ho priestoru
J9GC043=po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165 nov\u00E9ho priestoru
J9GC046=po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165 star\u00E9ho priestoru
J9GC045=po\u010Diato\u010Dn\u00E1 ve\u013Ekos\u0165 pam\u00E4te
SHRC490=Vn\u00FAti\u0165 n\u00E1jdenie po\u0161koden\u00FA pam\u00E4\u0165 cache zdie\u013Ean\u00FDch tried
SHRC491=Zlyhalo ukladanie %1$s pripojen\u00FDch \u00FAdajov pre %8$.*7$s.%4$.*3$s%6$.*5$s, pr\u00ED\u010Dina\: %2$s
SHRC492=Zlyhala aktualiz\u00E1cia %1$s pripojen\u00FDch \u00FAdajov pre %8$.*7$s.%4$.*3$s%6$.*5$s, pr\u00ED\u010Dina\: %2$s
J9GC060=ve\u013Ekos\u0165 trval\u00E9ho pam\u00E4\u0165ov\u00E9ho priestoru
SHRC013=Zlyhalo odstra\u0148ovanie pam\u00E4te zdie\u013Eanej pam\u00E4te cache "%s"
SHRC497=Placeholder, not used
SHRC014=Zlyhalo odstra\u0148ovanie semafora zdie\u013Eanej pam\u00E4te cache "%s"
SHRC498=Placeholder, not used
SHRC015=Chyba zdie\u013Eanej vyrovn\u00E1vacej pam\u00E4te tried\: Neplatn\u00FD pr\u00EDznak
SHRC499=Placeholder, not used
SHRC016=Chyba zdie\u013Eanej vyrovn\u00E1vacej pam\u00E4te tried\:
SHRC493=Zlyhalo h\u013Eadanie %1$s pripojen\u00FDch \u00FAdajov pre %8$.*7$s.%4$.*3$s.%6$.*5$s, pr\u00ED\u010Dina \:%2$s
SHRC010=Zdie\u013Ean\u00E1 pam\u00E4\u0165 "%s" je zru\u0161en\u00E1
SHRC494=Zlyhalo h\u013Eadanie %1$s pripojen\u00FDch \u00FAdajov pre adresu 0x%2$p, pr\u00ED\u010Dina\: %3$s
SHRC011=Chyba\: Ned\u00E1 sa otvori\u0165 zdie\u013Ean\u00E1 vyrovn\u00E1vacia pam\u00E4\u0165 tried
SHRC495=Zlyhalo ukladanie %1$s pripojen\u00FDch \u00FAdajov pre adresu 0x%2$p, pr\u00ED\u010Dina\: %3$s
SHRC012=Nemo\u017Eno odstr\u00E1ni\u0165 zdie\u013Ean\u00FA pam\u00E4\u0165 cache "%s", preto\u017Ee s\u00FA k nej st\u00E1le pripojen\u00E9 stroje JVM
SHRC496=Zlyhala aktualiz\u00E1cia %1$s pripojen\u00FDch \u00FAdajov pre adresu 0x%2$p, pr\u00ED\u010Dina\: %3$s
J9GC059=Vo\u013Eba -Xgcpolicy\:metronome nie je povolen\u00E1 bez vo\u013Eby -Xrealtime
J9GC058=Zlyhalo vyhradzovanie trval\u00E9ho pam\u00E4\u0165ov\u00E9ho priestoru
SHRC017=K\u00F3d chyby\: %d
SHRC018=pam\u00E4\u0165 sa ned\u00E1 vyhradi\u0165
SHRC019=d\u013A\u017Eka po\u017Eiadavky je pr\u00EDli\u0161 mal\u00E1
J9GC051=pr\u00EDrastok segmentu triedy RAM
J9GC050=mierne maximum pam\u00E4te
J9GC053=maxim\u00E1lne mno\u017Estvo pam\u00E4te
J9GC052=pr\u00EDrastok segmentu triedy ROM
J9GC055=ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky
J9GC054=Ve\u013Ekos\u0165 ve\u013Ekej str\u00E1nky %1$zu%2$s nie je podporovan\u00E1 ve\u013Ekos\u0165 str\u00E1nky; namiesto nej sa pou\u017Eije %3$zu%4$s
J9GC057=%1$s mus\u00ED by\u0165 nie v\u00E4\u010D\u0161\u00ED ako %2$s
J9GC056=dostupn\u00E9 ve\u013Ekosti ve\u013Ekej str\u00E1nky\:
SHRC040=Zadajte n\u00E1zov zdie\u013Eanej vyrovn\u00E1vacej pam\u00E4te
SHRC041=Zni\u010Di\u0165 zdie\u013Ean\u00FA vyrovn\u00E1vaciu pam\u00E4\u0165 (pou\u017Eite parameter n\u00E1zvu alebo predvolen\u00FA hodnotu)
SHRC046=Zobrazi\u0165 v\u0161etky vyrovn\u00E1vacie pam\u00E4te a ich \u0161tatistiku
SHRC047=Vytla\u010Di\u0165 sum\u00E1r \u0161tatistiky vyrovn\u00E1vacej pam\u00E4te
SHRC048=Zobrazi\u0165 zoznam v\u0161etk\u00FDch prvkov vo vyrovn\u00E1vacej pam\u00E4ti
SHRC049=Re\u017Eim ladenia, ktor\u00FD kontroluje v\u0161etok prich\u00E1dzaj\u00FAci bajtov\u00FD k\u00F3d
SHRC042=Zni\u010Di\u0165 v\u0161etky zdie\u013Ean\u00E9 vyrovn\u00E1vacie pam\u00E4te
SHRC043=Povoli\u0165 zdie\u013Eanie modifikovan\u00E9ho bajtov\u00E9ho k\u00F3du\n \t<kontextMod> je u\u017E\u00EDvate\u013Esk\u00FD popisova\u010D opisuj\u00FAci typ modifik\u00E1cie\n \tvirtu\u00E1lne stroje JVM pou\u017E\u00EDvaj\u00FAce rovnak\u00E9 <kontextMod> musia pou\u017E\u00EDva\u0165 rovnak\u00E9 modifik\u00E1cie
SHRC044=OPTION_MODIFIED_EQUALS"<kontextMod>"
SHRC045=Zni\u010Di\u0165 vyrovn\u00E1vacie pam\u00E4te, ktor\u00E9 sa nepou\u017E\u00EDvali <t> min\u00FAt
J9GC026=Vo\u013Eba -Xverbosegclog nemohla vyhradi\u0165 intern\u00E9 \u0161trukt\u00FAry
J9GC025=S\u00FA\u010Det volieb %1$s a %2$s
J9GC028=Vo\u013Eba je pr\u00EDli\u0161 ve\u013Ek\u00E1\: '%s'
J9GC027=Chybne vytvoren\u00E1\: '%s'
J9GC029=Chybn\u00E1 vo\u013Eba\: '%s'
J9GC020=Vo\u013Eba %s je pr\u00EDli\u0161 mal\u00E1 pre haldu
J9GC022=S\u00FA\u010Det volieb %1$s a %2$s je prive\u013Ek\u00FD pre %3$s
J9GC021=Vo\u013Eba %1$s mus\u00ED by\u0165 rovn\u00E1 %2$s
J9GC024=S\u00FA\u010Det volieb %1$s a %2$s je prive\u013Ek\u00FD pre haldu
J9GC023=S\u00FA\u010Det %1$s a %2$s sa mus\u00ED rovna\u0165 %3$s
SHRC030=Zdie\u013Ean\u00E1 pam\u00E4\u0165 cache tried, ktor\u00FA prip\u00E1jate, m\u00E1 neplatn\u00FA hlavi\u010Dku.
SHRC035=Lok\u00E1lne ukladanie ciest k triedam do pam\u00E4te cache je deaktivovan\u00E9
SHRC036=Obmedzenie s\u00FAperenia pri s\u00FAbe\u017Enom ukladan\u00ED je deaktivovan\u00E9
SHRC037=Inkrement\u00E1lne aktualiz\u00E1cie s\u00FA deaktivovan\u00E9
SHRC038=Pou\u017Eitie\:\n\njava -Xshareclasses[\:vo\u013Eba,...]\n\n Platn\u00E9 zahrnut\u00E9 vo\u013Eby (s kr\u00E1tkym s\u00FAhrnom) s\u00FA\:\n\n
SHRC031=Zdie\u013Ean\u00E1 vyrovn\u00E1vacia pam\u00E4\u0165 tried, ktor\u00FA prip\u00E1jate, m\u00E1 nekompatibiln\u00FA verziu JVM.
SHRC032=Zdie\u013Ean\u00E1 vyrovn\u00E1vacia pam\u00E4\u0165 tried, ktor\u00FA prip\u00E1jate, m\u00E1 nespr\u00E1vnu \u00FArove\u0148 modifik\u00E1cie.
SHRC033=Zamykanie lok\u00E1lnych ha\u0161ovac\u00EDch tabuliek je deaktivovan\u00E9
SHRC034=Kontrola \u010Dasov\u00FDch zna\u010Diek je deaktivovan\u00E1
J9GC037=Vo\u013Eba %1$s nepodporuje hodnoty in\u00E9 ako %2$zu
J9GC036=Hodnota vo\u013Eby %1$s mus\u00ED by\u0165 v\u00E4\u010D\u0161ia ako %2$zu
J9GC039=Vo\u013Eba %1$s je neschv\u00E1len\u00E1; namiesto nej pou\u017Eite %2$s
J9GC038=Zadan\u00E1 hodnota %s je pr\u00EDli\u0161 ve\u013Ek\u00E1
SHRC039=Vytla\u010Di\u0165 v\u0161eobecn\u00FA pomoc pre zdie\u013Eanie
J9GC031=Vo\u013Eby %1$s a %2$s nem\u00F4\u017Eu by\u0165 zadan\u00E9 s\u00FA\u010Dasne
J9GC030=Vo\u013Eba %1$s s hodnotou %2$.2f mus\u00ED by\u0165 aspo\u0148 o %3$s men\u0161ia ako vo\u013Eba %4$s s hodnotou %5$.2f
J9GC033=Hodnota vo\u013Eby %1$s mus\u00ED by\u0165 medzi %2$.2f a %3$.2f (vr\u00E1tane)
J9GC032=Konfigur\u00E1cia syst\u00E9mu nepodporuje vo\u013Ebu '%s'
J9GC035=Za %s mus\u00ED nasledova\u0165 \u010D\u00EDslo
J9GC034=Hodnota vo\u013Eby %1$s mus\u00ED by\u0165 medzi %2$zu a %3$zu (vr\u00E1tane)
SHRC060=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre vyrovn\u00E1vaciu pam\u00E4\u0165 re\u0165azca v shrinit\:\:hookFindSharedClass
SHRC061=N\u00E1zov vyrovn\u00E1vacej pam\u00E4te by nemal by\u0165 dlh\u0161\u00ED ne\u017E 64 znakov. Vyrovn\u00E1vacia pam\u00E4\u0165 sa nevytvorila.
SHRC062=Chyba pri kop\u00EDrovan\u00ED mena u\u017E\u00EDvate\u013Ea do predvolen\u00E9ho n\u00E1zvu pam\u00E4te cache
SHRC063=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre sharedClassConfig v shrinit
SHRC068=Lok\u00E1lne ukladanie ciest k triedam do pam\u00E4te cache je deaktivovan\u00E9
SHRC069=Obmedzenie s\u00FAperenia pri s\u00FAbe\u017Enom ukladan\u00ED je deaktivovan\u00E9
SHRC064=Zlyhalo vytvorenie configMonitor v shrinit
SHRC065=Nie je mo\u017En\u00E9 alokova\u0165 oblas\u0165 v shrinit
SHRC066=Zamykanie lok\u00E1lnych ha\u0161ovac\u00EDch tabuliek je deaktivovan\u00E9
SHRC067=Kontrola \u010Dasov\u00FDch zna\u010Diek je deaktivovan\u00E1
J9GC004=Vytvorenie in\u0161tancie glob\u00E1lneho kolektora odpadu zlyhalo
J9GC003=Vytvorenie in\u0161tancie rozvrhova\u010Da \u00FAloh zlyhalo
J9GC006=Zlyhala inicializ\u00E1cia; nedostatok pam\u00E4te
J9GC005=Inicializ\u00E1cia zlyhala
J9GC008=Inicializ\u00E1cia roz\u0161\u00EDren\u00ED modulu zlyhala
J9GC007=Zlyhala inicializ\u00E1cia; nemo\u017Eno analyzova\u0165 pr\u00EDkazov\u00FD riadok
J9GC009=Inicializ\u00E1cia mutexu pre \u0161tatistiku GC zlyhala
J9GC000=Intern\u00E1 chyba; nedostatok pam\u00E4te
J9GC002=Zlyhalo vytv\u00E1ranie in\u0161tancie haldy; po\u017Eadovalo sa %1$zu%2$s
J9GC001=Vytvorenie in\u0161tancie kopy zlyhalo
SHRC050=Povoli\u0165 detailn\u00FD v\u00FDstup
SHRC051=Vypn\u00FA\u0165 dynamick\u00E9 aktualiz\u00E1cie
SHRC052=Deaktivova\u0165 lok\u00E1lne ukladanie cesty k triede do pam\u00E4te cache
SHRC057=Nespr\u00E1vne parametre pre vo\u013Ebu exspir\u00E1cie
SHRC058=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre ClasspathItem v shrinit\:\:hookStoreSharedClass
SHRC059=Nie je mo\u017En\u00E9 alokova\u0165 pam\u00E4\u0165 pre ClasspathItem v shrinit\:\:hookFindSharedClass
SHRC053=Deaktivova\u0165 zamykanie lok\u00E1lnej ha\u0161ovacej tabu\u013Eky
SHRC054=Deaktivova\u0165 algoritmus na obmedzenie s\u00FAperenia pri ukladan\u00ED
SHRC055=Deaktivova\u0165 inkrement\u00E1lne aktualiz\u00E1cie vyrovn\u00E1vacej pam\u00E4te
SHRC056=Nezn\u00E1ma vo\u013Eba pr\u00EDkazov\u00E9ho riadka "%s"
J9GC015=Vyhradenie predvolen\u00E9ho pam\u00E4\u0165ov\u00E9ho priestoru zlyhalo
J9GC014=Vyhradenie pam\u00E4\u0165ov\u00FDch segmentov pre triedy VM zlyhalo
J9GC017=Vo\u013Eba %1$s je primal\u00E1, mus\u00ED ma\u0165 aspo\u0148 %2$zu %3$sbajtov
J9GC016=Zlyhalo alokovanie segmentu, ktor\u00FD zostal v \u0161tandardnom pam\u00E4\u0165ovom priestore
J9GC019=Vo\u013Eba %1$s je prive\u013Ek\u00E1 pre %2$s
J9GC018=Vo\u013Eba %1$s je primal\u00E1 pre %2$s
J9GC011=Zlyhala inicializ\u00E1cia oblasti pam\u00E4\u0165ov\u00FDch priestorov
J9GC010=Zlyhala inicializ\u00E1cia mana\u017Ementu dokon\u010Denia
J9GC013=Vyhradenie pam\u00E4\u0165ov\u00FDch segmentov pre objekty VM zlyhalo
J9GC012=Vyhradenie pam\u00E4\u0165ov\u00FDch segmentov VM zlyhalo
