#Thu Jan 21 02:08:20 CST 2021
EXEL070=ROM-Image hat die falsche Version.
EXEL079=\  -Xscmx<x>       Gr\u00F6\u00DFe des neuen Cache f\u00FCr gemeinsam genutzte Klasse auf <x> setzen
J9VM151=JImage-Bibliothek konnte nicht ge\u00F6ffnet werden.
J9VM150=-Xscsoftmx wird ignoriert, wenn -Xshareclasses nicht angegeben ist.
J9VM153=Es wird zum internen JImage-Eingabeprogramm gewechselt, weil JVM die JImage-Bibliothek nicht verwenden kann.
EXEL071=Hauptklassenname konnte nicht gefunden werden.
J9VM152=Symbol %s konnte nicht in JImage-Bibliothek gesucht werden.
EXEL072=Fehler beim VM-Start\: Nicht gen\u00FCgend Speicherkapazit\u00E4t.
J9VM155=Ung\u00FCltiger Wert f\u00FCr -Xpatch; der Patchpfad wurde in der Eigenschaft %s\=%s nicht angegeben
EXEL073=Interner VM-Fehler\: JVM konnte nicht erstellt werden.
J9VM154=Ung\u00FCltiger Wert f\u00FCr -Xpatch; der Wert der Eigenschaft %s wurde nicht angegeben
EXEL074=
J9VM157=Klasse %2$.*1$s(%3$s) kann nicht auf Klasse %5$.*4$s(%6$s) zugreifen, weil Modul %6$s von Modul %3$s nicht gelesen werden kann
EXEL075=\  -Xquickstart    Startzeit durch Verz\u00F6gerung von Optimierungen verbessern
J9VM156=-XX\:SharedCacheHardLimit\= wird ignoriert, wenn -Xshareclasses nicht angegeben ist
EXEL076=JIT  - %s\n
J9VM159=Fehler\: %s erfordert die Spezifikation eines Modulpfads
EXEL077=\  -Xssi<x>        Inkrement des Java-Thread-Stacks auf <x> setzen
J9VM158=Klasse %2$.*1$s(%3$s) kann nicht auf Klasse %5$.*4$s(%6$s) zugreifen, weil Modul %6$s den Export von Paket %7$s nach Modul %3$s nicht unterst\u00FCtzt
EXEL078=\  -Xshareclasses[\:Optionen]  gemeinsame Nutzung von Klassendaten aktivieren (Details mit -help abrufen) \n
J9VM149='%s' wird nicht mehr unterst\u00FCtzt. F\u00FCgen Sie dem Klassenpfad die erforderlichen Bibliotheken/JAR-Dateien hinzu.
EXEL068=Interner VM-Fehler\: Array-Element f\u00FCr %s konnte nicht festgelegt werden.
EXEL069=ROM-Image konnte nicht gefunden werden.
J9VM140=Aufrufendes Programm ist nicht mit Anmerkung @sun.reflect.CallerSensitive versehen.
J9VM142=Die Befehlszeilenoption '-Xrealtime' wird in dieser Version von IBM SDK nicht unterst\u00FCtzt.
EXEL060=Interner VM-Fehler\: Byte-Array f\u00FCr Klassenname %s konnte nicht erstellt werden.
J9VM141=Widerspr\u00FCchliche Standardmethoden f\u00FCr '%2$.*1$s%4$.*3$s' in %6$.*5$s aus den Klassen [%7$s]
EXEL061=Interner VM-Fehler\: java/lang/String f\u00FCr Klassenname %s konnte nicht erstellt werden.
J9VM144=Zu viele Parameter\: 255 + 1
EXEL062=Interner VM-Fehler\: Nicht gen\u00FCgend Speicherkapazit\u00E4t beim Konvertieren der Zeichenfolge in UTF-Zeichen f\u00FCr Klassenname %s
J9VM143=Die Befehlszeilenoption '%s' wird in dieser Version von IBM SDK nicht unterst\u00FCtzt.
EXEL063=Klasse %s implementiert main() nicht.
J9VM146='invokeinterface' der nicht \u00F6ffentlichen Methode '%4$.*3$s%6$.*5$s' in %2$.*1$s
EXEL064=Die Methode "main" muss als "public", "static" und "void" deklariert werden.
J9VM145='%s' wird unter z/OS nicht unterst\u00FCtzt.
EXEL065=Interner VM-Fehler\: Argumentenarray konnte nicht erstellt werden.
J9VM148='%s' wird nicht mehr unterst\u00FCtzt. Der Mechanismus, mit dem zul\u00E4ssige Standards au\u00DFer Kraft gesetzt werden, wird nur \u00FCber aktualisierbare Module unterst\u00FCtzt.
EXEL066=Interner VM-Fehler\: Byte-Array f\u00FCr Argument %s konnte nicht erstellt werden.
J9VM147=Aktueller Thread kann nicht angeh\u00E4ngt werden
EXEL067=Interner VM-Fehler\: java/lang/String f\u00FCr Argument %s konnte nicht erstellt werden.
SMAP000=
EXEL090=\  -Xscmaxaot<x>   maximalen f\u00FCr AOT-Daten zul\u00E4ssigen Speicherbereich f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse festlegen auf <x>
EXEL091=\n  -Xcheck[\:Option[\:...]]  \u00DCberpr\u00FCfung steuern, f\u00FCr mehr Details -Xcheck\:help verwenden
EXEL092=\n  -Xdump[\:option,...]  Speicherausz\u00FCge steuern, f\u00FCr mehr Details -Xdump\:help verwenden
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP005=
J9VM171=Es wird versucht, ein finales Instanzfeld %2$.*1$s.%4$.*3$s \u00FCber Methode "%6$.*5$s" festzulegen, die nicht <init> entspricht.
J9VM170=Es wird versucht, ein statisches finales Feld %2$.*1$s.%4$.*3$s \u00FCber Methode "%6$.*5$s" festzulegen, die nicht <clinit> entspricht.
J9VM173=Klasse %2$.*1$s und ihr Verschachtelungshost %4$.*3$s m\u00FCssen dasselbe Paket verwenden.
J9VM172=Klasse %2$.*1$s und ihr Verschachtelungshost %4$.*3$s m\u00FCssen dasselbe Klassenladeprogramm verwenden.
J9VM175=Bibliothek %1$s, die f\u00FCr Modul %2$s erforderlich ist, konnte nicht geladen werden
EXEL093=Die folgenden Optionen steuern die globale VM-Konfiguration\:
J9VM174=Klasse %2$.*1$s muss von ihrem Verschachtelungshost %4$.*3$s \u00FCbernommen werden
EXEL094=\  -Xcompressedrefs              komprimierte Heapspeicherverweise verwenden
J9VM177=Klasse %2$.*1$s muss ihren Verschachtelungshost %4$.*3$s laden k\u00F6nnen.
EXEL095=\  -Xrealtime                    Echtzeit-Erweiterungen aktivieren
J9VM176=\u00DCbertretung der Ladeeinschr\u00E4nkung beim \u00DCberschreiben von Methode "%2$.*1$s.%4$.*3$s%6$.*5$s" w\u00E4hrend der Erstellung der Klasse "%18$.*17$s"\: Ladeprogramm "%8$.*7$s@%9$x" der Klasse "%11$.*10$s" und Ladeprogramm "%13$.*12$s@%14$x" der Klasse "%16$.*15$s" haben verschiedene Typen f\u00FCr die Methodensignatur.
EXEL096=\  -Xgcpolicy\:metronome          Echtzeit-Erweiterungen aktivieren
J9VM179=Das Modul ist nicht benannt.
EXEL097=\  -Xrealtime                    weiche Echtzeit aktivieren
J9VM178=Das Modul ist null.
EXEL098=\  -Xgcpolicy\:metronome          weiche Echtzeit aktivieren
EXEL099=\  -Xrealtime -Xnortsj           weiche Echtzeit aktivieren
EXEL080=Java-Version "%s"
EXEL081=Java-Version "%1$s/%2$s"
J9VM160=Fehler\: %s erfordert, dass Module angegeben werden
J9VM162=\tin %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s)
J9VM161=\tin %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s\:%9$u)
J9VM164=\tin %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s)
EXEL082=\  -Xlp<x>         Gr\u00F6\u00DFe gro\u00DFer Seiten festlegen auf <x>
J9VM163=\tin %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s\:%8$u)
EXEL083=Datei konnte nicht ge\u00F6ffnet werden\: %s
J9VM166=\tin %2$.*1$s.%4$.*3$s (%5$.*6$s)
EXEL084=Sicherungskopie der folgenden Datei konnte nicht erstellt werden\: %s
J9VM165=\tin %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
EXEL085=\nWARNUNG\: Der Befehlszeilenparameter "%s" ist veraltet. \nWARNUNG\: Verwenden Sie stattdessen "-jxe <Pfad>".\n
J9VM168=
EXEL086=\n  -Xtrace[\:Option,...]  Traceverarbeitung steuern, f\u00FCr mehr Details -Xtrace\:help verwenden
J9VM167=GC-Optimierungen f\u00FCr 'idle' werden nicht unterst\u00FCtzt.
EXEL087=\  -Xjni\:<Optionen>               JNI-Optionen festlegen
EXEL088=
J9VM169=
EXEL089=\  -Xscminaot<x>   minimalen f\u00FCr AOT-Daten reservierten Speicherbereich f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse festlegen auf <x>
J9VM117=-Xitsn wird ignoriert, wenn -Xshareclasses nicht angegeben ist.
J9VM116=noLockword\:%.*s
J9VM119=-Xscmaxjit wird ignoriert, wenn -Xshareclasses nicht angegeben ist.
J9VM118=-Xscminjit wird ignoriert, wenn -Xshareclasses nicht angegeben ist.
J9VM111=Ung\u00FCltige lockword-Option angegeben\:%s
J9VM110=Ung\u00FCltiger lockword-Modus angegeben\:%s
J9VM113=-----------------------------
J9VM112=Lockword-Konfiguration
J9VM115=lockword\:%.*s
J9VM114=Lockword-Modus\=%s
J9VM106=Die Optionen "info", "warn", "error", "vital" und "config" k\u00F6nnen mit einem Komma (,) kombiniert werden. Beispiel\:\n
J9VM105=-Xsyslog\:config            JVM-Konfigurationsnachrichten protokollieren.\n
J9VM108=-Xsyslog\:info,warn,error\n
J9VM107=-Xsyslog\:error,warn
J9VM109=Nicht unterst\u00FCtztes Betriebssystem (%s)\: Windows XP oder neueres Betriebssystem erforderlich.
J9VM100=-Xsyslog\:all               Alle JVM-Nachrichten protokollieren.
J9VM102=-Xsyslog\:warn              JVM-Warnungen protokollieren.
J9VM101=-Xsyslog\:info              JVM-Informationsnachrichten protokollieren.
J9VM104=-Xsyslog\:vital             Kritische JVM-Nachrichten protokollieren. Dies ist standardm\u00E4\u00DFig aktiviert.
J9VM103=-Xsyslog\:error             JVM-Fehlernachrichten protokollieren. Dies ist standardm\u00E4\u00DFig aktiviert.
J9VM139=
J9VM138=
J9VM131=Der Prozess wird durch CEE3AB2() mit Abbruch %1$u, Ursache %2$u, Bereinigung %3$u beendet.
J9VM130=Die Ausf\u00FChrung der Anwendung wurde wiederaufgenommen, nachdem eine nicht behebbare Bedingung behandelt wurde, und die Anwendung kehrte unzul\u00E4ssigerweise zu Java zur\u00FCck oder f\u00FChrte einen unzul\u00E4ssigen Aufruf an Java aus (mit JIT kompilierter Code).
J9VM133=Der feste ulimit-Wert f\u00FCr die Systemkerngr\u00F6\u00DFe ist auf %d gesetzt, Systemspeicherausz\u00FCge werden m\u00F6glicherweise abgeschnitten.
J9VM132=Ung\u00FCltiger Sperrwortmodus angegeben; java/lang/Class und java/lang/String k\u00F6nnen keine Sperrw\u00F6rter haben, wenn -Xtenant vorhanden ist\: %s
J9VM135=/proc/sys/kernel/core_pattern-Einstellung "%s" gibt an, dass Kernspeicherausz\u00FCge in ein externes Programm geleitet werden sollen. M\u00F6glicherweise kann die JVM Kernspeicherausz\u00FCge nicht lokalisieren und benennt sie um.
J9VM134=Die Systemoption 'fullcore' ist auf FALSE gesetzt; Systemspeicherausz\u00FCge werden m\u00F6glicherweise abgeschnitten.
J9VM137=Klasse %2$.*1$s hat widerspr\u00FCchliche Standardwerte f\u00FCr Methode %4$.*3$s%6$.*5$s
J9VM136=/proc/sys/kernel/core_pattern-Einstellung "%s" gibt eine Formatzeichenfolge zum Umbenennen von Kernspeicherausz\u00FCgen an. M\u00F6glicherweise kann die JVM Kernspeicherausz\u00FCge nicht lokalisieren und benennt sie um.
J9VM128=Java-Heapspeicher
J9VM127=Urspr\u00FCngliche Gr\u00F6\u00DFe der 32-Bit-Unterzuordnungsfunktion kann nicht auf null gesetzt werden.
J9VM129=Die Ausf\u00FChrung der Anwendung wurde wiederaufgenommen, nachdem eine nicht behebbare Bedingung behandelt wurde, und die Anwendung kehrte unzul\u00E4ssigerweise zu Java zur\u00FCck oder f\u00FChrte einen unzul\u00E4ssigen Aufruf an Java aus.
J9VM120=-Xscminjitdata wird ignoriert, wenn -Xshareclasses nicht angegeben ist.
J9VM122=Der f\u00FCr -Xprotectcontiguous erforderliche user32.dll-Adressbereich konnte nicht abgerufen werden.
J9VM121=-Xscmaxjitdata wird ignoriert, wenn -Xshareclasses nicht angegeben ist
J9VM124=Klasse %.*s kann nicht definiert werden - '%.*s' ist ein gesch\u00FCtztes Systempaket
J9VM123=Ausf\u00FChrung auf einem nicht unterst\u00FCtzten Prozessor versucht. JVM wird beendet.
J9VM126=COMMIT-Gr\u00F6\u00DFe der 32-Bit-Unterzuordnungsfunktion kann nicht auf null gesetzt werden.
J9VM125=COMMIT-Gr\u00F6\u00DFe der 32-Bit-Unterzuordnungsfunktion \u00FCbersteigt die urspr\u00FCngliche Gr\u00F6\u00DFe. COMMIT-Gr\u00F6\u00DFe \= %1$u, urspr\u00FCngliche Gr\u00F6\u00DFe \= %2$u.
SHRC802=Der Cacheinhalt entspricht %1$d%% des ver\u00E4nderlichen Speichers.\n
SHRC803=Speicherschutz f\u00FCr teilweise gef\u00FCllte Seiten beim Systemstart aktivieren.
SHRC804=Die JVM hat den Schutz von Teilseiten des gemeinsam genutzten Cache aktiviert, da der vorhandene gemeinsam genutzte Cache beim Start mit aktiviertem Schutz von Teilseiten erstellt wurde.
SHRC805=Die JVM hat den Schutz von Teilseiten des gemeinsam genutzten Cache beim Start nicht aktiviert.
SHRC800=Der gemeinsam genutzte Cache ist voll. Der mindestens reservierte und maximal zul\u00E4ssige AOT- bzw. JIT-Datenspeicherbereich und der softmx-Grenzwert k\u00F6nnen nicht mehr angepasst werden.
SHRC801=softmx-Byte                         %*c\= %d
SHRC806=Der persistente gemeinsam genutzte Cache "%1$s" f\u00FCr komprimierte Verweise wurde gel\u00F6scht. Wenn Sie einen Cache f\u00FCr nicht komprimierte Verweise l\u00F6schen wollen, verwenden Sie die Option '-Xnocompressedrefs'.
SHRC807=Der persistente gemeinsam genutzte Cache "%1$s" f\u00FCr nicht komprimierte Verweise wurde gel\u00F6scht. Wenn Sie einen Cache f\u00FCr komprimierte Verweise l\u00F6schen wollen, verwenden Sie die Option '-Xcompressedrefs'.
SHRC808=Der gemeinsam genutzte Cache "%s" f\u00FCr komprimierte Verweise wurde gel\u00F6scht. Wenn Sie einen Cache f\u00FCr nicht komprimierte Verweise l\u00F6schen wollen, verwenden Sie die Option '-Xnocompressedrefs'.
SHRC809=Der gemeinsam genutzte Cache "%s" f\u00FCr nicht komprimierte Verweise wurde gel\u00F6scht. Wenn Sie einen Cache f\u00FCr komprimierte Verweise l\u00F6schen wollen, verwenden Sie die Option '-Xcompressedrefs'.
DUMP001=Speicherauszugsereignis nicht erkannt\: ...%s
DUMP000=Speicherauszugsoption nicht erkannt\: -Xdump\:%s
DUMP003=Speicherauszugsagent nicht erkannt\: %s
DUMP002=Token nicht erkannt\: %%%1$c
DUMP012=Fehler in %1$s-Speicherauszug\: %2$s
DUMP011=Speicherauszug von %1$s erzeugte Prozess %2$d
DUMP014=VM-Aktion nicht erkannt\: ...%s
DUMP013=Speicherauszugsereignis "%1$s", Detail "%3$.*2$s" wurde verarbeitet.
DUMP010=Speicherauszug von %1$s in %2$s geschrieben
SHRC824=Startup-Hinweisdetail-Flags\: %1$zu DATA1\: %2$zu DATA2\: %3$zu
DUMP009=%s-Speicherauszug nicht verf\u00FCgbar
SHRC825=\t startuphint       Gibt nur startup-Hinweistypen im gemeinsam genutzten Cache aus.
DUMP008=unter Verwendung von '%s'
SHRC826=Startup-Hinweisbyte                  %*c\= %d
SHRC827=\# Startup-Hinweise                     %*c\= %d
SHRC820=Inaktivieren Sie das Caching von Klassen, die durch das Klassenladeprogramm des Bootprogramms geladen wurden.
DUMP005=Externes Tool fehlt
SHRC821=Inaktivieren Sie das Caching von Klassen, die durch Klassenladeprogramme von Nicht-Bootprogrammen geladen wurden. Diese Option aktiviert auch die Option "nonfatal".
DUMP004=Dateiname fehlt
SHRC822=Starten Sie den gemeinsam genutzten Cache nicht, wenn ein Fehler auftritt.
DUMP007=JVM fordert %1$s-Speicherauszug mit "%2$s" an.
SHRC823=%1$d\: 0x%2$p Startup-Hinweisschl\u00FCssel\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
DUMP006=Speicherauszugsereignis "%1$s", Detail "%3$.*2$s" wird verarbeitet - bitte warten.
SHRC828=Der Pfad des Verzeichnisses des gemeinsam genutzten Cache ist zu lang.
SHRC829=Das Ausgangsverzeichnis des Benutzers konnte nicht als Standardverzeichnis des gemeinsam genutzten Cache verwendet werden. Ausgangsverzeichnis kann nicht abgerufen werden. W\u00E4hlen Sie \u00FCber die Umgebungsvariable "HOME" oder die Befehlszeilenoption "cacheDir\=" ein anderes Verzeichnis aus oder korrigieren Sie das Ausgangsverzeichnis im Kennwortdateieintrag.
DUMP023=Die angeforderte Heapspeichervorbereitung wurde nicht durchgef\u00FChrt, weil exklusiver Zugriff nicht angefordert oder nicht verf\u00FCgbar war.
DUMP022=Die angeforderte Heapspeicherkomprimierung wurde nicht durchgef\u00FChrt, weil exklusiver Zugriff nicht angefordert oder nicht verf\u00FCgbar war.
DUMP025=IEATDUMP-Fehler f\u00FCr DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=Mehrere Heapspeicherausz\u00FCge wurden angefordert, aber %%id fehlt im Dateikennsatz\: \u00DCberschreiben durch die Speicherausz\u00FCge.
DUMP021=Der angeforderte Heapspeicherauszug wurde nicht erzeugt, weil exklusiver Zugriff nicht angefordert oder nicht verf\u00FCgbar war.
DUMP020=Speicherauszug von %s wurde geschrieben
SHRC813=Aufgrund der Einstellung von -Xscsoftmx wurden insgesamt %u Byte nicht gespeichert. Aufgrund der Einstellung von -Xscmaxaot wurden insgesamt %u AOT-Byte nicht gespeichert. Aufgrund der Einstellung von -Xscmaxjitdata wurden insgesamt %u JIT-Byte nicht gespeichert.
SHRC814=\t stale           Gibt alle abgelaufenen Eintr\u00E4ge im gemeinsam genutzten Cache aus.
DUMP019=JVM fordert %s-Speicherauszug an
SHRC815=Abgelaufene Byte                    %*c\= %u
SHRC816=Wert %s ist gr\u00F6\u00DFer als die Gr\u00F6\u00DFe des gemeinsam genutzten Cache und wurde daher auf die Gr\u00F6\u00DFe des gemeinsam genutzten Cache gesetzt.
DUMP016=Abbruch\: Datei (%s) kann nicht erstellt werden.
SHRC810=Die Momentaufnahme "%s" des gemeinsam genutzten Cache f\u00FCr komprimierte Verweise wurde gel\u00F6scht. Wenn Sie eine Momentaufnahme des Cache f\u00FCr nicht komprimierte Verweise l\u00F6schen wollen, verwenden Sie die Option '-Xnocompressedrefs'.
DUMP015=Abbruch\: Kann nicht ge\u00F6ffnet oder gelesen werden (%s).
SHRC811=Die Momentaufnahme "%s" des gemeinsam genutzten Cache f\u00FCr nicht komprimierte Verweise wurde gel\u00F6scht. Wenn Sie eine Momentaufnahme des Cache f\u00FCr komprimierte Verweise l\u00F6schen wollen, verwenden Sie die Option '-Xcompressedrefs'.
DUMP018=Angefordertes Ereignis ist nicht verf\u00FCgbar\: mit Markierung -Xdump\:dynamic ausf\u00FChren
SHRC812=Funktion                             \= %s
DUMP017=Abbruch\: Datei (%s) kann nicht komprimiert werden.
SHRC817=Wert %s ist gr\u00F6\u00DFer als die Gr\u00F6\u00DFe des gemeinsam genutzten Cache und wurde daher auf "uneingeschr\u00E4nkt" gesetzt
SHRC818=Aufgrund der Einstellung f\u00FCr die ver\u00E4nderliche maximale Gr\u00F6\u00DFe des gemeinsam genutzten Cache wurden insgesamt %u Byte nicht gespeichert. Aufgrund der Einstellung von -Xscmaxaot wurden insgesamt %u AOT-Byte nicht gespeichert. Aufgrund der Einstellung von -Xscmaxjitdata wurden insgesamt %u JIT-Byte nicht gespeichert.
SHRC819=Der gemeinsam genutzte Cache konnte nicht gestartet werden. Der vorhandene gemeinsam genutzte Cache wurde von einem anderen JVM-Build erstellt und stimmt nicht mit der ausgef\u00FChrten JVM \u00FCberein.
SHRC840=Der gemeinsam genutzte Cache konnte nicht gestartet werden.
SHRC841=Geben Sie die Nummer der obersten Ebene an. Erstellen Sie eine neue gemeinsam genutzte Cacheebene, wenn die angegebene Ebene nicht vorhanden ist.
SHRC846=\nAktuelle Statistik f\u00FCr oberste Ebene des Cache "%s"\: \n
SHRC847=Cacheebene                         %*.c\= %d
SHRC848=\nAktuelle Statistik f\u00FCr alle Ebenen des Cache "%s"\: \n
J9VM191=%2$.*1$s ist nicht sichtbar
SHRC849=Zusammenfassung der Statistikdaten des Cache nur f\u00FCr oberste Ebene ausgeben. Mit printTopLayerStats\=help k\u00F6nnen Sie die verf\u00FCgbaren Optionen anzeigen.
J9VM190=Superklasse %2$.*1$s kann keine Schnittstelle sein
SHRC842=Erstellen Sie eine neue gemeinsam genutzte Cacheebene.
J9VM193=Ab Java 13 sind -Xverify\:none und -noverify veraltet und werden zuk\u00FCnftig m\u00F6glicherweise nicht mehr als Optionen akzeptiert.
SHRC843=Ung\u00FCltige Ebenennummer %d f\u00FCr "%s" gefunden. Die Ebenennummer muss kleiner als %d sein.
J9VM192=%2$.*1$s ist keine Schnittstelle
SHRC844=Ung\u00FCltige Ebenennummer %d. Die vorhandene oberste Ebene ist %d. Die neue Ebenennummer sollte %d sein.
J9VM195=Paketarray ist null.
SHRC845=Pr\u00FCfen Sie nicht den freien Plattenspeicherplatz, bevor Sie einen persistenten Cache erstellen.
J9VM194=Ung\u00FCltige Beziehung f\u00FCr Laden von Klassen f\u00FCr untergeordnetes Element\: %2$.*1$s, \u00FCbergeordnetes Element\: %4$.*3$s
J9VM197=%1$s wird nicht mit %2$s unterst\u00FCtzt.
J9VM196=Paketzeichenfolge ist null.
J9VM199=Klasse %2$.*1$s ist nicht berechtigt, Werte von ihrer \u00FCbergeordneten versiegelten Schnittstelle zu \u00FCbernehmen.
J9VM198=Klasse %2$.*1$s ist nicht berechtigt, Werte von ihrer \u00FCbergeordneten versiegelten Klasse zu \u00FCbernehmen.
SHRC830=Das Ausgangsverzeichnis des Benutzers konnte nicht als Standardverzeichnis des gemeinsam genutzten Cache verwendet werden. Der Pfad ist zu lang. Ausgangsverzeichnis kann nicht abgerufen werden. W\u00E4hlen Sie \u00FCber die Umgebungsvariable "HOME" oder die Befehlszeilenoption "cacheDir\=" ein anderes Verzeichnis aus oder korrigieren Sie das Ausgangsverzeichnis im Kennwortdateieintrag.
SHRC835=Pr\u00FCfen Sie Zeitmarken von JAR/ZIP-Dateien von Nicht-Bootprogrammen bei jedem Laden von Klassen.
SHRC836=Alle gemeinsam genutzten Cacheebenen mit demselben Namen l\u00F6schen (Namensparameter oder Standard verwenden)
SHRC837=Cachedeskriptor konnte nicht zugeordnet werden.
J9VM180=Der Modulname ist ung\u00FCltig.
SHRC838=Der gemeinsam genutzte Cache konnte nicht gestartet werden. Eine \u00C4nderung an einem gemeinsam genutzten Cache einer niedrigeren Ebene wurde erkannt. Erwartete eindeutige Cache-ID\: %s
SHRC831=Das Ausgangsverzeichnis des Benutzers konnte nicht als Standardverzeichnis des gemeinsam genutzten Cache verwendet werden. Es befindet sich in einem Netzdateisystem. Ausgangsverzeichnis kann nicht abgerufen werden. W\u00E4hlen Sie \u00FCber die Umgebungsvariable "HOME" oder die Befehlszeilenoption "cacheDir\=" ein anderes Verzeichnis aus oder korrigieren Sie das Ausgangsverzeichnis im Kennwortdateieintrag.
J9VM182=Nur das Klassenladeprogramm des Bootprogramms oder der Plattform kann das Paket 'java' oder 'java.*' definieren.
SHRC832=Das Ausgangsverzeichnis des Benutzers konnte nicht als Standardverzeichnis des gemeinsam genutzten Cache verwendet werden. Fehlercode\: %1$d.
J9VM181=Nur das Klassenladeprogramm des Bootprogramms kann das Modul 'java.base' definieren.
SHRC833=Es konnte kein nativer Speicher zugeordnet werden, der zum Abrufen des Verzeichnisses des gemeinsam genutzten Cache erforderlich ist.
J9VM184=Ung\u00FCltige Klasse %2$.*1$s\: Qtype-Instanzfeld ist kein Werttyp
SHRC834=Minimieren Sie die Zeitmarkenpr\u00FCfung f\u00FCr URL-jar/zip-Dateien.
J9VM183=Verschachtelungselement %2$.*1$s muss Verschachtelungshost %4$.*3$s laden k\u00F6nnen
J9VM186=Ung\u00FCltiger Objekttyp %2$.*1$s\: Objekt f\u00FCr Stack ist kein Werttyp
J9VM185=Ung\u00FCltige Klasse %2$.*1$s\: classref ist kein Werttyp
J9VM188=Threaderstellung ist fehlgeschlagen\: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 0x%4$x
J9VM187=Ung\u00FCltiger Objekttyp %2$.*1$s\: synchronisiertes Objekt ist ein Werttyp
SHRC839=Der gemeinsam genutzte Cache konnte nicht gestartet werden. Beim Abrufen der eindeutigen ID eines vorausgesetzten Cache einer niedrigeren Ebene ist ein Fehler aufgetreten.
J9VM189=Finale Superklasse %2$.*1$s kann nicht erweitert werden
SHRC850=Verf\u00FCgbare Optionen f\u00FCr-Xshareclasses\:%1$s<Optionen>. Mit '+' k\u00F6nnen Sie mehrere Optionen angeben. Beispiel\: %2$saot+url \n
SHRC851=Inaktiviert die Zeitmarkenpr\u00FCfung, wenn Klassen im gemeinsam genutzten Cache gefunden werden. M\u00F6glicherweise werden veraltete Klassen aus dem gemeinsam genutzten Cache geladen.
SHRC852=Die oberste Ebene (Ebene %d) des Cache ist gel\u00F6scht. Eine \u00C4nderung an der Ebene %d des gemeinsam genutzten Cache wurde erkannt. Erwartete eindeutige Cache-ID\: %s, aktuelle eindeutige Cache-ID\: %s.
SHRC853=Prozessorfunktionen                   \= %s
VRFY007=Finale Methode au\u00DFer Kraft gesetzt
VRFY008=Array-Index keine ganze Zahl
VRFY009=Array nicht typkompatibel
SHRC761=Das Festlegen der Gruppenzugriffsberechtigung, die durch die Unteroption 'groupAccess' f\u00FCr die Momentaufnahmedatei f\u00FCr den gemeinsam genutzten Cache angefordert wurde, ist fehlgeschlagen.
VRFY000=%1$s; Klasse\=%3$.*2$s, Methode\=%5$.*4$s%7$.*6$s, PC\=%8$u
SHRC762=Fehler beim Abrufen des Status der Cachedatei f\u00FCr gemeinsam genutzte Klassen w\u00E4hrend der Pr\u00FCfung ihrer Zugriffsberechtigungen f\u00FCr Gruppen.
VRFY001=%1$s; Klasse\=%3$.*2$s, Methode\=%5$.*4$s%7$.*6$s
SHRC763=Alle Unteroptionen f\u00FCr gemeinsam genutzte Klassen sollten zusammen nicht l\u00E4nger als %u Zeichen sein.
VRFY002=Bytecodesequenz ung\u00FCltig
SHRC764=Der angeforderte gemeinsam genutzte Speicher mit einer Gr\u00F6\u00DFe von %1$d Byte konnte nicht erstellt werden. \n \tDer Wert wurde an das zul\u00E4ssige Maximum (%2$d Byte) f\u00FCr gemeinsam genutzten Speicher angepasst. \n \t(Zum Vergr\u00F6\u00DFern des verf\u00FCgbaren gemeinsam genutzten Speichers muss der Systemwert SHMMAX ge\u00E4ndert werden.) \n \t Wenn -Xscdmx verwendet wird, wird der Bereich des Debugattributs proportional entsprechend \n \t des Originalverh\u00E4ltnisses zum Wert -Xscmx angepasst.
VRFY003=Klasse enth\u00E4lt keine Vorabpr\u00FCfungsdaten.
VRFY004=JSR-Inlining fand zu viele JSRs.
VRFY005=Lokal nicht typkompatibel
VRFY006=Neue Array-Gr\u00F6\u00DFe ist keine ganze Zahl.
SHRC760=Das Festlegen der Gruppenzugriffsberechtigung, die durch die Unteroption 'groupAccess' f\u00FCr die Steuerdatei f\u00FCr den gemeinsam genutzten Speicher angefordert wurde, die dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnet ist, ist fehlgeschlagen.
SHRC769=Die JVM hat den Schutz von Teilseiten des gemeinsam genutzten Cache aktiviert, da der vorhandene gemeinsam genutzte Cache mit aktiviertem Schutz von Teilseiten erstellt wurde.
SHRC765=Speicherseitenschutz f\u00FCr Laufzeitdaten, Zeichenfolgen-Schreib-/Lesedaten und teilweise gef\u00FCllte Seiten wurde erfolgreich aktiviert.
SHRC766=Speicherseitenschutz f\u00FCr Laufzeitdaten und teilweise gef\u00FCllte Seiten wurde erfolgreich aktiviert
SHRC767=Speicherseitenschutz f\u00FCr Laufzeitdaten und Zeichenfolgen-Schreib-/Lesedaten wurde erfolgreich aktiviert
SHRC768=Speicherseitenschutz f\u00FCr Laufzeitdaten wurde erfolgreich aktiviert
VRFY018=Max. Stack \u00FCberschritten
VRFY019=Laden der Klasse ist fehlgeschlagen.
VRFY010=Mehrere JSRs verwenden eine einzige R\u00FCckgabe.
SHRC750=Keine AOT-Methoden entsprechen den Methodenspezifikationen.
VRFY011=Parameter "lookupswitch" ist keine ganze Zahl.
SHRC751=Die Methodenspezifikationen konnten nicht analysiert werden. Es sind maximal %d Methodenspezifikationen zul\u00E4ssig.
VRFY012=Stackform inkonsistent
SHRC752=Die Methodenspezifikation(en) konnte(n) nicht analysiert werden.
VRFY013=Integrit\u00E4tsbedingung f\u00FCr das Laden von Klassen nicht eingehalten
SHRC753=Der Cache-Mutex f\u00FCr Schreiben konnte nicht abgerufen werden.
VRFY014=R\u00FCckgabebytecode nicht kompatibel mit R\u00FCckgabetyp
VRFY015=Mehrere R\u00FCckgaben auf eine einzige JSR
VRFY016=Bytecodeparameter f\u00FCr Verschiebung ist keine ganze Zahl.
VRFY017=<init> ruft nicht diese <init> oder die \u00FCbergeordnete <init> auf.
SHRC758=Das Festlegen der Gruppenzugriffsberechtigung, die durch die Unteroption 'groupAccess' f\u00FCr den gemeinsam genutzten Speicher mit shmid\=%d angefordert wurde, der dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnet ist, ist fehlgeschlagen.
SHRC759=Das Festlegen der Gruppenzugriffsberechtigung, die durch die Unteroption 'groupAccess' f\u00FCr die Semaphorsteuerdatei angefordert wurde, die dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnet ist, ist fehlgeschlagen.
SHRC754=Die erneute Erstellung einer Steuerdatei f\u00FCr gemeinsam genutzten Speicher ist nicht zul\u00E4ssig.
SHRC755=\t invalidatedaot Gibt nur inaktivierte AOT-Typen im gemeinsam genutzten Cache aus.
SHRC756=Das Festlegen der Gruppenzugriffsberechtigung f\u00FCr die Datei des gemeinsam genutzten Cache, die durch die Unteroption 'groupAccess' angefordert wurde, ist fehlgeschlagen.
VRFY020=Aufrufargumente nicht typkompatibel
SHRC757=Das Festlegen der Gruppenzugriffsberechtigung, die durch die Unteroption 'groupAccess' f\u00FCr das Semaphorset mit semid\=%d angefordert wurde, das dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnet ist, ist fehlgeschlagen.
SHRC783=Der maximal zul\u00E4ssige JIT-Datenspeicherbereich sollte nicht gr\u00F6\u00DFer als der softmx-Grenzwert (%u Byte) sein, der f\u00FCr die Belegung des gemeinsam genutzten Cache festgelegt wurde.
SHRC300=Der Cache f\u00FCr gemeinsam genutzte Klasse wird von einer anderen virtuellen Maschine verwendet; der verschachtelte Cache kann nicht vergr\u00F6\u00DFert werden.
SHRC784=Der angeforderte minimale AOT- und/oder JIT-Datenspeicherbereich kann nicht festgelegt werden. Der festgelegte softmx-Grenzwert f\u00FCr die Belegung des gemeinsam genutzten Cache oder die gesamte Cachegr\u00F6\u00DFe ist nicht gro\u00DF genug.
SHRC301=Verschachtelter Cache "%s" kann nicht vergr\u00F6\u00DFert werden, neuer Supercache f\u00FCr Hinweise konnte nicht zugeordnet werden.
SHRC785=Die mindestens reservierten AOT-Byte sind auf %d gesetzt.
SHRC302=Verschachtelter Cache "%s" kann nicht vergr\u00F6\u00DFert werden, Block f\u00FCr Hinweise konnte nicht zugeordnet werden.
SHRC786=Die maximal zul\u00E4ssigen AOT-Byte sind auf %d gesetzt.
SHRC780=Die Gr\u00F6\u00DFe des maximalen AOT-Bereichs sollte nicht kleiner sein als die AOT-Byte (%d), die bereits im Cache gespeichert sind.
SHRC781=Der maximal zul\u00E4ssige AOT-Bereich sollte nicht gr\u00F6\u00DFer als der softmx-Grenzwert (%u Byte) sein, der f\u00FCr die Belegung des gemeinsam genutzten Cache festgelegt wurde.
SHRC782=Die Gr\u00F6\u00DFe des maximalen JIT-Datenspeicherbereichs sollte nicht kleiner sein als die JIT-Byte (%d), die bereits im Cache gespeichert sind.
SHRC307=\tROMMETHOD\: %2$.*1$s Signatur\: %4$.*3$s Adresse\: 0x%5$p
SHRC308=Cache "%s" konnte nicht serialisiert werden. Die Aktualisierung der ROM-Klassen-Offsets in AOT-Methoden ist fehlgeschlagen.
SHRC309=Die Optionen "grow" und "readonly" d\u00FCrfen nicht zusammen genutzt werden.
SHRC303=Verschachtelter Cache "%s" konnte nicht erstellt werden.
SHRC787=Die mindestens reservierten JIT-Datenbyte sind auf %d gesetzt.
SHRC304=Cache "%s" konnte nicht ersetzt werden.
SHRC788=Die maximal zul\u00E4ssigen JIT-Datenbyte sind auf %d gesetzt.
SHRC305=Speicher f\u00FCr Hinweis-Lookup-Tabelle kann in SH_ClasspathManagerImpl2 nicht reserviert werden.
SHRC789=Die softmx-Byte sind auf %u gesetzt.
SHRC306=\ Signatur\: %2$.*1$s Adresse\: 0x%3$p
SHRC772=Der softmx-Grenzwert f\u00FCr die Belegung des gemeinsam genutzten Cache "%s" wurde erreicht. Verwenden Sie die Option "%s", um den softmx-Grenzwert zu erh\u00F6hen.
SHRC773=Der Bereich f\u00FCr AOT-Daten im gemeinsam genutzten Cache "%s" ist voll.
SHRC774=Der Bereich f\u00FCr JIT-Daten im gemeinsam genutzten Cache "%s" ist voll.
SHRC775=Der f\u00FCr die Belegung des gemeinsam genutzten Cache festgelegte softmx-Grenzwert ist gr\u00F6\u00DFer als die gesamte Cachegr\u00F6\u00DFe (%u Byte). Er wird auf die gesamte Cachegr\u00F6\u00DFe gesetzt.
SHRC770=Die JVM hat den Schutz teilweise gef\u00FCllter Seiten inaktiviert. Wenn die Option '-Xshareclasses\:mprotect\=onfind' angegeben ist, wird sie ignoriert.
SHRC771=Aktiviert den Speicherschutz f\u00FCr teilweise gef\u00FCllte Seiten. Unter z/OS ist dies \u00E4quivalent zu 'partialpagesonstartup'.
SHRC776=Der softmx-Grenzwert f\u00FCr die Belegung des gemeinsam genutzten Cache ist kleiner als die Anzahl der Byte (%u), die bereits im gemeinsam genutzten Cache verwendet werden.
SHRC777=Der softmx-Grenzwert f\u00FCr die Belegung des gemeinsam genutzten Cache ist kleiner als der zul\u00E4ssige Mindestwert (%u Byte).
SHRC778=Der mindestens reservierte AOT-Bereich sollte nicht gr\u00F6\u00DFer als der maximal zul\u00E4ssige AOT-Bereich sein.
SHRC779=Der mindestens reservierte JIT-Datenspeicherbereich sollte nicht gr\u00F6\u00DFer als der maximal zul\u00E4ssige JIT-Datenspeicherbereich sein.
SHRC321=Fehlerbehebung\: Semaphore eines gemeinsam genutzten Speichers schlie\u00DFen.
SHRC322=Semaphore f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse konnten nicht initialisiert werden. Warnung\: Ihr Cache ist m\u00F6glicherweise besch\u00E4digt. Wenn bei Verwendung des gemeinsam genutzten Cache Probleme auftreten, m\u00FCssen Sie diesen m\u00F6glicherweise l\u00F6schen und neu erstellen.
SHRC323=FEHLER\: Fehler beim Eintritt in den Mutex f\u00FCr den Header des gemeinsam genutzten Klassencache. Warnung\: Ihr Cache ist m\u00F6glicherweise besch\u00E4digt. Wenn bei Verwendung des gemeinsam genutzten Cache Probleme auftreten, m\u00FCssen Sie diesen m\u00F6glicherweise l\u00F6schen und neu erstellen.
SHRC324=FEHLER\: Fehler beim Verlassen des Mutex f\u00FCr den Header des gemeinsam genutzten Klassencache. Warnung\: Ihr Cache ist m\u00F6glicherweise besch\u00E4digt. Wenn bei Verwendung des gemeinsam genutzten Cache Probleme auftreten, m\u00FCssen Sie diesen m\u00F6glicherweise l\u00F6schen und neu erstellen.
SHRC320=Fehlerbehebung\: L\u00F6schen der Semaphore des gemeinsam genutzten Speichers.
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex konnte den Zeichenfolgetabellen-Mutex nicht anfordern (R\u00FCckkehrcode %d).
SHRC325=Headersperre f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse konnte w\u00E4hrend der Initialisierung nicht \u00FCbergeben werden. Warnung\: Ihr Cache ist m\u00F6glicherweise besch\u00E4digt. Wenn bei Verwendung des gemeinsam genutzten Cache Probleme auftreten, m\u00FCssen Sie diesen m\u00F6glicherweise l\u00F6schen und neu erstellen.
SHRC326=Benutzersperre f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse konnte w\u00E4hrend der Initialisierung nicht \u00FCbergeben werden. Warnung\: Ihr Cache ist m\u00F6glicherweise besch\u00E4digt. Wenn bei Verwendung des gemeinsam genutzten Cache Probleme auftreten, m\u00FCssen Sie diesen m\u00F6glicherweise l\u00F6schen und neu erstellen.
SHRC327=SH_OSCachesysv\:\:acquireWriteLock()-Aufruf an "j9shsem_wait" ist mit Fehler %d fehlgeschlagen.
SHRC328=System V IPC hat den folgenden Fehler "%s" zur\u00FCckgemeldet.
VERB032=Minimaler reservierter Speicherbereich f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse f\u00FCr JIT-Daten
SHRC310=Persistenter Cache kann in einem Netzdateisystem nicht lokalisiert werden. W\u00E4hlen Sie ein anderes "cacheDir" aus.
SHRC794=Passen Sie den maximalen f\u00FCr JIT-Daten zul\u00E4ssigen Speicherbereich im Cache f\u00FCr gemeinsam genutzte Klassen an <Gr\u00F6\u00DFe> an.
VERB033=Maximal zul\u00E4ssiger Speicherbereich f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse f\u00FCr JIT-Daten
SHRC311=Fehler beim Freigeben der Anhangschreibsperre f\u00FCr die Datei f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse
SHRC795=Die Summe aus mindestens reservierten AOT-Byte (%d) und mindestens reservierten JIT-Datenbyte (%d) sollte nicht gr\u00F6\u00DFer als die softmx-Byte (%d) sein.
VERB034=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten f\u00FCr JIT-Codecache
SHRC312=Fehler beim Freigeben der Headerschreibsperre f\u00FCr die Datei f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse
SHRC796=Der mindestens reservierte AOT-Bereich sollte nicht gr\u00F6\u00DFer als der softmx-Grenzwert (%d) sein, der f\u00FCr die Belegung des gemeinsam genutzten Cache festgelegt wurde.
VERB035=Verf\u00FCgbare Gr\u00F6\u00DFen f\u00FCr gro\u00DFe Seiten f\u00FCr JIT-Codecache\:
SHRC313=jclCacheMutex konnte in "shrinit" nicht erstellt werden.
SHRC797=Der mindestens reservierte JIT-Datenspeicherbereich sollte nicht gr\u00F6\u00DFer als der softmx-Grenzwert (%d) sein, der f\u00FCr die Belegung des gemeinsam genutzten Cache festgelegt wurde.
VERB036=Anfangsgr\u00F6\u00DFe der Metadaten f\u00FCr komprimierte Verweise
SHRC790=Passen Sie die softmx-Gr\u00F6\u00DFe im Cache an <Gr\u00F6\u00DFe> an.
VERB037=Gr\u00F6\u00DFe des Cache f\u00FCr gemeinsam genutzte Klasse
SHRC791=Passen Sie den minimalen f\u00FCr AOT-Daten reservierten Speicherbereich im Cache f\u00FCr gemeinsam genutzte Klassen an <Gr\u00F6\u00DFe> an.
VERB038=Ver\u00E4nderliche maximale Gr\u00F6\u00DFe des Cache f\u00FCr gemeinsam genutzte Klasse
SHRC792=Passen Sie den maximalen f\u00FCr AOT-Daten zul\u00E4ssigen Speicherbereich im Cache f\u00FCr gemeinsam genutzte Klassen an <Gr\u00F6\u00DFe> an.
SHRC793=Passen Sie den minimalen f\u00FCr JIT-Daten reservierten Speicherbereich im Cache f\u00FCr gemeinsam genutzte Klassen an <Gr\u00F6\u00DFe> an.
SHRC318=Fehlerbehebung\: L\u00F6schen des gemeinsam genutzten Speichers.
SHRC319=Fehlerbehebung\: Schlie\u00DFen des gemeinsam genutzten Speichers.
SHRC314=Speicher f\u00FCr Hinweis-Lookup-Tabelle kann in SH_Manager nicht reserviert werden.
SHRC798=Der maximal zul\u00E4ssige AOT-Bereich sollte nicht gr\u00F6\u00DFer als der softmx-Grenzwert (%d) sein, der f\u00FCr die Belegung des gemeinsam genutzten Cache festgelegt wurde.
SHRC315=Cachelet-Klassenspeichersegmente k\u00F6nnen nicht initialisiert werden.
SHRC799=Der maximal zul\u00E4ssige JIT-Datenspeicherbereich sollte nicht gr\u00F6\u00DFer als der softmx-Grenzwert (%d) sein, der f\u00FCr die Belegung des gemeinsam genutzten Cache festgelegt wurde.
VERB030=Maximal zul\u00E4ssiger Speicherbereich f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse f\u00FCr JIT
SHRC316=Cache kann nicht serialisiert werden, weil es keinen aktuellen VM-Thread gibt.
VERB031=Reservierter Speicherbereich f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse f\u00FCr Klassendebugattribute
SHRC317=Den Namen der Datei f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse, der verwendet werden wird, ausgeben.
VRFY029=Ung\u00FCltige R\u00FCckkehradresse f\u00FCr R\u00FCckkehranweisung
VRFY021=Ausgel\u00F6stes Objekt ist nicht ausl\u00F6sbar.
SHRC343=Klasse %1$s in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %2$d mit URL %4$.*3$s gefunden.
VRFY022=F\u00FCr Subroutinen muss f\u00FCr jeden JSR eine Walk-Operation ausgef\u00FChrt werden.
SHRC344=Klasse %1$s konnte in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %2$d mit URL %4$.*3$s nicht gefunden werden.
VRFY023=Parameter "tableswitch" ist keine ganze Zahl.
SHRC345=Klasse %1$s in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %2$d mit Token %4$.*3$s gefunden.
VRFY024=Argumente sind nicht typkompatibel.
SHRC346=Klasse %1$s konnte in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %2$d mit Token %4$.*3$s nicht gefunden werden.
VRFY025=Ung\u00FCltiger Zugriff auf gesch\u00FCtzte Daten
VRFY026=Unerwartete Bezugszahl f\u00FCr das Dateiende (EOF)
SHRC340=CRC-Pr\u00FCfung des gemeinsam genutzten Cache fehlgeschlagen. Gespeicherter CRC %1$x, berechneter CRC %2$x
VRFY027=Empf\u00E4nger ist nicht kompatibel mit deklarierender Klasse.
SHRC341=Klasse %1$s in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %2$d gefunden.
VRFY028=Falsche Dimension
SHRC342=Klasse %1$s konnte in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %2$d nicht gefunden werden.
SHRC347=Klasse %2$.*1$s in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %3$d mit URL %5$.*4$s (Index %6$d) gespeichert.
SHRC348=Klasse %2$.*1$s konnte in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %3$d mit URL %5$.*4$s (Index %6$d) nicht gespeichert werden.
VRFY030=Ung\u00FCltiger Typ f\u00FCr Stack
SHRC349=Klasse %2$.*1$s in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %3$d mit URL %5$.*4$s gespeichert.
VRFY031=Die lokale Variable iinc enth\u00E4lt keine ganze Zahl.
J2SE000=\n
VRFY032=Ung\u00FCltiger Empf\u00E4nger f\u00FCr <init>
SHRC332=Datenspeicherseitenschutz f\u00FCr Cache erfolgreich aktiviert
VRFY033=Feld nicht typkompatibel
SHRC333=Standardspeicherseitenschutz f\u00FCr Cache aktiviert
VRFY034=Ziel-PC ung\u00FCltig
SHRC334=Fehlerbehebung fehlgeschlagen\: Das L\u00F6schen des gemeinsam genutzten Speichers ist fehlgeschlagen.
VRFY035=Kein Fehler
SHRC335=Fehlerbehebung fehlgeschlagen\: Das L\u00F6schen des gemeinsam genutzten Semaphors ist fehlgeschlagen.
VRFY036=Stackunterlauf
VRFY037=Nicht initialisiertes Objekt bei R\u00FCckw\u00E4rtsverzweigung
VRFY038=invokespecial auf ung\u00FCltigem Ziel
SHRC330=SH_CompositeCacheImpl\:\:runExitCode konnte den Schreibbereichs-Mutex nicht anfordern (R\u00FCckkehrcode %d).
VRFY039=Unbekannter Bytecode
SHRC331=Es wurde ein anderer Semaphor als der vorher mit diesem Cache verwendete angefordert.
SHRC336=Fehlercode f\u00FCr Portschicht \= %1$d
VRFY040=Pr\u00FCffunktion kann nativen Speicher nicht zuordnen
SHRC337=Fehlernachricht f\u00FCr Plattform\: %1$s
SHRC338=Fehlercode f\u00FCr Portschicht \= %1$d
VRFY041=invokespecial des falschen Initialisierungsoperators
VRFY042=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u; Keine Typ\u00FCbereinstimmung, Argument %9$d in Signatur %11$.*10$s.%13$.*12$s\:%15$.*14$s stimmt nicht \u00FCberein
SHRC339=Fehlernachricht f\u00FCr Plattform\: %1$s
VERB007=Stackgr\u00F6\u00DFe des Betriebssystemthreads
VERB008=Anfangsstackgr\u00F6\u00DFe des Java-Threads
VERB009=Inkrement f\u00FCr Java-Thread-Stack
SHRC360=Bytedaten f\u00FCr Schl\u00FCssel %.*s konnten in gemeinsam genutztem Cache nicht gefunden werden...
SHRC365=Aktiviert die Speicherung von Klassendebuginformationen in der gemeinsam genutzten Klasse.
EXEL109=\  -XX\:ShareClassesEnableBCI   Cache f\u00FCr gemeinsam genutzte Klassen mit Unterst\u00FCtzung f\u00FCr Bytecodeinstrumentierung erstellen
SHRC366=Debug aktiviert      \= true
VERB000=Ausf\u00FChrlicher Stack\: "%2$.*1$s" belegte %3$zd/%4$zd Byte in Java/C-Stacks.
SHRC367=Debug aktiviert      \= false
VERB001=
SHRC368=Cache f\u00FCr gemeinsam genutzte Klasse ohne aktiviertes Debug abschalten.
VERB002=Ausf\u00FChrlicher Stack\: maximale Stackbelegung betrug %1$zd/%2$zd Byte in Java/C-Stacks.
SHRC361=Fehler beim Zuordnen zum gemeinsam genutzten Speicher w\u00E4hrend des \u00D6ffnens/Erstellens
VERB003=Fehler\: -Xverbosegclog Anzahl der Dateien muss gr\u00F6\u00DFer als 0 sein.
SHRC362=Speicher f\u00FCr ClasspathItem kann nicht reserviert werden.
VERB004=Fehler\: -Xverbosegclog Anzahl der Zyklen muss gr\u00F6\u00DFer als 0 sein.
SHRC363=API f\u00FCr gemeinsam genutzte Klassen kann in "shrinit" nicht zugeordnet werden.
VERB005=Fehler\: -Xverbosegclog fehlender Dateiname
SHRC364=SH_OSCachesysv\:\:acquireWriteLock()-Aufruf an "j9shsem_wait" auf Semaphor-ID %d ist mit Fehler %d fehlgeschlagen.
VERB006=Initialisierung ist fehlgeschlagen.
EXEL112=\  -Xscsoftmx<x>   ver\u00E4nderliche maximale Gr\u00F6\u00DFe des neuen Cache f\u00FCr gemeinsam genutzte Klasse auf <x> setzen
EXEL113=\  -Xscmx<x>       Gr\u00F6\u00DFe (oder ver\u00E4nderliche maximale Gr\u00F6\u00DFe, wenn Option -XX\:SharedCacheHardLimit\= vorhanden ist) des neuen Cache f\u00FCr gemeinsam genutzte Klasse auf <x> setzen
EXEL114=\  -XX\:SharedCacheHardLimit\=<x>   Gr\u00F6\u00DFe des neuen Cache f\u00FCr gemeinsam genutzte Klasse auf <x> setzen
EXEL115=\  -XX\:+ShareAnonymousClasses   Speichern und Suchen von anonymen Klassen im Cache f\u00FCr gemeinsam genutzte Klassen aktivieren
SHRC369=-Xnolinenumbers    \= true
EXEL116=\  -XX\:-ShareAnonymousClasses   Speichern und Suchen von anonymen Klassen im Cache f\u00FCr gemeinsam genutzte Klassen inaktivieren
EXEL117=\  -XX\:+ShareUnsafeClasses   Speichern und Suchen von nicht anonymen unsicheren Klassen im Cache f\u00FCr gemeinsam genutzte Klassen aktivieren
EXEL118=\  -XX\:-ShareUnsafeClasses   Speichern und Suchen von nicht anonymen unsicheren Klassen im Cache f\u00FCr gemeinsam genutzte Klassen inaktivieren
EXEL119=\  -XX\:+UseGCStartupHints   Speichern und Suchen von GC-Startup-Hinweisen im Cache f\u00FCr gemeinsam genutzte Klassen aktivieren
EXEL110=\  -XX\:ShareClassesDisableBCI   Cache f\u00FCr gemeinsam genutzte Klassen ohne Unterst\u00FCtzung f\u00FCr Bytecodeinstrumentierung erstellen
EXEL111=\  -XX\:+StoreIntermediateClassfile   w\u00E4hrend der erneuten Umsetzung zu verwendende unaufbereitete Klassendaten speichern
SHRC354=AOT-Code f\u00FCr ROMMethod 0x%1$p konnte in gemeinsam genutztem Cache nicht gefunden werden.
SHRC355=AOT-Code f\u00FCr ROMMethod 0x%1$p in gemeinsam genutztem Cache gespeichert.
SHRC356=AOT-Code f\u00FCr ROMMethod 0x%1$p konnte in gemeinsam genutztem Cache nicht gespeichert werden.
SHRC357=Bytedaten f\u00FCr Schl\u00FCssel %.*s in gemeinsam genutztem Cache gespeichert.
SHRC350=Klasse %2$.*1$s konnte in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %3$d mit URL %5$.*4$s nicht gespeichert werden.
SHRC351=Klasse %2$.*1$s in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %3$d mit Token %5$.*4$s gespeichert.
SHRC352=Klasse %2$.*1$s konnte in gemeinsam genutztem Cache f\u00FCr Klassenladeprogramm-ID %3$d mit Token %5$.*4$s nicht gespeichert werden.
SHRC353=AOT-Code f\u00FCr ROMMethod 0x%1$p in gemeinsam genutztem Cache gefunden.
EXEL101=\n  -Xhealthcenter  den Diagnosezentralen-Agenten aktivieren
EXEL102=
EXEL103=\  -Xscdmx<x>      Gr\u00F6\u00DFe des Bereichs des Attributs 'debug' f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse auf <x> festlegen
EXEL104=\  -Xscminjit<x>   minimalen f\u00FCr JIT-Daten reservierten Speicherbereich f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse auf <x> festlegen
SHRC358=Bytedaten f\u00FCr Schl\u00FCssel %.*s konnten in gemeinsam genutztem Cache nicht gespeichert werden.
EXEL105=\ -Xscmaxjit<x>   maximalen f\u00FCr JIT-Daten zul\u00E4ssigen Speicherbereich f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse auf <x> festlegen
SHRC359=Bytedaten f\u00FCr Schl\u00FCssel %.*s in gemeinsam genutztem Cache gefunden...
EXEL106=\  -Xscminjitdata<x>   minimalen f\u00FCr JIT-Daten reservierten Speicherbereich f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse auf <x> festlegen
EXEL107=\  -Xscmaxjitdata<x>   maximalen f\u00FCr JIT-Daten zul\u00E4ssigen Speicherbereich f\u00FCr Cache f\u00FCr gemeinsam genutzte Klasse auf <x> festlegen
EXEL108=\  -Xzero\:nosharebootzip   Caches f\u00FCr Bootstrap-JAR-Dateieintr\u00E4ge im Cache f\u00FCr gemeinsam genutzte Klassen nicht gemeinsam nutzen
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj weiche Echtzeit aktivieren
VERB029=Minimaler reservierter Speicherbereich f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse f\u00FCr JIT
SHRC380=Klassendebugbereich %% verwendet              %*c\= %u
SHRC381=LineNumberTable-Klassenbyte         %*c\= %u
SHRC382=Byte im Klassendebugbereich des Typs LocalVariableTable  %*c\= %u\n
VERB021=Ung\u00FCltiger Klassenpfadeintrag\: %s (nicht unterst\u00FCtzter Dateityp)
SHRC387=freie Byte                          %*c\= %d
VERB022=Ung\u00FCltiger Klassenpfadeintrag\: %s (unbekannter Dateityp)
SHRC388=ROM-Klassenbyte                      %*c\= %d
VERB023=Ung\u00FCltiger Klassenpfadeintrag\: %s (unbekannter Fehler)
SHRC389=Metadatenbyte                      %*c\= %d
VERB024=Ung\u00FCltiger Klassenpfadeintrag\: %s (in JXE-Datei fehlt rom.classes)
VERB025=Ung\u00FCltiger Klassenpfadeintrag\: %s (besch\u00E4digter Image-Header in JXE-Datei)
SHRC383=\nBasisadresse                        %*c\= 0x%p
VERB026=Ung\u00FCltiger Klassenpfadeintrag\: %s (JXE-Datei mit entgegengesetztem Endian wird nicht unterst\u00FCtzt)
SHRC384=Endadresse                         %*c\= 0x%p
VERB027=Ausf\u00FChrlicher Stack\: Aktiver Thread "%2$.*1$s" belegt %3$zd/%4$zd Byte in Java/C-Stacks.
SHRC385=Zuordnungszeiger                  %*c\= 0x%p\n
VERB028=Ausf\u00FChrlicher Stack\: Die Stackinformationen f\u00FCr die derzeit aktiven Threads k\u00F6nnen nicht ausgegeben werden.
SHRC386=Cachegr\u00F6\u00DFe                          %*c\= %d
VERB020=Ung\u00FCltiger Klassenpfadeintrag\: %s (Datei besch\u00E4digt)
VERB018=Ung\u00FCltiger Klassenpfadeintrag\: %s (Dateiein-/ausgabe ist fehlgeschlagen)
VERB019=Ung\u00FCltiger Klassenpfadeintrag\: %s (Lesen der Datei ist fehlgeschlagen
SHRC370=-Xnolinenumbers    \= false
SHRC371=Zip-Cache-Byte    \= %d
VERB010=Maximalstackgr\u00F6\u00DFe des Java-Threads
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC377=Der Wert von -Xscdmx von %u Byte ist gr\u00F6\u00DFer als %u Byte des verf\u00FCgbaren freien Speicherbereichs. Stattdessen wird f\u00FCr -Xscdmx ein Wert von %u Byte verwendet.
VERB011=Stackgr\u00F6\u00DFe des Java-Threads
VERB012=Inkrement f\u00FCr RAM-Klassensegment
SHRC378=\nZugeh\u00F6rige Befehlszeilenoptionen\:\n
VERB013=Inkrement f\u00FCr ROM-Klassensegment
SHRC379=Gr\u00F6\u00DFe des Klassendebugbereichs               %*c\= %u
VERB014=Maximaler Speicher
SHRC372=\# Zip-Caches       \= %d
VERB015=Gr\u00F6\u00DFe des Cache f\u00FCr gemeinsam genutzte Klasse
SHRC373=JIT-Datenbyte     \= %d
SHRC374=Cache erstellt mit\:
VERB016=Minimaler reservierter Speicherbereich f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse f\u00FCr AOT
SHRC375=Der Cachename ist zu lang, wenn er den Benutzernamen einschlie\u00DFt. In diesem Puffer sind noch %d Byte frei und Ihr Benutzername hat %d Byte.
VERB017=Maximal zul\u00E4ssiger Speicherbereich f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse f\u00FCr AOT
EXEL120=\  -XX\:-UseGCStartupHints   Speichern und Suchen von GC-Startup-Hinweisen im Cache f\u00FCr gemeinsam genutzte Klassen inaktivieren
EXEL121=\  -XX\:+PortableSharedCache   Funktion aktivieren, die versucht, die Portierbarkeit des gemeinsam genutzten Caches system\u00FCbergreifend zu maximieren
EXEL122=\  -XX\:-PortableShareCache   Funktion inaktivieren, die versucht, die Portierbarkeit des gemeinsam genutzten Caches system\u00FCbergreifend zu maximieren
SHRC390=Metadaten %% verwendet                     %*c\= %d%%
SHRC391=\# ROM-Klassen                        %*c\= %d
SHRC392=\# Klassenpfade                        %*c\= %d
SHRC393=\# URLs                              %*c\= %d
SHRC398=\# AOT-Methoden                       %*c\= %d
SHRC399=Datenbyte                          %*c\= %d
SHRC394=\# Tokens                            %*c\= %d
SHRC395=\# Veraltete Klassen                     %*c\= %d
SHRC396=%% Veraltete Klassen                     %*c\= %d%%\n
SHRC397=AOT-Byte                           %*c\= %d
CFRE100=Zu viele Dimensionen in Bytecode "multianewarray" angefordert
CFRE101=Offset au\u00DFerhalb des g\u00FCltigen Bereichs im Bytecode "switch"
CFRE102=Feldsignatur ist ung\u00FCltig.
CFRE103=Abstrakte Methode kann nicht "private", "static", "final", "native", "synchronized" oder "strict" sein.
CFRE104=Feld kann nur "public", "private" oder "protected" sein.
CFRE110=Inkompatible Konstante f\u00FCr Feld
CFRE111=Fehlerhafter UTF8-Code
CFRE112=VM unterst\u00FCtzt nicht die dynamische \u00DCberpr\u00FCfung.
CFRE113=Unerwartete Bezugszahl f\u00FCr das Dateiende (EOF)
CFRE114=Feldname ist ung\u00FCltig.
CFRE115=Array-Dimensionen > 255
CFRE105="superClass" muss eine Klasse sein.
CFRE106=Doppelte Methode
CFRE107=Offset im Sprungbytecode au\u00DFerhalb des g\u00FCltigen Bereichs
CFRE108=Methodenindex der \u00FCbergeordneten Methode muss auf einen Namen und Typ verweisen.
CFRE109=Methodensignatur ist ung\u00FCltig.
CFRE141=method_info hat mehr als ein Attribut 'RuntimeInvisibleParameterAnnotations' oder 'RuntimeVisibleParameterAnnotations'.
CFRE142=Klasse hat mehr als ein Attribut 'RuntimeInvisibleAnnotations' oder 'RuntimeVisibleAnnotations'.
CFRE143=Mehrere Attribute f\u00FCr Verschachtelungspartner
CFRE144=Element des Verschachtelungshosts des Verschachtelungsattributs muss eine konstante Klasse sein
CFRE145=Verschachtelungshost muss eine konstante Klasse sein
CFRE146=Methode <clinit> ist nicht statisch
CFRE147=Methode <clinit> hat eine unzul\u00E4ssige Signatur
CFRE148=Schnittstelle darf keine Methode <init> enthalten
CFRE140=method_info hat mehr als ein Attribut 'AnnotationDefault'.
CFRE138=Attribut 'Classfile' verweist auf nicht vorhandenen Konstantenpooleintrag.
CFRE139=Klasse hat mehr als ein Attribut 'SourceDebugExtension'.
CFRE152='module-info' ist keine Klasse, weil die Zugriffsmarkierung ACC_MODULE festgelegt wurde
CFRE153=Der Konstantenpooleintrag ist in Klassendateien mit Versionen unter 55.0 nicht g\u00FCltig.
CFRE154=Die Bytecodes ldc und ldc_2 bytecodes m\u00FCssen auf eine Konstante oder Constant_Dynamic verweisen
CFRE155=Der Bytecode ldc2_w muss auf eine Konstante oder Constant_Dynamic verweisen
CFRE156=Constant_Dynamic-Eintr\u00E4ge, auf die von den Bytecodes ldc und ldc_w verwiesen wird, d\u00FCrfen nicht 'long' oder 'double' zur\u00FCckgeben
CFRE157=Constant_Dynamic-Eintr\u00E4ge, auf die vom Bytecode ldc2_w verwiesen wird, m\u00FCssen 'long' oder 'double' zur\u00FCckgeben
CFRE158=Der Konstantenpooleintrag ist in Klassendateien mit Versionen unter 49.0 nicht g\u00FCltig.
CFRE159=Der Konstantenpooleintrag ist in Klassendateien mit Versionen unter 51.0 nicht g\u00FCltig.
CFRE150=Unbekannter Konstantentag 20 in Klassendatei
CFRE151=Der Konstantenpooleintrag ist in Klassendateien mit Versionen unter 53.0 nicht g\u00FCltig.
CFRE149=Unbekannter Konstantentag 19 in Klassendatei
CFRE120=Operationscodes "jsr" und "jsr_w" sind in Klassendateien mit Versionen >\= 51.0 nicht g\u00FCltig.
CFRE121=Unzul\u00E4ssiger Feldname
CFRE122=Klasse kann nur "public" oder "module" sein.
CFRE123=MethodHandle-Konstanten m\u00FCssen auf einen Feld- oder einen Methodenverweis verweisen
CFRE124=Wertetag f\u00FCr Anmerkungselement ist ung\u00FCltig
CFRE125=Bytecode "invokedynamic" muss auf einen Eintrag "InvokeDynamic" f\u00FCr den Konstantenpool verweisen
CFRE126=Bytecode "invokedynamic" hat Slots reserviert, die ungleich null sind
CFRE116=Bytecode "invoke" muss auf "Methodref" verweisen.
CFRE117=Feld kann nicht gleichzeitig "final" und "volatile" sein.
CFRE118=Zus\u00E4tzliche Byte nach EQF
CFRE119=Mehrere SourceFile-Attribute
CFRE130=Mehrere Attribute 'BootstrapMethods'
CFRE131=Das von 'invokedynamic' ben\u00F6tigte Attribut 'BootstrapMethods' ist nicht vorhanden oder zu klein.
CFRE132='target_type' f\u00FCr 'type_annotation' wurde nicht erkannt.
CFRE133=Methode hat zwei Attribute 'MethodParameters'.
CFRE134=Methodenparameter hat eine ung\u00FCltige Markierung.
CFRE135=Methodenparametername ist nicht UTF8.
CFRE136=Unzul\u00E4ssige \u00C4nderungswerte f\u00FCr Schnittstellenmethode
CFRE137=Klasse hat mehr als ein Attribut 'RuntimeVisibleTypeAnnotations' oder 'RuntimeInvisibleTypeAnnotations'.
CFRE127=Der Index f\u00FCr die Bootmethode muss auf einen Eintrag "MethodHandle" f\u00FCr den Konstantenpool verweisen
CFRE128=Methodentypsignatur ist ung\u00FCltig
CFRE129=Der Konstantenpooleintrag ist in Klassendateien mit Versionen unter 51.0 nicht g\u00FCltig
CFRE163=Die Klassendatei ist eine Vorschauversion, geh\u00F6rt aber zur falschen Hauptversion oder die Vorschau ist nicht aktiviert.
CFRE164=Index in LocalVariableTable liegt au\u00DFerhalb des g\u00FCltigen Bereichs.
CFRE165=Index in LocalVariableTypeTable liegt au\u00DFerhalb des g\u00FCltigen Bereichs.
CFRE166=Doppelte Eintr\u00E4ge in LocalVariableTypeTable sind nicht zul\u00E4ssig.
CFRE167=Mehrere Record-Attribute
CFRE168=Record-Klassen d\u00FCrfen nicht abstrakt sein.
CFRE169=Record-Name muss eine Zeichenfolge sein.
CFRE160=Der Konstantenpooleintrag ist in Klassendateien mit Versionen unter 55.0 nicht g\u00FCltig.
CFRE161=Argumente von BootstrapMethod (%1$d) enthalten einen ung\u00FCltigen constantpool-Eintrag bei Index (\#%2$u) des Typs (%3$u); class\=%5$.*4$s, offset\=%6$u
CFRE162=ValueTypes werden nur mit der Option -XX\:+EnableValhalla aktiviert
SHRC703=Die Momentaufnahmedatei "%s" f\u00FCr den gemeinsam genutzten Cache konnte nicht ge\u00F6ffnet werden.
SHRC704=Fehlercode f\u00FCr Portschicht \= %1$d
SHRC705=Fehlernachricht f\u00FCr Plattform\: %1$s
SHRC706=Dateisperre f\u00FCr die Momentaufnahmedatei f\u00FCr den gemeinsam genutzten Cache konnte nicht angefordert werden.
SHRC700=Momentaufnahme des nicht persistenten gemeinsam genutzten Cache "%s" wurde erstellt.
SHRC701=Es konnte keine Momentaufnahme des nicht persistenten gemeinsam genutzten Cache "%s" erstellt werden.
SHRC702=F\u00FCr die Momentaufnahme des gemeinsam genutzten Cache konnte kein Verzeichnis abgerufen werden.
SHRC707=Mutex des Cache "%s" konnte nicht angefordert werden.
SHRC708=Die Momentaufnahmedatei "%s" f\u00FCr den vorhandenen nicht persistenten gemeinsam genutzten Cache konnte nicht abgeschnitten werden.
SHRC709=Die JVM erstellt eine Momentaufnahme des nicht persistenten gemeinsam genutzten Cache "%s", aber es ist schon eine Momentaufnahmedatei "%s" vorhanden, die \u00FCberschrieben wird.
CFRE174=Mehrere PermittedSubclasses-Attribute
CFRE175=finale Klassen k\u00F6nnen nicht versiegelt werden
CFRE176=PermittedSubclasses-Name muss eine Zeichenfolge sein.
CFRE177=PermittedSubclasses-Klasseneintrag ist kein Klassentyp.
CFRE178=Versiegelte Klassen m\u00FCssen mindestens eine zul\u00E4ssige Unterklasse enthalten.
CFRE170=RecordComponent-Name muss eine Zeichenfolge sein.
CFRE171=RecordComponent-Deskriptor muss eine Zeichenfolge sein.
CFRE172=Record ist implizit final.
CFRE173=LocalVariableTypeTable-Eintrag stimmt mit keinem LocalVariableTable-Eintrag \u00FCberein.
SHRC720=Die erneute Erstellung der Steuerdatei f\u00FCr gemeinsam genutzten Speicher ist beim Erstellen einer Momentaufnahme des Cache nicht zul\u00E4ssig.
SHRC725=Die L\u00E4nge der Momentaufnahmedatei "%s" f\u00FCr den nicht persistenten gemeinsam genutzten Cache ist ung\u00FCltig. Die L\u00E4nge der Datei betr\u00E4gt %lld Byte. Eine g\u00FCltige Momentaufnahmedatei hat eine L\u00E4nge zwischen %d Byte und maximal %lld Byte.
SHRC726=Der nicht persistente gemeinsam genutzte Cache "%s" ist bereits vorhanden. Er kann aus der Momentaufnahme nicht wiederhergestellt werden.
SHRC727=Beim Erstellen des neuen nicht persistenten gemeinsam genutzten Cache ist ein Fehler aufgetreten.
SHRC728=Die Momentaufnahmedatei "%s" f\u00FCr den nicht persistenten gemeinsam genutzten Cache konnte nicht gelesen werden.
SHRC721=Die JVM ist nicht f\u00FCr den Zugriff auf die Momentaufnahmedatei "%s" des nicht persistenten gemeinsam genutzten Cache konfiguriert. Verwenden Sie die Unteroption 'groupAccess', um die Datei zu \u00F6ffnen.
SHRC722=Die JVM l\u00E4sst den Zugriff auf die Momentaufnahmedatei "%s" f\u00FCr den gemeinsam genutzten Cache nicht zu, weil sich die Benutzer-ID und die Gruppen-ID des JVM-Prozesses von der Benutzer-ID und der Gruppen-ID des Eigners der Momentaufnahmedatei f\u00FCr den gemeinsam genutzten Cache unterscheiden und die Benutzer-ID des JVM-Prozesses nicht zur Gruppe des Eigners der Momentaufnahmedatei f\u00FCr den gemeinsam genutzten Cache geh\u00F6rt.
SHRC723=Die JVM konnte die Berechtigungen der Momentaufnahmedatei "%s" f\u00FCr den gemeinsam genutzten Cache nicht pr\u00FCfen.
SHRC724=Momentaufnahmedatei "%s" f\u00FCr den gemeinsam genutzten Cache ist nicht vorhanden.
SHRC729=Die Momentaufnahme wurde von einem anderen JVM-Build erstellt und stimmt nicht mit der ausgef\u00FChrten JVM \u00FCberein.
SHRC714=Keine Momentaufnahmen des gemeinsam genutzten Cache verf\u00FCgbar
SHRC715=\u00C4ltere Generierung der Momentaufnahme "%s" des gemeinsam genutzten Cache gel\u00F6scht
SHRC716=\u00C4ltere Generierung der Momentaufnahme "%s" des gemeinsam genutzten Cache konnte nicht entfernt werden.
SHRC717=Aktuelle Generierung der Momentaufnahme "%s" des gemeinsam genutzten Cache konnte nicht entfernt werden.
SHRC710=In die Momentaufnahmedatei "%s" f\u00FCr den nicht persistenten gemeinsam genutzten Cache konnte nicht geschrieben werden.
SHRC711=Das Offset des Dateideskriptors in der Momentaufnahmedatei "%s" f\u00FCr den nicht persistenten gemeinsam genutzten Cache konnte nicht neu positioniert werden.
SHRC712=Es wird versucht, alle Momentaufnahmen des gemeinsam genutzten Cache in cacheDir "%s" zu l\u00F6schen.
SHRC713=Die L\u00E4nge der Momentaufnahmedatei "%s" f\u00FCr den gemeinsam genutzten Cache konnte nicht abgerufen werden.
SHRC718=Momentaufnahme des gemeinsam genutzten Cache ist nicht vorhanden.
SHRC719=Momentaufnahme "%s" des gemeinsam genutzten Cache wurde gel\u00F6scht.
SHRC740=Syntax\: %s{<Methodenspezifikation>[,<Methodenspezifikation>]}
SHRC741=<Methodenspezifikation> hat folgendes Format\: [\!]{*|[*]<Paketname/Klassenname>[*]}[.{*|[*]<Methodenname>[*]}[({*|[*]<Parameter>[*]})]]. Beispiel\:\n\n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC742=WICHTIG\: Sie k\u00F6nnen mehrere Methodenspezifikationen \u00FCbergeben, die durch Kommas getrennt sind. Wenn ein Optionswert mindestens ein Komma enth\u00E4lt, muss er in geschweifte Klammern gesetzt werden.\n\tM\u00F6glicherweise m\u00FCssen Sie Optionen in Anf\u00FChrungszeichen setzen, damit die Shell durch Kommas getrennte Befehlszeilen nicht abf\u00E4ngt und fragmentiert. Beispiel\: \n \n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" oder\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC747=Die AOT-Methode(n) konnte(n) nicht inaktiviert werden.
SHRC748=Die AOT-Methode(n) konnte(n) nicht erneut aktiviert werden.
SHRC749=Die AOT-Methode(n) konnte(n) nicht gefunden werden.
SHRC743=Ung\u00FCltige Methodenspezifikation(en) f\u00FCr Option "%s"
SHRC744=Die %d AOT-Methode(n) wurde(n) inaktiviert.
SHRC745=Die %d AOT-Methode(n) wurde(n) erneut aktiviert.
SHRC746=Die %d AOT-Methode(n) wurde(n) gefunden.
SHRC730=Die JVM hat den gemeinsam genutzten Cache mit der Option '-Xshareclasses\:restrictClasspaths' erstellt. Nachfolgende JVM-Aufrufe k\u00F6nnen Klassenpfade nicht in dem gemeinsam genutzten Cache speichern.
SHRC731=Die JVM hat die Option '-Xshareclasses\:restrictClasspaths' ignoriert, da der vorhandene gemeinsam genutzte Cache ohne die Option '-Xshareclasses\:restrictClasspaths' erstellt wurde.
SHRC736=Inaktivieren Sie die den Methodenspezifikationen entsprechende(n) AOT-Methode(n).
SHRC737=Aktivieren Sie die den Methodenspezifikationen entsprechende(n) AOT-Methode(n) erneut.
SHRC738=Geben Sie die den Methodenspezifikationen entsprechende(n) AOT-Methode(n) aus.\n\t<Methodenspezifikation> ist wie folgt definiert\: [\!]{*|[*]<Paketname/Klassenname>[*]}[.{*|[*]<Methodenname>[*]}[({*|[*]<Parameter>[*]}]].
SHRC739=INAKTIVIERT
SHRC732=Die JVM kann Klassenpfade in dem gemeinsam genutzten Cache speichern, der mit der Option '-Xshareclasses\:restrictClasspaths' erstellt wurde.
SHRC733=Die JVM kann Klassenpfade in dem gemeinsam genutzten Cache nicht speichern, da der Cache mit der '-Xshareclasses\:restrictClasspaths' erstellt wurde.
SHRC734=Den Namen der Momentaufnahmedatei f\u00FCr gemeinsam genutzte Klasse ausgeben, die verwendet wird.
SHRC735=Verwenden Sie eine %d-Bit-JVM, um die angeforderte Operation f\u00FCr den gemeinsam genutzten %d-Bit-Cache "%s" auszuf\u00FChren, da die %d-Bit-JVM nicht pr\u00FCfen kann, ob der gemeinsam genutzte Speicher von der JVM erstellt wurde.
SHRC640=JVM verwendet den vorhandenen Cache f\u00FCr gemeinsam genutzte Klassen im 'mprotect'-Diagnosemodus (mit der Option -Xshareclasses\:mprotect\=diagnostic), jedoch wurde der Cache in diesem Modus nicht erstellt. Die Verwendung des Cache in diesem Modus kann sich auf die Leistung auswirken.
SHRC641=JVM versucht, den vorhandenen Cache f\u00FCr gemeinsam genutzte Klassen im 'mprotect'-Diagnosemodus (mit der Option -Xshareclasses\:mprotect\=diagnostic) zu verwenden, jedoch wurde der Cache in diesem Modus nicht erstellt. In einem solchen Fall wird die Option mprotect\=diagnostic unter z/OS ignoriert.
SHRC642=JVM hat den Cache f\u00FCr gemeinsam genutzte Klassen im 'mprotect'-Diagnosemodus (mit der Option -Xshareclasses\:mprotect\=diagnostic) erstellt. Die Verwendung des Cache in diesem Modus kann sich auf die Leistung auswirken.
SHRC643=JVM wurde an den Cache f\u00FCr gemeinsam genutzte Klassen angeh\u00E4ngt, der im 'mprotect'-Diagnosemodus (mit der Option '-Xshareclasses\:mprotect\=diagnostic') erstellt wurde. Die Verwendung des Cache in diesem Modus kann sich auf die Leistung auswirken.
SHRC648=Die JVM ist nicht f\u00FCr den Zugriff auf das Semaphorset konfiguriert, das dem vorhandenen nicht persistenten Cache f\u00FCr gemeinsam genutzte Klassen zugeordnet ist. Verwenden Sie die Unteroption 'groupAccess', um den nicht persistenten Cache f\u00FCr gemeinsam genutzte Klassen anzuh\u00E4ngen.
SHRC649=Die JVM l\u00E4sst keinen Zugriff auf das Semaphorset des gemeinsam genutzten Cache zu, dessen Ersteller und Eigner ein anderer Benutzer ist, der nicht zur Gruppe der JVM geh\u00F6rt.
J9CL030=Es kann kein Speicher f\u00FCr native Daten von Nutzern reserviert werden.
J9CL031=dbgwrapper.dll konnte nicht als Bootstrapbibliothek registriert werden. Fehlercode \= %zu
J9CL032=%1$d\: %2$s-Informationen konnten nicht abgerufen werden.
SHRC644=JVM wurde an den Cache f\u00FCr gemeinsam genutzte Klassen angeh\u00E4ngt, der im 'mprotect'-Diagnosemodus (mit der Option '-Xshareclasses\:mprotect\=diagnostic') erstellt wurde. Die Option -Xshareclasses\:mprotect\=none wird ignoriert.
SHRC645=mprotect-Diagnosemodus aktivieren
SHRC646=Die JVM konnte die Berechtigungen des Semaphorsets nicht pr\u00FCfen, das dem gemeinsam genutzten Cache zugeordnet ist.
SHRC647=Die JVM hat erkannt, dass die effektive Benutzer-ID des Prozesses der Eigner, jedoch nicht der Ersteller des Semaphorsets ist, das dem gemeinsam genutzten Cache zugeordnet ist. JVM wird nicht an den gemeinsam genutzten Cache angeh\u00E4ngt, um einen unbeabsichtigten Zugriff auf den gemeinsam genutzten Cache zu verhindern.
J9CL037=CPU-Nutzungsinformationen f\u00FCr JVM k\u00F6nnen nicht abgerufen werden, wenn -XX\:-EnableCPUMonitor angegeben wurde.
J9CL038=Fehler beim Abrufen von CPU-Nutzungsinformationen f\u00FCr JVM.
J9CL039=Die Zeitmarke ist ung\u00FCltig, wenn CPU-Nutzungsinformationen f\u00FCr JVM abgerufen werden.
J9CL033=%s konnte nicht als Bootstrapbibliothek registriert werden. Fehlercode \= %zu
J9CL034=%1$d\: %2$s-Informationen konnten nicht abgerufen werden. %3$s
J9CL035=Private Schnittstellenmethoden erfordern 'invokespecial'.
J9CL036=Integrit\u00E4tsbedingung f\u00FCr das Laden nicht eingehalten\: %2$.*1$s ist in %4$.*3$s nicht sichtbar
J9CL019=SIOCGIFCONF-Puffer kann nicht reserviert werden.
SHRC630=Speicherbereich zum Speichern von Nicht-AOT-/Nicht-JIT-Daten wie Klassen im gemeinsam genutzten Cache "%s" ist voll.
SHRC631=F\u00FCr AOT-Daten im gemeinsam genutzten Cache "%s" reservierter Speicherbereich ist voll. Mit -Xscminaot k\u00F6nnen Sie den f\u00FCr AOT-Daten reservierten Speicherbereich erh\u00F6hen.
SHRC632=F\u00FCr JIT-Daten im gemeinsam genutzten Cache "%s" reservierte Speicherbereich ist voll. Mit -Xscminjitdata k\u00F6nnen Sie den f\u00FCr JIT-Daten reservierten Speicherbereich erh\u00F6hen.
SHRC637=Die Unteroption -Xshareclasses\:cacheRetransformed ist nicht kompatibel mit einem vorhandenen, f\u00FCr BCI aktivierten gemeinsam genutzten Cache.
SHRC638=Die Cacheerstellung mit der Option 'cacheRetransformed' erzwingt den Modus 'disableBCI'.
SHRC639=Nur Dienstprogrammoptionen f\u00FCr gemeinsam genutzte Caches k\u00F6nnen zusammen mit -Xmt verwendet werden. Geben Sie andere Optionen f\u00FCr gemeinsam genutzte Caches in der Datei 'javad.options' an.
J9CL020=Nicht gen\u00FCgend Speicherkapazit\u00E4t zum Lesen der L\u00E4ndereinstellungsdaten
J9CL021=Nicht gen\u00FCgend Speicherkapazit\u00E4t zum Erstellen der Indexliste
SHRC633=Die Option "-XX\:+StoreIntermediateClassfile" wurde angegeben, aber der vorhandene Cache wurde nicht mit der Option "-XX\:+StoreIntermediateClassfile" erstellt.
SHRC634=Die Option "-XX\:-StoreIntermediateClassfile" wurde angegeben, aber der vorhandene Cache wurde mit der Option "-XX\:+StoreIntermediateClassfile" erstellt.
SHRC635=Tempor\u00E4re Klassendatei speichern \= true
SHRC636=Die Unteroption "disableBCI" ist nicht kompatibel mit vorhandenem, f\u00FCr BCI aktiviertem gemeinsam genutztem Cache.
J9CL026=Speicher f\u00FCr HTTP-POST-Inhalte kann nicht reserviert werden.
J9CL027=Fehler beim Lesen der ZIP-Datei
J9CL028=Interner Fehler beim Lesen der ZIP-Datei, Fehlercode %d
J9CL029=fehlerhafte Zeichen/Zeichen, die nicht zugeordnet werden k\u00F6nnen, gefunden
J9CL022=Nicht gen\u00FCgend Speicherkapazit\u00E4t zum Auflisten der Datensatzspeicher
J9CL023=Nicht gen\u00FCgend Speicherkapazit\u00E4t zum Lesen des Datensatzes
J9CL024=Nicht gen\u00FCgend Speicherkapazit\u00E4t
J9CL025=Speicher f\u00FCr Header von HTTP-Antworten kann nicht reserviert werden.
SHRC662=Fehlerbehebung\: Dem Cache f\u00FCr gemeinsam genutzte Klassen ist ein gel\u00F6schtes Semaphorset zugeordnet.
SHRC663=Fehlerbehebung\: Dem Cache f\u00FCr gemeinsam genutzte Klassen ist ein gel\u00F6schtes Semaphorset mit ID\=%d zugeordnet.
SHRC664=Fehlerbehebung fehlgeschlagen\: Das dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete Semaphorset mit Semaphor-ID\=%d konnte nicht gel\u00F6scht werden. Nur Ersteller, Eigner oder Benutzer mit Administratorberechtigungen k\u00F6nnen das Semaphorset l\u00F6schen.
SHRC665=Fehlerbehebung fehlgeschlagen\: Das dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete Semaphorset mit Semaphor-ID\=%d konnte nicht gel\u00F6scht werden.
SHRC660=Die JVM konnte Semaphorset-ID\=%d nicht dem Cache f\u00FCr gemeinsam genutzte Klassen zuordnen.
SHRC661=Die JVM konnte die ID (%d) des gemeinsam genutzten Speichers nicht dem Cache f\u00FCr gemeinsam genutzte Klassen zuordnen.
SHRC666=Fehlerbehebung\: Dem Cache f\u00FCr gemeinsam genutzte Klassen ist ein gel\u00F6schter gemeinsam genutzter Speicher zugeordnet.
SHRC667=Fehlerbehebung\: Dem Cache f\u00FCr gemeinsam genutzte Klassen ist ein gel\u00F6schter gemeinsam genutzter Speicher mit ID\=%d zugeordnet.
SHRC668=Fehlerbehebung fehlgeschlagen\: Der dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete gemeinsam genutzte Speicher mit ID\=%d konnte nicht gel\u00F6scht werden. Nur Ersteller, Eigner oder Benutzer mit Administratorberechtigungem k\u00F6nnen den gemeinsam genutzten Speicher l\u00F6schen.
SHRC669=Fehlerbehebung fehlgeschlagen\: Der dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete gemeinsam genutzte Speicher mit ID\=%d konnte nicht gel\u00F6scht werden.
SHRC651=Die JVM hat erkannt, dass die effektive Benutzer-ID des Prozesses der Eigner, jedoch nicht der Ersteller des gemeinsam genutzten Speichers ist, der dem gemeinsam genutzten Cache zugeordnet ist. JVM wird nicht an den gemeinsam genutzten Cache angeh\u00E4ngt, um einen unbeabsichtigten Zugriff auf den gemeinsam genutzten Cache zu verhindern.
SHRC652=Die JVM ist nicht konfiguriert, um auf gemeinsamen Speicher zuzugreifen, der dem vorhandenen nicht persistenten Cache f\u00FCr gemeinsam genutzte Klassen zugeordnet ist. Verwenden Sie die Unteroption 'groupAccess', um den nicht persistenten Cache f\u00FCr gemeinsam genutzte Klassen anzuh\u00E4ngen.
SHRC653=Die JVM ist nicht konfiguriert, um auf gemeinsamen Speicher zuzugreifen, der dem vorhandenen nicht persistenten Cache f\u00FCr gemeinsam genutzte Klassen zugeordnet ist. Verwenden Sie die Unteroption 'groupAccess' und 'readonly', um den nicht persistenten Cache f\u00FCr gemeinsam genutzte Klassen anzuh\u00E4ngen.
SHRC654=Die JVM l\u00E4sst keinen Zugriff auf die gemeinsam genutzte Speicherregion des gemeinsam genutzten Cache zu, deren Ersteller und Eigner ein anderer Benutzer ist, der nicht zur Gruppe der JVM geh\u00F6rt.
SHRC650=Die JVM konnte die Berechtigungen des gemeinsam genutzten Speichers nicht pr\u00FCfen, der dem gemeinsam genutzten Cache zugeordnet ist.
SHRC659=Beim \u00D6ffnen von gemeinsam genutztem Speicher ist ein Fehler aufgetreten.
J9CL040=Speicher f\u00FCr globalen JNI-Verweis kann nicht reserviert werden.
J9CL041=Hostklasse %2$.*1$s und anonyme Klasse %4$.*3$s befinden sich in unterschiedlichen Paketen
J9CL042=Verschachtelungselement %2$.*1$s in %4$.*3$s deklariert einen anderen Verschachtelungshost\: %6$.*5$s
SHRC655=Cache ist zug\u00E4nglich f\u00FCr aktuellen Benutzer \= %s
SHRC656=Die JVM ist nicht f\u00FCr den Zugriff auf die gemeinsam genutzte Cachedatei konfiguriert. Verwenden Sie die Unteroption 'groupAccess', um den Cache f\u00FCr gemeinsam genutzte Klassen anzuh\u00E4ngen.
SHRC657=Die JVM l\u00E4sst den Zugriff auf die gemeinsam genutzte Cachedatei nicht zu, weil sich die Benutzer-ID und die Gruppen-ID des JVM-Prozesses von der Benutzer-ID und der Gruppen-ID des Eigners der gemeinsam genutzten Cachedatei unterscheiden und die Benutzer-ID des JVM-Prozesses nicht zur Gruppe des Eigners der gemeinsam genutzten Cachedatei geh\u00F6rt.
SHRC658=Die JVM konnte die Berechtigungen der gemeinsam genutzten Cachedatei nicht pr\u00FCfen.
SHRC200=\ %2$.*1$s wurde gefunden.
SHRC684=Beim \u00D6ffnen eines Semaphors ist ein Fehler aufgetreten. Steuerdatei konnte nicht gesperrt werden.
DUMP034=Benutzer forderte Speicherauszug von %1$s mit "%2$s" durch %3$s an.
SHRC201=\ %2$.*1$s wurde ersetzt.
SHRC685=Beim \u00D6ffnen von gemeinsam genutztem Speicher ist ein Fehler aufgetreten. Steuerdatei konnte nicht gesperrt werden.
DUMP033=JVM forderte als Antwort auf ein Ereignis einen Speicherauszug von %1$s an
SHRC202=Pools im Manager f\u00FCr gemeinsam genutzte Klassen konnten nicht initialisiert werden.
SHRC686=Cache f\u00FCr gemeinsam genutzte Klassen konnte nicht gestartet werden. Es wird ohne seine Verwendung fortgefahren, da "-Xshareclasses\:nonfatal" angegeben ist.
DUMP036="-Xdump"-Filter ung\u00FCltig oder fehlt
SHRC203=Hashtabelle konnte nicht im Manager f\u00FCr gemeinsam genutzte Klassen erstellt werden.
SHRC687=Bei der Ausf\u00FChrung mit der Option "-Xshareclasses\:readonly" kann kein neuer Cache f\u00FCr gemeinsam genutzte Klassen erstellt werden.
DUMP035=Benutzer forderte Speicherauszug von %1$s durch %2$s an
SHRC680=Fehlerbehebung fehlgeschlagen\: Die dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete Semaphorsetsteuerdatei %s konnte nicht entfernt werden.
DUMP030=Speicherauszug kann nicht in Datei %s geschrieben werden\: %s
SHRC681=Systemgrenzwert f\u00FCr maximale Anzahl der Semaphore oder systemweite maximale Anzahl der Semaphore erreicht.
SHRC682=Systemgrenzwert f\u00FCr maximale Anzahl der gemeinsam genutzten Speicherbereiche oder systemweiter Grenzwert f\u00FCr den den gemeinsam genutzten Speicherbereichen zugeordneten Speicher erreicht.
DUMP032=JVM forderte als Antwort auf ein Ereignis einen Speicherauszug von %1$s mit "%2$s" an
SHRC683=Systemgrenzwert f\u00FCr Gesamtzahl der offenen Dateien erreicht.
DUMP031=Der angeforderte Heapspeicherauszug wurde nicht erzeugt, weil die exklusive Sperre der virtuellen Maschine nicht angefordert war. F\u00FCgen Sie "request\=exclusive+prepwalk+compact" zu Ihrer Befehlszeilenoption "-Xdump\:heap\:" hinzu.
SHRC208=F\u00FCr Hashtabellenelementpool in CompiledMethodManagerImpl kann kein Speicher zugeordnet werden.
SHRC209=Ausf\u00FChrliche Bytedatenausgabe aktivieren
SHRC204=Hashtabellenmutex konnte nicht im Manager f\u00FCr gemeinsam genutzte Klassen erstellt werden.
SHRC688=Klassenpfade k\u00F6nnen nur von der ersten JVM hinzugef\u00FCgt werden, die den Cache initialisiert.
DUMP027=Der angeforderte Heapspeicherauszug wurde nicht erzeugt, weil die exklusive Sperre der virtuellen Maschine f\u00FCr eine andere Komponente eingerichtet ist.
SHRC205=Neues Hashtabellenelement konnte nicht in CompiledMethodManagerImpl erstellt werden.
SHRC689=Erm\u00F6glicht einer JVM die Speicherung von Klassenpfaden in dem Cache, der mit der Option "restrictClasspaths" erstellt wurde.
DUMP026=IEATDUMP-Name \u00FCberschreitet die maximal zul\u00E4ssige L\u00E4nge. Standardname wurde verwendet.
SHRC206=F\u00FCr Hashtabelleneintrag in CompiledMethodManagerImpl kann kein Speicher zugeordnet werden.
DUMP029=Die Anforderung von "prepwalk" oder "compact" vor Aufnahme eines Systemspeicherauszugs wird ignoriert, weil die exklusive Sperre der virtuellen Maschine nicht angefordert wurde.
SHRC207=CompiledMethodManager-Hashtabellenmutex kann nicht eingegeben werden.
DUMP028=Vor Aufnahme des Systemspeicherauszugs konnte die exklusive Sperre der virtuellen Maschine nicht eingerichtet werden.
SHRC673=Das dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete Semaphorset mit Semaphor-ID\=%d konnte nicht gel\u00F6scht werden.
DUMP045=Die Anzahl der Speicherauszugsoptionen, einschlie\u00DFlich der standardm\u00E4\u00DFig festgelegten Optionen,muss kleiner als %d sein.
SHRC674=Der Benutzer darf den gemeinsam genutzten Speicher mit ID\=%d nicht l\u00F6schen. Nur Ersteller, Eigner oder Benutzer mit Administratorberechtigungem k\u00F6nnen den gemeinsam genutzten Speicher l\u00F6schen.
DUMP044=Ung\u00FCltiger oder reservierter g\u00FCltiger Wert f\u00FCr %s
SHRC675=Der dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete gemeinsam genutzte Speicher konnte nicht gel\u00F6scht werden.
DUMP047=VM wird heruntergefahren. Ursache\: Unbekannt
SHRC676=Der dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete gemeinsam genutzte Speicher mit ID\=%d konnte nicht gel\u00F6scht werden.
DUMP046=VM wird heruntergefahren. Ursache\: %2$.*1$s
DUMP041=Falsche Verwendung von '-Xdump msg_filter'
SHRC670=Fehlerbehebung\: Aufgrund der Option "-Xshareclasses\:nonfatal" wird versucht, den gemeinsam genutzten Cache im schreibgesch\u00FCtzten Modus zu verwenden, wenn der gemeinsam genutzte Speicherbereich vorhanden ist.
DUMP040=%1$s-Speicherauszug wurde in Datei(en) mit der Namensvorlage %2$s geschrieben
SHRC671=Der Benutzer darf Semaphorset mit Semaphor-ID\=%d nicht l\u00F6schen. Nur Ersteller, Eigner oder Benutzer mit Administratorberechtigungen k\u00F6nnen das Semaphorset l\u00F6schen.
DUMP043=%s wird auf dieser Plattform nicht unterst\u00FCtzt.
SHRC672=Das dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete Semaphorset konnte nicht gel\u00F6scht werden.
DUMP042=Abbruchssignal bei Ausf\u00FChrung im Java-Stack empfangen. Die JVM-Speicherauszugsagenten konnten nicht ausgef\u00FChrt werden.
SHRC677=Fehlercode f\u00FCr Portschicht \= %1$d
DUMP038=Kurzspeicherauszug wird nicht geschrieben wegen Traceerstellung in Datei\: %1$s
SHRC678=Fehlernachricht f\u00FCr Plattform\: %1$s
DUMP037=Fehler in Speicherauszug von %1$s\: %2$s fehlgeschlagen, Fehlercode\: %3$d
SHRC679=Fehlerbehebung fehlgeschlagen\: Die dem Cache f\u00FCr gemeinsam genutzte Klassen zugeordnete Semaphorsetsteuerdatei %s konnte nicht entfernt werden.
DUMP039=Speicherauszugsereignis "%1$s", Detail "%3$.*2$s" um %4$s - bitte warten.
J9CL008=In Nanosekunden angegebener Zeitlimitwert liegt au\u00DFerhalb des g\u00FCltigen Bereichs.
J9CL009=Thread bereits gestartet.
SHRC222=Persistente Caches f\u00FCr eine gemeinsam genutzte Klasse k\u00F6nnen nicht erstellt/verwendet werden, da die Speicherzuordnung die erforderliche Funktionalit\u00E4t nicht unterst\u00FCtzt.
SHRC223=Persistente Caches f\u00FCr eine gemeinsam genutzte Klasse k\u00F6nnen nicht erstellt/verwendet werden, da die Dateisperrung nicht unterst\u00FCtzt wird.
SHRC224=Nicht gen\u00FCgend Speicherkapazit\u00E4t f\u00FCr lokale Kopie des Cachenamens
SHRC225=Fehler beim Abrufen des Cachedateipfads
SHRC220=Fehlercode f\u00FCr Portschicht \= %1$d
SHRC221=Fehlernachricht f\u00FCr Plattform\: %1$s
J9CL010=JNIEnv konnte nicht zugeordnet werden.
SHRC226=Fehler beim \u00D6ffnen der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC227=Fehler beim Anfordern der Headerschreibsperre f\u00FCr die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC228=Fehler beim Aktualisieren der Zeit der letzten Zuordnung f\u00FCr den Cache f\u00FCr eine gemeinsam genutzte Klasse
SHRC229=Fehler\: Cachedatei f\u00FCr eine gemeinsam genutzte Klasse hat einen ung\u00FCltigen Header.
J9CL015=Erstellung eines Stack-Trace ist fehlgeschlagen (wahrscheinlich wegen zu geringen Betriebssystemspeichers).
J9CL016=Es kann kein neuer Klassenpfad-Eintrag erstellt werden.
J9CL017=Es kann nicht f\u00FCr Zeitzonen-Ressource reserviert werden.
J9CL018=Es kann nicht f\u00FCr Zeitzonen-Eintrag reserviert werden.
J9CL011=Betriebssystemthread konnte nicht verzweigt werden.
J9CL012=
J9CL013=Betriebssystemmonitor konnte nicht zugeordnet werden.
J9CL014=Ung\u00FCltiges JCL-Befehlszeilenargument
SHRC690=Klassenpfade beschr\u00E4nken             \= true
SHRC211=Bytedaten f\u00FCr Schl\u00FCssel %.*s im gemeinsam genutzten Cache werden gesucht...
SHRC695=Einen neuen nicht persistenten gemeinsam genutzten Cache aus einer Momentaufnahme wiederherstellen
SHRC212=Bytedaten f\u00FCr Schl\u00FCssel %.*s im gemeinsam genutzten Cache werden gespeichert...
SHRC696=Unteroptionen "%s" und "%s" sind nicht kompatibel. Unteroption "%s" wird ignoriert.
SHRC213=F\u00FCr Hashtabelleneintrag in ByteDataManagerImpl kann kein Speicher zugeordnet werden.
SHRC697=F\u00FCr den gemeinsam genutzten Cache konnte kein Verzeichnis abgerufen werden.
SHRC214=ByteDataManager-Hashtabellenmutex kann nicht eingegeben werden.
SHRC698=Der nicht persistente gemeinsam genutzte Cache "%s" wurde erfolgreich aus der Momentaufnahme wiederhergestellt.
SHRC691=Klassenpfade beschr\u00E4nken             \= false
SHRC692=Momentaufnahme eines vorhandenen nicht persistenten gemeinsam genutzten Cache erstellen
SHRC693=Momentaufnahme eines gemeinsam genutzten Cache l\u00F6schen (Namensparameter oder Standard verwenden)
SHRC210=[-Xshareclasses ausf\u00FChrliche Bytedatenausgabe aktiviert]
SHRC694=Alle Momentaufnahmen eines gemeinsam genutzten Cache l\u00F6schen
SHRC219=[-Xshareclasses Gruppenzugriff aktiviert f\u00FCr neue Caches]
SHRC215=Persistenten Cache f\u00FCr eine gemeinsam genutzte Klasse erstellen
SHRC699=Der nicht persistente gemeinsam genutzte Cache "%s" konnte nicht aus der Momentaufnahme wiederhergestellt werden.
SHRC216=Nicht persistenten Cache f\u00FCr eine gemeinsam genutzte Klasse erstellen
SHRC217=[-Xshareclasses persistenter Cache aktiviert]
SHRC218=[-Xshareclasses persistenter Cache inaktiviert]
J9CL004=Inkompatible Klassenbibliotheksversion\: JCL v%1$i wurde erwartet, v%2$i gefunden.
J9CL005=Inkompatible Klassenbibliotheksversion\: VM v%1$i ist erforderlich, v%2$i wurde gefunden.
J9CL006=Keine vorab zu pr\u00FCfenden Daten f\u00FCr java/lang/Object
J9CL007=Zeitlimitwert ist negativ.
J9CL000=Inkompatible Klassenbibliothek
J9CL001=Versuchen Sie die Ausf\u00FChrung mit -jcl\:%s.
J9CL002=Klassen stammen nicht aus einer J9-Bibliothek oder sie stammen aus einer nicht korrekt reduzierten JXE-Datei
J9CL003=Inkompatible Klassenbibliotheksversion\: JCL %1$x, VM %2$x
SHRC244=Fehler beim Abrufen der L\u00E4nge der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC245=Fehler beim Zuordnen der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC246=Persistenter Cache f\u00FCr gemeinsam genutzte Klasse %1$s zugeordnet
SHRC247=Fehler\: Strukturkennung des Headers der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse ist ung\u00FCltig.
SHRC240=Fehler\: Anhangschreibsperre f\u00FCr die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse kann nicht angefordert werden
SHRC241=Fehler\: Cachedatei f\u00FCr eine gemeinsam genutzte Klasse kann nicht gel\u00F6scht werden.
SHRC242=Fehler beim Aktualisieren der Zeit der letzten Freigabe der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC243=Fehler beim Freigeben der Anhanglesesperre f\u00FCr die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC248=Fehler\: Version des Headers der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse ist ung\u00FCltig.
SHRC249=Fehler\: \u00C4nderungsstufe des Headers der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse ist ung\u00FCltig.
SHRC233=Fehler beim Erstellen des Headers der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC234=Fehler beim Anfordern der Anhanglesesperre f\u00FCr die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC235=Fehler beim Freigeben der Anhanglesesperre f\u00FCr die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC236=Persistenter Cache f\u00FCr gemeinsam genutzte Klasse %1$s erstellt
SHRC230=Fehler beim Initialisieren des Headers der gemeinsam genutzten Cachedaten
SHRC231=Fehler beim Festlegen der L\u00E4nge der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC232=Cache kann nicht im schreibgesch\u00FCtzten Modus erstellt werden.
SHRC237=Persistenter Cache f\u00FCr gemeinsam genutzte Klasse %1$s ge\u00F6ffnet
SHRC238=Fehler\: der Cache f\u00FCr eine gemeinsam genutzte Klasse ist nicht zugeordnet
SHRC239=Fehler\: Headerschreibsperre f\u00FCr die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse kann nicht angefordert werden
SHRC260=Pool in ByteDataManager konnte nicht erstellt werden.
SHRC261=Zeichenfolgeninterne ausf\u00FChrliche Ausgabe aktivieren
SHRC266=[-Xshareclasses Caching von erneut umgesetzten Klassen aktiviert]
SHRC267=Caching von Klassen aus bootclasspath inaktivieren
SHRC268=[-Xshareclasses Caching von Eintr\u00E4gen aus bootclasspath inaktiviert]
SHRC269=Das System unterst\u00FCtzt keinen Speicherseitenschutz.
SHRC262=Datenbyte         \= %d
SHRC263=Ausf\u00FChrliche CompositeCache-Seiten aktivieren
SHRC264=Cachebereich nicht auf Seitenbegrenzungen runden
SHRC265=Cacheklassen, die \u00FCber JVMTI erneut umgesetzt werden
EXEL013=\  -Xmn<x>         Gr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr neue Objekte auf <x> setzen
EXEL014=\  -Xmn<x>         Anfangs-/Maximalgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr neue Objekte auf <x> setzen
EXEL015=\  -Xmns<x>        Anfangsgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr neue Objekte auf <x> setzen
EXEL016=\  -Xmnx<x>        Maximalgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr neue Objekte auf <x> setzen
EXEL017=\  -Xmo<x>         Gr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr alte Objekte auf <x> setzen
EXEL018=\  -Xmo<x>         Anfangs-/Maximalgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr alte Objekte auf <x> setzen
EXEL019=\  -Xmos<x>        Anfangsgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr alte Objekte auf <x> setzen
EXEL010=Werte mit dem Suffix "k" (Kilo) oder "m" (Mega) werden entsprechend umgerechnet. \n
EXEL011=\  -Xmca<x>        Inkrement f\u00FCr RAM-Klassensegment auf <x> setzen
EXEL012=\  -Xmco<x>        Inkrement f\u00FCr ROM-Klassensegment auf <x> setzen
SHRC250=Cache kann nicht schreibgesch\u00FCtzt ge\u00F6ffnet werden, da er noch nicht initialisiert wurde.
SHRC255=Fehler beim Aktualisieren der Zeit der letzten Freigabe f\u00FCr die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse beim Beenden von JVM
SHRC256=Persistenter gemeinsam genutzter Cache "%1$s" wurde gel\u00F6scht.
SHRC257=Speicher f\u00FCr verkn\u00FCpftes Listenelement in Manager kann nicht reserviert werden.
SHRC258=F\u00FCr Hashtabelleneintrag in Manager kann kein Speicher zugeordnet werden.
SHRC251=Caches unterschiedlicher buildIDs d\u00FCrfen nicht automatisch gel\u00F6scht werden.
SHRC252=Fehler beim Suchen in der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC253=Fehler beim Schreiben des Headers in die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC254=Fehler beim Festlegen der L\u00E4nge der Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
EXEL002=\  -Xbootclasspath/p\:<Pfad>  <Pfad> dem Klassenpfad des Bootprogramms voranstellen
EXEL003=\  -Xbootclasspath/a\:<Pfad>  <Pfad> an den Klassenpfad des Bootprogramms anf\u00FCgen
EXEL004=\n  -Xrun<Bibliothek>[\:Optionen]  native Agentenbibliothek laden\n                                (nicht weiter unterst\u00FCtzt zu Gunsten von -agentlib)\n
EXEL005=\  -Xint           nur interpretierten Code ausf\u00FChren (\u00E4quivalent zu -Xnojit -Xnoaot)
SHRC259=Manager-Hashtabellen-Mutex kann nicht eingegeben werden.
EXEL006=\  -Xnojit         JIT inaktivieren
EXEL007=\  -Xnoaot         vorkompilierten Code nicht ausf\u00FChren
EXEL008=\  -Xfuture        strengste \u00DCberpr\u00FCfungen aktivieren (zuk\u00FCnftige Standardeinstellung)
EXEL009=\nArgumente f\u00FCr die folgenden Optionen werden in Byte angegeben.
EXEL000=Die folgenden Optionen sind keine Standardoptionen und k\u00F6nnen ohne Ank\u00FCndigung ge\u00E4ndert werden. \n
EXEL001=\  -Xbootclasspath\:<Pfad>    Klassenpfad des Bootprogramms auf <Pfad> setzen
SHRC280=Alle Caches in cacheDir %s werden aufgelistet
SHRC281=Es wird versucht, alle Caches in cacheDir %s zu l\u00F6schen.
SHRC282=Die Seitengr\u00F6\u00DFe des Betriebssystems ist inkompatibel mit diesem Cache. Es wird versucht, den Cache neu zu erstellen.
SHRC283=Cache mit Leseberechtigung (schreibgesch\u00FCtzt) \u00F6ffnen
SHRC288=gemeinsame Speicher-ID   \= %d
SHRC289=Nicht erkennen, wenn ein Cache sich in einem fernen Netzdateisystem befindet
SHRC284=Cache kann nicht im schreibgesch\u00FCtzten Modus erstellt werden.
SHRC285=Persistenter Cache %1$s f\u00FCr gemeinsam genutzte Klasse schreibgesch\u00FCtzt ge\u00F6ffnet
SHRC286=Cache %1$s f\u00FCr gemeinsam genutzte Klasse schreibgesch\u00FCtzt ge\u00F6ffnet
SHRC287=Persistenter Cache kann in einem Netzdateisystem nicht lokalisiert werden. W\u00E4hlen Sie entweder "nonpersistent" oder ein anderes "cacheDir" aus.
EXEL035=\  -Xminf<x>       Mindestprozentsatz des freien Heapspeichers nach GC
EXEL036=\  -Xmaxf<x>       Maximaler Prozentsatz des freien Heapspeichers nach GC
EXEL037=\nArgumente f\u00FCr die folgenden Optionen werden als Dezimalzahlen angegeben.\n
EXEL038=\  -Xgcthreads<x>                Anzahl der GC-Threads festlegen
EXEL039=\  -Xnoclassgc                   Dynamisches Entladen von Klassen inaktivieren
EXEL030=\  -Xss<x>         Gr\u00F6\u00DFe f\u00FCr Thread-Stack auf <x> setzen
EXEL031=\  -Xmine<x>       Mindestgr\u00F6\u00DFe f\u00FCr die Heapspeichererweiterung auf <x> setzen
EXEL032=\  -Xmaxe<x>       Maximalgr\u00F6\u00DFe f\u00FCr die Heapspeichererweiterung auf <x> setzen
EXEL033=\nArgumente f\u00FCr die folgenden Optionen werden als Dezimalzahl von 0 bis 1 angegeben.
EXEL034=Der Wert 0,3 steht f\u00FCr eine Anforderung von 30 %%. \n
SHRC270=Speicherseitenschutz f\u00FCr Cache konfigurieren
SHRC271=Nicht erkannte Unteroption f\u00FCr Option mprotect\=
SHRC272=Vollst\u00E4ndiger Speicherseitenschutz erfolgreich f\u00FCr Cache aktiviert
SHRC277=Zum Ausf\u00FChren des Dienstprogramms "%s" f\u00FCr einen nicht persistenten gemeinsam genutzten Cache "%s" muss auch die Unteroption "nonpersistent" verwendet werden.
SHRC278=Das Dienstprogramm "%s" kann f\u00FCr den inkompatiblen Klassencache "%s" nicht ausgef\u00FChrt werden. Verwenden Sie eine JVM-Datei mit der richtigen Version.
SHRC279=Gemeinsam genutzten Cache beim Start neu erstellen
SHRC273=Standardspeicherseitenschutz f\u00FCr Cache aktiviert
SHRC274=Speicherseitenschutz f\u00FCr Cache inaktiviert
SHRC275=Speicherposition der JVM-Cachedateien festlegen
SHRC276=Zum Ausf\u00FChren des Dienstprogramms "%s" f\u00FCr den persistenten Klassencache "%s" nicht die Option "nonpersistent" verwenden.
EXEL024=\  -Xmx<x>         Maximalgr\u00F6\u00DFe f\u00FCr Hauptspeicher auf <x> setzen
EXEL025=\  -Xmr<x>         Gr\u00F6\u00DFe f\u00FCr gemerkte Gruppe auf <x> setzen
EXEL026=\  -Xmrx<x>        Maximalgr\u00F6\u00DFe f\u00FCr gemerkte Gruppe auf <x> setzen
EXEL027=\  -Xmso<x>        Stackgr\u00F6\u00DFe f\u00FCr Betriebssystemthreads auf <x> setzen
EXEL028=\  -Xiss<x>        Anfangsstackgr\u00F6\u00DFe f\u00FCr Java-Threads auf <x> setzen
EXEL029=\  -Xss<x>         Maximalstackgr\u00F6\u00DFe f\u00FCr Java-Threads auf <x> setzen
EXEL020=\  -Xmox<x>        Maximalgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr alte Objekte auf <x> setzen
EXEL021=\  -Xmoi<x>        Inkrement f\u00FCr Speicherbereich f\u00FCr alte Objekte auf <x> setzen
EXEL022=\  -Xms<x>         Gr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr alte Objekte auf <x> setzen
EXEL023=\  -Xms<x>         Anfangsgr\u00F6\u00DFe f\u00FCr Hauptspeicher auf <x> setzen
EXEL057=
EXEL058=Interner VM-Fehler\: Nicht gen\u00FCgend Speicherkapazit\u00E4t
EXEL059=Interner VM-Fehler\: Klasse java/lang/String konnte nicht gefunden werden.
EXEL050=\  -Xrdbginfo\:<Host>\:<Port>      fernen Debuginformationsserver aktivieren
EXEL051=\nWARNUNG\: Der Befehlszeilenparameter "%s" ist veraltet. \nWARNUNG\: Verwenden Sie "-classpath <Pfad>" oder "-cp <Pfad>".
EXEL052=\nWARNUNG\: Der Befehlszeilenparameter "%s" ist veraltet. \nWARNUNG\: Verwenden Sie den funktional entsprechenden Parameter -X.
EXEL053=
EXEL054=
EXEL055=Ziel\: %s
EXEL056=
SHRC291=F\u00FCr Hashtabelleneintrag kann in ROMClassResourceManager kein Speicher reserviert werden.
SHRC292=ROMClassResourceManager-Hashtabellen-Mutex kann nicht eingegeben werden.
SHRC293=F\u00FCr Hashtabellenelementpool kann in ROMClassResourceManager kein Speicher reserviert werden.
SHRC294=%1$d\: 0x%2$p CHARARRAY\: in 0x%3$p.
SHRC290=Neues Hashtabellenelement konnte in ROMClassResourceManager nicht erstellt werden.
SHRC299=Der Cache f\u00FCr gemeinsam genutzte Klasse "%s" wurde nicht mit der Option "nested" (verschachtelt) erstellt, Cache kann nicht vergr\u00F6\u00DFert werden.
SHRC295=Abh\u00E4ngigkeit von der Verwendung von CORE_MMAP unter AIX ausschalten
SHRC296=Ausf\u00FChrung mit der Option "noCoreMmap" bedeutet, dass IBM Ihnen bei Abst\u00FCrzen kaum helfen k\u00F6nnen wird, da Klassendaten in Systemspeicherausz\u00FCgen fehlen.
SHRC297=Damit unter AIX persistente Caches f\u00FCr gemeinsam genutzte Klasse verwendet werden k\u00F6nnen, muss die Umgebungsvariable "CORE_MMAP" auf "yes" gesetzt werden.
SHRC298=Zum Ausf\u00FChren des Dienstprogramms "%s" f\u00FCr den persistenten Klassencache "%s" verwenden Sie die Unteroption "persistent".
EXEL046=\  -Xlp                          Unterst\u00FCtzung f\u00FCr gro\u00DFe Seiten aktivieren
EXEL047=\n  -Xdbg\:<Optionen>               Debugging aktivieren (JDWP-Standardoptionen)
EXEL048=\  -Xrunjdwp\:<Optionen>           Debugging aktivieren (JDWP-Standardoptionen)
EXEL049=\  -Xdbginfo\:<symbol file path>  Debuginformationen-Server aktivieren
EXEL040=\  -Xclassgc                     Dynamisches Entladen von Klassen aktivieren
EXEL041=\  -Xalwaysclassgc               Dynamisches Entladen von Klassen bei jeder GC aktivieren
EXEL042=\  -Xnocompactexplicitgc         Komprimierung bei einer System-GC inaktivieren
EXEL043=\  -Xcompactexplicitgc           Komprimierung bei jeder System-GC aktivieren
EXEL044=\  -Xcompactgc                   Komprimierung aktivieren
EXEL045=\  -Xnocompactgc                 Komprimierung inaktivieren
SHRC192=Wert von -Xscminaot ist gr\u00F6\u00DFer als der Wert von -Xscmx, er wurde deshalb auf "uneingeschr\u00E4nkt" gesetzt.
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC194=\tf\u00FCr ROMClass %2$.*1$s bei 0x%3$p.
SHRC195=Ausf\u00FChrliche AOT-Ausgabe aktivieren
SHRC190=Wert von -Xscminaot sollte nicht gr\u00F6\u00DFer als der Wert von -Xscmaxaot sein
SHRC191=Wert von -Xscminaot ist gr\u00F6\u00DFer als der Wert von -Xscmx, er wurde deshalb auf denselben Wert wie -Xscmx gesetzt.
SHRC196=[-Xshareclasses ausf\u00FChrliche AOT-Ausgabe aktiviert]
SHRC197=AOT-Code f\u00FCr ROMMethod 0x%1$p in gemeinsam genutztem Cache wird gesucht...
SHRC198=AOT-Code f\u00FCr ROMMethod 0x%1$p in gemeinsam genutztem Cache wird gespeichert...
SHRC199=\ %2$.*1$s erfolgreich gespeichert.
TRCE020=Beim Beenden der Trace-Engine ist eine Zeitlimit\u00FCberschreitung aufgetreten.
JNCK097=\tadvice         Anzeigehinweise
JNCK098=JNI-Fehler in %1$s\: Argument \#%2$d erwartet %3$s %4$s, tats\u00E4chliches Argument ist %5$s %6$s
JNCK095=JNI-Fehler im zur\u00FCckgegebenen Wert\: der R\u00FCckgabetyp ist ein Verweis, aber der Wert (0x%1$p) ist kein g\u00FCltiger Objektverweis. Sein Typ ist\: %2$s
JNCK096=\twarn           Anzeigewarnungen
JNCK099=JNI-Fehler in %1$s\: Argument \#%2$d erfordert einen Nicht-Array-Typ
JNCK090=Warnung im Handler-Frame eines JVMPI oder JVMTI Ereignisses festgestellt\n
JNCK093=JNI-Fehler in %s\: Methode ist kein Konstruktor
JNCK094=JNI-Fehler in %1$s\: Die Daten, auf die Argument \#%2$d verwies, wurden w\u00E4hrend der  Ausf\u00FChrung von %3$s ge\u00E4ndert. Die Daten wurden vermutlich durch einen anderen Thread oder einen verschachtelten Aufruf ge\u00E4ndert. Das Ergebnis von  %4$s kann falsch sein und die VM wird eventuell instabil.
JNCK091=Informationen im Handler-Frame eines JVMPI oder JVMTI Ereignisses festgestellt\n
JNCK092=\tvalist         auf Wiederverwendung von va_list pr\u00FCfen
JNCK086=JNI-Warnung in %1$s\: Argument \#%2$d ist kein java/nio/Buffer. %3$s gibt einen Fehlercode zur\u00FCck.
JNCK087=JNI-Fehler in %1$s\: Argument \#%2$d ist keine java/lang/reflect/Methode oder  java/lang/reflect/Konstruktor
JNCK084=Warnung in JNI_OnLoad der Bibliothek %.*s festgestellt\n
JNCK085=Information in JNI_OnLoad der Bibliothek %.*s festgestellt\n
JNCK088=JNI-Warnung in %1$s\: Argument \#%2$d ist ein schwacher Verweis. Ein schwacher Verweis kann jederzeit NULL werden. Der Verweis sollte mit NewLocalRef oder NewGlobalRef hochgestuft und dann mit NULL verglichen werden, bevor %3$s aufgerufen wird.
JNCK089=Fehler im Handler-Frame eines JVMPI oder JVMTI Ereignisses festgestellt\n
CFRE020=PC f\u00FCr Beginn der Ausnahmebehandlungsroutine ist ung\u00FCltig.
CFRE021=Doppeltes Feld
CFRE022="thisClass" muss eine Klasse sein.
CFRE023=Konstantenpool leer
CFRE024=Der Klassenname muss eine Zeichenfolge sein.
CFRE025=Feld hat zwei ConstantValue-Attribute
CFRE026=Typ des Bytecodes "newarray" nicht erkannt
CFRE027=Bytecode "multianewarray" muss auf eine Array-Klasse verweisen.
CFRE017=Mehrere Attribute 'StackMap/StackMapTable'
CFRE018=Untergeordnete Klasse muss eine Klasse sein.
CFRE019=PC f\u00FCr Beginn der lokalen Variable ung\u00FCltig
CFRE031=Ausgel\u00F6ste Ausnahmebedingung muss eine Klasse sein.
CFRE032=Schnittstellensuperklasse muss java.lang.Object sein.
CFRE033=Bereich der Ausnahmebehandlungsroutine ist leer.
CFRE034=Bytecode unvollst\u00E4ndig
CFRE035=Bytecode "new" muss auf eine Klasse verweisen.
CFRE036=Ziel ist keine Anweisung im Sprungbytecode.
CFRE037=Temp enth\u00E4lt falschen Typ.
CFRE038=Methode hat zwei Ausnahmebedingungsattribute.
CFRE030=Keine Superklasse
CFRE028=Bytecode "ldc*" muss auf eine Konstante verweisen.
CFRE029=Bytecode "multianewarray" muss auf eine Klasse verweisen
CFRE000=%1$s; Klasse\=%3$.*2$s, Methode\=%5$.*4$s%7$.*6$s, PC\=%8$u
CFRE001=%1$s; Klasse\=%3$.*2$s, Offset\=%4$u
CFRE002=Methodenname ist ung\u00FCltig.
CFRE003=Ung\u00FCltige \u00FCbergeordnete Version
CFRE004=Unbekannter Bytecode
CFRE005=Doppelte Schnittstelle
CFRE010=Negativer Z\u00E4hler f\u00FCr \u00DCbereinstimmungs- und Offset-Paare in Bytecode 'lookupswitch'
CFRE011=Bytecode 'anewarray' muss auf eine Klasse verweisen.
CFRE012=Konstanter Wert muss ein Wert sein.
CFRE013=L\u00E4nge der vom PC ermittelten lokalen Variablen ung\u00FCltig
CFRE014=Attribut "Code" angegeben f\u00FCr eine native oder abstrakte Methode
CFRE015=Schnittstellen m\u00FCssen Klassen sein.
CFRE016=Index der lokalen Variablen au\u00DFerhalb des g\u00FCltigen Bereichs im Inkrement
CFRE006=Ung\u00FCltiges Attribut 'StackMap/StackMapTable'
CFRE007=Feldsignatur ist ung\u00FCltig.
CFRE008=hoch < niedrig in Bytecode 'tableswitch'
CFRE009=Schnittstellenfeld muss 'public', 'static' oder 'final' sein.
CFRE064=Deskriptor muss eine UTF8-Zeichenfolge sein.
CFRE065=Mehrere \u00FCbergeordnete Methodenattribute
CFRE066=Mehrere Attribute "InnerClasses"
CFRE067=Unbekannter Eingabetag f\u00FCr den Konstantenpool
CFRE068=Klassenname ist ung\u00FCltig.
CFRE069=Attributl\u00E4nge gr\u00F6\u00DFer als Attributdaten
CFRE060=PC f\u00FCr Ende der Ausnahmebehandlungsroutine ist keine Anweisung oder das Ende des Bytecode-Arrays.
CFRE061=Name muss eine UTF8-Zeichenfolge sein.
CFRE062=Maximale Anzahl der lokalen Variablen ist kleiner als die Gr\u00F6\u00DFe der Argumente
CFRE063=Bytecode "invoke" ruft ung\u00FCltige Methode auf.
JNCK039=JNI-Fehler in %1$s\: Argument \#%2$d ist NULL
JNCK037=JNI-Fehler in %1$s\: Argument \#%2$d (0x%3$p) ist kein lokaler Verweis. Sein Typ ist\: %4$s
JNCK038=JNI-Fehler in %1$s\: Argument \#%2$d (0x%3$p) ist kein g\u00FCltiger Objektverweis. Sein Typ ist\: %4$s\n
JNCK031=JNI-Fehler in %1$s\: Argument \#%2$d ist NULL
JNCK032=JNI-Fehler in %1$s\: Argument \#%2$d ist kein jobjectArray.
JNCK030=JNI-Fehler in %s\: Diese Funktion kann nicht aufgerufen werden w\u00E4hrend der Garbage-Collectorinaktiviert ist (sie wurde vermutlich von einem JVMPI- oder JVMTI-Ereignis aufgerufen).
JNCK035=JNI-Fehler in %1$s\: Argument \#%2$d (0x%3$p) ist kein globaler Verweis. Sein Typ ist\: %4$s
JNCK036=JNI-Fehler in %1$s\: Argument \#%2$d (0x%3$p) ist kein schwacher globaler Verweis. Sein Typ ist\: %4$s
JNCK033=JNI-Fehler in %1$s\: Argument \#%2$d ist kein jarray.
JNCK034=JNI-Fehler in %1$s\: Argument \#%2$d ist kein %3$s.
CFRE075=Signatur der lokalen Variablen ung\u00FCltig.
CFRE076=Ung\u00FCltiger Dateitypanzeiger
CFRE077=Schnittstellen m\u00FCssen "abstract" sein.
CFRE078=Klassenindex der \u00FCbergeordneten Methoden muss auf eine Klasse verweisen.
CFRE079=PC f\u00FCr Ausnahmebehandlungsroutine ist ung\u00FCltig.
CFRE070=PC f\u00FCr Zeilennummer ung\u00FCltig
CFRE071=Bytecode-Array ist leer.
CFRE072=Eintr\u00E4ge in Bytecode "lookupswitch" nicht sortiert.
CFRE073=Attribute "StackMap/StackMapTable" au\u00DFerhalb des Attributs "Code" gefunden.
CFRE074=Kein Attribut "Code" angegeben.
JNCK028=JNI-Fehler in %s\: Diese Funktion kann nicht aufgerufen werden, wenn eine Ausnahmebedingung ansteht.
JNCK029=JNI-Fehler in %s\: Diese Funktion kann nicht in einem kritischen Abschnitt aufgerufen werden.
JNCK026=JNI-Fehler in %s\: JNIEnv scheint kein g\u00FCltiger Thread zu sein, der Speicher ist besch\u00E4digt oder dies ist keine J9-VM.
JNCK027=JNI-Fehler in %s\: JNIEnv ist nicht die JNIEnv f\u00FCr den aktiven Thread.
JNCK020=Debugger-Verweis
JNCK021=lokaler Verweis in einem anderen Thread
JNCK024=JNI-Fehler erkannt. Vorgang wird abgebrochen.
JNCK025=Mit -Xcheck\:jni\:nonfatal kann die Ausf\u00FChrung fortgesetzt werden, wenn Fehler festgestellt werden.
JNCK022=freier lokaler Verweis
JNCK023=JNI-Fehler erkannt. Vorgang wird fortgesetzt...
CFRE042=Gr\u00F6\u00DFe des Bytecode-Arrays > 65535
CFRE043=Bytecode kann nicht in <wide> ge\u00E4ndert werden.
CFRE044=Reservierter Slot f\u00FCr Bytecode "invokeinterface" ist nicht Null.
CFRE045=Index des Konstantenpools au\u00DFerhalb des g\u00FCltigen Bereichs
CFRE046=Auff\u00FCllen des Bytecodes "switch" falsch
CFRE047=Schnittstellenklasse kann nur "public", "abstract" oder "annotation" sein.
CFRE048=Index der lokalen Variablen beim Speichern au\u00DFerhalb des g\u00FCltigen Bereichs
CFRE049=Bytecode "checkcast" muss auf eine Klasse verweisen.
CFRE040=Attributl\u00E4nge geringer als Attributdaten
CFRE041=Ung\u00FCltige untergeordnete Version
JNCK017=lokaler Verweis
JNCK018=globaler Verweis
JNCK015=\thelp           diese Anzeige ausgeben
JNCK016=NULL
JNCK019=schwacher globale Verweis
CFRE039=Index der lokalen Variablen beim Laden au\u00DFerhalb des g\u00FCltigen Bereichs
JNCK010=\tnonfatal       bei Erkennung von Fehlern nicht beenden
JNCK013=\tnovalist       nicht auf Wiederverwendung von va_list pr\u00FCfen
JNCK014=\tpedantic       gr\u00FCndlichere, aber langsamere Pr\u00FCfungen ausf\u00FChren
JNCK011=\tnowarn         keine Warnungen anzeigen
JNCK012=\tnoadvice       keine Informationsnachrichten anzeigen
CFRE053=Methode hat mehr als 255 Argumentenslots.
CFRE054=Bytecode "field" muss auf "Fieldref" verweisen.
CFRE055=PC f\u00FCr Ende der Ausnahmebehandlungsroutine ist ung\u00FCltig.
CFRE056=Falsche Anzahl Argumente f\u00FCr Bytecode "invokeinterface"
CFRE057=Typ der Ausnahmebehandlungsroutine muss eine Klasse sein.
CFRE058=Index der lokalen Variablen bei der R\u00FCckgabe der Subroutine au\u00DFerhalb des g\u00FCltigen Bereichs
CFRE059=PC f\u00FCr Ausnahmebehandlungsroutine ist keine Anweisung.
CFRE050=Schnittstellenmethode muss "public" oder "abstract" sein.
CFRE051=Zeichenfolgekonstante muss eine Zeichenfolge sein.
CFRE052=\u00C4u\u00DFere Klasse muss eine Klasse sein.
JNCK006=\tall            Anwendungs- und Systemklassen pr\u00FCfen
JNCK007=\tverbose        Trace f\u00FCr bestimmte JNI-Funktionen und -Vorg\u00E4nge durchf\u00FChren
JNCK004=jnichk - JNI-Pr\u00FCfporgramm f\u00FCr J9 Version %s
JNCK005=Syntax\: -Xcheck\:jni\:[Option[,Option[,...]]]
JNCK008=\ttrace          Trace f\u00FCr alle JNI-Funktionen durchf\u00FChren
JNCK009=\tnobounds       keine Grenzpr\u00FCfungen f\u00FCr Zeichenfolgen und Arrays durchf\u00FChren
JNCK002=JNI-Pr\u00FCfprogramm\: Ereignis kann nicht registriert werden.
JNCK003=JNI-Pr\u00FCfprogramm\: lokaler VM-Speicher kann nicht zugeordnet werden.
JNCK000=-Xcheck\:jni\: nicht erkannte Option --> '%s'
JNCK001=JNI-Pr\u00FCfprogramm installiert. Mit -Xcheck\:jni\:help kann die Syntax angezeigt werden.
JNCK082=Information im \u00E4u\u00DFersten Frame eines zugeordneten Threads festgestellt\n
JNCK083=Fehler in JNI_OnLoad der Bibliothek %.*s festgestellt\n
JNCK080=Fehler im \u00E4u\u00DFersten Frame eines zugeordneten Threads festgestellt\n
JNCK081=Warnung im \u00E4u\u00DFersten Frame eines zugeordneten Threads festgestellt\n
SHRC604=<Gr\u00F6\u00DFe> Byte Cachespeicher f\u00FCr unaufbereitete Klassendaten reservieren
TRCE009=Fehler beim Schreiben in Snapdatei
SHRC605=Die Hauptspeichergr\u00F6\u00DFe f\u00FCr "%s" ist zu hoch oder es werden andere Einheiten als 'K','M' oder 'G' verwendet.
TRCE008=Fehler beim Ausf\u00FChren einer Suche in der Tracedatei\: %s
SHRC606=F\u00FCgen Sie Methoden f\u00FCr das Testen nicht funktionale JIT-Hinweise hinzu. Verwenden Sie hierbei -Xint und einen zuvor aufgef\u00FCllten Cache.
SHRC607=%1$s - angeh\u00E4ngte Daten %2$s f\u00FCr %8$.*7$s.%4$.*3$s%6$.*5$s wurden gespeichert
SHRC600=Der Bereich f\u00FCr unaufbereitete Klassendaten ist besch\u00E4digt, weil durch Speichern von %u Byte der freie Speicherbereich des verf\u00FCgbaren Bereichs ('Beginn des freien Speicherbereichs'\=%p, 'Ende des freien Speicherbereich'\=%p) \u00FCberschritten wird.
SHRC601=Gr\u00F6\u00DFe des Bereichs f\u00FCr unaufbereitete Klassendaten  %*c\= %lu
SHRC602=Bereich f\u00FCr unaufbereitete Klassendaten, %% belegt %*c\= %lu%%
SHRC603=F\u00FCr unaufbereitete Klassendaten ben\u00F6tigte Byte  %*c\= %lu
JNCK075=Interner jnichk-Fehler in %1$s\: Nicht erkannter Deskriptor 0x%2$x
TRCE001=Fehler beim Verarbeiten der Traceoption\: -Xtrace\:%s
JNCK076=Interner jnichk-Fehler in %s\: Nicht gen\u00FCgend Speicherkapazit\u00E4t
TRCE000=Traceoption nicht erkannt\: -Xtrace\:%s
JNCK073=JNI-Information in %1$s\: JNI_ABORT wurde angegeben, kann jedoch nicht ber\u00FCcksichtigt werden, da die Daten ge\u00E4ndert wurden.\n(Urspr\u00FCnglicher CRC\=0x%2$x, neuer CRC\=0x%3$x).\nDa %4$s den tats\u00E4chlichen Array-Inhalt zur\u00FCckgab, werden die \u00C4nderungen nicht verworfen. Dies ist eventuell nicht das gew\u00FCnschte Resultat.
TRCE003=Fehler beim Verarbeiten der Traceoption, Detail\: %s
JNCK074=JNI-Information in %s\: Puffer scheint unver\u00E4ndert zu sein. Sie k\u00F6nnen auch JNI_ABORT statt Modus 0 verwenden.
TRCE002=Fehler beim Verarbeiten der Traceoption\: -Xtrace\:%s\=%s
TRCE005=Fehler beim Schreiben von Header in Tracedatei\: %s
SHRC608=%1$s - angeh\u00E4ngte Daten %2$s f\u00FCr %8$.*7$s.%4$.*3$s%6$.*5$s wurden gefunden
JNCK079=Information in %2$.*1$s.%4$.*3$s%6$.*5$s festgestellt\n
TRCE004=Fehler beim \u00D6ffnen der Tracedatei\: %s
SHRC609=%1$s - angeh\u00E4ngte Daten %2$s f\u00FCr %8$.*7$s.%4$.*3$s%6$.*5$s wurden aktualisiert
TRCE007=Fehler beim \u00D6ffnen der n\u00E4chsten Tracedateigeneration\: %s
JNCK077=Fehler in %2$.*1$s.%4$.*3$s%6$.*5$s festgestellt\n
TRCE006=Fehler beim Schreiben von %d Byte in Tracedatei\: %s R\u00FCckgabecode\: %d
JNCK078=Warnung in %2$.*1$s.%4$.*3$s%6$.*5$s festgestellt\n
JNCK071=JNI-Warnung\: Speicher bei 0x%1$p angefordert von %2$s wurde vor der R\u00FCckgabe aus der nativen Methode nicht freigegeben. Dies ist wahrscheinlich ein Speicherverlust.
JNCK072=JNI-Information in %1$s\: JNI_COMMIT wurde angegeben, wird jedoch ignoriert.\nDa %2$s den tats\u00E4chlichen Array-Inhalt zur\u00FCckgab, wird der Puffer nach diesem Aufruf ung\u00FCltig. Dies ist eventuell nicht das gew\u00FCnschte Resultat.
TRCE010=Fehler beim Zuordnen von nativem Speicher; das System wird auf nicht dynamische Traceeinstellungen zur\u00FCckgesetzt.
JNCK070=JNI-Warnung in %1$s\: Urspr\u00FCngliche Array-Daten wurden zwischen %2$s und %3$s ge\u00E4ndert.\n(Urspr\u00FCnglicher CRC\=0x%4$x, neuer CRC\=0x%5$x).\nDa %6$s eine Kopie des Array-Inhalts zur\u00FCckgab, geht der neue Inhalt verloren.
TRCE019=Trace-Engine konnte nicht ordnungsgem\u00E4\u00DF initialisiert werden, R\u00FCckgabecode \= %d
JNCK064=JNI-Warnung in %1$s\: Kapazit\u00E4t des Pools f\u00FCr globale schwache Verweise wuchs automatisch von %2$d auf %3$d.\nDies kann ein Anzeichen f\u00FCr einen Speicherverlust sein.
TRCE012=Die Tracepunktz\u00E4hlerdatei %s kann nicht ge\u00F6ffnet werden, Z\u00E4hler werden nach stderr umgeleitet.
JNCK065=JNI-Warnung in %1$s\: Kapazit\u00E4t des Frames f\u00FCr lokale Verweise wuchs automatisch von %2$d auf %3$d. %4$d Verweise sind im Gebrauch.\nVergr\u00F6\u00DFern Sie den Frame explizit mit EnsureLocalCapacity oder PushLocalFrame.
TRCE011=Modul nicht f\u00FCr Trace konfiguriert\: %s
JNCK062=JNI-Warnung in %s\: Diese Funktion sollte nicht in einem kritischen Abschnitt aufgerufen werden.
TRCE014=Initialisierung der Trace-Engine ist fehlgeschlagen, Trace wurde nicht aktiviert
JNCK063=JNI-Warnung in %1$s\: Kapazit\u00E4t des Pools f\u00FCr globale Verweise wuchs automatisch von %2$d auf %3$d.\nDies kann ein Anzeichen f\u00FCr einen Speicherverlust sein.
TRCE013=Tracez\u00E4hlerinformationen werden in %s geschrieben
TRCE016=Speicher f\u00FCr RasGlobalStorage nicht verf\u00FCgbar, Trace wurde nicht aktiviert
JNCK068=JNI-Warnung in %1$s\: Start oder Index liegen au\u00DFerhalb des g\u00FCltigen Bereichs (%2$d >\= %3$d)
JNCK069=JNI-Warnung in %1$s\: Das Ende liegt au\u00DFerhalb des g\u00FCltigen Bereichs (%2$d + %3$d > %4$d)
TRCE015=Fehler beim Registrieren des Traceschreibeabonnenten
TRCE018=Lokaler Speicherschl\u00FCssel f\u00FCr UTE-Thread kann nicht zugeordnet werden
JNCK066=JNI-Warnung in %1$s\: Negativer Start oder Index (%2$d) angegeben
TRCE017=Lokaler Speicherschl\u00FCssel f\u00FCr RAS-Thread kann nicht zugeordnet werden
JNCK067=JNI-Warnung in %1$s\: Negative Bereichsl\u00E4nge (%2$d) angegeben
CFRE086=Methode hat zwei Attribute "Code".
CFRE087=Bytecode der Schnittstellenmethode muss auf "InterfaceMethodref" verweisen.
CFRE088=Name der lokalen Variablen muss eine Zeichenfolge sein.
CFRE089=Name und Typ wird erwartet.
JNCK060=JNI-Warnung in %1$s\: Argument \#%2$d ist fehlerhafte Methodensignatur ("%3$s")
JNCK061=JNI-Warnung in %1$s\: Argument \#%2$d ist eine fehlerhafte Feldsignatur ("%3$s")
SHRC620=Fehler beim \u00D6ffnen eines gemeinsam genutzten Speicherbereichs. Es wurde festgestellt, dass die Steuerdatei besch\u00E4digt ist.
CFRE080=Methodensignatur ist ung\u00FCltig.
SHRC621=Fehler beim \u00D6ffnen eines gemeinsam genutzten Speicherbereichs. Abweichung bei gemeinsamer Speicher-ID.
CFRE081=Quellendatei muss UTF8 sein.
CFRE082=Methode <init> darf nicht "static", "final", "synchronized", "native" oder "abstract" sein.
CFRE083=Klasse ist "abstract" und "final".
CFRE084=Kein Fehler
CFRE085=<inner name> muss eine Zeichenfolge sein.
SHRC626=Der Status des gemeinsam genutzten Cache kann nicht abgerufen werden, weil kein g\u00FCltiger gemeinsam genutzter Cache vorhanden ist.
SHRC627=Die erneute Erstellung einer Steuerdatei f\u00FCr gemeinsam genutzten Speicher ist im Lesezugriffsmodus nicht zul\u00E4ssig.
SHRC628=Steuerdatei f\u00FCr gemeinsam genutzten Speicher kann nicht gelesen werden.
JNCK059=JNI-Warnung in %1$s\: Argument \#%2$d ist eine fehlerhafte Kennung ("%3$s")
SHRC629=Auf Steuerdatei f\u00FCr gemeinsam genutzten Speicher besteht nur Lesezugriff.
SHRC622=Fehler beim \u00D6ffnen eines gemeinsam genutzten Speicherbereichs. Abweichung bei Schl\u00FCssel f\u00FCr gemeinsam genutzten Speicher.
SHRC623=Fehler beim \u00D6ffnen eines gemeinsam genutzten Speicherbereichs. Die Pr\u00FCfung f\u00FCr die Gruppen-ID ist fehlgeschlagen.
SHRC624=Fehler beim \u00D6ffnen eines gemeinsam genutzten Speicherbereichs. Die Pr\u00FCfung f\u00FCr die Benutzer-ID ist fehlgeschlagen.
SHRC625=Fehler beim \u00D6ffnen eines gemeinsam genutzten Speicherbereichs. Die Pr\u00FCfung f\u00FCr die Gr\u00F6\u00DFe des gemeinsam genutzten Speichers ist fehlgeschlagen.
JNCK053=JNI-Fehler\: Kritischer Abschnitt muss freigegeben werden, bevor die Funktion fortgesetzt wird.
JNCK054=JNI-Fehler in %1$s\: Nicht erkannte Modusoption %2$d
JNCK051=Interner VM-Fehler in %1$s\: Mit Push \u00FCbertragene Byte %2$p sind kleiner als JNI-Verweisbyte %3$p
JNCK052=JNI-Fehler in %1$s\: Klasse %3$.*2$s ist veraltet
JNCK057=JNI-Fehler in %1$s\: %2$s darf nicht verwendet werden, um Speicher 0x%3$p freizugeben, der mit %4$s angefordert wurde.
JNCK058=JNI-Warnung in %1$s\: Nach dem Aufruf von %2$s m\u00FCssen Sie mit  ExceptionCheck, ExceptionClear oder ExceptionOccurred auf Ausnahmebedingungen pr\u00FCfen, bevor Sie %3$s aufrufen.
JNCK055=JNI-Fehler in %1$s\: Zeiger 0x%2$p wurde von keiner JNI-Funktion zur\u00FCckgegeben oder wurde bereits freigegeben.
JNCK056=JNI-Fehler in %1$s\: Speicher 0x%2$p von Objekt 0x%3$p erhalten, freigegeben von 0x%4$p
CFRE097=Doppelter Eintrag f\u00FCr untergeordnete Klasse im Attribut "InnerClasses"
CFRE098=Signatur der lokalen Variablen muss eine Zeichenfolge sein.
CFRE099=Unzul\u00E4ssige Methoden\u00E4nderungswerte
JNCK050=JNI-Fehler in %s\: PopLocalFrame ohne lokalen Frame im Stack aufgerufen.
CFRE090=Bytecode "new" kann keine Arrays erstellen.
CFRE091=PC f\u00FCr Beginn der Ausnahmebehandlungsroutine ist keine Anweisung.
SHRC610=Inaktivieren Sie die Unterst\u00FCtzung der Bytecodeinstrumentierung.
CFRE092=Signatur ung\u00FCltig
CFRE093=Methode kann nur "public", "private" oder "protected" sein.
CFRE094=Bytecode "instanceof" muss auf eine Klasse verweisen.
CFRE095=Anmerkungen m\u00FCssen Schnittstellen sein.
CFRE096=Ziel ist keine Anweisung im Bytecode "switch".
SHRC615=Beim \u00D6ffnen eines Semaphors ist ein Fehler aufgetreten. Abweichung beim Semaphorschl\u00FCssel.
SHRC616=Beim \u00D6ffnen eines Semaphors ist ein Fehler aufgetreten. Abweichung bei der Anzahl der Semaphore im Semaphorset.
SHRC617=Beim \u00D6ffnen eines Semaphors ist ein Fehler aufgetreten. Es wurde keine Semaphormarkierung im Semaphorset gefunden.
JNCK048=JNI-Fehler in %s\: Nicht ausw\u00E4hlbarer Empf\u00E4nger
SHRC618=Die Semaphorsteuerdatei ist nicht lesbar.
JNCK049=JNI-Fehler in %s\: Wiederverwendung von va_list erkannt
SHRC611=Die Unteroption "disableBCI" wurde angegeben, aber der vorhandene Cache wurde mit der Unteroption "enableBCI" erstellt.
SHRC612=Legen Sie den Speicherschl\u00FCssel (0-15) unter z/OS k\u00FCnstlich zum Testen fest.
SHRC613=Beim \u00D6ffnen eines Semaphors ist ein Fehler aufgetreten. Es wurde festgestellt, dass die Steuerdatei besch\u00E4digt ist.
SHRC614=Beim \u00D6ffnen eines Semaphors ist ein Fehler aufgetreten. Abweichung bei der Semaphor-ID.
JNCK042=JNI-Fehler in %1$s\: Argument \#%2$d ist keine Unterklasse von %3$s
JNCK043=JNI-Fehler in %1$s\: Argument \#%2$d; kann %3$s nicht finden
JNCK040=JNI-Fehler in %1$s\: Argument \#%2$d ist au\u00DFerhalb des g\u00FCltigen Bereichs f\u00FCr %3$s (0x%4$x < 0x%5$x)
JNCK041=JNI-Fehler in %1$s\: Argument \#%2$d ist au\u00DFerhalb des g\u00FCltigen Bereichs f\u00FCr  %3$s (0x%4$x > 0x%5$x)
SHRC619=Auf die Semaphorsteuerdatei besteht nur Lesezugriff.
JNCK046=JNI-Fehler in %1$s\: Methode hat falschen R\u00FCckgabetyp ("%2$c")
JNCK047=JNI-Fehler in %s\: Falsches Argument "clazz"
JNCK044=JNI-Fehler in %s\: Methode ist statisch.
JNCK045=JNI-Fehler in %s\: Methode ist nicht statisch.
SHRC520=\t classpath   Gibt nur classpath-Typen im gemeinsam genutzten Cache aus.
SHRC521=\t url               Gibt nur url-Typen im gemeinsam genutzten Cache aus.
SHRC522=\t token           Gibt nur token-Typen im gemeinsam genutzten Cache aus.
SHRC527=\t zipcache   Gibt nur zipcache-Typen im gemeinsam genutzten Cache aus.
SHRC528=\t extra           Gibt alle folgenden private Typen im gemeinsam genutzten Cache aus.
SHRC529=\t orphan         Gibt nur orphan-Typen im gemeinsam genutzten Cache aus.
SHRC523=\t romclass     Gibt nur romclass-Typen im gemeinsam genutzten Cache aus.
SHRC524=\t rommethod   Gibt nur rommethod-Typen im gemeinsam genutzten Cache aus.
SHRC525=\t aot               Gibt nur aot-Typen im gemeinsam genutzten Cache aus.
SHRC526=\t jitprofile Gibt nur jitprofile-Typen im gemeinsam genutzten Cache aus.
SHRC510=Erstellung von Speicherausz\u00FCgen in besch\u00E4digten Caches inaktivieren
SHRC511=CompositeCache hat einen ung\u00FCltigen Initialisierungsmarkierungswert. Der Wert von ccInitComplete ist %lu
SHRC516=Standardm\u00E4\u00DFig alle Elemente im Cache auflisten. Mit printallstats\=help k\u00F6nnen Sie die verf\u00FCgbaren Optionen anzeigen.
SHRC517=Nicht erkannte Unteroption f\u00FCr Option printallstats\=. Mit printallstats\=help k\u00F6nnen Sie die verf\u00FCgbaren Optionen anzeigen.
SHRC518=Verf\u00FCgbare Optionen f\u00FCr -Xshareclasses\:printAllStats\=<Optionen>. Mit '+' k\u00F6nnen Sie mehrere Optionen angeben. Beispiel\: printallstats\=aot+url \n
SHRC519=\t all               Gibt alle folgenden Typen im gemeinsam genutzten Cache aus.
SHRC512=Keine Daten im Cache
SHRC513=Berechtigungen f\u00FCr die Erstellung von Cacheverzeichnissen im UNIX-Format festlegen
SHRC514=Ung\u00FCltige Einstellung f\u00FCr die Option "cacheDirPerm". Es muss eine Dateizugriffsberechtigung im UNIX-Format im Bereich 0700 - 0777 oder 1700 - 1777 in Oktaldarstellung sein.
SHRC515=Das Abrufen des Standardcacheverzeichnisses ist fehlgeschlagen.
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC549=-Xshareclasses\:checkStringTableReset schl\u00E4gt m\u00F6glicherweise fehl. Zeichenfolgetabelle ist nicht gro\u00DF genug. Sie muss mindestens so gro\u00DF wie die Seitengr\u00F6\u00DFe des Betriebssystems sein. Tabellengr\u00F6\u00DFe \= %d, Seitengr\u00F6\u00DFe \= %d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC547=Hauptspeicher f\u00FCr Zeichenbereich in shrinit kann nicht reserviert werden
SHRC548=Pr\u00FCfung f\u00FCr Zur\u00FCcksetzung der Zeichenfolgetabelle erzwingen, wenn diese als besch\u00E4digt markiert ist.
SHRC530=\t jithint       Gibt nur jithint-Typen im gemeinsam genutzten Cache aus.
SHRC531=\t aotch           Gibt nur aotch-Typen im gemeinsam genutzten Cache aus.
SHRC532=\t aotthunk     Gibt nur aotthunk-Typen im gemeinsam genutzten Cache aus.
SHRC533=\t aotdata       Gibt nur aotdata-Typen im gemeinsam genutzten Cache aus.
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC534=\t jcl               Gibt nur jcl-Typen im gemeinsam genutzten Cache aus.
SHRC535=\t bytedata     Gibt alle anderen bytedata-Typen im gemeinsam genutzten Cache aus.
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s Adresse\: 0x%5$p Gr\u00F6\u00DFe\: %6$d
SHRC563=Wenn Sie einen Echtzeitcache \u00F6ffnen, der nicht mit dieser JVM-Version kompatibel ist, k\u00F6nnen Sie mit der JVM-Option -Xrealtime auf diesen Cache zugreifen.
SHRC564=[-Xshareclasses - gemeinsam genutzter gast\u00FCbergreifender Cache aktiviert]
SHRC565=Gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klasse erstellen
SHRC566=Strukturkennung des Headers des gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klassen ist ung\u00FCltig.
SHRC560=Der interne Cachename ist ung\u00FCltig.
SHRC561=Der Cache f\u00FCr gemeinsam genutzte Klassen konnte nicht initialisiert werden. Das Dateisystem verf\u00FCgt nicht \u00FCber gen\u00FCgend Speicherbereich. Verf\u00FCgbare Byte f\u00FCr freien Plattenspeicherplatz \= %lld, angeforderte Byte \= %lld.
SHRC562=Lesen besch\u00E4digter Daten f\u00FCr Cacheeintragheader 0x%p (ung\u00FCltige Elementl\u00E4nge\: %u Byte)
SHRC567=Gast\u00FCbergreifender Cache %1$s f\u00FCr gemeinsam genutzte Klasse schreibgesch\u00FCtzt ge\u00F6ffnet
SHRC568=Gast\u00FCbergreifender Cache %1$s f\u00FCr gemeinsam genutzte Klassen ge\u00F6ffnet
SHRC569=Gast\u00FCbergreifender Cache %1$s f\u00FCr gemeinsam genutzte Klassen erstellt
SHRC552=Angeforderte Blockgr\u00F6\u00DFe f\u00FCr Cache "%s" kann nicht zugeordnet werden. Verf\u00FCgbare Byte \= %d, angeforderte Byte \= %d
SHRC553=Cache enth\u00E4lt nur Klassen mit Zeilennummern
SHRC554=Cache enth\u00E4lt nur Klassen ohne Zeilennummern
SHRC555=Cache enth\u00E4lt Klassen mit Zeilennummern und Klassen ohne Zeilennummern
SHRC550=Laufzeitmarkierung ROUND_TO_PAGE_SIZE fehlt. -Xshareclasses\:checkStringTableReset erfordert, dass Zeichenfolgetabelle auf Seitengr\u00F6\u00DFe gerundet wird.
SHRC551=Cache "%s" ist als voll markiert. Blockgr\u00F6\u00DFe \= %d konnte nicht zugeordnet werden.
SHRC556=Zusammenfassung der Statistikdaten des Cache ausgeben. Mit printstats\=help k\u00F6nnen Sie die verf\u00FCgbaren Optionen anzeigen.
SHRC557=Nicht erkannte Unteroption f\u00FCr Option printstats\=. Mit printstats\=help k\u00F6nnen Sie die verf\u00FCgbaren Optionen anzeigen.
SHRC558=Verf\u00FCgbare Optionen f\u00FCr -Xshareclasses\:printStats\=<Optionen>. Mit '+' k\u00F6nnen Sie mehrere Optionen angeben. Beispiel\: printstats\=aot+url \n
SHRC559=F\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse konnte kein Verzeichnis "%s" erstellt werden.
SHRC580=Fehler beim Freigeben der Anhanglesesperre f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klassen
SHRC101=\tIndex %1$d im Klassenpfad 0x%2$p
SHRC585=Fehler beim Anfordern der Headerschreibsperre f\u00FCr den gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klassen
SHRC102=\tURL 0x%p
SHRC586=Fehler\: Gast\u00FCbergreifender Cache f\u00FCr gemeinsam genutzte Klassen hat einen ung\u00FCltigen Header.
SHRC103=\tToken 0x%p
SHRC587=Fehler beim Aktualisieren der Zeit der letzten Zuordnung des gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klassen
SHRC104=%1$d\: 0x%2$p CLASSPATH
SHRC588=Fehler beim Freigeben der Headerlesesperre f\u00FCr den gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klassen
SHRC581=Fehler beim Zuordnen im gemeinsam genutzten gast\u00FCbergreifenden Objekt
SHRC582=Fehler\: Gast\u00FCbergreifender Cache f\u00FCr gemeinsam genutzte Klassen kann nicht gel\u00F6scht werden.
SHRC583=Fehler beim Aktualisieren der Zeit der letzten Freigabe des gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klassen.
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s in 0x%5$p.
SHRC584=Fehler beim Anfordern der Anhanglesesperre f\u00FCr den gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klassen
SHRC109=\!VERALTET\!
SHRC105=%1$d\: 0x%2$p URL
SHRC589=Erstellen Sie den Cache mit Unterst\u00FCtzung f\u00FCr Bytecodeinstrumentierung.
SHRC106=%1$d\: 0x%2$p TOKEN
SHRC107=\t%.*s
SHRC108=\t%.*s
SHRC574=Gemeinsam genutzter gast\u00FCbergreifender Cache kann sich nicht in einem Netzdateisystem befinden. W\u00E4hlen Sie entweder "nonpersistent" oder ein anderes "cacheDir" aus.
SHRC575=Fehler beim Anfordern einer Schreibsperre f\u00FCr Header im gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klassen
SHRC576=Gemeinsam genutzter gast\u00FCbergreifender Cache kann nicht schreibgesch\u00FCtzt ge\u00F6ffnet werden, da er noch nicht initialisiert wurde.
SHRC577=Gemeinsam genutzter gast\u00FCbergreifender Cache kann nicht im schreibgesch\u00FCtzten Modus erstellt werden.
SHRC570=Gemeinsam genutzter gast\u00FCbergreifender Cache "%1$s" wurde gel\u00F6scht
SHRC571=Gast\u00FCbergreifender Cache %1$s f\u00FCr gemeinsam genutzte Klassen angeh\u00E4ngt
SHRC572=Falsche Zielangabe gefunden. Das im Cache-Header angegebene Ziel ist %s, aber erwartet wurde %s.
SHRC573=F\u00FCr Befehlszeilenoption "-Xshareclasses\:%s" ist "-Xvirt" erforderlich
SHRC578=Fehler beim Erstellen des Headers des gast\u00FCbergreifenden Cache f\u00FCr gemeinsam genutzte Klassen
SHRC579=Fehler beim Initialisieren des Datenheaders des gemeinsam genutzten gast\u00FCbergreifenden Cache
SHRC123=%% Veraltete Klassen    \= %1$d%%\n
SHRC124=Cache ist %1$d%% voll. \n
SHRC125=Speicher f\u00FCr Zeichenfolgepuffer in SH_CacheMap konnte nicht reserviert werden.
SHRC126=Es wurde angefordert, ClasspathItem zu viele Elemente hinzuzuf\u00FCgen.
SHRC120=\# URLs           \= %d
SHRC121=\# Tokens           \= %d
SHRC122=\# Veraltete Klassen  \= %d
SHRC127=SH_CompositeCache\:\:enterMutex ist mit R\u00FCckkehrcode %d fehlgeschlagen. Warnung\: Ihr Cache ist m\u00F6glicherweise besch\u00E4digt.
SHRC128=SH_CompositeCache\:\:exitMutex ist mit R\u00FCckkehrcode %d fehlgeschlagen. Warnung\: Ihr Cache ist m\u00F6glicherweise besch\u00E4digt.
SHRC129=Es wurde versucht, readerCount auf -1 zu setzen\!
SHRC590=Die Unteroption "enableBCI" wurde angegeben, aber der vorhandene Cache wurde nicht mit der Unteroption "enableBCI" erstellt.
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
SHRC112=Zuordnungszeiger \= 0x%p\n
SHRC596=Nehmen Sie beim Speichern und Zuordnen von au\u00DFerplanm\u00E4\u00DFigen Klassendaten zus\u00E4tzliche Pr\u00FCfungen vor.
SHRC113=Cachegr\u00F6\u00DFe       \= %d
SHRC597=-Xshareclasses\:rcdSize\=%u Byte ist gr\u00F6\u00DFer als %u Byte von verf\u00FCgbarem freiem Speicherbereich, -Xshareclasses\:rcdSize\=%u wird stattdessen verwendet.
SHRC114=freie Byte       \= %d
SHRC598=Der Bereich f\u00FCr unaufbereitete Klassendaten ist besch\u00E4digt, weil er mit %lu gr\u00F6\u00DFer als die Gesamtcachegr\u00F6\u00DFe von %lu ist.
SHRC115=ROM-Klassenbyte   \= %d
SHRC599=Der freie Speicherbereich im Bereich f\u00FCr unaufbereitete Klassendaten ist besch\u00E4digt ('Beginn des freien Bereichs'\=%p, 'Ende des freien Bereichs'\=%p, 'Freier Bereich'\=%lu Byte)
SHRC592=BCI aktiviert      \= true
SHRC593=BCI aktiviert      \= false
SHRC110=\nBasisadresse       \= 0x%p
SHRC594=Die Unteroption -Xshareclasses\:cacheRetransformed ist nicht kompatibel mit einem gemeinsam genutzten Cache, der mit der Unteroption 'enableBCI' erstellt wurde.
SHRC111=Endadresse        \= 0x%p
SHRC595=Die Befehlszeilenoptionen "%s" und "%s" sind nicht kompatibel.
SHRC116=Metadatenbyte   \= %d
SHRC117=Metadaten %% verwendet    \= %1$d%%\n
SHRC118=\# ROM-Klassen     \= %d
SHRC119=\# Klassenpfade     \= %d
J9TI006=Erweiterte Leistungsmerkmale von capabilities_ptr aufgeben.
J9TI007=Aktuellen Satz der erweiterten Leistungsmerkmale \u00FCber capabilities_ptr abrufen.
J9TI004=Gibt \u00FCber capabilities_ptr die erweiterten Leistungsmerkmale zur\u00FCck, die derzeit verf\u00FCgbar sind.
SHRC140=Gr\u00F6\u00DFe\:\t%1$d\t\t\t%2$d\n
J9TI005=Neue erweiterte Leistungsmerkmale von capabilities_ptr hinzuf\u00FCgen.
J9TI008=Gibt den Start einer JIT-Kompilierungsphase an. (Nicht sicher f\u00FCr Callback)
J9TI009=Gibt das Ende einer JIT-Kompilierungsphase an. (Nicht sicher f\u00FCr Callback)
SHRC145=Klasse %1$s wird im gemeinsam genutzten Cache f\u00FCr Klassenladeprogramm-ID %2$d mit URL %4$.*3$s gesucht...
SHRC146=Klasse %1$s wird im gemeinsam genutzten Cache f\u00FCr Klassenladeprogramm-ID %2$d mit Token %4$.*3$s gesucht...
VMUT001=(nicht benannter Thread)
SHRC147=Zeichen %.*s ist f\u00FCr den Cachenamen nicht g\u00FCltig.
VMUT000=(kein Speicher mehr)
SHRC148=Gruppenzugriff auf Cache erlauben (standardm\u00E4\u00DFig Benutzerzugriff)
VMUT003=Optionsdatei wurde nicht gefunden.
SHRC141=abweichende Byte\:
VMUT002=(Zugriffsfehler)
SHRC142=\tin 0x%1$p\t\t%2$x \!\= %3$x
VMUT005=Option zu gro\u00DF\: '%s'
SHRC143=Klasse %2$.*1$s wird im gemeinsam genutzten Cache f\u00FCr Klassenladeprogramm-ID %3$d mit URL %5$.*4$s gespeichert...
VMUT004=Fehlerhafte Option\: '%s'
SHRC144=Klasse %2$.*1$s wird im gemeinsam genutzten Cache f\u00FCr Klassenladeprogramm-ID %3$d mit Token %5$.*4$s gespeichert...
SHRC149=Ausf\u00FChrliche Such-/Speicherausgabe aktivieren
J9TI002=Agent_OnLoad wurde in Bibliothek %s nicht gefunden.
J9TI003=Agent_OnLoad ist f\u00FCr Bibliothek %s fehlgeschlagen.
J9TI000=Nicht gen\u00FCgend Speicherkapazit\u00E4t beim Versuch, die Agentenbibliothek %s zu laden.
J9TI001=Agentenbibliothek %1$s konnte nicht ge\u00F6ffnet werden (%2$s).
J9TI017=Steuert verschiedene VM- und Kompilierungsoptionen.
J9TI018=Legt eine Methode f\u00FCr selektive Eingangs- und Ausgangsbenachrichtigung fest.
J9TI015=Einen JLM-Speicherauszug (Java Lock Monitor) anfordern.
J9TI016=Erlaubt das Inlining bei Vorhandensein von Eingangs- und Ausgangsereignissen einer Methode (was m\u00F6glicherweise zu ungenauer Eingangs- und Ausgangsberichterstellung f\u00FChrt).
J9TI019=Legt den Benachrichtigungsmodus f\u00FCr erweiterte Ereignisse fest durch Zulassen von Selektivit\u00E4t auf Threadebene.
SHRC134=Pool in SH_ROMClassManagerImpl konnte nicht erstellt werden.
VMUT010=Fehlerhafter Wert der Option; Option "%1$s%3$.*2$s" enth\u00E4lt abschlie\u00DFende Zeichen "%4$s",  die ignoriert wurden.
SHRC135=Hashtabelle in SH_ROMClassManagerImpl konnte nicht erstellt werden.
SHRC136=Monitor in SH_ROMClassManagerImpl kann nicht erstellt werden.
VMUT012=%2$.*1$s ist keine direkte \u00FCbergeordnete Schnittstelle von %4$.*3$s.
VMUT011=Speicher f\u00FCr Optionsarray der Befehlszeile konnte nicht zugeordnet werden.
SHRC137=SICHERER MODUS\: Warnung\: ROM-Klasse %.*s entspricht nicht der ROM-Klasse im Cache.
SHRC130=Es wurde eine Zuordnung versucht, w\u00E4hrend die COMMIT-Operation noch ansteht.
VMUT014=Empf\u00E4ngerklasse %2$.*1$s muss die aktuelle Klasse oder ein Subtyp der Schnittstelle %4$.*3$s sein
SHRC131=Speicher f\u00FCr verkn\u00FCpftes Listenelement in ROMClassManagerImpl kann nicht reserviert werden.
VMUT013=Optionsdatei '%s' ist ung\u00FCltig
SHRC132=F\u00FCr Hashtabelleneintrag in ROMClassManagerImpl kann kein Speicher zugeordnet werden.
SHRC133=ROMClassManager-Hashtabellen-Mutex kann nicht eingegeben werden.
VMUT007=Fehlerhafter Wert f\u00FCr JAVA_TOOL_OPTIONS
VMUT006=Fehlerhafte Option %s gefunden in -Xoptionsfile
VMUT009=Fehlerhafter Wert f\u00FCr -Xservice
VMUT008=Fehlerhafter Wert f\u00FCr IBM_JAVA_OPTIONS
SHRC138=Mehrere verwaiste ROM-Klassen f\u00FCr %.*s gefunden
SHRC139=\n\tGespeicherte ROM-Klasse \tROM-Klasse im Cache
J9TI010=Methodeneintrag mit erweiterten Informationen zum Methodentyp
J9TI013=Callbacks f\u00FCr instrumentelle Zuordnungen erlauben (die nicht von VMObjectAlloc gemeldet wurden).
J9TI014=Steuert Java Lock Monitor (JLM) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI011=Dynamische -Xtrace-Option hinzuf\u00FCgen
J9TI012=Dynamische -Xdump-Option hinzuf\u00FCgen
SHRC160=Die zul\u00E4ssige Wartezeit f\u00FCr den Erstellungsmutex beim \u00D6ffnen des Semaphors wurde \u00FCberschritten.
SHRC161=Die zul\u00E4ssige Wartezeit f\u00FCr den Erstellungsmutex beim Erstellen des gemeinsam genutzten Speichers wurde \u00FCberschritten.
SHRC162=Die zul\u00E4ssige Wartezeit f\u00FCr den Erstellungsmutex beim \u00D6ffnen des gemeinsam genutzten Speichers wurde \u00FCberschritten.
SHRC167=Inaktiviert die gemeinsame Klassennutzung.
SHRC168=Summe der aus gemeinsam genutzter Klasse gelesenen Byte\=%1$lld. Summe der gespeicherten Byte\=%2$d
SHRC169=\u00C4nderung erkannt in %2$.*1$s...\n \t...markierte %3$d zwischengespeicherte Klassen als veraltet
SHRC163=[ausf\u00FChrliche Ausgabe f\u00FCr "-Xshareclasses" aktiviert]
SHRC164=[ausf\u00FChrliche Ein-/Ausgabe f\u00FCr -Xshareclasses aktiviert]
SHRC165=[ausf\u00FChrliche Ausgabe der Helper-API f\u00FCr -Xshareclasses aktiviert]
SHRC166=Zugeordnet zu Cache "%1$s", Gr\u00F6\u00DFe\=%2$d Byte
SHRC150=Ausf\u00FChrliche Ausgabe der Helper-API aktivieren
SHRC151=Alle Nachrichten unterdr\u00FCcken
SHRC156=Fehler beim Kopieren des Gruppennamens in den Cachenamen
SHRC157=Angeforderte %1$d Byte des gemeinsam genutzten Speichers konnten nicht zugeordnet werden \n \tMaximal zul\u00E4ssiger gemeinsam genutzter Speicher erfolgreich zugeordnet (%2$d Byte) \n \t(Zum Vergr\u00F6\u00DFern des verf\u00FCgbaren gemeinsam genutzten Speichers muss der Systemwert SHMMAX ge\u00E4ndert werden).
SHRC158=Cache f\u00FCr gemeinsam genutzte Klasse "%1$s" erstellt
SHRC159=Cache f\u00FCr gemeinsam genutzte Klasse "%1$s" ge\u00F6ffnet
SHRC152=JVM unabh\u00E4ngig von Fehlern/Warnungen immer starten
SHRC153=Namen des gemeinsam genutzten Cache angeben\n \t(%%g zum Ersetzen des Gruppennamens und %%u f\u00FCr den Benutzernamen verwenden)
SHRC154=Escapezeichen %.*s nicht g\u00FCltig f\u00FCr Cachenamen
SHRC155=Fehler beim Kopieren des Benutzernamens in den Cachenamen
SHRC181=ScopeManagerImpl-Hashtabellen-Mutex kann nicht eingegeben werden.
SHRC182=Monitor in ScopeManagerImpl kann nicht erstellt werden.
SHRC183=Hashtabelle in ScopeManagerImpl kann nicht erstellt werden.
SHRC184=\tPartition %.*s
SHRC180=F\u00FCr Hashtabelleneintrag in ScopeManagerImpl kann kein Speicher zugeordnet werden.
SHRC189=\# AOT-Methoden      \= %d
SHRC185=\tModContext %.*s
SHRC186=\tPartition %.*s in ModContext %.*s
SHRC187=Speichern von AOT-Daten im gemeinsam genutzten Cache inaktivieren
SHRC188=AOT-Byte          \= %d
SHRC170=Namen des gemeinsam genutzten Cache angeben\n \t(%%u zum Ersetzen des Benutzernamens verwenden)
SHRC171=z/OS kann keinen Cache der angeforderten Gr\u00F6\u00DFe erstellen\: Pr\u00FCfen Sie die BPXPRMxx-Einstellungen Ihres z/OS-Systems.
SHRC172=Cache der angeforderten Gr\u00F6\u00DFe kann aufgrund von Betriebssystemeinschr\u00E4nkungen nicht erstellt werden.
SHRC173=Verzeichnis f\u00FCr JVM-Steuerdateien festlegen (erweitert)
SHRC178=Die Option "noIncrementalUpdates" wird wegen Verwendung der Option "singleJVM" ignoriert.
SHRC179=Das Segment ROMClass wurde besch\u00E4digt. Fehler beim Lesen von ROMClass bei 0x%p
SHRC174=Optimierungen f\u00FCr die Verwendung einer einzelnen JVM aktivieren
SHRC175=Cache \u00FCber Neustarts hinweg persistent machen (nur Win)
SHRC176=Verlagerung von "String invariant" aktiviert
SHRC177=Ausf\u00FChrung des sicheren Modus ist wegen Verwendung der Option "singleJVM" nicht m\u00F6glich
SHRC082=identifiedMutex in SH_ClasspathManagerImpl2 kann nicht erstellt werden.
J9VM039=-Xscmx wird ignoriert, wenn -Xshareclasses nicht angegeben ist.
SHRC083=Speicher f\u00FCr identifiedClasspaths-Array in SH_ClasspathManagerImpl2 kann nicht reserviert werden.
SHRC084=Speicher f\u00FCr verkn\u00FCpftes Listenelement kann nicht reserviert werden.
SHRC085=Speicher f\u00FCr Header des verkn\u00FCpften Listenelements kann nicht reserviert werden.
SHRC080=Speicher f\u00FCr Hashtabelleneintrag kann nicht reserviert werden.
SHRC081=cpeTableMutex in SH_ClasspathManagerImpl2 kann nicht erstellt werden.
SHRC086=ClasspathManager-Hashtabellen-Mutex kann nicht eingegeben werden.
SHRC087=MarkStale ist w\u00E4hrend ClasspathManager\:\:update() fehlgeschlagen.
SHRC088=Cache als ROMImageSegment in SH_CacheMap konnte nicht erstellt werden.
SHRC089=Aktualisierungs-Mutex in SH_CacheMap kann nicht erstellt werden.
J9TI060=Ein Abonnement ausf\u00FChrlicher GC-Datens\u00E4tze erstellen
J9TI061=Ein Abonnement ausf\u00FChrlicher GC-Datens\u00E4tze abbrechen
J9VM030=Ung\u00FCltiges UTF8-Format in JNI-Funktion verwendet.
J9VM031=Erforderliche Klasse %2$.*1$s muss sich im Bootklassenpfad befinden, wurde jedoch im Anwendungsklassenpfad in %4$.*3$s gefunden.
J9TI064=Agenteninitialisierungsfunktion %s ist f\u00FCr Bibliothek %s fehlgeschlagen, R\u00FCckgabecode %d
CDRT000=Es kann keine JIT-Stackzuordnung gefunden werden. VM wird abgebrochen.
J9VM032=Nicht behebbarer Fehler\: %1$s kann nicht geladen werden\: %2$s
J9TI065=Agenteninitialisierungsfunktion %s wurde nicht in Bibliothek %s gefunden
J9VM033=Nicht behebbarer Fehler\: %s konnte nicht initialisiert werden.
J9TI062=Ruft den J9VMThread-Zeiger aus 'jthread' ab
CDRT002=Fehlschlag auf dem PC\: %1$p (offset %2$p), metaData \= %3$p
J9VM034=JVMRI erfordert Trace-Engine\: mit der Markierung -Xtrace ausf\u00FChren
J9TI063=Ruft den J9Method-Zeiger aus JMethodID ab
CDRT001=Methode\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
J9VM035=OutOfMemoryError kann nicht zugeordnet werden.
J9VM036=durch Null dividieren
J9VM037=Monitor (Synchronisationsmechanismus) konnte nicht zugeordnet werden.
J9TI066=Ein Abonnement f\u00FCr VM-Tracepunkte erstellen
J9VM038=-Xthr\: nicht erkannte Option --> '%s'
J9TI067=Ein Abonnement f\u00FCr VM-Tracepunkte abbrechen
SHRC071=Befehlszeilenoption "%s" erfordert Unteroption
J9VM028=\tin %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
SHRC072=Befehlszeilenoption "%s" nicht erkannt
J9VM029=\tbei (unbekannte Methode)
SHRC073=Klasse %2$.*1$s wird im gemeinsam genutzten Cache f\u00FCr Klassenladeprogramm-ID %3$d mit URL %5$.*4$s (Index %6$d) gespeichert...
SHRC074=\ Erfolgreich.
SHRC070=Teilaktualisierungen inaktiviert
SHRC079=Hashtabelle in SH_ClasspathManagerImpl2 kann nicht erstellt werden.
SHRC075=\ Fehlgeschlagen.
SHRC076=Klasse %1$s wird im gemeinsam genutzten Cache f\u00FCr Klassenladeprogramm-ID %2$d gesucht...
SHRC077=linkedListImpl-Pool in SH_ClasspathManagerImpl2 kann nicht erstellt werden.
SHRC078=linkedListHdr-Pool in SH_ClasspathManagerImpl2 kann nicht erstellt werden.
J9VM020=Es wurde in %.*s gesucht.
J9VM021=Zu geringe Speicherkapazit\u00E4t f\u00FCr Interpreter-Stackzuordnung. VM wird abgebrochen.
J9VM022=Stackzuordnung ist fehlgeschlagen. Ergebnis \= %p. VM wird abgebrochen.
J9VM023=Dies kann darauf hindeuten, dass JAVA_HOME falsch ist oder dass die Klassenbibliotheken nicht installiert sind.
J9VM024=Ausnahmebedingung in Thread "%.*s"\# START NON-TRANSLATABLE
J9VM025=\tin %2$.*1$s.%4$.*3$s (Native Methode)
J9VM026=\tin %2$.*1$s.%4$.*3$s (Unbekannte Quelle)
J9VM027=\tin %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM050=-Xjni\: nicht erkannte Option --> '%s'
J9VM051=Syntax\:\n
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] maximale Gr\u00F6\u00DFe des JNI-Arrays im Cache festlegen\n
J9VM053=Fehlerhafte Option %s gefunden in -Xoptionsfile
J9VM054=Threaderstellung ist fehlgeschlagen\: retVal %1$zd, errno %2$zd
J9VM055=Nicht behebbarer Fehler\: \u00FCbergeordnete Version von JXE unterscheidet sich von %d
J9VM056=\u00DCbergeordnete Version
J9VM057=Grenzwert des Monitorcache wurde \u00FCberschritten
J9VM058=-Xscminaot wird ignoriert, wenn -Xshareclasses nicht angegeben ist
J9VM059=-Xscmaxaot wird ignoriert, wenn -Xshareclasses nicht angegeben ist
SHRC093=Unerwartete Beendigung einer anderen JVM w\u00E4hrend der Aktualisierung erkannt
SHRC094=Verwaistes Element identifiziert, aber lokale ROMClass an addROMClassToCache \u00FCbergeben.
SHRC095=Versuche, markStale f\u00FCr Elemente des gemeinsam genutzten Cache aufzurufen, sind fehlgeschlagen.
SHRC096=Gemeinsam genutzter Cache "%s" ist voll. Verwenden Sie -Xscmx zum Festlegen der Cachegr\u00F6\u00DFe.
SHRC090=Cache-Mutex in SH_CacheMap-Start konnte nicht abgerufen werden.
SHRC091=Besch\u00E4digte Daten f\u00FCr Element 0x%p (ung\u00FCltiger Datentyp) gelesen.
SHRC092=ADD-Fehler beim Lesen des Cache
SHRC097=Gemeinsam genutzter Cache "%s" ist besch\u00E4digt. Neue JVMs d\u00FCrfen keine Verbindung zum Cache herstellen. \n \tVorhandene JVMs k\u00F6nnen weiterhin arbeiten, allerdings den Cache nicht aktualisieren.
SHRC098=\nAktuelle Statistik f\u00FCr Cache "%s"\: \n
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s in 0x%5$p.
JITM031=Der Wert f\u00FCr '%s' ist falsch
JITM032=Die Option '%1$s' ist nicht vollst\u00E4ndig, Sie m\u00FCssen den Parameter '%2$s' angeben.
J9VM040=Stack\u00FCberlauf des Betriebssystems
JITM030=Der angegebene Wert %s ist zu gro\u00DF.
J9VM041=Falsche Anzahl Argumente
JITM035=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe f\u00FCr den JIT-Codecache; stattdessen wird %3$zu%4$s %5$s verwendet.
J9VM042=Threading-Konfiguration
JITM036=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s %3$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe f\u00FCr den JIT-Codecache; stattdessen wird %4$zu%5$s verwendet.
J9VM043=-----------------------
JITM033=\u00DCberz\u00E4hlige Kommas in der Option '-Xlp' gefunden - sie werden ignoriert
J9VM044=Dreistufige Systemmonitore werden unterst\u00FCtzt
JITM034=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe f\u00FCr den JIT-Codecache; stattdessen wird %3$zu%4$s verwendet.
J9VM045=Dreistufige Systemmonitore werden nicht unterst\u00FCtzt
J9VM046=JLM wird unterst\u00FCtzt
J9VM047=JLM wird nicht unterst\u00FCtzt
JITM037=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s %3$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe f\u00FCr den JIT-Codecache; stattdessen wird %4$zu%5$s %6$s verwendet.
J9VM048=JLM-Wartezeiten werden unterst\u00FCtzt
J9VM049=JLM-Wartezeiten werden nicht unterst\u00FCtzt
J9TI028=Das Ende eines RAS-Speicherauszugs berichten.
J9TI029=Konfiguration eines RAS-Speicherauszugsagenten abfragen.
JITM019=Abweichung bei Funktion f\u00FCr gleichzeitige Scavenger-Ausf\u00FChrung. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI026=Einen Speicherauszug unter Verwendung der gegebenen RAS-Konfiguration ausl\u00F6sen.
J9TI027=Den Start eines RAS-Speicherauszugs berichten.
J9RI019=jvmri->InjectOutOfMemory wird nicht unterst\u00FCtzt.
J9RI017=Speicherauszugsagent kann in jvmri->SetOutOfMemoryHook nicht zugeordnet werden. Funktion nicht registriert.
J9RI018=jvmri->NotifySignal l\u00F6st Signal %d aus.
JITM020=Abweichung bei Funktion f\u00FCr Softwareleseblockade. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
JITM021=Abweichung bei TM-Funktion. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
JITM024=Abweichung bei Compressedrefs-Verschiebung. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI020=Ruft die Betriebssystemthread-ID von jthread ab.
J9RI015=jvmri->RunDumpRoutine\: Komponenten-ID liegt au\u00DFerhalb des g\u00FCltigen Bereichs.
JITM025=Der Cache f\u00FCr gemeinsam genutzte Klasse ist zu gro\u00DF, sodass JIT Offsets nicht korrekt codieren kann. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI021=Ruft erweiterte Frame-Informationen ab.
J9RI016=jvmri->SetOutOfMemoryHook mit leerem Callback aufgerufen. Funktion nicht registriert.
JITM022=Abweichung bei Sperrwort. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9RI013=jvmri->ReleaseRasInfo\: Struktur hat nicht unterst\u00FCtztes Typenfeld.
JITM023=Gr\u00F6\u00DFenabweichung bei Arraylet. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9RI014=jvmri->RunDumpRoutine\: Komponentendaten k\u00F6nnen nicht abgerufen werden.
JITM028=Die Systemkonfiguration unterst\u00FCtzt den Parameter '%.*s' in Option '-Xlp' nicht
J9TI024=Methodenausgang ohne den R\u00FCckgabewert.
J9RI011=RasInfo-Struktur hat nicht unterst\u00FCtztes Typenfeld.
JITM029=Auf %s muss eine Zahl folgen.
J9TI025=Erm\u00F6glicht direkte JNI bei Vorhandensein von Eingangs- und Ausgangsereignissen einer Methode (was m\u00F6glicherweise zu ungenauer Eingangs- und Ausgangsberichterstellung f\u00FChrt).
J9RI012=jvmri->ReleaseRasInfo mit leerer RasInfo-Struktur aufgerufen.
JITM026=Unbekanntes Problem. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI022=Ruft erweiterte Frame-Informationen f\u00FCr alle Stack-Traces ab.
JITM027=JIT konnte keinen Speicher reservieren.
J9TI023=Ruft erweiterte Frame-Informationen f\u00FCr eine Threadliste ab.
J9RI010=jvmri->GetRasInfo kann keinen Speicher zuordnen.
J9TI039=Einen benannten gemeinsam genutzten Cache l\u00F6schen.
JITM008=Validierung des AOT-Headers fehlgeschlagen. Bit am Anfang des Flags f\u00FCr den ordnungsgem\u00E4\u00DFen Zustand einer Funktion ist besch\u00E4digt. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI037=Gesamt-Heapspeicher abrufen.
JITM009=Validierung des AOT-Headers fehlgeschlagen. Bit am Ende des Flags f\u00FCr den ordnungsgem\u00E4\u00DFen Zustand einer Funktion ist besch\u00E4digt. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI038=\u00DCber gemeinsam genutzte Caches iterieren.
J9RI008=jvmri->GetRasInfo kann keine Komponenten abrufen.
J9RI009=jvmri->GetRasInfo kann keinen Speicher zuordnen.
J9RI006=jvmri->GetRasInfo mit leerer RasInfo-Struktur aufgerufen.
J9RI007=jvmri->GetRasInfo kann keinen Speicher zuordnen.
JITM010=Abweichung bei SMP-Funktion. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
JITM013=Abweichung bei Funktion f\u00FCr Inaktivierung von Traps. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI031=Das asynchrone Ereignis eines einzelnen oder aller Threads abbrechen.
J9RI004=jvmri->DynamicVerbosegc wird nicht unterst\u00FCtzt.
JITM014=Abweichung bei Funktion f\u00FCr TLH-Vorablesezugriff. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI032=Gibt an, dass ein Thread das asynchrone Ereignis verarbeitet hat.
J9RI005=jvmri->GetComponentDataArea-Komponente %s hat keinen Datenbereich unter dieser VM.
JITM011=Abweichung bei Funktion f\u00FCr komprimierte Verweise. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9RI002=jvmri->DumpRegister mit leerem Callback aufgerufen. Funktion ist nicht registriert.
JITM012=Abweichung bei DFP-Funktion. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI030=Das asynchrone Ereignis eines einzelnen oder aller Threads signalisieren.
J9RI003=Speicherauszugsagent kann in jvmri->DumpRegister nicht zugeordnet werden. Funktion ist nicht registriert.
JITM017=Abweichung bei Funktion f\u00FCr SIMD-Aktivierung. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI035=Garbage-Collection-Zyklus wurde beendet.
J9RI000=jvmri->CreateThread kann keinen Speicher f\u00FCr Thread-Argumente zuordnen.
JITM018=Abweichung bei Funktion f\u00FCr asynchrone Kompilierung. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI036=Aktuellen freien Heapspeicher abrufen.
J9RI001=Interner Fehler beim Entfernen des Speicherauszugsagenten in jvmri->DumpDeregister. Die Registrierung der Funktion wurde eventuell nicht zur\u00FCckgenommen.
JITM015=Abweichung bei Funktion f\u00FCr Methodentrampolin. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI033=Die VM-Speicherauszugsoptionen zur\u00FCcksetzen
JITM016=Abweichung bei Funktion f\u00FCr HCR-Aktivierung. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI034=Garbage-Collection-Zyklus wurde gestartet.
J9VM017=Speicher f\u00FCr Optionsarray der Befehlszeile konnte nicht zugeordnet werden.
J9VM018=Speicher f\u00FCr Ladetabellenpool f\u00FCr gemeinsam genutzte Bibliothek konnte nicht zugeordnet werden.
J9VM019=Nicht behebbarer Fehler\: Erforderliche Klasse %.*s konnte nicht gefunden und initialisiert werden.
J9TI048=Ruft Trace-Metadaten ab, die mit dem Formatierungsprogramm verwendet werden k\u00F6nnen, um Tracepuffer zu verarbeiten.
J9TI049=Klassen-, Methoden- und Paketnamen f\u00FCr einen Satz von RAM-Methodenverweisen zur\u00FCckgeben
JITM002=Fehler beim Speichern von AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse. Der Cache f\u00FCr gemeinsam genutzte Klasse ist m\u00F6glicherweise besch\u00E4digt. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9TI042=Autotags f\u00FCr neu zugeordnetes Objekt und seine Klasse signalisieren.
JITM003=Fehler bei der AOT-Laufzeitinitialisierung. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9VM010=%s konnte nicht initialisiert werden.
J9TI043=Klassenlast nur f\u00FCr Array-Klassen signalisieren.
JITM000=Nicht unterst\u00FCtzte Hardware [%d].
J9VM011=%1$s konnte nicht geladen werden\: %2$s
J9TI040=F\u00FCgt die erweiterte Funktionalit\u00E4t "can_autotag_objects" hinzu.
JITM001=Kein Platz mehr f\u00FCr AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse. Neuer AOT-Code wird nicht generiert.
J9VM012=%1$s konnte nicht entladen werden\: %2$s
J9TI041=Ereignis "Objekt(e) umbenannt" (verschoben oder gel\u00F6scht) signalisieren.
JITM006=Der AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse kann mit der aktuellen Garbage-Collection-Richtlinie nicht ausgef\u00FChrt werden. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9VM013=Initialisierungsfehler in Funktion %1$s(%2$d)\: %3$s
J9TI046=Ein Abonnement externer Traces\u00E4tze l\u00F6schen
JITM007=Der AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse kann mit den aktuellen JVMPI- oder JVMTI-Einstellungen nicht ausgef\u00FChrt werden. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9VM014=Beendigungsfehler in Funktion %1$s(%2$d)\: %3$s
J9TI047=Alle in Gebrauch befindlichen Traces\u00E4tze werden ausgeschaltet und an Trace-Abonnenten \u00FCbermittelt.
JITM004=AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse kann auf dem aktuellen Prozessor nicht ausgef\u00FChrt werden. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9VM015=Initialisierungsfehler f\u00FCr Bibliothek %1$s(%2$d)\: %3$s
J9TI044=Alle Objekttags l\u00F6schen.
JITM005=Der AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse kann auf dem aktuellen JVM-Release nicht ausgef\u00FChrt werden. AOT-Code im Cache f\u00FCr gemeinsam genutzte Klasse wird ignoriert.
J9VM016=Beendigungsfehler f\u00FCr Bibliothek %1$s(%2$d)\: %3$s
J9TI045=Ein Abonnement externer Traces\u00E4tze erstellen
MECK001=Nicht erkannte Option -Xcheck\:memory\: %s
J9VM006=Ung\u00FCltige Befehlszeilenoption\: %s
MECK000=Fehler beim Initialisieren des Dienstprogramms -Xcheck\:memory
J9VM007=Nicht erkannte Befehlszeilenoption\: %s
J9VM008=J9VMDllMain wurde nicht gefunden.
J9TI059=Die von der JVM belegte native Speicherkapazit\u00E4t, nach Speicherkategorien aufgeschl\u00FCsselt, abrufen.
MECK002=Fehler beim Erstellen der Datenstruktur f\u00FCr die Aufrufsite. Die Informationen zur Aufrufsite werden nicht angezeigt.
J9VM009=J9VMDllMain ist fehlgeschlagen.
J9TI050=Einen Hash-Code f\u00FCr den Monitor eines Objekts abrufen.
J9TI053=VM-Protokoll-Optionen einstellen.
J9TI054=Einen JLM-Speicherauszug (Java Lock Monitor) mit einer Formatkennung anfordern.
J9VM000=Fehlerhafter Wert f\u00FCr IBM_JAVA_OPTIONS
J9TI051=Methodenweise Markierung f\u00FCr selektive Eingabe- und Ausgabebenachrichtigung l\u00F6schen.
J9VM001=Fehlerhafter Wert f\u00FCr -Xservice
J9TI052=Aktuelle VM-Protokoll-Optionen abfragen.
J9VM002=Optionsdatei wurde nicht gefunden.
J9TI057=Native Zeichenfolge der JVM-Protokoll-Optionen konnte nicht konvertiert werden.
J9VM003=JIT-Compiler "%s" wurde nicht gefunden. Interpreter wird verwendet.
J9TI058=JVM-Protokoll-Optionen konnten nicht festgekegt werden.
J9VM004=Erforderliche Bibliothek kann nicht geladen werden f\u00FCr\: %s
J9TI055=Puffer f\u00FCr JVM-Protokoll-Optionen konnte nicht zugeordnet werden.
J9VM005=Ung\u00FCltiger Wert f\u00FCr Umgebungsvariable\: %s
J9TI056=JVM-Protokoll-Optionen konnten nicht abgefragt werden.
PORT033=Es wurde kein unterst\u00FCtzter Hypervisor gefunden.
PORT032=Operation im Zusammenhang mit dem Hypervisor ist fehlgeschlagen.
PORT031=Die LE-Bedingung %s%i, die einem per Software erzeugten POSIX-Signal entspricht, wurde empfangen
PORT030=%s-Einstellung "%s" gibt an, dass der Kernspeicherauszug \u00FCber eine Pipe in ein externes Programm geleitet werden soll.  Versuchte Umbenennung von core oder core.%d.\n
PORT037=Es wird kein Hypervisor verwendet.
PORT036=Unerwarteter R\u00FCckgabecode vom Service CSRSI unter z/OS
PORT035=__malloc31 konnte keinen Puffer in z/OS zuordnen.
PORT034=Es wurde versucht, gemeinsam genutzten Speicher anzuh\u00E4ngen, der im Speicherschutzschl\u00FCssel %lu erstellt wurde, aber zurzeit wird der Schl\u00FCssel %lu verwendet.
PORT039=HYPFS-Aktualisierung ist fehlgeschlagen
PORT038=Fehlerhafter Wert f\u00FCr IBM_JAVA_HYPERVISOR_SETTINGS
PORT022=Anf\u00FCgen von .X&DS an benutzerdefinierte Speicherauszugsschablone, um mehrteilige Speicherausz\u00FCge zu erm\u00F6glichen.
PORT021=Sie haben einen alten gemeinsam genutzten System-V-Semaphor ge\u00F6ffnet\: Datei\:%1$s semid\:%2$d
PORT020=Sie haben einen alten gemeinsam genutzten System-V-Speicher ge\u00F6ffnet\: Datei\:%1$s shmid\:%2$d
PORT026=Angegebene Datei ist ein Verzeichnis
PORT025=Ung\u00FCltiger Sperrtyp f\u00FCr Operation zum Sperren einer Datei. lockFlags\: %1$d
PORT024=IEATDUMP ist fehlgeschlagen, weil die Speicherauszugsdatei nicht zugeordnet werden konnte. (\u00DCberpr\u00FCfen Sie den Festplattenspeicher und die Feldberechtigungen.)
PORT023=IEATDUMP ist fehlgeschlagen, weil die benutzerdefinierte Speicherauszugschablone zu lang war. Versuchen Sie erneut einen Speicherauszug mit der Standard-Speicherauszugsschablone.
PORT029=Ung\u00FCltige Kennung. Dateikennung\: %1$d.
PORT028=mmap aufgrund von ung\u00FCltigen Zuordnungsoptionen fehlgeschlagen.
PORT027=mmap aufgrund eines ung\u00FCltigen Speicherschutzparameters fehlgeschlagen.
PORT011=Beim Versuch, eine gemeinsam genutzte Bibliothek zu laden, konnte kein Speicher zugeordnet werden
PORT010=Die Berechtigung zum Laden der gemeinsam genutzten Bibliothek wurde nicht erteilt
PORT015=Verweise auf gemeinsam genutzte Bibliotheken k\u00F6nnen nicht aufgel\u00F6st werden - eine vorausgesetzte, gemeinsam genutzte Bibliothek fehlt m\u00F6glicherweise.
PORT014=Die dll konnte nicht geladen werden, da sie nicht gefunden wurde
PORT013=Fehler beim Laden der gemeinsam genutzten Bibliothek - die dll-Tabelle konnte nicht gefunden werden
PORT012=Fehler beim Laden der gemeinsam genutzten Bibliothek, da das PACE-Bit gesetzt wurde
PORT019=Verzeichnis %s kann nicht erstellt werden.  Gemeinsam genutzte Klassen werden inaktiviert, bis dieses Verzeichnis erstellt wurde.
PORT018=Operation ist fehlgeschlagen\: %1$d (%2$s ist fehlgeschlagen\: %3$d)
PORT017=Operation ist fehlgeschlagen\: %d
PORT016=Interner Fehler %i
PORT000=
ZIPS000=%1$s kann nicht ge\u00F6ffnet werden (%2$s)
ZIPS001=%s kann nicht ge\u00F6ffnet werden (fehlender Export).
PORT009=Die angegebene gemeinsam genutzte Bibliothek wurde nicht gefunden
PORT004=Fehler bei der Symbolaufl\u00F6sung
PORT003=Abh\u00E4ngiges Modul %s konnte nicht geladen werden.
PORT002=Unbekannter Fehler beim Laden einer gemeinsam genutzten Bibliothek
PORT001=Beim Versuch, in eine Datei zu schreiben, konnte der Speicher nicht zugeordnet werden.
PORT008=Modularchitektur ist falsch
J9RI022=Bei der JVMRI-Initialisierung kann der JVMRI-Speicherauszugsmonitor nicht zugeordnet werden.
PORT007=Das angegebene Modul ist kein Modul
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister und TraceListener werden nicht mehr unterst\u00FCtzt; verwenden Sie die neuen Versionen in JVMRAS_VERSION_1_5.
PORT006=Das Format des Moduls ist nicht richtig
J9RI020=jvmri->CreateThread kann keinen internen Monitor (Synchronisationsmechanismus) zuordnen.
PORT005=Die gemeinsam genutzte Bibliothek konnte nicht geladen werden
J9RI021=jvmri->RunDumpRoutine wird nicht unterst\u00FCtzt.
J9VM070=Nativer Speicher w\u00E4hrend Bindung der nativen Methode %2$.*1$s.%4$.*3$s%6$.*5$s ersch\u00F6pft.
J9VM071=Es wird versucht, die native Methode %2$.*1$s.%4$.*3$s%6$.*5$s rekursiv zu binden.
J9VM072=Nativer Speicher ersch\u00F6pft
J9VM073=Klasse %2$.*1$s greift unzul\u00E4ssigerweise auf Element %3$s der Klasse %5$.*4$s zu.
J9VM074=Klasse %2$.*1$s greift unzul\u00E4ssigerweise auf %3$s-Klasse %5$.*4$s zu.
J9VM075=Unzul\u00E4ssige Operation an eventron-Thread
J9VM076=Nativer Speicher beim Zuordnen des Listeneintrags f\u00FCr fertigstellbares oder Verweisobjekt ersch\u00F6pft
J9VM077=Hinweis\: -Xdfpbd hat in diesem Release von Java keine Auswirkungen
J9VM078=Fehlerhafter Wert f\u00FCr JAVA_TOOL_OPTIONS
J9VM079=triggerOneOffDump(%1$s) erfordert %2$s
J9VM060=runNamedDump(%1$s) erfordert %2$s
J9VM061=insertDumpAgent erfordert %s
J9VM062=removeDumpAgent erfordert %s
J9VM063=seekDumpAgent erfordert %s
J9VM064=setDumpOption erfordert %s
J9VM065=Das Objekt ist keine Instanz der deklarierenden Klasse
J9VM066=Argumententyp stimmt nicht \u00FCberein
J9VM067=-Xshareclasses nicht aktiviert, Option "-Xzero\:sharezip" ignoriert
J9VM068=-Xshareclasses nicht aktiviert, Option "-Xzero\:sharestring" ignoriert
J9VM069=\u00DCbertretung der Ladeeinschr\u00E4nkung\: Ladeprogramm "%2$.*1$s@%3$x" hat zuvor das Laden f\u00FCr einen anderen Typ mit dem Namen "%5$.*4$s", der durch Ladeprogramm "%7$.*6$s@%8$x" definiert ist, eingeleitet.
SHRC500=Der Debugbereich ist besch\u00E4digt, weil die niedrige Adresse f\u00FCr den freien Speicherbereich %p gr\u00F6\u00DFer ist als die hohe Adresse f\u00FCr den freien Speicherbereich %p
SHRC505=Der Debugbereich ist besch\u00E4digt, weil die hohe Adresse f\u00FCr den freien Speicherbereich %p minus der niedrigen Adresse f\u00FCr den freien Speicherbereich %p die Gr\u00F6\u00DFe des Debugbereichs von %lu Byte \u00FCberschreitet
SHRC506=Der Debugbereich ist besch\u00E4digt, weil er mit %lu gr\u00F6\u00DFer als die im Cache-Header gespeicherte Gesamtcachegr\u00F6\u00DFe von %u ist
J9VM090=Langsame Antwort auf Netzabfrage (%d Sekunden); \u00FCberpr\u00FCfen Sie Ihre IP-DNS-Konfiguration.
SHRC507=Nehmen Sie beim Speichern und Zuordnen von Klassendebugdaten zus\u00E4tzliche Pr\u00FCfungen vor
J9VM091=Adaptives Drehen wird unterst\u00FCtzt.
SHRC508=Es wurde ein anderer Semaphor als der vorher mit diesem Cache verwendete angefordert. Alte Semaphor-ID\=%d, neue Semaphor-ID\=%d
J9VM092=Adaptives Drehen wird nicht unterst\u00FCtzt.
SHRC501=Der Debugbereich ist besch\u00E4digt, weil die niedrige Adresse f\u00FCr die Zeilennummertabellendaten %p gr\u00F6\u00DFer ist als die hohe Adresse %p
J9VM093=F\u00FCr diese Version von Java ist eine CPU erforderlich, die SSE2 oder sp\u00E4tere Erweiterungen unterst\u00FCtzt.  Weitere Informationen finden Sie im Abschnitt zu unterst\u00FCtzten Umgebungen im IBM Java-Benutzerhandbuch.
SHRC502=Der Debugbereich ist besch\u00E4digt, weil die niedrige Adresse f\u00FCr die Tabellendaten %p f\u00FCr lokale Variablen gr\u00F6\u00DFer ist als die hohe Adresse %p
J9VM094=Thread "%s" ist nach Ausf\u00FChren der Shutdown-Hooks noch aktiv.
SHRC503=Der Debugbereich ist besch\u00E4digt, weil die Speicherung der Zeilennummerntabelle (%d Byte) und der Tabelle f\u00FCr lokale Variablen (%d Byte) zu einer hohen Adresse f\u00FCr die Daten der Zeilennummerntabelle %p f\u00FChrt, die gr\u00F6\u00DFer als die neue niedrige Adresse der Daten der Tabelle f\u00FCr lokale Variablen %p ist
J9VM095=\u00DCbertretung der Ladeeinschr\u00E4nkung beim Aufl\u00F6sen von Methode "%2$.*1$s.%4$.*3$s%6$.*5$s" \: Ladeprogramm "%8$.*7$s@%9$x" der Klasse "%11$.*10$s" und Ladeprogramm "%13$.*12$s@%14$x" der Klasse "%16$.*15$s" haben verschiedene Typen f\u00FCr die Methodensignatur.
SHRC504=Der Cachedatenstart ist null. Datenstart\: %p
J9VM096=-Xscdmx wird ignoriert, wenn -Xshareclasses nicht angegeben ist.
J9VM097=\nSyntax\:\n
J9VM098=-Xsyslog\:help              JVM-Hilfe zu JVM -Xsyslog ausgeben.
J9VM099=-Xsyslog\:none              Zuvor angegebene JVM-Protokoll-Optionen, einschlie\u00DFlich der Standardwerte, inaktivieren.
SHRC509=Erstellen Sie einen Cache, der eine Generation \u00E4lter als die aktuelle Generation ist.
PORT040=Lesen von HYPFS ist fehlgeschlagen
PORT044=Beim Abrufen von Hypervisorinformationen konnte kein Speicher zugeordnet werden.
PORT043=%1$d\: %2$s-Informationen konnten nicht abgerufen werden.
PORT042=/proc/sysinfo kann nicht gelesen werden
PORT041=HYPFS nicht angeh\u00E4ngt
J9VM080=queryVmDump erfordert %s
J9VM081=Fehlerhafter Wert der Option; Option "%1$s%3$.*2$s" enth\u00E4lt abschlie\u00DFende Zeichen "%4$s",  die ignoriert wurden.
J9VM082=Es kann nicht auf IFA-Prozessor umgeschaltet werden - "extattr +a lib%s.so" ausgeben
J9VM083=Fehler beim Umschalten auf IFA-Prozessor mit folgendem R\u00FCckkehrcode\: %08x
J9VM084=IFA-Fehler\: nicht erwarteter R\u00FCckkehrcode %08x vom IFA-Umschaltservice
J9VM085=Fehlerhafte Option\: '%s'
PORT048=Das Erstellen eines Systemspeicherauszugs ist fehlgeschlagen, weil eine nicht regul\u00E4re Datei "%s" mit demselben Namen vorhanden ist wie die erwartete Systemspeicherauszugsdatei.
J9VM086=Option zu gro\u00DF\: '%s'
PORT047=Beim Versuch, eine gemeinsam genutzte Bibliothek zu laden, war nicht gen\u00FCgend Pufferspeicher verf\u00FCgbar.
J9VM087=resetDumpOption erfordert %s
PORT046=Die ausf\u00FChrbare Datei konnte nicht ge\u00F6ffnet werden.
J9VM088=Achtung\: "syscorepath" wurde nicht konfiguriert, was die Generierung einer System-Kerndatei (falls eine ben\u00F6tigt wird) verhindern kann.\n\t\tDie ordnungsgem\u00E4\u00DFen "syscorepath"-Konfigurationseinstellungen finden Sie in den WebSphere Real Time-Installationsanweisungen.\n\t\tHINWEIS\: "syscorepath" muss nach jedem Neustart der Maschine konfiguriert werden.
PORT045=Beim Abrufen von Systeminformationen konnte kein Speicher zugeordnet werden.
J9VM089=Achtung\: "syscorepath"-Einstellungen k\u00F6nnen nicht mit "sysconfig" \u00FCberpr\u00FCft werden\: %s.
SHRC400=Zip-Cache-Byte                     %*c\= %d
SHRC401=\# Zip-Caches                        %*c\= %d
SHRC406=Startadresse der Metadaten               %*c\= 0x%p
SHRC407=Laufzeitflags                       %*.c\= 0x%.16llX
SHRC408=Cachegenerierung                    %*.c\= %d\n
SHRC409=AOT-Codebyte                      %*c\= %d
SHRC402=JIT-Datenbyte                      %*c\= %d
SHRC403=Im Klassendebugbereich verwendete Byte         %*c\= %u
SHRC404=F\u00FCr den Cache konnte kein Verzeichnis abgerufen werden
SHRC405=F\u00FCr den Cache konnte kein Verzeichnis erstellt werden
SHRC420=\# AOT-Dateneintr\u00E4ge                  %*c\= %d
SHRC421=\# AOT-Klassenhierarchie               %*c\= %d
SHRC422=\# AOT-Thunks                        %*c\= %d
SHRC423=\# JIT-Hinweise                         %*c\= %d
SHRC428=Gel\u00F6schte \u00E4ltere Generierung des Cache f\u00FCr gemeinsam genutzte Klasse "%s"
SHRC429=\u00C4ltere Generierung des Cache f\u00FCr gemeinsam genutzte Klasse "%s" konnte nicht gel\u00F6scht werden
SHRC424=\# JIT-Profile                      %*c\= %d
SHRC425=\# Java-Objekte                      %*c\= %d
SHRC426=\# JCL-Eintr\u00E4ge                       %*c\= %d
SHRC427=Zum Ausgeben detaillierter Cachestatistiken verwendeter \u00C4nderungswert
SHRC410=AOT-Datenbyte                      %*c\= %d
SHRC411=AOT-Klassenhierarchiebyte           %*c\= %d
SHRC412=AOT-Thunk-Byte                     %*c\= %d
SHRC417=JCL-Datenbyte                      %*c\= %d
SHRC418=Bytedatenbyte                     %*c\= %d
SHRC419=LocalVariableTable-Klassenbyte      %*c\= %u
SHRC413=JIT-Hinweisbyte                      %*c\= %d
SHRC414=JIT-Profilbyte                   %*c\= %d
SHRC415=Java-Objektbyte                   %*c\= %d
SHRC416=ReadWrite-Byte                     %*c\= %d
SHRC442=Gemeinsam genutzter Cache "%s" ist besch\u00E4digt. Besch\u00E4digungscode ist %d. Der besch\u00E4digte Wert ist 0x%p. Neue JVMs d\u00FCrfen keine Verbindung zum Cache herstellen. \n \tVorhandene JVMs k\u00F6nnen weiterhin arbeiten, allerdings den Cache nicht aktualisieren.
SHRC443=Cache-CRC ist falsch und gibt einen besch\u00E4digten Cache an. Falscher Cache-CRC\: 0x%x.
SHRC444=Lesen besch\u00E4digter Daten f\u00FCr Cache-Eintragheader 0x%p (ung\u00FCltige Elementl\u00E4nge)
SHRC445=Cache ist zu klein, um verwendet werden zu k\u00F6nnen. Ung\u00FCltige Cachegr\u00F6\u00DFe\: 0x%x.
SHRC440=Wert von -XscminJIT ist gr\u00F6\u00DFer als der Wert von -Xscmx und wurde daher auf denselben Wert wie -Xscmx gesetzt.
SHRC441=Wert von -XscmaxJIT ist gr\u00F6\u00DFer als der Wert von -Xscmx und wurde daher auf "uneingeschr\u00E4nkt" gesetzt
SHRC446=Die Anforderung der Headerschreibsperre schlug beim Starten des Cache mit folgendem Fehlercode fehl\: %d.
SHRC447=Strukturkennung des Cache-Headers ist nicht g\u00FCltig. Adresse der Strukturkennungszeichenfolge im Cache-Header\: 0x%p.
SHRC448=Feld f\u00FCr Cachegr\u00F6\u00DFe im Cache-Header ist nicht g\u00FCltig. Cachegr\u00F6\u00DFe im Cache-Header ist\: 0x%x.
SHRC449=Auff\u00FCllen ist ungleich null. Auff\u00FCllbyte in Cache-Header sind\: %u.
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC432=\ Signatur\: %2$.*1$s Adresse\: 0x%3$p
SHRC433=\tf\u00FCr ROMClass %2$.*1$s bei 0x%3$p.
SHRC434=Der von der Option -Xitsn \u00FCbergebene Wert\=%d befindet sich au\u00DFerhalb des Bereichs der von der VM unterst\u00FCtzten Primzahlwerte. Unterst\u00FCtzter Bereich \= 0 - %u
SHRC430=Aktuelle Generierung des Cache f\u00FCr gemeinsam genutzte Klasse "%s" konnte nicht gel\u00F6scht werden
SHRC439=Wert von -XscminJIT sollte nicht gr\u00F6\u00DFer als der Wert von -XscmaxJIT sein
SHRC435=-Xitsn%2$u belegt %1$u Byte des Speichers, was die Gr\u00F6\u00DFe des Cache f\u00FCr gemeinsam genutzte Klasse von %3$u Byte \u00FCbersteigt
SHRC436=Fehler beim Anfordern der Headerschreibsperre f\u00FCr die Cachedatei f\u00FCr eine gemeinsam genutzte Klasse
SHRC437=Fehler beim Freigeben der Headerlesesperre f\u00FCr die Datei f\u00FCr den Cache f\u00FCr gemeinsam genutzte Klasse
SHRC438=Speichern von AOT-Daten im gemeinsam genutzten Cache inaktivieren
JNCK101=JNI-Fehler in %1$s\: Argument \#%2$d wird als statisch erwartet, aber eine nicht statische Feld-ID wird an JNI \u00FCbergeben
JNCK102=JNI-Fehler in %1$s\: Argument \#%2$d wird als nicht statisch erwartet, aber eine statische Feld-ID wird an JNI \u00FCbergeben
JNCK100=JNI-Information in %1$s\: Diese Funktion kann nicht mit gepackten Objekten verwendet werden. Verwenden Sie stattdessen %2$s.
SHRC464=Ausf\u00FChrliche JIT-Datenausgabe aktivieren
SHRC465=[-Xshareclasses ausf\u00FChrliche JIT-Datenausgabe aktiviert]
SHRC466=%1$s - angeh\u00E4ngte Daten f\u00FCr %7$.*6$s.%3$.*2$s%5$.*4$s wurden gefunden
SHRC467=%1$s - angeh\u00E4ngte Daten konnten nicht gefunden werden f\u00FCr %8$.*7$s.%4$.*3$s.%6$.*5$s, Ursache\: %2$s
SHRC460=Speichern von AOT-Daten im gemeinsam genutzten Cache inaktivieren
SHRC461=Wert von -Xscminjitdata sollte nicht gr\u00F6\u00DFer als der Wert von -Xscmaxjitdata sein
SHRC462=Wert von -Xscminjitdata ist gr\u00F6\u00DFer als der Wert von -Xscmx, er wurde deshalb auf denselben Wert wie -Xscmx gesetzt
SHRC463=Wert von -Xscmaxjitdata ist gr\u00F6\u00DFer als der Wert von -Xscmx und wurde daher auf "uneingeschr\u00E4nkt" gesetzt
SHRC468=%1$s - angeh\u00E4ngte Daten f\u00FCr %7$.*6$s.%3$.*2$s%5$.*4$s wurden gespeichert
SHRC469=1$s - angeh\u00E4ngte Daten konnten nicht gespeichert werden f\u00FCr %8$.*7$s.%4$.*3$s%6$.*5$s. Ursache\: %2$s
J9GC084=Die Taktaufl\u00F6sung des Betriebssystems unterst\u00FCtzt die angeforderte Zielpausezeit angeblich nicht.  Aufgrund der Befehlszeilenoption -Xgc\:overrideHiresTimerCheck wird dies au\u00DFer Kraft gesetzt.
J9GC083=Fehler beim Initialisieren. Multi-Tenant-Funktionalit\u00E4t unterst\u00FCtzt nur -Xgcpolicy\:balanced
J9GC086=Instanziieren der Metadaten f\u00FCr komprimierte Verweise ist fehlgeschlagen; %1$zu%2$s erforderlich
J9GC085=Anfangsgr\u00F6\u00DFe der Metadaten f\u00FCr komprimierte Verweise
J9GC088=Die angeforderte Seitengr\u00F6\u00DFe %1$zu%2$s des Objektheapspeichers konnte nicht erf\u00FCllt werden. Stattdessen wird %3$zu%4$s verwendet.
J9GC087=Gr\u00F6\u00DFe des Heapspeichers %1$zu%2$s kann nicht mit Seitengr\u00F6\u00DFe %3$zu%4$s erf\u00FCllt werden. Sie k\u00F6nnen die Gr\u00F6\u00DFe des Heapspeichers mit -Xmx angeben.
J9GC089=Die Option -Xgc\:preferredHeapBase wird unter z/OS nicht unterst\u00FCtzt.
SHRC453=Alle Elemente im Cache auflisten, einschlie\u00DFlich verwaister Klassen
SHRC454=\u00DCberpr\u00FCfung inaktivieren, wenn die aktuelle SysV-Semaphor-ID mit der zwischengespeicherten SysV-Semaphor-ID identisch ist
SHRC455=Die Pr\u00FCfung der Zeichenfolgetabelle beim Start erzwingen
SHRC456=Erkennen einer \u00C4nderung der VM-Build-ID erzwingen
SHRC450=Feld f\u00FCr Datenl\u00E4nge im Cache-Header ist nicht g\u00FCltig. Datenl\u00E4nge im Cache-Header ist\: %u.
SHRC451=Feld f\u00FCr Datenstart im Cache-Header ist nicht g\u00FCltig. Datenstartadresse im Cache-Header ist\: 0x%p.
SHRC452=Speicherschutz des Lese-/Schreibbereichs (Zeichenfolgetabelle) inaktivieren
SHRC457=Ung\u00FCltiger Cachename. Der Cachename "%.*s" enth\u00E4lt nur ein Leerzeichen oder ist leer
SHRC458=Inaktiviert die gemeinsame Klassennutzung ohne die Dienstprogramm-APIs zu inaktivieren.
SHRC459=Inaktiviert die gemeinsame Klassennutzung und die Dienstprogramm-APIs.
SHRC480=Zu viele Aktualisierungen beim Lesen
SHRC481=Cache besch\u00E4digt
J9GC071=Der Wert f\u00FCr '%s' ist falsch
J9GC070=Garbage-Collector konnte nicht gestartet werden
SHRC002=im Gebrauch
SHRC486=Reservierter Speicherbereich f\u00FCr JIT-Datenbyte   %*c\= %d
SHRC003=letzte Freigabezeit
SHRC487=Maximaler Speicherbereich f\u00FCr JIT-Datenbyte      %*c\= %d
SHRC004=Cache "%s" kann nicht gel\u00F6scht werden.
SHRC488=Summe der Werte von -Xscminaot und -Xscminjitdata darf die Gr\u00F6\u00DFe des verf\u00FCgbaren Cache nicht \u00FCberschreiten
SHRC005=Keine Caches f\u00FCr gemeinsam genutzte Klasse verf\u00FCgbar.
SHRC489=Wenn der ge\u00F6ffnete Cache als besch\u00E4digt markiert ist, einen Cachespeicherauszug ausl\u00F6sen
SHRC482=Adresse nicht in Cache
SHRC483=Cache konnte nicht aktualisiert werden
SHRC000=Gemeinsam genutzter Cache
SHRC484=Reservierter Speicherbereich f\u00FCr AOT-Byte        %*c\= %d
SHRC001=ID f\u00FCr gemeinsamen Speicher des Betriebssystems
SHRC485=Maximaler Speicherbereich f\u00FCr AOT-Byte           %*c\= %d
J9GC069=Fertigstellungsthread konnte nicht initialisiert werden
SHRC006=Anzahl der in den letzten %1$d Minuten abgelaufenen Caches\: %2$d
SHRC007=Cache "%s" f\u00FCr gemeinsam genutzte Klasse konnte nicht entfernt werden.
SHRC008=Gemeinsam genutzter Cache wurde erstellt\: %1$s Gr\u00F6\u00DFe\: %2$d Byte
SHRC009=Gemeinsam genutzter Cache wurde ge\u00F6ffnet\: %1$s Gr\u00F6\u00DFe\: %2$d Byte
J9GC062=Wert %s muss eine Zweierpotenz sein.
J9GC061=Maximalgr\u00F6\u00DFe des Speichers f\u00FCr Objekte mit beschr\u00E4nkter Lebensdauer
J9GC064=Speicherbereich f\u00FCr alte Objekte konnte nicht reserviert werden.
J9GC063=Datei "%s" kann nicht f\u00FCr Schreibvorg\u00E4nge ge\u00F6ffnet werden.
J9GC066=Erforderliche geteilte Heapspeichergeometrie konnte nicht reserviert werden.
J9GC065=Speicherbereich f\u00FCr neue Objekte konnte nicht reserviert werden.
J9GC068=ScopedMemory.join/joinAndEnter unterbrochen
J9GC067=Geteilter Heapspeicher konnte nicht instanziiert werden\: %1$s (neue Gr\u00F6\u00DFe %2$zu%3$s, alte Gr\u00F6\u00DFe %4$zu%5$s)
SHRC470=%1$s - angeh\u00E4ngte Daten f\u00FCr %7$.*6$s.%3$.*2$s%5$.*4$s wurden aktualisiert
J9GC080=Die Systemkonfiguration unterst\u00FCtzt den Parameter '%.*s' in Option '-Xlp' nicht
J9GC082=Die f\u00FCr %1$s angeforderte Seitengr\u00F6\u00DFe %2$zu%3$s%4$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe; stattdessen wird %5$zu%6$s%7$s verwendet
J9GC081=\u00DCberz\u00E4hlige Kommas in der Option '-Xlp' gefunden - sie werden ignoriert
SHRC475=Keine Daten vorhanden
SHRC476=Daten bereits vorhanden
SHRC477=Kein Platz im Cache f\u00FCr %d Byte
SHRC478=Datenmenge %d gr\u00F6\u00DFer als verf\u00FCgbare %d
SHRC471=%1$s - angeh\u00E4ngte Daten konnten nicht aktualisiert werden f\u00FCr %8$.*7$s.%4$.*3$s%6$.*5$s, Ursache\:%2$s
SHRC472=Kein Zugriff auf Ressource
SHRC473=enterWriteMutex fehlgeschlagen
SHRC474=enterReadMutex fehlgeschlagen
SHRC479=Speicherzuordnung von %d Byte fehlgeschlagen
J9GC073=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s %3$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe; stattdessen wird %4$zu%5$s verwendet
J9GC072=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe; stattdessen wird %3$zu%4$s %5$s verwendet
J9GC075=Bei der Syntaxanalyse der Option '-Xlp' ist ein Fehler aufgetreten
J9GC074=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s %3$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe; stattdessen wird %4$zu%5$s %6$s verwendet
J9GC077=Die Systemkonfiguration unterst\u00FCtzt die angeforderte Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s %3$s nicht
J9GC076=Die Systemkonfiguration unterst\u00FCtzt die angeforderte Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s nicht
J9GC079=Die Option '%1$s' ist nicht vollst\u00E4ndig, Sie m\u00FCssen den Parameter '%2$s' angeben.
J9GC078='%1$s' ist nicht als erster Parameter in der Option '%2$s' angegeben
SHRC024=Fehler beim Freigeben des gemeinsam genutzten Speichers
SHRC025=Fehler beim Zuordnen des gemeinsam genutzten Speichers
SHRC026=Cache der angeforderten Gr\u00F6\u00DFe kann nicht erstellt werden\: SHMMAX- und SHMMIN-Einstellungen pr\u00FCfen
SHRC027=Name des gemeinsam genutzten Cache ist zu lang.
SHRC020=Beim \u00D6ffnen des Semaphors ist ein Fehler aufgetreten.
SHRC021=Ein unbekannter Fehlercode wurde zur\u00FCckgegeben.
SHRC022=Fehler beim Erstellen eines gemeinsam genutzten Speicherbereichs
SHRC023=Cache ist nicht vorhanden.
J9GC048=Inkrement f\u00FCr Speicherbereich f\u00FCr alte Objekte
J9GC047=Maximalgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr alte Objekte
J9GC049=Gr\u00F6\u00DFe f\u00FCr gemerkte Gruppe
SHRC028=Berechtigung verweigert.
SHRC029=System verf\u00FCgt nicht \u00FCber ausreichend Speicherkapazit\u00E4t
J9GC040=Unbekannte Option\: %s
J9GC042=Summe aus %1$s und %2$s ist zu klein f\u00FCr %3$s.
J9GC041=Unbekannter fvtest-Typ\: %s
J9GC044=Maximalgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr neue Objekte
J9GC043=Anfangsgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr neue Objekte
J9GC046=Anfangsgr\u00F6\u00DFe f\u00FCr Speicherbereich f\u00FCr alte Objekte
J9GC045=Anfangsgr\u00F6\u00DFe f\u00FCr Hauptspeicher
SHRC490=Erkennung eines besch\u00E4digten Cache f\u00FCr gemeinsam genutzte Klasse erzwingen
SHRC491=%1$s - angeh\u00E4ngte Daten konnten nicht gespeichert werden f\u00FCr %8$.*7$s.%4$.*3$s%6$.*5$s. Ursache\: %2$s
SHRC492=%1$s - angeh\u00E4ngte Daten konnten nicht aktualisiert werden f\u00FCr %8$.*7$s.%4$.*3$s%6$.*5$s, Ursache\: %2$s
J9GC060=Speicherbereichsgr\u00F6\u00DFe des Speichers f\u00FCr Objekte mit unbeschr\u00E4nkter Lebensdauer
SHRC013=Speicher des gemeinsam genutzten Cache "%s" konnte nicht entfernt werden.
SHRC497=Placeholder, not used
SHRC014=Semaphor des gemeinsam genutzten Cache "%s" konnte nicht entfernt werden.
SHRC498=Placeholder, not used
SHRC015=Fehler im Cache f\u00FCr gemeinsam genutzte Klasse\: Ung\u00FCltige Markierung
SHRC499=Placeholder, not used
SHRC016=Fehler im Cache f\u00FCr gemeinsam genutzte Klasse\:
SHRC493=%1$s - angeh\u00E4ngte Daten konnten nicht gefunden werden f\u00FCr %8$.*7$s.%4$.*3$s%6$.*5$s. Ursache\: %2$s
SHRC010=Gemeinsam genutzter Cache "%s" wird gel\u00F6scht.
SHRC494=%1$s - angeh\u00E4ngte Daten konnten nicht gefunden werden f\u00FCr Adresse 0x%2$p, Ursache\: %3$s
SHRC011=Fehler\: Cache f\u00FCr gemeinsam genutzte Klasse kann nicht ge\u00F6ffnet werden.
SHRC495=%1$s - angeh\u00E4ngte Daten konnten nicht gespeichert werden f\u00FCr Adresse 0x%2$p, Ursache\: %3$s
SHRC012=Gemeinsam genutzter Cache "%s" kann nicht entfernt werden, da dem Cache noch JVMs zugeordnet sind.
SHRC496=%1$s - angeh\u00E4ngte Daten konnten nicht aktualisiert werden f\u00FCr Adresse 0x%2$p, Ursache\: %3$s
J9GC059=-Xgcpolicy\:metronome ist nicht zul\u00E4ssig ohne "-Xrealtime".
J9GC058=Speicher f\u00FCr Objekte mit unbeschr\u00E4nkter Lebensdauer konnte nicht zugewiesen werden.
SHRC017=Fehlercode\: %d
SHRC018=Speicher kann nicht reserviert werden.
SHRC019=Anforderungsl\u00E4nge ist zu kurz.
J9GC051=Inkrement f\u00FCr RAM-Klassensegment
J9GC050=Ver\u00E4nderliches Speichermaximum
J9GC053=Maximaler Speicher
J9GC052=Inkrement f\u00FCr ROM-Klassensegment
J9GC055=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten
J9GC054=Gr\u00F6\u00DFe f\u00FCr gro\u00DFe Seiten %1$zu%2$s ist keine unterst\u00FCtzte Seitengr\u00F6\u00DFe; stattdessen wird %3$zu%4$s verwendet.
J9GC057=%1$s darf nicht gr\u00F6\u00DFer als %2$s sein.
J9GC056=Verf\u00FCgbare Gr\u00F6\u00DFen f\u00FCr gro\u00DFe Seiten\:
SHRC040=Namen des gemeinsam genutzten Cache angeben
SHRC041=Gemeinsam genutzten Cache l\u00F6schen (Namensparameter oder Standard verwenden)
SHRC046=Alle gemeinsam genutzten Caches und die zugeh\u00F6rigen Statistikdaten anzeigen
SHRC047=Zusammenfassung der Statistikdaten des Cache ausgeben
SHRC048=Alle Elemente im Cache auflisten
SHRC049=Debugmodus, der den gesamten eingehenden Bytecode pr\u00FCft
SHRC042=Alle gemeinsam genutzten Caches l\u00F6schen
SHRC043=Gemeinsame Nutzung von ge\u00E4ndertem Bytecode aktivieren \n \t<Ge\u00E4nderter Kontext> ist eine benutzerdefinierte Beschreibung des \u00C4nderungstyps. \n \tJVMs mit demselben <Ge\u00E4nderten Kontext> m\u00FCssen dieselben \u00C4nderungen verwenden.
SHRC044=OPTION_MODIFIED_EQUALS"<Ge\u00E4nderter Kontext>"
SHRC045=Caches l\u00F6schen, die <t> Minuten nicht verwendet wurden
J9GC026=-Xverbosegclog konnte keine internen Strukturen zuordnen.
J9GC025=Summe von %1$s und %2$s
J9GC028=Option zu gro\u00DF\: '%s'
J9GC027=Fehlerhafte Option\: '%s'
J9GC029=Optionsfehler\: '%s'
J9GC020=%s ist zu gro\u00DF f\u00FCr den Heapspeicher.
J9GC022=Summe aus %1$s und %2$s ist zu gro\u00DF f\u00FCr %3$s.
J9GC021=%1$s muss gleich %2$s sein.
J9GC024=Summe aus %1$s und %2$s ist zu gro\u00DF f\u00FCr Heapspeicher.
J9GC023=Summe aus %1$s und %2$s muss gleich %3$s sein.
SHRC030=Der Cache f\u00FCr gemeinsam genutzte Klassen, den Sie zuordnen, hat einen ung\u00FCltigen Header.
SHRC035=Lokales Zwischenspeichern von Klassenpfaden inaktiviert
SHRC036=Reduzieren von Konkurrenzsituationen durch gleichzeitigen Speicherzugriff inaktiviert
SHRC037=Teilaktualisierungen inaktiviert
SHRC038=Verwendung\:\n\njava -Xshareclasses[\:option,...]\n\n Eingeschlossene g\u00FCltige Optionen (mit einer kurzen Zusammenfassung) sind\:\n\n
SHRC031=Der Cache f\u00FCr gemeinsam genutzte Klasse, den Sie zuordnen, hat eine inkompatible JVM-Version.
SHRC032=Der Cache f\u00FCr gemeinsam genutzte Klasse, den Sie zuordnen, hat eine falsche Modifikationsstufe.
SHRC033=Sperren von lokalen Hashtabellen inaktiviert
SHRC034=\u00DCberpr\u00FCfung der Zeitmarke inaktiviert
J9GC037=%1$s wird nicht mit anderen Werten als %2$zu unterst\u00FCtzt.
J9GC036=Der Wert %1$s muss \u00FCber %2$zu liegen.
J9GC039=%1$s ist veraltet. Verwenden Sie stattdessen %2$s.
J9GC038=Der angegebene Wert %s ist zu gro\u00DF.
SHRC039=Allgemeine Hilfe zum gemeinsam genutzten Cache ausgeben
J9GC031=%1$s und %2$s k\u00F6nnen nicht gleichzeitig angegeben werden.
J9GC030=Der %1$s-Wert von %2$.2f muss mindestens %3$s kleiner sein als der %4$s-Wert von %5$.2f.
J9GC033=Der Wert %1$s muss zwischen %2$.2f und %3$.2f (einschlie\u00DFlich) liegen.
J9GC032=Systemkonfiguration unterst\u00FCtzt Option "%s" nicht.
J9GC035=Auf %s muss eine Zahl folgen.
J9GC034=Der Wert %1$s muss zwischen %2$zu und %3$zu (einschlie\u00DFlich) liegen.
SHRC060=Speicher f\u00FCr Zeichenfolgepuffer in shrinit\:\:hookFindSharedClass kann nicht reserviert werden.
SHRC061=Cachename darf nicht l\u00E4nger als 64 Zeichen sein. Cache wurde nicht erstellt.
SHRC062=Fehler beim Kopieren des Benutzernamens in den Cache-Standardnamen
SHRC063=Speicher f\u00FCr sharedClassConfig in shrinit kann nicht reserviert werden.
SHRC068=Lokales Zwischenspeichern von Klassenpfaden inaktiviert
SHRC069=Reduzieren von Konkurrenzsituationen durch gleichzeitigen Speicherzugriff inaktiviert
SHRC064=configMonitor in shrinit kann nicht erstellt werden.
SHRC065=Pool in shrinit kann nicht zugeordnet werden.
SHRC066=Sperren von lokalen Hashtabellen inaktiviert
SHRC067=\u00DCberpr\u00FCfung der Zeitmarke inaktiviert
J9GC004=Globaler Garbage-Collector konnte nicht instanziiert werden.
J9GC003=Task-Dispatcher konnte nicht instanziiert werden.
J9GC006=Initialisierung ist fehlgeschlagen; Nicht gen\u00FCgend Speicherkapazit\u00E4t
J9GC005=Initialisierung ist fehlgeschlagen.
J9GC008=Modulerweiterungen konnten nicht initialisiert werden.
J9GC007=Initialisierung ist fehlgeschlagen; Befehlszeile konnte nicht syntaktisch analysiert werden.
J9GC009=Mutex f\u00FCr GC-Statistik konnte nicht initialisiert werden.
J9GC000=Interner Fehler; Nicht gen\u00FCgend Speicherkapazit\u00E4t
J9GC002=Instanziieren des Heapspeichers ist fehlgeschlagen; %1$zu%2$s erforderlich
J9GC001=Heapspeicher konnte nicht instanziiert werden.
SHRC050=Ausf\u00FChrliche Ausgabe aktivieren
SHRC051=Dynamische Aktualisierungen inaktivieren
SHRC052=Lokales Zwischenspeichern von Klassenpfaden inaktivieren
SHRC057=Falsche Parameter f\u00FCr Ablaufoption
SHRC058=Speicher f\u00FCr ClasspathItem in shrinit\:\:hookStoreSharedClass kann nicht reserviert werden.
SHRC059=Speicher f\u00FCr ClasspathItem in shrinit\:\:hookFindSharedClass kann nicht reserviert werden.
SHRC053=Sperren von lokalen Hashtabellen inaktivieren
SHRC054=Algorithmus zur Reduzierung von Speicherkonkurrenzsituationen inaktivieren
SHRC055=Cache-Teilaktualisierungen inaktivieren
SHRC056=Befehlszeilenoption "%s" nicht erkannt
J9GC015=Standardspeicherbereich konnte nicht zugeordnet werden.
J9GC014=VM-Klassenspeichersegmente konnten nicht zugeordnet werden.
J9GC017=%1$s ist zu klein; muss mindestens %2$zu %3$sbytes gro\u00DF sein.
J9GC016=Noch aktives Segment konnte im Standardspeicherbereich nicht zugeordnet werden.
J9GC019=%1$s ist zu gro\u00DF f\u00FCr %2$s.
J9GC018=%1$s ist zu klein f\u00FCr %2$s.
J9GC011=Pool von Speicherbereichen konnte nicht initialisiert werden.
J9GC010=Fertigstellungsverwaltung konnte nicht initialisiert werden.
J9GC013=VM-Objektspeichersegmente konnten nicht zugeordnet werden.
J9GC012=VM-Speichersegmente konnten nicht zugeordnet werden.
