#Thu Jan 21 02:08:19 CST 2021
EXEL070=La imatge ROM \u00E9s una d'una versi\u00F3 err\u00F2nia
EXEL079=\  -Xscmx<x>       estableix la mida de la nova mem\u00F2ria cau de classes compartides en <x>
J9VM151=No s'ha pogut obrir la biblioteca jimage
J9VM150=-Xscsoftmx s'ignora si no s'especifica -Xshareclasses
J9VM153=S'est\u00E0 canviant al lector jimage intern perqu\u00E8 la JVM no pot utilitzar la biblioteca jimage
EXEL071=No s'ha pogut trobar el nom de classe principal
J9VM152=No s'ha pogut cercar el s\u00EDmbol %s a la biblioteca jimage
EXEL072=Error d'engegada de VM\: sense mem\u00F2ria
J9VM155=Valor erroni per a -Xpatch; el cam\u00ED d'acc\u00E9s del peda\u00E7 no s'ha especificat a la propietat %s\=%s.
EXEL073=Error intern de VM\: no s'ha pogut crear la VM de Java
J9VM154=Valor erroni per a -Xpatch; no s'ha especificat el valor de la propietat %s.
EXEL074=
J9VM157=La classe %2$.*1$s(%3$s) no pot accedir a la classe %5$.*4$s(%6$s) perqu\u00E8 %3$s no llegeix el m\u00F2dul %6$s
EXEL075=\  -Xquickstart    millora el temps d'engegada gr\u00E0cies a les optimitzacions de retards
J9VM156=-XX\:SharedCacheHardLimit s'ignora si no s'ha especificat -Xshareclasses
EXEL076=JIT  - %s\n
J9VM159=Error\: %s necessita l'especificaci\u00F3 del cam\u00ED d'acc\u00E9s del m\u00F2dul.
EXEL077=\  -Xssi<x>        estableix l'increment de pila de fils java en <x>
J9VM158=La classe %2$.*1$s(%3$s) no pot accedir a la classe %5$.*4$s(%6$s) perqu\u00E8 el m\u00F2dul %6$s no exporta el paquet %7$s al m\u00F2dul %3$s.
EXEL078=\  -Xshareclasses[\:opcions] permet compartir dades de classe (utilitzar l'ajuda per veure detalls)\n
J9VM149=%s ja no s'admet. Afegiu les biblioteques o fitxers jar necessaris a la classpath.
EXEL068=Error intern de VM\: no s'ha pogut establir l'element de la matriu per %s
EXEL069=No s'ha pogut trobar la imatge ROM
J9VM140=L'emissor no \u00E9s anotat com a @sun.reflect.CallerSensitive.
J9VM142=L'opci\u00F3 -Xrealtime de l\u00EDnia d'ordres no se suporta en aquesta versi\u00F3 de l'IBM SDK
EXEL060=Error intern de VM\: no s'ha pogut crear la matriu de bytes per al nom de classe %s
J9VM141=m\u00E8todes per defecte en conflicte per '%2$.*1$s%4$.*3$s' in %6$.*5$s de classes [%7$s]
EXEL061=Error intern de VM\: no s'ha pogut crear java/lang/String per al nom de classe %s
J9VM144=massa par\u00E0metres\: 255 + 1
EXEL062=Error intern de VM\: s'ha exhaurit la mem\u00F2ria en convertir la cadena a car\u00E0cters UTF per al nom de classe %s
J9VM143=L'opci\u00F3 %s de l\u00EDnia d'ordres no s'admet en aquesta versi\u00F3 de l'IBM SDK.
EXEL063=La classe %s no implementa main()
J9VM146=invokeinterface del m\u00E8tode no p\u00FAblic '%4$.*3$s%6$.*5$s' in %2$.*1$s
EXEL064=El m\u00E8tode main s'ha de declarar p\u00FAblic, est\u00E0tic i nul.
J9VM145=%s no s'admet al z/OS.
EXEL065=Error intern de VM\: no s'ha pogut crear la matriu d'arguments
J9VM148=%s ja no s'admet. El mecanisme d'alteraci\u00F3 temporal endorsed-standards nom\u00E9s s'admet a trav\u00E9s dels m\u00F2duls actualitzables.
EXEL066=Error intern de VM\: no s'ha pogut crear la matriu de bytes per a l'argument %s
J9VM147=No es pot adjuntar el fil actual.
EXEL067=Error intern de VM\: no s'ha pogut crear java/lang/String per a l'argument %s
SMAP000=
EXEL090=\  -Xscmaxaot<x>   defineix l'espai m\u00E0xim de mem\u00F2ria cau de classes compartides perm\u00E8s per a les dades AOT en <x>
EXEL091=\n  -Xcheck[\:opci\u00F3[\:...]]  controla la comprovaci\u00F3; utilitzeu -Xcheck\:help per obtenir-ne m\u00E9s informaci\u00F3 detallada
EXEL092=\n  -Xdump[\:opci\u00F3,...]  controla els abocaments de mem\u00F2ria; utilitzeu -Xdump\:help per obtenir-ne m\u00E9s informaci\u00F3 detallada
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP005=
J9VM171=S'ha intentat definir el camp final d'inst\u00E0ncia %2$.*1$s.%4$.*3$s a partir del m\u00E8tode "%6$.*5$s" que no \u00E9s <init>
J9VM170=S'ha intentat definir el camp final est\u00E0tic %2$.*1$s.%4$.*3$s a partir del m\u00E8tode "%6$.*5$s" que no \u00E9s <clinit>
J9VM173=La classe %2$.*1$s i l'amfitri\u00F3 d'imbricaci\u00F3 %4$.*3$s han de tenir el mateix paquet.
J9VM172=La classe %2$.*1$s i l'amfitri\u00F3 d'imbricaci\u00F3 %4$.*3$s han de tenir el mateix carregador de classes.
J9VM175=No s'ha pogut carregar la biblioteca %1$s que necessita el m\u00F2dul\: %2$s
EXEL093=Les opcions seg\u00FCents controlen la configuraci\u00F3 global de la VM\:
J9VM174=La classe %2$.*1$s l'ha de reclamar l'amfitri\u00F3 d'imbricaci\u00F3 %4$.*3$s
EXEL094=\  -Xcompressedrefs              utilitza les refer\u00E8ncies d'emmagatzematge din\u00E0mic comprimides
J9VM177=La classe %2$.*1$s ha de poder carregar l'amfitri\u00F3 d'imbricaci\u00F3 %4$.*3$s.
EXEL095=\  -Xrealtime                    habilita les extensions en temps real
J9VM176=Violaci\u00F3 de la restricci\u00F3 en sobreescriure el m\u00E8tode "%2$.*1$s.%4$.*3$s%6$.*5$s" durant la creaci\u00F3 de la classe "%18$.*17$s"\: el carregador "%8$.*7$s@%9$x" de la classe "%11$.*10$s" i el carregador "%13$.*12$s@%14$x" de la classe "%16$.*15$s" tenen diferents tipus per a la signatura de m\u00E8tode
EXEL096=\  -Xgcpolicy\:metronome          habilita les extensions en temps real
J9VM179=El m\u00F2dul no t\u00E9 nom.
EXEL097=\  -Xrealtime                    habilita el temps real lleu
J9VM178=El m\u00F2dul \u00E9s nul.
EXEL098=\  -Xgcpolicy\:metronome          habilita el temps real lleu
EXEL099=\  -Xrealtime -Xnortsj           habilita el temps real lleu
EXEL080=Versi\u00F3 de Java "%s"
EXEL081=Versi\u00F3 de Java "%1$s/%2$s"
J9VM160=Error\: %s necessita que s'especifiquin els m\u00F2duls.
J9VM162=\ta %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s)
J9VM161=\ta %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s\:%9$u)
J9VM164=\ta %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s)
EXEL082=\  -Xlp<x>         defineix la mida de p\u00E0gina gran en <x>
J9VM163=\ta %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s\:%8$u)
EXEL083=No s'ha pogut obrir el fitxer\: %s
J9VM166=\ta %2$.*1$s.%4$.*3$s (%5$.*6$s)
EXEL084=No es pot fer una c\u00F2pia de seguretat del fitxer\: %s
J9VM165=\ta %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
EXEL085=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nADVERTIMENT\: Utilitzeu "-jxe <path>" com a alternativa.\n
J9VM168=
EXEL086=\n  -Xtrace[\:opci\u00F3,...]  controla la tra\u00E7a; utilitzeu -Xtrace\:help per obtenir-ne m\u00E9s informaci\u00F3 detallada
J9VM167=No s'admeten les optimitzacions GC inactives
EXEL087=\  -Xjni\:<opcions>               defineix les opcions de JNI
EXEL088=
J9VM169=
EXEL089=\  -Xscminaot<x>   defineix l'espai m\u00EDnim de mem\u00F2ria cau de classes compartides reservat per a les dades AOT en <x>
J9VM117=-Xitsn s'ignora si no s'ha especificat -Xshareclasses
J9VM116=noLockword\:%.*s
J9VM119=-Xscmaxjit s'ignora si no s'ha especificat -Xshareclasses
J9VM118=-Xscminjit s'ignora si no s'especifica -Xshareclasses
J9VM111=S'ha especificat una opci\u00F3 lockword no v\u00E0lida\: %s
J9VM110=S'ha especificat un mode lockword no v\u00E0lid\: %s
J9VM113=-----------------------------
J9VM112=Configuraci\u00F3 de Lockword
J9VM115=lockword\:%.*s
J9VM114=Mode Lockword\=%s
J9VM106=Les opcions info, warn, error, vital i config es poden combinar amb una ',', per exemple\: \n
J9VM105=-Xsyslog\:config            Registra missatges de configuraci\u00F3 de la JVM. \n
J9VM108=-Xsyslog\:info,warn,error\n
J9VM107=-Xsyslog\:error,warn
J9VM109=Sistema operatiu no adm\u00E8s (%s)\: Cal utilitzar Windows XP o posterior.
J9VM100=-Xsyslog\:all               Registra tots els missatges de la JVM.
J9VM102=-Xsyslog\:warn              Registra els missatges d'av\u00EDs de la JVM.
J9VM101=-Xsyslog\:info              Registra els missatges informatius de la JVM.
J9VM104=-Xsyslog\:vital             Registra missatges vitals de la JVM. Aquesta opci\u00F3 est\u00E0 activada per defecte.
J9VM103=-Xsyslog\:error             Registra missatges d'error de la JVM. Aquesta opci\u00F3 est\u00E0 activada per defecte.
J9VM139=
J9VM138=
J9VM131=El proc\u00E9s ha finalitzat mitjan\u00E7ant CEE3AB2() amb el fi de tasca anormal %1$u, ra\u00F3 %2$u, neteja %3$u.
J9VM130=Execuci\u00F3 represa de l'aplicaci\u00F3 despr\u00E9s de manipular una condici\u00F3 que no es pot recuperar i que s'ha retornat a Java de manera no permesa o que s'ha recorregut (codi JIT'ed)
J9VM133=S'ha configurat l'ulimit permanent de la mida del fitxer d'abocament del nucli del sistema en %d, els abocaments de mem\u00F2ria del sistema poden estar truncats.
J9VM132=S'ha especificat un mode de paraula de bloqueig no v\u00E0lid, java/lang/Class i java/lang/String no poden tenir paraules de bloqueig quan -Xtenant est\u00E0 present\: %s
J9VM135=/proc/sys/kernel/core_pattern par\u00E0metre "%s" especifica que cal connectar els abocaments de mem\u00F2ria principal a un programa extern. Potser que la JVM no pugui ubicar abocaments de mem\u00F2ria principal ni canviar-los el nom.
J9VM134=S'ha configurat l'opci\u00F3 fullcore del sistema en FALSE, els abocaments de mem\u00F2ria del sistema poden estar truncats.
J9VM137=La classe %2$.*1$s t\u00E9 valors per defecte en conflicte en el m\u00E8tode %4$.*3$s%6$.*5$s
J9VM136=/proc/sys/kernel/core_pattern par\u00E0metre "%s" especifica una cadena de format per canviar el nom dels abocaments de mem\u00F2ria principal. Potser que la JVM no pugui ubicar abocaments de mem\u00F2ria principal ni canviar-los el nom.
J9VM128=Espai d'emmagatzematge din\u00E0mic Java
J9VM127=La mida inicial del subassignador de 32 bits no es pot configurar en zero.
J9VM129=L'execuci\u00F3 repr\u00E8n de l'aplicaci\u00F3 despr\u00E9s de manipular una condici\u00F3 que no es pot recuperar i s'ha retornat a Java de manera no permesa o s'ha recorregut a Java
J9VM120=-Xscminjitdata s'ignora si no s'especifica -Xshareclasses
J9VM122=No es pot obtenir l'interval d'adreces user32.dll necessari per a -Xprotectcontiguous.
J9VM121=-Xscmaxjitdata s'ignora si no s'ha especificat -Xshareclasses
J9VM124=No es pot definir la classe %.*s - '%.*s' \u00E9s un paquet de sistema protegit
J9VM123=S'est\u00E0 provant d'executar en un processador no adm\u00E8s, la JVM finalitzar\u00E0.
J9VM126=La mida de la confirmaci\u00F3 del subassignador de 32 bits no es pot configurar en zero.
J9VM125=La mida de la confirmaci\u00F3 del subassignador de 32 bits \u00E9s m\u00E9s gran que la mida inicial. Mida de la confirmaci\u00F3 \= %1$u, mida inicial \= %2$u.
SHRC802=La mem\u00F2ria cau est\u00E0 plena al %1$d%%\n
SHRC803=Habilita la protecci\u00F3 de mem\u00F2ria de p\u00E0gines emplenades parcialment a l'inici.
SHRC804=La JVM ha habilitat la protecci\u00F3 de p\u00E0gines parcials de la mem\u00F2ria cau compartida a l'inici, ja que la mem\u00F2ria cau compartida existent s'ha creat amb la protecci\u00F3 de p\u00E0gines parcials habilitada a l'inici.
SHRC805=La JVM no ha habilitat la protecci\u00F3 de p\u00E0gines emplenades parcialment de la mem\u00F2ria cau durant l'inici.
SHRC800=La mem\u00F2ria cau compartida \u00E9s plena. L'espai AOT/de dades JIT m\u00EDnim reservat mi m\u00E0xim perm\u00E8s i el l\u00EDmit de softmx ja no es poden ajustar.
SHRC801=Bytes softmx                        %*c\= %d
SHRC806=S'ha destru\u00EFt la mem\u00F2ria cau compartida persistent de refer\u00E8ncies comprimides "%1$s". Utilitzeu l'opci\u00F3 -Xnocompressedrefs si voleu destruir una mem\u00F2ria cau de refer\u00E8ncies no comprimides.
SHRC807=S'ha destru\u00EFt la mem\u00F2ria cau compartida persistent de refer\u00E8ncies no comprimides "%1$s". Utilitzeu l'opci\u00F3 -Xcompressedrefs si voleu destruir una mem\u00F2ria cau de refer\u00E8ncies comprimides.
SHRC808=S'ha destru\u00EFt la mem\u00F2ria cau compartida de refer\u00E8ncies comprimides "%s". Utilitzeu l'opci\u00F3 -Xnocompressedrefs si voleu destruir una mem\u00F2ria cau de refer\u00E8ncies no comprimides.
SHRC809=S'ha destru\u00EFt la mem\u00F2ria cau compartida de refer\u00E8ncies no comprimides "%s". Utilitzeu l'opci\u00F3 -Xcompressedrefs si voleu destruir una mem\u00F2ria cau de refer\u00E8ncies comprimides.
DUMP001=Incid\u00E8ncia d'abocament de mem\u00F2ria no reconeguda\: ...%s
DUMP000=Opci\u00F3 d'abocament de mem\u00F2ria no reconeguda\: -Xdump\:%s
DUMP003=Agent d'abocament de mem\u00F2ria no reconegut\: %s
DUMP002=Testimoni no reconegut\: %%%1$c
DUMP012=Error a l'abocament de mem\u00F2ria de %1$s\: %2$s
DUMP011=L'abocament de mem\u00F2ria de %1$s ha creat el proc\u00E9s %2$d
DUMP014=Acci\u00F3 de VM no reconeguda\: ...%s
DUMP013=S'ha processat la incid\u00E8ncia d'abocament de mem\u00F2ria "%1$s", detall "%3$.*2$s".
DUMP010=L'abocament de mem\u00F2ria de %1$s s'ha escrit a %2$s
SHRC824=STARTUP HINTS DETAIL Flags\: %1$zu DATA1\: %2$zu DATA2\: %3$zu
DUMP009=Abocament de mem\u00F2ria de %s no disponible
SHRC825=\t startuphint       Imprimeix nom\u00E9s els tipus de hint d'inici a la mem\u00F2ria cau compartida.
DUMP008=\u00FAs de '%s'
SHRC826=Bytes de hint d'inici                  %*c\= %d
SHRC827=\# Hints d'inici                     %*c\= %d
SHRC820=Inhabilita l'emmagatzematge en mem\u00F2ria cau de les classes carregades pel carregador de classes de bootstrap.
DUMP005=Falta una eina externa
SHRC821=Inhabilita l'emmagatzematge en mem\u00F2ria cau de les classes carregades pel carregador de classes no bootstrap. Aquesta opci\u00F3 tamb\u00E9 activa l'opci\u00F3 "nonfatal".
DUMP004=Falta el nom de fitxer
SHRC822=No inicieu la mem\u00F2ria cau compartida si es produeix un error.
DUMP007=La JVM est\u00E0 sol\u00B7licitant l'abocament de mem\u00F2ria de %1$s amb '%2$s'
SHRC823=%1$d\: 0x%2$p STARTUP HINTS KEY\: %4$.*3$s Address\: 0x%5$p Size\: %6$d
DUMP006=S'est\u00E0 processant la incid\u00E8ncia d'abocament de mem\u00F2ria "%1$s", detall "%3$.*2$s"; espereu.
SHRC828=El cam\u00ED d'acc\u00E9s del directori de la mem\u00F2ria cau \u00E9s massa llarg.
SHRC829=No s'ha pogut utilitzar l'inici de l'usuari com a directori de mem\u00F2ria cau compartit per defecte. No es pot obtenir el directori d'inici. Definiu un altre directori a trav\u00E9s de la variable d'entorn "HOME" o de l'opci\u00F3 de la l\u00EDnia d'ordres "cacheDir\=", o corregiu el directori d'inici a l'entrada del fitxer de la contrasenya.
DUMP023=La preparaci\u00F3 d'emmagatzematge din\u00E0mic sol\u00B7licitada no s'ha efectuat perqu\u00E8 no s'ha sol\u00B7licitat acc\u00E9s exclusiu o no s'ha pogut obtenir.
DUMP022=La compactaci\u00F3 d'emmagatzematge din\u00E0mic sol\u00B7licitada no s'ha efectuat perqu\u00E8 no s'ha sol\u00B7licitat acc\u00E9s exclusiu o no s'ha pogut obtenir.
DUMP025=Error d'IEATDUMP per al DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=S'han sol\u00B7licitat diversos heapdumps, per\u00F2 falta %%id a l'etiqueta de fitxer\: els abocaments de mem\u00F2ria se sobreescriuran.
DUMP021=El heapdump sol\u00B7licitat no s'ha generat perqu\u00E8 no s'ha sol\u00B7licitat acc\u00E9s exclusiu o no s'ha pogut obtenir.
DUMP020=L'abocament de mem\u00F2ria de %s s'ha escrit
SHRC813=Bytes totals no emmagatzemats perqu\u00E8 el valor de -Xscsoftmx \u00E9s %u. Bytes AOT no emmagatzemats perqu\u00E8 el valor de -Xscmaxaot \u00E9s %u. Bytes JIT no emmagatzemats perqu\u00E8 el valor de -Xscmaxjitdata \u00E9s %u.
SHRC814=\t stale           Imprimeix totes les entrades obsoletes de la mem\u00F2ria cau compartida.
DUMP019=La JVM est\u00E0 sol\u00B7licitant un abocament de mem\u00F2ria de %s
SHRC815=Bytes obsolets                        %*c\= %u
SHRC816=El valor de %s \u00E9s superior a la mida de la mem\u00F2ria cau compartida, per tant, s'ha definit en el mateix valor que la mida de la mem\u00F2ria cau compartida.
DUMP016=S'est\u00E0 avortant\: No es pot crear el fitxer (%s)
SHRC810=S'ha destru\u00EFt la instant\u00E0nia de la mem\u00F2ria cau compartida de refer\u00E8ncies comprimides "%s". Utilitzeu l'opci\u00F3 -Xnocompressedrefs si voleu destruir una instant\u00E0nia de mem\u00F2ria cau de refer\u00E8ncies no comprimides.
DUMP015=S'est\u00E0 avortant\: No es pot obrir o llegir (%s)
SHRC811=S'ha destru\u00EFt la instant\u00E0nia de la mem\u00F2ria cau compartida de refer\u00E8ncies no comprimides "%s". Utilitzeu l'opci\u00F3 -Xcompressedrefs si voleu destruir una instant\u00E0nia de mem\u00F2ria cau de refer\u00E8ncies comprimides.
DUMP018=L'esdeveniment sol\u00B7licitat no est\u00E0 disponible\: executeu-lo amb l'indicador -Xdump\:dynamic
SHRC812=Funci\u00F3                              \= %s
DUMP017=S'est\u00E0 avortant\: No es pot comprimir el fitxer (%s)
SHRC817=El valor de %s \u00E9s superior a la mida de la mem\u00F2ria cau compartida, per tant, s'ha definit com a il\u00B7limitat.
SHRC818=Bytes totals no emmagatzemats perqu\u00E8 el valor de la mem\u00F2ria cau m\u00E0xima compartida \u00E9s %u. Bytes AOT no emmagatzemats perqu\u00E8 el valor de -Xscmaxaot \u00E9s %u. Bytes JIT no emmagatzemats perqu\u00E8 el valor de -Xscmaxjitdata \u00E9s %u.
SHRC819=No s'ha pogut iniciar la mem\u00F2ria cau compartida. La mem\u00F2ria cau compartida existent es va crear amb una compilaci\u00F3 de la JVM diferent i no coincideix amb la JVM que s'est\u00E0 executant.
SHRC840=No s'ha pogut iniciar la mem\u00F2ria cau compartida.
SHRC841=Especifiqueu el n\u00F9mero de la capa superior. Creeu una nova capa de mem\u00F2ria cau compartida si la capa especificada no existeix.
SHRC846=\nEstad\u00EDstiques actuals per a la capa superior de la mem\u00F2ria cau "%s"\: \n
SHRC847=capa de mem\u00F2ria cau                         %*.c\= %d
SHRC848=\nEstad\u00EDstiques actuals per a totes les capes de la mem\u00F2ria cau "%s"\: \n
J9VM191=%2$.*1$s no \u00E9s visible
SHRC849=Imprimiu el resum de les estad\u00EDstiques de la mem\u00F2ria cau nom\u00E9s des de la capa superior. Utilitzeu printTopLayerStats\=help per veure les opcions disponibles.
J9VM190=Superclasse %2$.*1$s no pot ser una interf\u00EDcie
SHRC842=Creeu una nova capa de mem\u00F2ria cau compartida.
J9VM193=A partir del Java 13 -Xverify\:none i -noverify han quedat en des\u00FAs i s'han d'eliminar i \u00E9s possible que no s'acceptin m\u00E9s endavant.
SHRC843=N\u00FAmero de capa (%d) no v\u00E0lid detectat per a "%s". El n\u00FAmero de capa hauria de ser inferior a %d.
J9VM192=%2$.*1$s no \u00E9s una interf\u00EDcie
SHRC844=N\u00FAmero capa no v\u00E0lid (%d). La capa superior existent \u00E9s %d. El n\u00FAmero de la capa nova hauria de ser %d.
J9VM195=La matriu del paquet \u00E9s nul\u00B7la.
SHRC845=No comprovis l'espai de disc lliure abans de crear la mem\u00F2ria cau persistent.
J9VM194=Relaci\u00F3 de c\u00E0rrega de classes no v\u00E0lida per a l'element subordinat\: %2$.*1$s, pare\: %4$.*3$s
J9VM197=%1$s no s'admet amb %2$s.
J9VM196=La cadena del paquet \u00E9s nul\u00B7la.
J9VM199=La classe %2$.*1$s no pot heretar de la seva super interf\u00EDcie segellada.
J9VM198=La classe %2$.*1$s no pot heretar de la seva super classe segellada.
SHRC830=No s'ha pogut utilitzar l'inici de l'usuari com a directori de mem\u00F2ria cau compartit per defecte. El cam\u00ED d'acc\u00E9s \u00E9s massa llarg. No es pot obtenir el directori d'inici. Definiu un altre directori a trav\u00E9s de la variable d'entorn "HOME" o de l'opci\u00F3 de la l\u00EDnia d'ordres "cacheDir\=", o corregiu el directori d'inici a l'entrada del fitxer de la contrasenya.
SHRC835=Comproveu les marques hor\u00E0ries del fitxer jar/zip de l'URL a cada c\u00E0rrega de classe.
SHRC836=Destrueix totes les capes de mem\u00F2ria cau compartides amb el mateix nom (utilitza el par\u00E0metre name o el valor per defecte)
SHRC837=No s'ha pogut assignar un descriptor de mem\u00F2ria cau
J9VM180=El nom del m\u00F2dul no \u00E9s v\u00E0lid.
SHRC838=No s'ha pogut iniciar la mem\u00F2ria cau compartida. S'ha detectat una modificaci\u00F3 a una mem\u00F2ria cau compartida de capa inferior. L'ID de mem\u00F2ria cau \u00FAnic esperat \u00E9s %s
SHRC831=No s'ha pogut utilitzar l'inici de l'usuari com a directori de mem\u00F2ria cau compartit per defecte. \u00C9s a un sistema de fitxers de xarxa. No es pot obtenir el directori d'inici. Definiu un altre directori a trav\u00E9s de la variable d'entorn "HOME" o de l'opci\u00F3 de la l\u00EDnia d'ordres "cacheDir\=", o corregiu el directori d'inici a l'entrada del fitxer de la contrasenya.
J9VM182=Nom\u00E9s el bootstrap o el carregador de classes de la plataforma pot definir el paquet java o java.*.
SHRC832=No s'ha pogut utilitzar l'inici de l'usuari com a directori de mem\u00F2ria cau compartit per defecte. El codi d'error \u00E9s %1$d.
J9VM181=Nom\u00E9s el carregador de classes de bootstrap pot definir el m\u00F2dul java.base.
SHRC833=No s'ha pogut assignar la mem\u00F2ria nativa per obtenir el directori de la mem\u00F2ria cau compartida.
J9VM184=classe err\u00F2nia %2$.*1$s\: el camp d'inst\u00E0ncia Qtype no \u00E9s un tipus de valor
SHRC834=Minimitzeu la marca hor\u00E0ria comprovant els fitxers jar/zip de l'URL.
J9VM183=El membre imbricat %2$.*1$s ha de poder carregar l'amfitri\u00F3 d'imbricaci\u00F3 %4$.*3$s
J9VM186=tipus d'objecte erroni %2$.*1$s\: l'objecte de la pila no \u00E9s un tipus de valor
J9VM185=classe err\u00F2nia %2$.*1$s\: classref no \u00E9s un tipus de valor
J9VM188=No es pot crear un fil\: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 0x%4$x
J9VM187=tipus d'objecte erroni %2$.*1$s\: l'objecte sincronitzat \u00E9s un tipus de valor
SHRC839=No s'ha pogut iniciar la mem\u00F2ria cau compartida. S'ha produ\u00EFt un error en obtenir l'ID \u00FAnic d'una mem\u00F2ria cau de prerequisit d'una capa inferior.
J9VM189=Superclasse final %2$.*1$s no es pot ampliar
SHRC850=Opcions disponibles per a -Xshareclasses\:%1$s<options>. Utilitzeu '+' per especificar diverses opcions. \u00C9s a dir, %2$saot+url \n
SHRC851=Desactiva la comprovaci\u00F3 de marca hor\u00E0ria quan es troben classes a la mem\u00F2ria cau compartida. Les classes obsoletes es poden carregar des de la mem\u00F2ria cau compartida.
SHRC852=La capa superior (capa %d) de la mem\u00F2ria cau es destrueix. S'ha detectat una modificaci\u00F3 a la capa %d de la mem\u00F2ria cau compartida. L'ID \u00FAnic de mem\u00F2ria cau esperat \u00E9s %s, l'ID \u00FAnic de mem\u00F2ria cau actual \u00E9s %s.
SHRC853=Caracter\u00EDstiques de processador      \= %s
VRFY007=M\u00E8tode final alterat temporalment
VRFY008=L'\u00EDndex de matriu no \u00E9s un enter
VRFY009=Matriu amb tipus no compatible
SHRC761=No s'ha pogut definir el perm\u00EDs d'acc\u00E9s a grup segons s'ha sol\u00B7licitat amb l'opci\u00F3 secund\u00E0ria 'groupAccess' al fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida.
VRFY000=%1$s; classe\=%3$.*2$s, m\u00E8tode\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC762=S'ha produ\u00EFt un error en obtenir les estad\u00EDstiques del fitxer de la mem\u00F2ria cau de classes compartides mentre se'n comprovava el perm\u00EDs d'acc\u00E9s del grup.
VRFY001=%1$s; classe\=%3$.*2$s, m\u00E8tode\=%5$.*4$s%7$.*6$s
SHRC763=Totes les opcions secund\u00E0ries de classes compartides en total no han de tenir m\u00E9s de %u car\u00E0cters.
VRFY002=Seq\u00FC\u00E8ncia de codi de bytes no v\u00E0lida
SHRC764=No es pot crear la mem\u00F2ria compartida de %1$d bytes de mida segons s'ha sol\u00B7licitat \n  \tS'ha ajustat a la mem\u00F2ria compartida m\u00E0xima permesa (%2$d bytes) \n  \t(Per augmentar la mem\u00F2ria compartida disponible, modifique el valor SHMMAX del sistema) \n  \t Si s'utilitza -Xscdmx, l'\u00E0rea d'atribut de depuraci\u00F3 s'ajusta de manera proporcional \n  \t segons la relaci\u00F3 original al valor -Xscmx.
VRFY003=La classe no cont\u00E9 dades de preverificaci\u00F3
VRFY004=La col\u00B7locaci\u00F3 a la mateixa l\u00EDnia de jsr ha trobat massa jsrs
VRFY005=Local amb tipus no compatible
VRFY006=La mida de matriu nova no \u00E9s un enter
SHRC760=No s'ha pogut definir el perm\u00EDs d'acc\u00E9s a grup segons s'ha sol\u00B7licitat amb l'opci\u00F3 secund\u00E0ria 'groupAccess' al fitxer de control de mem\u00F2ria compartida associat a la mem\u00F2ria cau de classe compartida.
SHRC769=La JVM ha habilitat la protecci\u00F3 de p\u00E0gines parcials de la mem\u00F2ria cau compartida, ja que la mem\u00F2ria cau compartida existent s'ha creat amb la protecci\u00F3 de p\u00E0gines parcials habilitada.
SHRC765=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gines de mem\u00F2ria en les dades d'execuci\u00F3, en les dades de lectura/escriptura de les cadenes i en les p\u00E0gines emplenades parcialment
SHRC766=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gines de mem\u00F2ria en les dades d'execuci\u00F3 i en les p\u00E0gines emplenades parcialment
SHRC767=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gines de mem\u00F2ria en les dades d'execuci\u00F3 i en les dades de lectura/escriptura de les cadenes
SHRC768=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gines de mem\u00F2ria en les dades d'execuci\u00F3
VRFY018=S'ha superat la pila m\u00E0xima
VRFY019=La c\u00E0rrega de classes ha fallat
VRFY010=Diversos jsrs utilitzen un \u00FAnic retorn
SHRC750=Cap m\u00E8tode AOT coincideix amb les especificacions de m\u00E8tode.
VRFY011=El par\u00E0metre lookupswitch no \u00E9s un enter
SHRC751=No s'han pogut analitzar les especificacions de m\u00E8tode. No es permeten m\u00E9s de %d especificacions de m\u00E8tode.
VRFY012=Forma de pila incoherent
SHRC752=No s'han pogut analitzar les especificacions de m\u00E8tode.
VRFY013=S'ha violat una restricci\u00F3 de c\u00E0rrega de classes
SHRC753=No s'ha pogut obtenir el mutex d'escriptura de la mem\u00F2ria cau.
VRFY014=Codi de bytes de retorn incompatible amb el tipus de retorn
VRFY015=Diversos retorns per a un sol jsr
VRFY016=El par\u00E0metre de codi de bytes de despla\u00E7ament no \u00E9s un enter
VRFY017=<init> no crida aquest <init> o s\u00FAper <init>
SHRC758=No s'ha pogut definir el perm\u00EDs d'acc\u00E9s a grup segons s'ha sol\u00B7licitat amb l'opci\u00F3 secund\u00E0ria 'groupAccess' a la mem\u00F2ria compartida amb shmid\=%d associada a la mem\u00F2ria cau de classe compartida.
SHRC759=No s'ha pogut definir el perm\u00EDs d'acc\u00E9s a grup segons s'ha sol\u00B7licitat amb l'opci\u00F3 secund\u00E0ria 'groupAccess' al fitxer de control de sem\u00E0for associat a la mem\u00F2ria cau de classe compartida.
SHRC754=La recreaci\u00F3 del fitxer de control de la mem\u00F2ria compartida no est\u00E0 permesa.
SHRC755=\t invalidatedaot Nom\u00E9s imprimeix tipus AOT invalidats a la mem\u00F2ria cau compartida.
SHRC756=No s'ha pogut definir el perm\u00EDs d'acc\u00E9s de grup al fitxer de mem\u00F2ria cau compartit segons s'ha sol\u00B7licitat amb l'opci\u00F3 secund\u00E0ria 'groupAccess'.
VRFY020=Arguments d'invocaci\u00F3 amb tipus no compatible
SHRC757=No s'ha pogut definir el perm\u00EDs d'acc\u00E9s a grup segons s'ha sol\u00B7licitat amb l'opci\u00F3 secund\u00E0ria 'groupAccess' al sem\u00E0for definit amb semid\=%d associat amb la mem\u00F2ria cau de classe compartida.
SHRC783=L'espai de dades JIT m\u00E0xim perm\u00E8s no pot ser superior al l\u00EDmit softmx de %u bytes definit a l'\u00FAs de la mem\u00F2ria cau compartida.
SHRC300=Una altra VM est\u00E0 utilitzant la mem\u00F2ria cau de classes compartides; la mem\u00F2ria cau imbricada no pot augmentar.
SHRC784=No es pot definir l'espai AOT i/o l'espai de dades JIT reservat m\u00EDnim de la manera sol\u00B7licitada. El l\u00EDmit softmx definit a l'\u00FAs de mem\u00F2ria cau compartida o a la mida de mem\u00F2ria cau total no \u00E9s prou gran.
SHRC301=No pot augmentar la mem\u00F2ria cau imbricada "%s"; no s'ha pogut assignar una supermem\u00F2ria cau nova com a suggeriment.
SHRC785=El m\u00EDnim de bytes AOT reservats s'ha definit amb el valor %d.
SHRC302=No pot augmentar la mem\u00F2ria cau imbricada "%s"; no s'ha pogut assignar un bloc com a suggeriment.
SHRC786=El m\u00E0xim de bytes AOT permesos s'ha definit amb el valor %d.
SHRC780=La mida de l'espai AOT m\u00E0xim no pot ser inferior als bytes AOT (%d) que ja hi ha emmagatzemats a la mem\u00F2ria cau.
SHRC781=L'espai AOT m\u00E0xim perm\u00E8s no pot ser superior al l\u00EDmit softmx de %u bytes definit a l'\u00FAs de la mem\u00F2ria cau compartida.
SHRC782=La mida de l'espai de dades JIT m\u00E0xim no pot ser inferior als bytes AOT (%d) que ja hi ha emmagatzemats a la mem\u00F2ria cau.
SHRC307=\tROMMETHOD\: %2$.*1$s Signatura\: %4$.*3$s Adre\u00E7a\: 0x%5$p
SHRC308=No s'ha pogut serialitzar la mem\u00F2ria cau "%s". No s'han pogut actualitzar els despla\u00E7aments de classes ROM als m\u00E8todes AOT.
SHRC309=Les opcions "grow" i "readonly" no es poden utilitzar juntes.
SHRC303=No s'ha pogut crear la mem\u00F2ria cau imbricada "%s".
SHRC787=El m\u00EDnim de bytes de dades JIT reservats s'ha definit amb el valor %d.
SHRC304=No s'ha pogut substituir la mem\u00F2ria cau "%s".
SHRC788=El m\u00E0xim de bytes de dades JIT permesos s'ha definit amb el valor %d.
SHRC305=No es pot assignar mem\u00F2ria per a la taula de cerca de suggeriments a SH_ClasspathManagerImpl2.
SHRC789=Els bytes softmx s'han definit amb el valor %u.
SHRC306=\ Signatura\: %2$.*1$s Adre\u00E7a\: 0x%3$p
SHRC772=S'ha assolit el l\u00EDmit softmx per a l'\u00FAs "%s" de mem\u00F2ria cau compartida. Utilitzeu l'opci\u00F3 "%s" per incrementar el l\u00EDmit softmx.
SHRC773=L'espai per a les dades AOT a la mem\u00F2ria compartida "%s" \u00E9s ple.
SHRC774=L'espai per a les dades JIT a la mem\u00F2ria compartida "%s" \u00E9s ple.
SHRC775=El l\u00EDmit softmx definit per a l'\u00FAs de mem\u00F2ria cau compartida \u00E9s superior a la mida de mem\u00F2ria cau total de %u bytes. Es definir\u00E0 amb un valor igual a la mida total de la mem\u00F2ria cau.
SHRC770=La JVM ha inhabilitat la protecci\u00F3 de p\u00E0gines emplenades parcialment. Si s'especifica '-Xshareclasses\:mprotect\=onfind', tamb\u00E9 s'ignora.
SHRC771=Habilita la protecci\u00F3 de mem\u00F2ria de p\u00E0gines emplenades parcialment. Al z/OS, equival a 'partialpagesonstartup'.
SHRC776=El l\u00EDmit softmx per a l'\u00FAs de mem\u00F2ria compartida \u00E9s inferior al nombre de %u bytes de la mem\u00F2ria cau compartida que ja s'utilitza.
SHRC777=El l\u00EDmit softmx per a l'\u00FAs de mem\u00F2ria cau compartida \u00E9s inferior al valor m\u00EDnim viable de %u bytes.
SHRC778=L'espai AOT reservat m\u00EDnim no pot ser superior a l'espai AOT m\u00E0xim perm\u00E8s.
SHRC779=L'espai de dades JIT reservat m\u00EDnim no pot ser superior a l'espai de dades JIT m\u00E0xim perm\u00E8s.
SHRC321=Recuperaci\u00F3 d'errors\: es tancaran els sem\u00E0fors de mem\u00F2ria compartida.
SHRC322=No s'han pogut inicialitzar els sem\u00E0fors per a la mem\u00F2ria cau de classes compartides. Av\u00EDs\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC323=ERROR\: Error en introduir el mutex per a la cap\u00E7alera de mem\u00F2ria cau de classes compartides. Av\u00EDs\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC324=ERROR\: Error en sortir del mutex per a la cap\u00E7alera de mem\u00F2ria cau de classes compartides. Av\u00EDs\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC320=Recuperaci\u00F3 d'errors\: es destruiran els sem\u00E0fors de mem\u00F2ria compartida.
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex no ha pogut adquirir el mutex de taula de cadenes (codi de retorn %d).
SHRC325=No s'ha pogut publicar el bloqueig de cap\u00E7alera de mem\u00F2ria cau de classes compartides durant la inicialitzaci\u00F3. Av\u00EDs\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC326=No s'ha pogut publicar el bloqueig d'usuari cap\u00E7alera de mem\u00F2ria cau de classes compartides durant la inicialitzaci\u00F3. Av\u00EDs\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa. Si teniu problemes quan utilitzeu la mem\u00F2ria cau compartida, \u00E9s possible que h\u00E0giu de destruir-la i tornar-la a crear.
SHRC327=La crida de SH_OSCachesysv\:\:acquireWriteLock() a j9shsem_wait ha fallat amb l'error %d.
SHRC328=System V IPC ha notificat l'error seg\u00FCent '%s'.
VERB032=Espai m\u00EDnim reservat de mem\u00F2ria cau de classes compartides per a dades JIT
SHRC310=No es pot localitzar la mem\u00F2ria cau persistent en un sistema de fitxers en xarxa. Seleccioneu un altre cacheDir.
SHRC794=Ajusteu l'espai de mem\u00F2ria cau de classes compartida m\u00E0xima permesa per a dades JIT a <mida>.
VERB033=Espai m\u00E0xim perm\u00E8s de mem\u00F2ria cau de classes compartides per a dades JIT
SHRC311=Error en alliberar el bloqueig d'escriptura de connexi\u00F3 de fitxer de mem\u00F2ria cau de classes compartides
SHRC795=La suma de %d bytes AOT m\u00EDnims reservats i els %d bytes de dades JTI m\u00EDnims reservats no pot ser superior als %d bytes de softmx.
VERB034=mida de p\u00E0gina gran per a la mem\u00F2ria cau de codi JIT
SHRC312=Error en alliberar el bloqueig d'escriptura de cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides
SHRC796=L'espai AOT m\u00EDnim reservat no pot ser superior al l\u00EDmit %d de softmx definit a l'\u00FAs de mem\u00F2ria cau compartida.
VERB035=mides de p\u00E0gina gran disponibles per a la mem\u00F2ria cau de codi JIT\:
SHRC313=No s'ha pogut crear jclCacheMutex a shrinit.
SHRC797=L'espai de dades JIT m\u00EDnim reservat no pot ser superior al l\u00EDmit %d de softmx definit a l'\u00FAs de mem\u00F2ria cau compartida.
VERB036=grand\u00E0ria inicial de metadates de refer\u00E8ncies comprimides
SHRC790=Ajusteu la mida de softmx a la mem\u00F2ria cau a <mida>.
VERB037=Mida de mem\u00F2ria cau de classes compartides
SHRC791=Ajusteu l'espai de mem\u00F2ria cau de classes compartida m\u00EDnima reservada per a dades AOT a <mida>.
VERB038=mida m\u00E0xima de programari de mem\u00F2ria cau de classes compartides
SHRC792=Ajusteu l'espai de mem\u00F2ria cau de classes compartida m\u00E0xima permesa per a dades AOT a <mida>.
SHRC793=Ajusteu l'espai de mem\u00F2ria cau de classes compartida m\u00EDnima reservada per a dades JIT a <mida>.
SHRC318=Recuperaci\u00F3 d'errors\: es destruir\u00E0 la mem\u00F2ria compartida.
SHRC319=Recuperaci\u00F3 d'errors\: es tancar\u00E0 la mem\u00F2ria compartida.
SHRC314=No es pot assignar mem\u00F2ria per a la taula de cerca de suggeriments a SH_Manager.
SHRC798=L'espai AOT m\u00E0xim perm\u00E8s no pot ser superior al l\u00EDmit %d de softmx definit a l'\u00FAs de mem\u00F2ria cau compartida.
SHRC315=No es poden inicialitzar els segments de mem\u00F2ria de classes de mem\u00F2ria cau.
SHRC799=L'espai de dades JIT m\u00E0xim perm\u00E8s no pot ser superior al l\u00EDmit %d de softmx definit a l'\u00FAs de mem\u00F2ria cau compartida.
VERB030=Espai m\u00E0xim perm\u00E8s de mem\u00F2ria cau de classes compartides per a JIT
SHRC316=No es pot serialitzar la mem\u00F2ria cau perqu\u00E8 no hi ha cap fil de VM actual.
VERB031=Espai reservat de mem\u00F2ria cau de classes compartida per a atributs de depuraci\u00F3 de classes
SHRC317=Imprimiu el nom del fitxer de mem\u00F2ria cau de classes compartides que s'utilitzar\u00E0.
VRFY029=returnAddress no v\u00E0lida per a la instrucci\u00F3 ret
VRFY021=S'ha generat un objecte no generable
SHRC343=S'ha trobat la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb l'URL %4$.*3$s.
VRFY022=Les subrutines s'han de tornar a fer passar per a cada jsr
SHRC344=No s'ha pogut trobar la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb l'URL %4$.*3$s.
VRFY023=El par\u00E0metre tableswitch no \u00E9s un enter
SHRC345=S'ha trobat la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb el testimoni %4$.*3$s.
VRFY024=Els arguments no tenen un tipus compatible
SHRC346=No s'ha pogut trobar la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb el testimoni %4$.*3$s.
VRFY025=Acces erroni a les dades protegides
VRFY026=EOF inesperat
SHRC340=La comprovaci\u00F3 de CRC de mem\u00F2ria cau ha fallat. CRC emmagatzemat %1$x, CRC calculat %2$x
VRFY027=El receptor no \u00E9s compatible amb la classe declarant
SHRC341=S'ha trobat la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d.
VRFY028=Dimensi\u00F3 err\u00F2nia
SHRC342=No s'ha pogut trobar la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d.
SHRC347=S'ha emmagatzemat la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s (\u00EDndex %6$d).
SHRC348=No s'ha pogut emmagatzemar la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s (\u00EDndex %6$d).
VRFY030=Tipus erroni a la pila
SHRC349=S'ha emmagatzemat la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s.
VRFY031=Intent d'iinc no enter
J2SE000=\n
VRFY032=Receptor erroni per a <init>
SHRC332=La protecci\u00F3 de p\u00E0gines de dades s'ha habilitat correctament per a la mem\u00F2ria cau.
VRFY033=Camb amb tipus no compatible
SHRC333=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per defecte per a la mem\u00F2ria cau
VRFY034=PC de destinaci\u00F3 no v\u00E0lid
SHRC334=La recuperaci\u00F3 d'errors ha fallat\: la destrucci\u00F3 de mem\u00F2ria compartida ha fallat.
VRFY035=Cap error
SHRC335=La recuperaci\u00F3 d'errors ha fallat\: la destrucci\u00F3 de sem\u00E0for compartit ha fallat.
VRFY036=Subeiximent de pila
VRFY037=Objecte desinicialitzat durant la bifurcaci\u00F3 cap enrere
VRFY038=invokespecial a destinaci\u00F3 no v\u00E0lida
SHRC330=SH_CompositeCacheImpl\:\:runExitCode no ha pogut adquirir el mutex d'\u00E0rea d'escriptura (codi de retorn %d).
VRFY039=Codi de bytes desconegut
SHRC331=S'ha adquirit un sem\u00E0for diferent del sem\u00E0for que s'utilitzava abans amb aquesta mem\u00F2ria cau.
SHRC336=Codi d'error de capa de port \= %1$d
VRFY040=El verificador no pot assignar mem\u00F2ria nativa
SHRC337=Missatge d'error de plataforma\: %1$s
SHRC338=Codi d'error de capa de port \= %1$d
VRFY041=invocaci\u00F3 especial d'inicialitzador incorrecte
VRFY042=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u; El tipus no coincideix, argument %9$d a la signatura %11$.*10$s.%13$.*12$s\:%15$.*14$s no coincideix
SHRC339=Missatge d'error de plataforma\: %1$s
VERB007=Mida de pila de fils de sistema operatiu
VERB008=grand\u00E0ria inicial de la pila de fils java
VERB009=Increment de la pila de fils java
SHRC360=No s'han pogut trobar les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida...
SHRC365=Habilita l'emmagatzematge d'informaci\u00F3 de depuraci\u00F3 de classes a la classe compartida.
EXEL109=\  -XX\:ShareClassesEnableBCI   crea la mem\u00F2ria cau de classes compartides amb suport per a la instrumentaci\u00F3 de codi de bytes
SHRC366=depuraci\u00F3 habilitada      \= true
VERB000=Pila detallada\: "%2$.*1$s" ha utilitzat %3$zd/%4$zd bytes a les piles Java/C
SHRC367=depuraci\u00F3 habilitada      \= false
VERB001=
SHRC368=S'est\u00E0 aturant la mem\u00F2ria cau de classes compartides no habilitada per a depuraci\u00F3.
VERB002=Pila detallada\: l'\u00FAs de pila m\u00E0xima era de %1$zd/%2$zd bytes a piles Java/C
SHRC361=Error en connectar amb la mem\u00F2ria compartida durant l'obertura/creaci\u00F3
VERB003=Error\: el nombre de fitxers -Xverbosegclog ha de ser superior a 0
SHRC362=No es pot assignar mem\u00F2ria per a ClasspathItem.
VERB004=Error\: el nombre -Xverbosegclog de cicles ha de ser superior a 0
SHRC363=No es pot assignar una API per a classes compartides a shrinit.
VERB005=Error\: falta el nom de fitxer -Xverbosegclog
SHRC364=La crida de SH_OSCachesysv\:\:acquireWriteLock() a j9shsem_wait al semid %d ha fallat amb l'error %d.
VERB006=No s'ha pogut inicialitzar
EXEL112=\  -Xscsoftmx<x>   definiu la mida m\u00E0xima de programari de la nova mem\u00F2ria cau de classes compartida amb el valor <x>
EXEL113=\  -Xscmx<x>       defineix la mida (o la mida m\u00E0xima de programari si l'opci\u00F3 -XX\:SharedCacheHardLimit\= \u00E9s present) de la nova mem\u00F2ria cau de classes compartides com a <x>
EXEL114=\  -XX\:SharedCacheHardLimit\=<x>   defineix la mida de la nova mem\u00F2ria cau de classes compartides com a <x>
EXEL115=\  -XX\:+ShareAnonymousClasses habilita l'opci\u00F3 d'emmagatzemar i trobar classes an\u00F2nimes a la mem\u00F2ria cau de classes compartides
SHRC369=-Xnolinenumbers    \= true
EXEL116=\  -XX\:-ShareAnonymousClasses habilita l'opci\u00F3 d'emmagatzemar i trobar classes an\u00F2nimes a la mem\u00F2ria cau de classes compartides
EXEL117=\  -XX\:+ShareUnsafeClasses habilita l'opci\u00F3 d'emmagatzemar i trobar classes no an\u00F2nimes a la mem\u00F2ria cau de classes compartides
EXEL118=\  -XX\:-ShareUnsafeClasses inhabilita l'opci\u00F3 d'emmagatzemar i trobar classes no an\u00F2nimes a la mem\u00F2ria cau de classes compartides
EXEL119=\  -XX\:+UseGCStartupHints habilita l'opci\u00F3 d'emmagatzemar i trobar suggeriments d'inici de GC a la mem\u00F2ria cau de classes compartides
EXEL110=\  -XX\:ShareClassesDisableBCI   crea la mem\u00F2ria cau de classes compartides amb suport per a la instrumentaci\u00F3 de codi de byte
EXEL111=\  -XX\:+StoreIntermediateClassfile   emmagatzema dades de classe sense processar que s'utilitzen durant la retransformaci\u00F3
SHRC354=No s'ha pogut trobar el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida.
SHRC355=S'ha emmagatzemat el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida.
SHRC356=No s'ha pogut emmagatzemar el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida.
SHRC357=S'han emmagatzemat les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida.
SHRC350=No s'ha pogut emmagatzemar la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s.
SHRC351=S'ha emmagatzemat la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb el testimoni %5$.*4$s.
SHRC352=No s'ha pogut emmagatzemar la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb el testimoni %5$.*4$s.
SHRC353=S'ha trobat el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida.
EXEL101=\n  -Xhealthcenter  habilita l'agent del Health Center
EXEL102=
EXEL103=\  -Xscdmx<x>      estableix la mida de l'\u00E0rea d'atributs de depuraci\u00F3 de la mem\u00F2ria cau de classes compartides en <x>
EXEL104=\  -Xscminjit<x>   estableix l'espai m\u00EDnim de mem\u00F2ria cau de classe compartida reservat per a dades JIT en <x>
SHRC358=No s'han pogut emmagatzemar les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida.
EXEL105=\  -Xscmaxjit<x>   estableix l'espai m\u00E0xim de mem\u00F2ria cau de classes compartida perm\u00E8s per a dades JIT en <x>
SHRC359=S'han trobat les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida...
EXEL106=\  -Xscminjitdata<x>   estableix l'espai m\u00EDnim de mem\u00F2ria cau de classe compartida reservat per a dades JIT en <x>
EXEL107=\  -Xscmaxjitdata<x>   estableix l'espai m\u00E0xim de mem\u00F2ria cau de classes compartida perm\u00E8s per a dades JIT en <x>
EXEL108=\  -Xzero\:nosharebootzip no compartir les mem\u00F2ries cau d'entrades jar bootstrap a la mem\u00F2ria cau de classes compartides
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj habilita el temps real lleu
VERB029=Espai m\u00EDnim reservat de mem\u00F2ria cau de classes compartides per a JIT
SHRC380=\u00C0rea de depuraci\u00F3 de classes %% utilitzada             %*c\= %u%%
SHRC381=Bytes de classe LineNumberTable         %*c\= %u
SHRC382=Bytes d'\u00E0rea de depuraci\u00F3 de classe LocalVariableTable %*c\= %u\n
VERB021=Entrada de variable classpath no v\u00E0lida\: %s (tipus de fitxer no adm\u00E8s)
SHRC387=Bytes lliures                          %*c\= %d
VERB022=Entrada de variable classpath no v\u00E0lida\: %s (tipus de fitxer desconegut)
SHRC388=Bytes de ROMClass                      %*c\= %d
VERB023=Entrada de variable classpath no v\u00E0lida\: %s (error desconegut)
SHRC389=Bytes de metadades                      %*c\= %d
VERB024=Entrada de variable classpath no v\u00E0lida\: %s (a jxe li falta rom.classes)
VERB025=Entrada de variable classpath no v\u00E0lida\: %s (cap\u00E7alera d'imatge malmesa de jxe)
SHRC383=\nAdre\u00E7a base                        %*c\= 0x%p
VERB026=Entrada de variable classpath no v\u00E0lida\: %s (no s'admet el jxe endian oposat)
SHRC384=Adre\u00E7a final                         %*c\= 0x%p
VERB027=Pila detallada\: el fil en execuci\u00F3 "%2$.*1$s" utilitza %3$zd/%4$zd bytes a les piles Java/C
SHRC385=Punter d'assignaci\u00F3                  %*c\= 0x%p\n
VERB028=Pila detallada\: No es pot imprimir la informaci\u00F3 de pila per als fils en execuci\u00F3 actuals.
SHRC386=Mida de mem\u00F2ria cau                          %*c\= %d
VERB020=Entrada de variable classpath no v\u00E0lida\: %s (el fitxer s'ha malm\u00E8s)
VERB018=Entrada de variable classpath no v\u00E0lida\: %s (l'E/S de fitxer ha fallat)
VERB019=Entrada de variable classpath no v\u00E0lida\: %s (la lectura del fitxer ha fallat)
SHRC370=-Xnolinenumbers    \= false
SHRC371=Bytes de mem\u00F2ria cau comprimits    \= %d
VERB010=Grand\u00E0ria m\u00E0xima de la pila de fils java
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC377=El valor -Xscdmx de %u \u00E9s superior als %u bytes d'espai lliure disponible. Cal utilitzar un valor de %u bytes per a -Xscdmx.
VERB011=Grand\u00E0ria de la pila de fils java
VERB012=Increment del segment de la classe RAM
SHRC378=\nOpcions de l\u00EDnia d'ordres relacionades\: \n
VERB013=Increment del segment de la classe ROM
SHRC379=Mida d'\u00E0rea de depuraci\u00F3 de classes               %*c\= %u
VERB014=M\u00E0xim de mem\u00F2ria
SHRC372=Nombre de mem\u00F2ries cau comprimides       \= %d
VERB015=Mida de mem\u00F2ria cau de classes compartides
SHRC373=Bytes de dades JIT     \= %d
SHRC374=Mem\u00F2ria cau creada amb\:
VERB016=Espai m\u00EDnim reservat de mem\u00F2ria cau de classes compartides per a AOT
SHRC375=El nom de la mem\u00F2ria cau \u00E9s massa llarg quan s'inclou el nom d'usuari. Queden %d bytes en aquesta mem\u00F2ria interm\u00E8dia i el nom d'usuari t\u00E9 %d bytes.
VERB017=Espai m\u00E0xim perm\u00E8s de mem\u00F2ria cau de classes compartides per a AOT
EXEL120=\  -XX\:-UseGCStartupHints inhabilita l'opci\u00F3 d'emmagatzemar i trobar suggeriments d'inici de GC a la mem\u00F2ria cau de classes compartides
EXEL121=\  -XX\:+PortableSharedCache   habilita la caracter\u00EDstica que intenta maximitzar la portabilitat de la mem\u00F2ria cau compartida entre les m\u00E0quines
EXEL122=\  -XX\:-PortableShareCache   inhabilita la caracter\u00EDstica que intenta maximitzar la portabilitat de la mem\u00F2ria cau compartida entre les m\u00E0quines
SHRC390=Metadades utilitzades %%                     %*c\= %d%%
SHRC391=Nombre de ROMClasses                        %*c\= %d
SHRC392=Nombre de variables classpath                        %*c\= %d
SHRC393=Nombre d'URL                              %*c\= %d
SHRC398=Nombre de m\u00E8todes AOT                       %*c\= %d
SHRC399=Bytes de dades                          %*c\= %d
SHRC394=Nombre de testimonis                            %*c\= %d
SHRC395=Nombre de classes stale                     %*c\= %d
SHRC396=%% de classes stale                     %*c\= %d%%\n
SHRC397=Bytes AOT                           %*c\= %d
CFRE100=S'han sol\u00B7licitat massa dimensions al codi de bytes de multianewarray
CFRE101=Despla\u00E7ament fora d'interval al codi de bytes de switch
CFRE102=Signatura de camp no v\u00E0lida
CFRE103=El m\u00E8tode abstracte no pot ser privat, est\u00E0tic, final, natiu, sincronitzat o estricte
CFRE104=El camp pot ser, com a molt, p\u00FAblic, privat o protegit
CFRE110=Constant incompatible per al camp
CFRE111=UTF8 amb format incorrecte
CFRE112=La VM no admet la verificaci\u00F3 din\u00E0mica
CFRE113=EOF inesperat
CFRE114=El nom de camp no \u00E9s v\u00E0lid
CFRE115=Les dimensions de matriu s\u00F3n superiors a 255
CFRE105=La superclasse ha de ser una classe
CFRE106=M\u00E8tode duplicat
CFRE107=Despla\u00E7ament fora d'interval al codi de bytes de jump
CFRE108=L'\u00EDndex de m\u00E8todes de tancament ha de fer refer\u00E8ncia a un nom i un tipus
CFRE109=Signatura de m\u00E8tode no v\u00E0lida
CFRE141=method_info t\u00E9 m\u00E9s d'un atribut RuntimeInvisibleParameterAnnotations o RuntimeVisibleParameterAnnotations
CFRE142=La classe t\u00E9 m\u00E9s d'un atribut RuntimeInvisibleAnnotations o RuntimeVisibleAnnotations
CFRE143=Diversos atributs de la parella d'imbricaci\u00F3
CFRE144=El membre de l'amfitri\u00F3 d'imbricaci\u00F3 de l'atribut d'imbricaci\u00F3 ha de ser una classe constant
CFRE145=L'amfitri\u00F3 de la imbricaci\u00F3 ha de ser una classe constant.
CFRE146=El m\u00E8tode <clinit> no \u00E9s est\u00E0tic
CFRE147=El m\u00E8tode <clinit> t\u00E9 una signatura il\u00B7legal
CFRE148=La interf\u00EDcie no pot tenir un nombre de m\u00E8tode <init>
CFRE140=method_info t\u00E9 m\u00E9s d'un atribut AnnotationDefault
CFRE138=L'atribut Classfile fa refer\u00E8ncia a una entrada d'agrupaci\u00F3 constant no existent
CFRE139=La classe t\u00E9 m\u00E9s d'un atribut SourceDebugExtension
CFRE152=module-info no \u00E9s una classe perqu\u00E8 s'ha definit access_flag ACC_MODULE
CFRE153=Entrada d'agrupaci\u00F3 constant no v\u00E0lida als fitxers de classes amb versions inferiors a la 55.0
CFRE154=Els codis de bytes ldc i ldc_2 han de fer refer\u00E8ncia a constant o a Constant_Dynamic
CFRE155=El codi de bytes ldc2_w ha de fer refer\u00E8ncia a constant o a Constant_Dynamic
CFRE156=Les entrades Constant_Dynamic a les quals fan refer\u00E8ncia els codis de bytes ldc i ldc_w no han de tornar 'long' ni 'double'
CFRE157=Les entrades Constant_Dynamic a les quals fa refer\u00E8ncia el codi de bytes ldc2_w han de tornar 'long' o 'double'
CFRE158=Entrada d'agrupaci\u00F3 constant no v\u00E0lida als fitxers de classes amb versions inferiors a la 49.0
CFRE159=Entrada d'agrupaci\u00F3 constant no v\u00E0lida als fitxers de classes amb versions inferiors a la 51.0
CFRE150=Etiqueta 20 constant desconeguda al fitxer de classe
CFRE151=Entrada d'agrupaci\u00F3 constant no v\u00E0lida als fitxers de classes amb versions inferiors a la 53.0
CFRE149=Etiqueta 19 constant desconeguda al fitxer de classe
CFRE120=Els codis d'operaci\u00F3 jsr i jsr_w no s\u00F3n v\u00E0lids als fitxers de classes amb les versions superior a la 51.0
CFRE121=Nom de campo no perm\u00E8s
CFRE122=La classe pot ser, com a molt, p\u00FAblica o m\u00F2dul
CFRE123=Les constants de MethodHandle han de fer refer\u00E8ncia a un camp o a una refer\u00E8ncia de m\u00E8tode
CFRE124=L'etiqueta del valor de l'element d'anotaci\u00F3 no \u00E9s v\u00E0lida
CFRE125=El codi de bytes d'invokedynamic ha de fer refer\u00E8ncia a una entrada d'agrupaci\u00F3 de constants d'InvokeDynamic
CFRE126=El codi de bytes d'invokedynamic ha reservat ranures no zero
CFRE116=El codi de bytes d'invoke ha de fer refer\u00E8ncia a una Methodref
CFRE117=El camp no pot ser final i vol\u00E0til
CFRE118=Bytes addicionals despr\u00E9s de l'EOF
CFRE119=Diversos atributs SourceFile
CFRE130=diversos atributs BootstrapMethods
CFRE131=L'atribut BootstrapMethods que requereix invokedynamic no apareix o \u00E9s massa petit
CFRE132=type_annotation target_type no reconeguts
CFRE133=El m\u00E8tode t\u00E9 dos atributs MethodParameters
CFRE134=Par\u00E0metre de m\u00E8tode t\u00E9 un senyalador no v\u00E0lid.
CFRE135=El nom de par\u00E0metre de m\u00E8tode no \u00E9s UTF8
CFRE136=modificadors no permesos per m\u00E8tode d'interf\u00EDcie
CFRE137=La classe t\u00E9 m\u00E9s d'un atribut RuntimeVisibleTypeAnnotations o RuntimeInvisibleTypeAnnotations
CFRE127=L'\u00EDndex de m\u00E8todes de bootstrap ha de fer refer\u00E8ncia a una entrada d'agrupaci\u00F3 de constants de MethodHandle
CFRE128=Signatura de methodtype no v\u00E0lida
CFRE129=Entrada d'agrupaci\u00F3 constant no v\u00E0lida als fitxers de classes amb versions inferiors a la 51.0
CFRE163=El fitxer de classe \u00E9s una versi\u00F3 de visualitzaci\u00F3 pr\u00E8via, per\u00F2 t\u00E9 la versi\u00F3 principal incorrecta o b\u00E9 la visualitzaci\u00F3 pr\u00E8via no est\u00E0 habilitada.
CFRE164=L'\u00EDndex a LocalVariableTable \u00E9s fora de l'interval
CFRE165=L'\u00EDndex a LocalVariableTypeTable \u00E9s fora de l'interval
CFRE166=No es permeten les entrades duplicades a LocalVariableTypeTable
CFRE167=diversos atributs Record
CFRE168=Les classes de Record no poden ser abstractes
CFRE169=El nom de Record ha de ser una cadena
CFRE160=Entrada d'agrupaci\u00F3 constant no v\u00E0lida als fitxers de classes amb versions inferiors a la 55.0
CFRE161=Els arguments BootstrapMethod (%1$d) contenen una entrada constantpool no v\u00E0lida a l'\u00EDndex (\#%2$u) del tipus (%3$u); classe\=%5$.*4$s, despla\u00E7ament\=%6$u
CFRE162=ValueTypes nom\u00E9s s'habiliten amb l'opci\u00F3 -XX\:+EnableValhalla
SHRC703=No s'ha pogut obrir el fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida "%s".
SHRC704=Codi d'error de capa de port \= %1$d
SHRC705=Missatge d'error de plataforma\: %1$s
SHRC706=No s'ha pogut adquirir el bloqueig de fitxer al fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida.
SHRC700=S'ha creat la instant\u00E0nia de la mem\u00F2ria cau compartida no persistent "%s".
SHRC701=No s'ha pogut crear una instant\u00E0nia de la mem\u00F2ria cau compartida no persistent "%s".
SHRC702=No s'ha pogut obtenir el directori per a la instant\u00E0nia de la mem\u00F2ria cau compartida.
SHRC707=No s'ha pogut adquirir el mutex de la mem\u00F2ria cau "%s".
SHRC708=No s'ha pogut truncar el fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s" existent.
SHRC709=La JVM est\u00E0 creant una instant\u00E0nia de la mem\u00F2ria cau compartida no persistent "%s", per\u00F2 ja existeix un fitxer d'instant\u00E0nia "%s" i se sobreescriur\u00E0.
CFRE174=diversos atributs PermittedSubclasses
CFRE175=les classes finals no es poden segellar
CFRE176=el nom PermittedSubclasses ha de ser una cadena
CFRE177=l'entrada de classe PermittedSubclasses no \u00E9s un tipus de cadena
CFRE178=Les classes segellades han de tenir com a m\u00EDnim una subclasse permesa
CFRE170=El nom de RecordComponent ha de ser una cadena
CFRE171=El descriptor de RecordComponent ha de ser una cadena
CFRE172=Record \u00E9s impl\u00EDcitament final
CFRE173=L'entrada LocalVariableTypeTable no coincideix amb cap entrada LocalVariableTable
SHRC720=No es permet la recreaci\u00F3 del fitxer de control de la mem\u00F2ria compartida en crear una instant\u00E0nia de la mem\u00F2ria cau.
SHRC725=La longitud del fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s" no \u00E9s v\u00E0lida. La longitud del fitxer \u00E9s de %lld bytes. Un fitxer d'instant\u00E0nia v\u00E0lid ha de tenir com a m\u00EDnim %d bytes i com a m\u00E0xim %lld bytes.
SHRC726=La mem\u00F2ria cau compartida no persistent "%s" ja existeix. No es pot restaurar des de la instant\u00E0nia.
SHRC727=S'ha produ\u00EFt un error en crear la nova mem\u00F2ria cau compartida no persistent.
SHRC728=No s'ha pogut llegir el fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s".
SHRC721=La JVM no est\u00E0 configurada per accedir al fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s". Per obtenir el fitxer, utilitzeu la subopci\u00F3 'groupAccess'.
SHRC722=La JVM no permet l'acc\u00E9s al fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida "%s" perqu\u00E8 l'ID d'usuari i l'ID de grup del proc\u00E9s de la JVM s\u00F3n diferents de l'ID d'usuari i l'ID de grup del propietari del fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida i l'ID d'usuari del proc\u00E9s de la JVM no pertany al grup del propietari del fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida.
SHRC723=La JVM no ha pogut comprovar els permisos del fitxer d'instant\u00E0nia de la mem\u00F2ria cau compartida "%s".
SHRC724=El fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida "%s" no existeix.
SHRC729=La instant\u00E0nia es va crear amb un muntatge de JVM diferent i no coincideix amb la JVM que s'est\u00E0 executant.
SHRC714=No hi ha cap instant\u00E0nia de mem\u00F2ria cau compartida disponible.
SHRC715=S'ha eliminat la generaci\u00F3 m\u00E9s antiga de la instant\u00E0nia de mem\u00F2ria cau compartida "%s".
SHRC716=No s'ha pogut eliminar la generaci\u00F3 m\u00E9s antiga de la instant\u00E0nia de mem\u00F2ria cau compartida "%s".
SHRC717=No s'ha pogut eliminar la generaci\u00F3 actual de la instant\u00E0nia de la mem\u00F2ria cau compartida "%s".
SHRC710=No s'ha pogut escriure al fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s".
SHRC711=No s'ha pogut reposicionar el despla\u00E7ament del descriptor del fitxer al fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida no persistent "%s".
SHRC712=S'est\u00E0 intentant destruir totes les instant\u00E0nies de mem\u00F2ria cau compartida al cacheDir "%s"
SHRC713=No s'ha pogut obtenir la longitud del fitxer d'instant\u00E0nia de mem\u00F2ria cau compartida "%s".
SHRC718=La instant\u00E0nia de la mem\u00F2ria cau compartida no existeix.
SHRC719=S'ha destru\u00EFt la mem\u00F2ria cau compartida "%s".
SHRC740=\u00DAs\: %s{<especificaci\u00F3_m\u00E8tode>[,<especificaci\u00F3_m\u00E8tode>]}
SHRC741=El format de <especificaci\u00F3_m\u00E8tode> \u00E9s [\!]{*|[*]<nom_paquet/nom_classe>[*]}[.{*|[*]<nom_m\u00E8tode>[*]}[({*|[*]<par\u00E0metres>[*]})]], p.ex.\:\n\n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC742=IMPORTANT\: Podeu passar diverses especificacions de m\u00E8tode separades amb comes. Si un valor d'opci\u00F3 cont\u00E9 comes, ha d'estar entre claus. \n\t\u00C9s possible que h\u00E0giu de posar opcions entre cometes per evitar que el shell intercepti i fragmenti l\u00EDnies separades amb comes com, per exemple\:\n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" or\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC747=No s'han pogut invalidar els m\u00E8todes AOT.
SHRC748=No s'han pogut revalidar els m\u00E8todes AOT.
SHRC749=No s'han trobat els m\u00E8todes AOT.
SHRC743=Especificacions de m\u00E8tode no v\u00E0lides per a l'opci\u00F3 "%s".
SHRC744=S'han invalidat els m\u00E8todes AOT %d
SHRC745=S'han tornat a validar els m\u00E8todes AOT %d
SHRC746=S'han trobat els m\u00E8todes AOT %d
SHRC730=La JVM ha creat una mem\u00F2ria cau compartida amb l'opci\u00F3 '-Xshareclasses\:restrictClasspaths'. Les invocacions de JVM futures no podran emmagatzemar classpaths a la mem\u00F2ria cau compartida.
SHRC731=La JVM ha ignorat l'opci\u00F3 '-Xshareclasses\:restrictClasspaths' perqu\u00E8 la mem\u00F2ria cau compartida es va crear sense l'opci\u00F3 '-Xshareclasses\:restrictClasspaths'.
SHRC736=Invalideu els m\u00E8todes AOT que coincideixin amb les especificacions de m\u00E8todes.
SHRC737=Revalideu els m\u00E8todes AOT que coincideixin amb les especificacions de m\u00E8todes.
SHRC738=Imprimiu els m\u00E8todes AOT que coincideixin amb les especificacions de m\u00E8todes.\n\t<especificaci\u00F3_m\u00E8tode> es defineix de la manera seg\u00FCent\: [\!]{*|[*]<nom_paquet/nom_classe>[*]}[.{*|[*]<nom_m\u00E8tode>[*]}[({*|[*]<par\u00E0metres>[*]})]].
SHRC739=INVALIDAT
SHRC732=La JVM pot emmagatzemar classpaths a la mem\u00F2ria cau compartida creada amb l'opci\u00F3 '-Xshareclasses\:restrictClasspaths'.
SHRC733=La JVM no pot emmagatzemar classpaths a la mem\u00F2ria cau compartida, ja que la mem\u00F2ria cau es va crear amb l'opci\u00F3 '-Xshareclasses\:restrictClasspaths'.
SHRC734=Imprimiu el nom del fitxer d'instant\u00E0nia de classes compartides que s'utilitzar\u00E0.
SHRC735=Utilitzeu una JVM de %d bits per dur a terme l'operaci\u00F3 sol\u00B7licitada a la mem\u00F2ria compartida de %d bits "%s", ja que la JVM de %d bits no pot verificar que la mem\u00F2ria compartida hagi estat creada per la JVM.
SHRC640=JVM est\u00E0 utilitzant la mem\u00F2ria cau compartida existent al mode de diagn\u00F2stic mprotect (utilitzant l'opci\u00F3 -Xshareclasses\:mprotect\=diagnostic), per\u00F2 la mem\u00F2ria cau no estava creant en aquest mode. La utilitzaci\u00F3 de la mem\u00F2ria cau en aquest mode pot afectar el rendiment.
SHRC641=JVM est\u00E0 intentant utilitzar la mem\u00F2ria cau compartida existent al mode de diagn\u00F2stic mprotect (utilitzant l'opci\u00F3 -Xshareclasses\:mprotect\=diagnostic), per\u00F2 la mem\u00F2ria cau no estava creant en aquest mode. En aquest cas mprotect\=diagnostic s'obvia en z/OS.
SHRC642=JVM ha creat la mem\u00F2ria cau de classes compartides al mode de diagn\u00F2stic mprotect (utilitzant l'opci\u00F3 -Xshareclasses\:mprotect\=diagnostic). La utilitzaci\u00F3 de la mem\u00F2ria cau en aquest mode pot afectar el rendiment.
SHRC643=JVM ha adjuntat la mem\u00F2ria cau de classes compartides al mode de diagn\u00F2stic mprotect (utilitzant l'opci\u00F3 -Xshareclasses\:mprotect\=diagnostic). La utilitzaci\u00F3 de la mem\u00F2ria cau en aquest mode pot afectar el rendiment.
SHRC648=La JVM no est\u00E0 configurada per accedir a conjunt de sem\u00E0fors associat amb mem\u00F2ria cau de classes compartides no persistent. Per connectar a mem\u00F2ria cau persistent de classes compartides, utilitzeu la subopci\u00F3 'groupAccess'.
SHRC649=La JVM no permet l'acc\u00E9s al conjunt de sem\u00E0fors de mem\u00F2ria cau compartida creada i propietat d'un altre usuari que no es troba al grup.
J9CL030=No es pot assignar mem\u00F2ria per a dades natives d'inquil\u00ED
J9CL031=No s'ha pogut registrar dbgwrapper.dll com a biblioteca bootstrap. Codi d'error \= %zu
J9CL032=%1$d\: No s'ha pogut recuperar la informaci\u00F3 %2$s.
SHRC644=JVM ha adjuntat la mem\u00F2ria cau de classes compartides al mode de diagn\u00F2stic mprotect (utilitzant l'opci\u00F3 -Xshareclasses\:mprotect\=diagnostic). l'opci\u00F3 -Xshareclasses\:mprotect\=none s'ignorar\u00E0.
SHRC645=Habilita la modalitat de diagn\u00F2stic mprotect
SHRC646=La JVM no ha pogut comprovar els permisos del conjunt de sem\u00E0fors associat amb la mem\u00F2ria cau compartida.
SHRC647=La JVM ha detectat que l'ID d'usuari efectiu del proc\u00E9s \u00E9s el propietari per\u00F2 no el creador de conjunt de sem\u00E0fors associat amb la mem\u00F2ria cau compartida. JVM no connectar\u00E0 amb la mem\u00F2ria cau compartida per evitar accedir col\u00B7lisions de la mem\u00F2ria cau compartida.
J9CL037=No es pot recuperar la informaci\u00F3 d'\u00FAs de CPU de la JVM quan s'ha especificat -XX\:-EnableCPUMonitor.
J9CL038=Error en recuperar la informaci\u00F3 d'\u00FAs de CPU de la JVM.
J9CL039=La marca hor\u00E0ria no \u00E9s v\u00E0lida quan es recupera la informaci\u00F3 d'\u00FAs de CPU de la JVM.
J9CL033=No s'ha pogut registrar %s com a biblioteca bootstrap. Codi d'error \= %zu
J9CL034=%1$d\: Error en recuperar la informaci\u00F3 de %2$s. %3$s
J9CL035=m\u00E8todes d'interf\u00EDcie privada necessiten invokespecial
J9CL036=S'est\u00E0 carregant la violaci\u00F3 de restricci\u00F3\: %2$.*1$s no \u00E9s visible des de %4$.*3$s
J9CL019=No es pot assignar la mem\u00F2ria interm\u00E8dia SIOCGIFCONF
SHRC630=L'espai est\u00E0 ple per emmagatzemar dades no AOT/no JIT, com ara classes, a la mem\u00F2ria cau compartida "%s".
SHRC631=L'espai reservat per a les dades AOT a la mem\u00F2ria cau compartida "%s" \u00E9s ple. Utilitzeu- Xscminaot per augmentar l'espai reservat per a les dades AOT.
SHRC632=L'espai reservat per a les dades JIT a la mem\u00F2ria cau compartida "%s" \u00E9s ple. Utilitzeu- Xscminjitdata per augmentar l'espai reservat per a les dades JIT.
SHRC637=La subopci\u00F3 --Xshareclasses\:cacheRetransformed no \u00E9s compatible amb un existent BCI a la mem\u00F2ria cau compartida que hi ha habilitada.
SHRC638=La creaci\u00F3 de la mem\u00F2ria cau amb l'opci\u00F3 cacheRetransformed obliga a tenir el mode disableBCI.
SHRC639=Nom\u00E9s es poden utilitzar les opcions del programa d'utilitat de la mem\u00F2ria cau en combinaci\u00F3 amb -Xmt. Poseu altres opcions de la mem\u00F2ria cau compartida al fitxer javad.options.
J9CL020=No ha hi prou mem\u00F2ria per llegir les dades d'entorn local
J9CL021=No hi ha prou mem\u00F2ria per crear la llista d'\u00EDndex
SHRC633=S'ha especificat l'opci\u00F3 "-XX\:+StoreIntermediateClassfile" per\u00F2 la mem\u00F2ria cau existent no s'ha creat amb l'opci\u00F3 "-XX\:+StoreIntermediateClassfile".
SHRC634=S'ha especificat l'opci\u00F3 "-XX\:-StoreIntermediateClassfile" i la mem\u00F2ria cau existent s'ha creat amb l'opci\u00F3 "-XX\:+StoreIntermediateClassfile".
SHRC635=Emmagatzema el fitxer de classes intermedi \= true
SHRC636=La subopci\u00F3 "disableBCI" no \u00E9s compatible amb un existent BCI a la mem\u00F2ria cau compartida que hi ha habilitada.
J9CL026=No es pot assignar mem\u00F2ria per al contingut de publicaci\u00F3 HTTP
J9CL027=Error de lectura del fitxer zip
J9CL028=Error intern en llegir el fitxer zip, codi d'error %d
J9CL029=S'han trobat car\u00E0cters de format incorrecte/que no es poden assignar
J9CL022=No hi ha prou mem\u00F2ria per llistar els magatzems de registres
J9CL023=No hi ha prou mem\u00F2ria disponible per llegir el registre
J9CL024=Sense mem\u00F2ria
J9CL025=No es pot assignar la mem\u00F2ria per a les cap\u00E7aleres de resposta HTTP
SHRC662=Recuperaci\u00F3 d'errors\: S'ha destru\u00EFt un conjunt de sem\u00E0fors associat a la mem\u00F2ria cau de classe compartida.
SHRC663=Recuperaci\u00F3 d'errors\: S'ha destru\u00EFt un conjunt de sem\u00E0fors amb id\=%d associat a la mem\u00F2ria cau de classe compartida.
SHRC664=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut destruir el conjunt de sem\u00E0fors amb semid\=%d associat a la mem\u00F2ria cau de classe compartida. Nom\u00E9s el creador, el propietari o un usuari amb privilegis administratius pot destruir el conjunt de sem\u00E0fors.
SHRC665=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut destruir el conjunt de sem\u00E0fors amb semid\=%d associat a la mem\u00F2ria cau de classe compartida.
SHRC660=La JVM no ha pogut associar l'id\=%d de conjunt de sem\u00E0fors amb la mem\u00F2ria cau de classes compartides.
SHRC661=La JVM no ha pogut associar l'id\=%d de mem\u00F2ria compartida amb la mem\u00F2ria cau de classes compartides.
SHRC666=Recuperaci\u00F3 d'errors\: S'ha destru\u00EFt la mem\u00F2ria compartida associada a la mem\u00F2ria cau de classe compartida.
SHRC667=Recuperaci\u00F3 d'errors\: S'ha destru\u00EFt la mem\u00F2ria compartida amb id\=%d associada a la mem\u00F2ria cau de classe compartida.
SHRC668=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut destruir la mem\u00F2ria compartida amb shmid\=%d associada a la mem\u00F2ria cau de classe compartida. Nom\u00E9s el creador, el propietari o un usuari amb privilegis administratius pot destruir la mem\u00F2ria compartida.
SHRC669=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut destruir la mem\u00F2ria compartida amb shmid\=%d associada a la mem\u00F2ria cau de classe compartida.
SHRC651=La JVM ha detectat que l'ID d'usuari efectiu del proc\u00E9s \u00E9s el propietari per\u00F2 no el creador de la mem\u00F2ria associada amb la mem\u00F2ria cau compartida. JVM no connectar\u00E0 amb la mem\u00F2ria cau compartida per evitar accedir col\u00B7lisions de la mem\u00F2ria cau compartida.
SHRC652=La JVM no est\u00E0 configurada per accedir a la mem\u00F2ria associada amb mem\u00F2ria cau de classes compartides no persistent. Per connectar a mem\u00F2ria cau persistent de classes compartides, utilitzeu la subopci\u00F3 'groupAccess'.
SHRC653=La JVM no est\u00E0 configurada per accedir a la mem\u00F2ria associada amb mem\u00F2ria cau de classes compartides no persistent. Per connectar a mem\u00F2ria cau persistent de classes compartides, utilitzeu la subopci\u00F3 'groupAccess' i 'readonly'.
SHRC654=La JVM no permet l'acc\u00E9s la mem\u00F2ria compartida de mem\u00F2ria cau compartida creada i propietat d'un altre usuari que no es troba al grup.
SHRC650=La JVM no ha pogut comprovar els permisos de la mem\u00F2ria associada amb la mem\u00F2ria cau compartida.
SHRC659=S'ha produ\u00EFt un error en obrir la mem\u00F2ria compartida
J9CL040=No es pot assignar mem\u00F2ria per a la refer\u00E8ncia global de JNI nova.
J9CL041=La classe d'amfitri\u00F3 %2$.*1$s i la classe an\u00F2nima %4$.*3$s es troben en paquets diferents
J9CL042=El membre imbricat %2$.*1$s a %4$.*3$s declara un amfitri\u00F3 d'imbricaci\u00F3 diferent de %6$.*5$s
SHRC655=Es pot accedir a la mem\u00F2ria cau per a l'usuari actual \= %s
SHRC656=La JVM no est\u00E0 configurada per accedir a la mem\u00F2ria cau compartida. Per connectar a mem\u00F2ria cau persistent de classes compartides, utilitzeu la subopci\u00F3 'groupAccess'.
SHRC657=La JVM no permet acc\u00E9s al fitxer de mem\u00F2ria cau compartida perqu\u00E8 l'ID d'usuari del proc\u00E9s de JVM i l'ID de grup s\u00F3n diferents dels del fitxer de mem\u00F2ria cau compartida i l'ID d'usuari de proc\u00E9s de JVM no pertany al grup de propietari de fitxer de mem\u00F2ria cau compartida.
SHRC658=La JVM no ha pogut comprovar els permisos de la mem\u00F2ria cau compartida.
SHRC200=\ S'ha trobat %2$.*1$s.
SHRC684=S'ha produ\u00EFt un error en obrir el sem\u00E0for. No s'ha pogut bloquejar el fitxer de control.
DUMP034=L'usuari ha sol\u00B7licitat l'abocament de mem\u00F2ria de %1$s amb '%2$s' per mitj\u00E0 de %3$s
SHRC201=\ S'ha substitu\u00EFt correctament %2$.*1$s.
SHRC685=S'ha produ\u00EFt un error en obrir la mem\u00F2ria compartida. No s'ha pogut bloquejar el fitxer de control.
DUMP033=La JVM ha sol\u00B7licitat l'abocament de mem\u00F2ria de %1$s en resposta a una incid\u00E8ncia.
SHRC202=No s'han pogut inicialitzar les agrupacions del gestor de classes compartides.
SHRC686=No s'ha pogut iniciar la mem\u00F2ria cau de classe compartida. S'ha especificat continuar sense utilitzar-la com a -Xshareclasses\:nonfatal.
DUMP036=Falta un filtre de -Xdump o el filtre no \u00E9s v\u00E0lid
SHRC203=No es pot crear una taula de hash al gestor de classes compartides.
SHRC687=No es pot crear una nova mem\u00F2ria cau de classe compartida si s'executa amb l'opci\u00F3 -Xshareclasses\:readonly.
DUMP035=L'usuari ha sol\u00B7licitat l'abocament de mem\u00F2ria de %1$s per mitj\u00E0 de %2$s
SHRC680=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut eliminar el fitxer de control %s del conjunt de sem\u00E0fors associat a la mem\u00F2ria cau de classe compartida.
DUMP030=No es pot escriure l'abocament de mem\u00F2ria al fitxer %s\: %s
SHRC681=S'ha assolit el l\u00EDmit del sistema per al nombre m\u00E0xim de sem\u00E0fors o s'ha assolit el nombre m\u00E0xim de sem\u00E0fors de tot el sistema.
SHRC682=S'ha assolit el l\u00EDmit del sistema per al nombre m\u00E0xim de regions de mem\u00F2ria compartida o el l\u00EDmit per a tot el sistema de la mem\u00F2ria assignada a les regions de mem\u00F2ria compartida.
DUMP032=La JVM ha sol\u00B7licitat l'abocament de mem\u00F2ria de %1$s amb '%2$s' en resposta a una incid\u00E8ncia.
SHRC683=S'ha assolit el l\u00EDmit del sistema per al nombre total de fitxers oberts.
DUMP031=El heapdump sol\u00B7licitat no s'ha generat perqu\u00E8 no s'ha sol\u00B7licitat el bloqueig exclusiu de VM. Afegiu request\=exclusive+prepwalk+compact a l'opci\u00F3 de l\u00EDnia d'ordres -Xdump\:heap\:.
SHRC208=No es pot assignar mem\u00F2ria per a l'agrupaci\u00F3 d'element de taula de hash a CompiledMethodManagerImpl.
SHRC209=Habilita la sortida detallada de dades de byte
SHRC204=No es pot crear un mutex de taula de hash al gestor de classes compartides.
SHRC688=Nom\u00E9s es poden afegir classpaths si primer la JVM inicialitza la mem\u00F2ria cau.
DUMP027=El heapdump sol\u00B7licitat no s'ha generat perqu\u00E8 un altre component cont\u00E9 el bloqueig exclusiu de VM.
SHRC205=No s'ha pogut crear un element de taula de hash nou a CompiledMethodManagerImpl.
SHRC689=Permet que una JVM emmagatzemi classpaths a la mem\u00F2ria cau creada amb l'opci\u00F3 "restrictClasspaths".
DUMP026=El nom d'IEATDUMP supera la longitud m\u00E0xima permesa. S'utilitzar\u00E0 el nom per defecte.
SHRC206=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a CompiledMethodManagerImpl.
DUMP029=La sol\u00B7licitud de prepwalk o compact abans de fer un abocament de mem\u00F2ria del sistema s'ignorar\u00E0 perqu\u00E8 no s'ha sol\u00B7licitat el bloqueig exclusiu de VM.
SHRC207=No es pot entrar al mutex de taula de hash de ClasspathManager.
DUMP028=El bloqueig exclusiu de VM no s'ha pogut adquirir abans de fer l'abocament de mem\u00F2ria del sistema.
SHRC673=No s'ha pogut destruir el conjunt de sem\u00E0fors amb semid\=%d associat a la mem\u00F2ria cau de classe compartida.
DUMP045=El nombre d'opcions d'abocament de mem\u00F2ria ha de ser inferior a %d, incloses les opcions establertes per defecte.
SHRC674=L'usuari no t\u00E9 perm\u00EDs per destruir la mem\u00F2ria compartida amb shmid\=%d. Nom\u00E9s el creador, el propietari o un usuari amb privilegis administratius pot destruir la mem\u00F2ria compartida.
DUMP044=Valor no v\u00E0lid o valor v\u00E0lid reservat per a %s
SHRC675=No s'ha pogut destruir la mem\u00F2ria compartida associada a la mem\u00F2ria cau de classe compartida.
DUMP047=La m\u00E0quina virtual s'atura. Motiu\: desconegut
SHRC676=No s'ha pogut destruir la mem\u00F2ria compartida amb shmid\=%d associada a la mem\u00F2ria cau de classe compartida.
DUMP046=La m\u00E0quina virtual s'atura. Motiu\: %2$.*1$s
DUMP041=\u00DAs incorrecte de -Xdump msg_filter
SHRC670=Recuperaci\u00F3 d'errors\: S'est\u00E0 intentant utilitzar la mem\u00F2ria compartida en mode de nom\u00E9s lectura si existeix la regi\u00F3 de mem\u00F2ria compartida, en resposta a l'opci\u00F3 "-Xshareclasses\:nonfatal".
DUMP040=%1$s abocament de mem\u00F2ria escrit als conjunts de dades mitjan\u00E7ant la plantilla de nom %2$s
SHRC671=L'usuari no t\u00E9 perm\u00EDs per destruir el conjunt de sem\u00E0fors amb semid\=%d. Nom\u00E9s el creador, el propietari o un usuari amb privilegis administratius pot destruir el conjunt de sem\u00E0fors.
DUMP043=%s no s'admet en aquesta plataforma
SHRC672=No s'ha pogut destruir un conjunt de sem\u00E0fors associat a la mem\u00F2ria cau de classe compartida.
DUMP042=S'ha rebut un senyal d'avortament mentre s'executava a la pila Java. No s'han pogut executar els agents d'abocament de mem\u00F2ria de JVM.
SHRC677=Codi d'error de capa de port \= %1$d
DUMP038=L'abocament de mem\u00F2ria breu no s'ha escrit perqu\u00E8 s'estava obtenint una tra\u00E7a al fitxer\: %1$s
SHRC678=Missatge d'error de plataforma\: %1$s
DUMP037=Error a l'abocament de mem\u00F2ria de %1$s\: %2$s ha fallat, codi d'error\: %3$d
SHRC679=La recuperaci\u00F3 d'errors ha fallat\: No s'ha pogut eliminar el fitxer de control %s del conjunt de sem\u00E0fors associat a la mem\u00F2ria cau de classe compartida.
DUMP039=S'est\u00E0 processant la incid\u00E8ncia d'abocament de mem\u00F2ria "%1$s", detall "%3$.*2$s" a %4$s - espereu.
J9CL008=el valor de temps d'espera en nanosegons est\u00E0 fora de l'interval
J9CL009=El fil ja s'ha iniciat
SHRC222=Les mem\u00F2ries cau de classes compartides persistents no es poden crear/utilitzar perqu\u00E8 el mapatge de mem\u00F2ria no admet les prestacions obligat\u00F2ries.
SHRC223=No es poden crear/utilitzar mem\u00F2ries cau de classes compartides perqu\u00E8 no s'admet el bloqueig de fitxers.
SHRC224=No queda mem\u00F2ria per a la c\u00F2pia local del nom de mem\u00F2ria cau.
SHRC225=Error en obtenir el cam\u00ED d'acc\u00E9s del fitxer de mem\u00F2ria cau
SHRC220=Codi d'error de capa de port \= %1$d
SHRC221=Missatge d'error de plataforma\: %1$s
J9CL010=No s'ha pogut assignar JNIEnv
SHRC226=Error en obrir el fitxer de mem\u00F2ria cau de classes compartides
SHRC227=Error en adquirir el bloqueig d'escriptura de cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides
SHRC228=Error en actualitzar l'hora de darrera connexi\u00F3 de la mem\u00F2ria cau de classes compartides
SHRC229=Error\: el fitxer de mem\u00F2ria cau de classes compartides t\u00E9 una cap\u00E7alera no v\u00E0lida.
J9CL015=No s'ha pogut crear la tra\u00E7a de pila (el m\u00E9s probable \u00E9s que es degui a una manca de mem\u00F2ria de SO)
J9CL016=No es pot crear una entrada de variable classpath nova
J9CL017=No es pot assignar per a un recurs de fus horari
J9CL018=No es pot assignar per a una entrada de fus horari
J9CL011=No s'ha pogut fer un proc\u00E9s fork al fil del sistema operatiu
J9CL012=
J9CL013=No s'ha pogut assignar el supervisor del sistema operatiu
J9CL014=Argument de l\u00EDnia d'ordres JCL no v\u00E0lid
SHRC690=Restringeix classpaths                  \= true
SHRC211=S'estan cercant les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida...
SHRC695=Restaura una nova mem\u00F2ria cau compartida no persistent des d'una instant\u00E0nia
SHRC212=S'estan emmagatzemant les dades de byte per a la clau %.*s a la mem\u00F2ria cau compartida...
SHRC696=Les subopcions "%s" i "%s" no s\u00F3n compatibles. S'ha ignorat la subopci\u00F3 "%s".
SHRC213=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a ByteDataManagerImpl.
SHRC697=No s'ha pogut obtenir el directori per a la mem\u00F2ria cau compartida.
SHRC214=No es pot entrar al mutex de taula de hash de ByteDataManager.
SHRC698=La mem\u00F2ria cau compartida no persistent "%s" s'ha restaurat correctament des de la instant\u00E0nia.
SHRC691=Restringeix classpaths                  \= false
SHRC692=Crea una instant\u00E0nia d'una mem\u00F2ria cau compartida no persistent existent.
SHRC693=Destrueix la instant\u00E0nia d'una mem\u00F2ria cau compartida (utilitza el par\u00E0metre de nom o el valor per defecte)
SHRC210=[Sortida detallada de dades de byte de -Xshareclasses habilitada]
SHRC694=Destrueix totes les instant\u00E0nies de mem\u00F2ria cau compartida
SHRC219=[Acc\u00E9s de grup de -Xshareclasses habilitat per a mem\u00F2ries cau noves]
SHRC215=Crea mem\u00F2ria cau persistent de classes compartides
SHRC699=No s'ha pogut restaurar la mem\u00F2ria cau compartida no persistent "%s" des de la instant\u00E0nia.
SHRC216=Crea mem\u00F2ria cau no persistent de classes compartides
SHRC217=[Mem\u00F2ria cau persistent de -Xshareclasses habilitada]
SHRC218=[Mem\u00F2ria cau persistent de -Xshareclasses inhabilitada]
J9CL004=Versi\u00F3 de la biblioteca de classes incompatible\: s'esperava JCL v%1$i, s'ha trobat v%2$i
J9CL005=Versi\u00F3 de la biblioteca de classes incompatible\: s'exigeix VM v%1$i, s'ha trobat v%2$i
J9CL006=No hi ha dades de verificaci\u00F3 pr\u00E8via per java/lang/Object
J9CL007=el valor de temps d'espera \u00E9s negatiu
J9CL000=Biblioteca de classes incompatible
J9CL001=Proveu d'executar amb -jcl\:%s
J9CL002=Les classes s\u00F3n de la biblioteca no J9 o JXE s'ha redu\u00EFt de forma incorrecta
J9CL003=Versi\u00F3 de biblioteca de classes incompatible\: JCL %1$x, VM %2$x
SHRC244=Error en obtenir la longitud de fitxer de mem\u00F2ria cau de classes compartides
SHRC245=Error en mapar el fitxer de mem\u00F2ria cau de classes compartides
SHRC246=S'ha connectat la mem\u00F2ria cau persistent de classes compartides %1$s
SHRC247=Error\: el reclam de cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides no \u00E9s v\u00E0lid.
SHRC240=Error\: no es pot adquirir el bloqueig d'escriptura de connexi\u00F3 de fitxer de mem\u00F2ria cau de classes compartides.
SHRC241=Error\: no es pot suprimir el fitxer de mem\u00F2ria cau de classes compartides.
SHRC242=Error en actualitzar l'hora de darrera desconnexi\u00F3 del fitxer de mem\u00F2ria cau de classes compartides
SHRC243=Error en alliberar el bloqueig de lectura de connexi\u00F3 del fitxer de mem\u00F2ria cau de classes compartides
SHRC248=Error\: la versi\u00F3 de cap\u00E7alera del fitxer de mem\u00F2ria cau de classes compartides no \u00E9s v\u00E0lida
SHRC249=Error\: modlevel de cap\u00E7alera de fitxer de classes compartides no \u00E9s v\u00E0lid
SHRC233=Error en crear la cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides
SHRC234=Error en adquirir el bloqueig de lectura de connexi\u00F3 de fitxer de mem\u00F2ria cau de classes compartides
SHRC235=Error en alliberar el bloqueig de lectura de connexi\u00F3 del fitxer de mem\u00F2ria cau de classes compartides
SHRC236=S'ha creat la mem\u00F2ria cau persistent de classes compartides %1$s
SHRC230=Error en inicialitzar la cap\u00E7alera de dades de mem\u00F2ria cau compartides
SHRC231=Error en definir la longitud de fitxer de mem\u00F2ria cau de classes compartides
SHRC232=No s'ha pogut crear una mem\u00F2ria cau en modalitat de nom\u00E9s lectura
SHRC237=S'ha obert la mem\u00F2ria cau persistent de classes compartides %1$s
SHRC238=Error\: la mem\u00F2ria cau de classes compartides no est\u00E0 connectada.
SHRC239=Error\: no es pot adquirir el bloqueig d'escriptura de cap\u00E7alera del fitxer de mem\u00F2ria cau de classes compartides
SHRC260=No s'ha pogut crear l'agrupaci\u00F3 a ByteDataManager
SHRC261=Habilita sortida detallada interna de la s\u00E8rie
SHRC266=[-Xshareclasses mem\u00F2ria cau de classes transformades de nou habilitada]
SHRC267=Inhabilita l'emmagatzematge en mem\u00F2ria cau de classes bootclasspath
SHRC268=[-Xshareclasses mem\u00F2ria cau d'entrades bootclasspath inhabilitada]
SHRC269=El sistema no admet la protecci\u00F3 de p\u00E0gina de mem\u00F2ria
SHRC262=Bytes de dades     \= %d
SHRC263=Habilita p\u00E0gines detallades de CompositeCache
SHRC264=No ajustis les \u00E0rees de mem\u00F2ria cau als l\u00EDmits de la p\u00E0gina
SHRC265=Classes de mem\u00F2ria cau que es tornen a transformar a trav\u00E9s de JVMTI
EXEL013=\  -Xmn<x>         estableix la mida del nou espai en <x>
EXEL014=\  -Xmn<x>         estableix la mida del nou espai inicial/m\u00E0xim en <x>
EXEL015=\  -Xmns<x>        estableix la mida del nou espai inicial en <x>
EXEL016=\  -Xmnx<x>        estableix la mida del nou espai m\u00E0xim en <x>
EXEL017=\  -Xmo<x>         estableix la mida de l'antic espai en <x>
EXEL018=\  -Xmo<x>         estableix la mida de l'antic espai inicial/m\u00E0xim en <x>
EXEL019=\  -Xmos<x>        estableix la mida de l'antic espai inicial en <x>
EXEL010=Els valors amb els sufixos "k" (kilo) o "m" (mega) es multiplicaran en conseq\u00FC\u00E8ncia.\n
EXEL011=\  -Xmca<x>        estableix l'increment del segment de la classe RAM en <x>
EXEL012=\  -Xmco<x>        estableix l'increment del segment de la classe ROM en <x>
SHRC250=No es pot obrir la mem\u00F2ria cau en modalitat de nom\u00E9s lectura donat que encara no s'ha inicialitzat
SHRC255=Error en actualitzar la data de darrera desconnexi\u00F3 del fitxer de mem\u00F2ria cau de classes compartides a la sortida de la JVM
SHRC256=La mem\u00F2ria cau compartida persistent "%1$s" s'ha eliminat
SHRC257=No es pot assignar mem\u00F2ria a l'\u00EDtem de llista enlla\u00E7at al gestor
SHRC258=No es pot assignar mem\u00F2ria per a l'entrada de la taula d'aleatoritzaci\u00F3 a Manager
SHRC251=No suprimeixis autom\u00E0ticament mem\u00F2ries cau de diferents buildID
SHRC252=Error en cercar al fitxer de mem\u00F2ria cau de classes compartides
SHRC253=Error en escriure la cap\u00E7alera al fitxer de mem\u00F2ria cau de classes compartides
SHRC254=Error en establir la longitud del fitxer de mem\u00F2ria cau de classes compartides
EXEL002=\  -Xbootclasspath/p\:<via>  deduir <via> per la classpath d'enceb
EXEL003=\  -Xbootclasspath/a\:<via>  afegir <via> a la classpath d'enceb
EXEL004=\n  -Xrun<biblioteca>[\:opcions]  carrega la biblioteca d'agent nativa\n                            (s'ha deixat d'utilitzar en benefici de -agentlib)\n
EXEL005=\  -Xint           executa nom\u00E9s all\u00F2 interpretat (equivalent a -Xnojit -Xnoaot)
SHRC259=No es pot escriure el mutex de la taula d'aleatoritzaci\u00F3 de Manager
EXEL006=\  -Xnojit         inhabilita JIT
EXEL007=\  -Xnoaot         no executa el codi compilat pr\u00E8viament
EXEL008=\  -Xfuture        habilita les comprovacions m\u00E9s estrictes, que anticipen futurs valors per defecte
EXEL009=\nEls arguments de les seg\u00FCents opcions s'expressen en bytes.
EXEL000=Les seg\u00FCents opcions s\u00F3n no est\u00E0ndard i estan subjectes a canvis sense avisos previs.\n
EXEL001=\  -Xbootclasspath\:<via>    estableix la classpath d'enceb en <via>
SHRC280=Enumeraci\u00F3 de totes les mem\u00F2ries cau a cacheDir %s
SHRC281=S'est\u00E0 intentant destruir totes les mem\u00F2ries cau de cacheDir %s
SHRC282=La mida de la p\u00E0gina del sistema operatiu \u00E9s incompatible amb aquesta mem\u00F2ria cau. S'est\u00E0 intentant tornar a crear la mem\u00F2ria cau.
SHRC283=Obre la mem\u00F2ria cau amb permisos de nom\u00E9s lectura
SHRC288=ID de mem\u00F2ria compartida   \= %d
SHRC289=No detectis quan es localitza una mem\u00F2ria cau en un sistema de fitxers en xarxa remot
SHRC284=No s'ha pogut crear una mem\u00F2ria cau en modalitat de nom\u00E9s lectura
SHRC285=La mem\u00F2ria cau persistent de classe compartida %1$s \u00E9s nom\u00E9s de lectura
SHRC286=La mem\u00F2ria cau de classes compartides oberta %1$s \u00E9s nom\u00E9s de lectura
SHRC287=No es pot localitzar la mem\u00F2ria cau persistent en un sistema de fitxers en xarxa. Seleccioneu "nonpersistent" o un altre cacheDir.
EXEL035=\  -Xminf<x>       percentatge m\u00EDnim de l'\u00E0rea d'emmagatzematge lliura despr\u00E9s de GC
EXEL036=\  -Xmaxf<x>       percentatge m\u00E0xim de l'\u00E0rea d'emmagatzematge lliura despr\u00E9s de GC
EXEL037=\nEls arguments per a les opcions seg\u00FCents s'expressen com a nombres decimals.\n
EXEL038=\  -Xgcthreads<x>                estableix un nombre de fils GC
EXEL039=\  -Xnoclassgc                   inhabilita la desc\u00E0rrega de classes din\u00E0miques
EXEL030=\  -Xss<x>         estableix la mida de la pila de fils en <x>
EXEL031=\  -Xmine<x>       estableix la mida m\u00EDnima per a l'expansi\u00F3 de l'\u00E0rea d'emmagatzematge a <x>
EXEL032=\  -Xmaxe<x>       estableix la mida m\u00E0xima per a l'expansi\u00F3 de l'\u00E0rea d'emmagatzematge a <x>
EXEL033=\nEls arguments de les seg\u00FCents opcions s'expressen com a decimals del 0 a l'1.
EXEL034=Un valor de 0,3 representa una sol\u00B7licitud del 30%%.\n
SHRC270=Configura la protecci\u00F3 de p\u00E0gina de mem\u00F2ria de mem\u00F2ria cau
SHRC271=Subopci\u00F3 de l'opci\u00F3 mprotect\= no reconeguda
SHRC272=S'ha habilitat correctament tota la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per a la mem\u00F2ria cau
SHRC277=Per executar la utilitat "%s" en una mem\u00F2ria cau compartida no persistent "%s", tamb\u00E9 heu d'utilitzar la subopci\u00F3 "nonpersistent".
SHRC278=Tingueu en compte que la utilitat "%s" no pot funcionar en una mem\u00F2ria cau de classe incompatible "%s". Utilitzeu una JVM al nivell correcte.
SHRC279=Torna a crear la mem\u00F2ria cau compartida a l'inici
SHRC273=S'ha habilitat correctament la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per defecte per a la mem\u00F2ria cau
SHRC274=S'ha inhabilitat la protecci\u00F3 de p\u00E0gina de mem\u00F2ria per a la mem\u00F2ria cau
SHRC275=Estableix la ubicaci\u00F3 dels fitxers de mem\u00F2ria cau de JVM
SHRC276=Per executar la utilitat "%s" a la mem\u00F2ria cau de classe persistent "%s", no utilitzeu la subopci\u00F3 "nonpersistent"
EXEL024=\  -Xmx<x>         estableix el m\u00E0xim de mem\u00F2ria en <x>
EXEL025=\  -Xmr<x>         estableix la mida del conjunt recordat en <x>
EXEL026=\  -Xmrx<x>        estableix la mida m\u00E0xima del conjunt recordat en <x>
EXEL027=\  -Xmso<x>        estableix la mida de la pila de fils del sistema operatiu en <x>
EXEL028=\  -Xiss<x>        estableix la mida de la pila de fils java inicials en <x>
EXEL029=\  -Xss<x>         estableix la mida m\u00E0xima de la pila de fils java en <x>
EXEL020=\  -Xmox<x>        estableix la mida de l'antic espai m\u00E0xim en <x>
EXEL021=\  -Xmoi<x>        estableix l'increment de l'antic espai en <x>
EXEL022=\  -Xms<x>         estableix la mida de l'antic espai en <x>
EXEL023=\  -Xms<x>         estableix la mida de la mem\u00F2ria inicial en <x>
EXEL057=
EXEL058=Error intern de VM\: sense mem\u00F2ria
EXEL059=Error intern de VM\: no s'ha pogut trobar la classe java/lang/String
EXEL050=\  -Xrdbginfo\:<sist_prin>\:<port> habilita el servidor d'informaci\u00F3 de depuraci\u00F3 remot
EXEL051=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nAV\u00CDS\: \u00DAs de "-classpath <via>" o "-cp <via>".
EXEL052=\nAV\u00CDS\: S'ha desaprovat l'argument de la l\u00EDnia d'ordres "%s".\nAV\u00CDS\: Utilitzeu l'equivalent de -X.
EXEL053=
EXEL054=
EXEL055=Destinaci\u00F3\: %s
EXEL056=
SHRC291=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a ROMClassResourceManager.
SHRC292=No es pot entrar al mutex de taula de hash de ROMClassResourceManager.
SHRC293=No es pot assignar mem\u00F2ria per a l'agrupaci\u00F3 d'element de taula de hash a ROMClassResourceManager.
SHRC294=%1$d\: 0x%2$p CHARARRAY\: a 0x%3$p.
SHRC290=No s'ha pogut crear un element de taula de hash nou a ROMClassResourceManager.
SHRC299=La mem\u00F2ria cau de classes compartides "%s" no s'ha creat amb l'opci\u00F3 imbricada i la mem\u00F2ria cau no pot augmentar.
SHRC295=Desactiva la depend\u00E8ncia de tenir CORE_MMAP a l'AIX
SHRC296=L'execuci\u00F3 amb l'opci\u00F3 "noCoreMmap" significar\u00E0 que \u00E9s poc probable que IBM us proporcioni assist\u00E8ncia perqu\u00E8 faltaran les dades de classe dels abocaments de mem\u00F2ria del sistema.
SHRC297=Per utilitzar mem\u00F2ries cau de classes compartides a l'AIX, la variable d'entorn CORE_MMAP s'ha d'haver definit en "yes".
SHRC298=Per executar la utilitat "%s" a la mem\u00F2ria cau de classes persistent "%s", utilitzeu la subopci\u00F3 "persistent".
EXEL046=\  -Xlp                          habilita el suport de p\u00E0gines grans
EXEL047=\n  -Xdbg\:<options>               habilita la depuraci\u00F3, les opcions est\u00E0ndard de JDWP
EXEL048=\  -Xrunjdwp\:<options>           habilita la depuraci\u00F3, les opcions est\u00E0ndard de JDWP
EXEL049=\  -Xdbginfo\:<via fitxer s\u00EDmbol> habilita la depuraci\u00F3 del servidor d'informaci\u00F3
EXEL040=\  -Xclassgc                     habilita la desc\u00E0rrega de classes din\u00E0miques
EXEL041=\  -Xalwaysclassgc               habilita la desc\u00E0rrega de classes din\u00E0miques a cada GC
EXEL042=\  -Xnocompactexplicitgc         inhabilita la compactaci\u00F3 a un sistema GC
EXEL043=\  -Xcompactexplicitgc           habilita la compactaci\u00F3 a tots els sistemes GC
EXEL044=\  -Xcompactgc                   habilita la compactaci\u00F3
EXEL045=\  -Xnocompactgc                 inhabilita la compactaci\u00F3
SHRC192=El valor de -Xscmaxaot \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en il\u00B7limitat.
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC194=\tper a ROMClass %2$.*1$s a 0x%3$p.
SHRC195=Habilita la sortida detallada AOT
SHRC190=El valor de -Xscminaot no ha de ser superior al valor de -Xscmaxaot.
SHRC191=El valor de -Xscminaot \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en el mateix valor que -Xscmx.
SHRC196=[Sortida detallada AOT de -Xshareclasses habilitada]
SHRC197=S'est\u00E0 cercant el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida...
SHRC198=S'est\u00E0 emmagatzemant el codi AOT per a ROMMethod 0x%1$p a la mem\u00F2ria cau compartida...
SHRC199=\ S'ha emmagatzemat correctament %2$.*1$s.
TRCE020=S'ha exhaurit el temps d'espera durant la finalitzaci\u00F3 del motor de tra\u00E7a
JNCK097=\tadvice         visualitza suggeriments
JNCK098=Error de JNI a %1$s\: l'argument \#%2$d espera %3$s %4$s, l'argument real \u00E9s %5$s %6$s
JNCK095=Error de JNI al valor tornat\: el tipus de retorn \u00E9s una refer\u00E8ncia, per\u00F2 el valor (0x%1$p) no \u00E9s una refer\u00E8ncia d'objecte v\u00E0lida. El seu tipus \u00E9s\: %2$s
JNCK096=\twarn           visualitza avisos
JNCK099=Error de JNI a %1$s\: l'argument \#%2$d necessita un tipus sense matriu
JNCK090=S'ha detectat un av\u00EDs al marc de gestor d'una incid\u00E8ncia de JVMPI o JVMTI.\n
JNCK093=Error JNI a %s\: el m\u00E8tode no \u00E9s un constructor
JNCK094=Error de JNI a %1$s\: les dades a les quals apunta l'argument \#%2$d s'han modificat durant l'execuci\u00F3 de %3$s. \u00C9s possible que un altre fil o una crida imbricada hagi modificat les dades. El resultat de %4$s pot ser incorrecte i \u00E9s possible que la VM sigui inestable.
JNCK091=S'ha detectat un suggeriment al marc de gestor d'una incid\u00E8ncia de JVMPI o JVMTI.\n
JNCK092=\tvalist         comprova la reutilitzaci\u00F3 de va_list
JNCK086=Av\u00EDs de JNI a %1$s\: l'argument \#%2$d no \u00E9s un a java/nio/Buffer. %3$s tornar\u00E0 un codi d'error.
JNCK087=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s un java/lang/reflect/Method ni un java/lang/reflect/Constructor
JNCK084=Av\u00EDs detectat a JNI_OnLoad de la biblioteca %.*s\n
JNCK085=Suggeriment detectat a JNI_OnLoad de la biblioteca %.*s\n
JNCK088=Av\u00EDs de JNI a %1$s\: l'argument \#%2$d \u00E9s una refer\u00E8ncia feble. Una refer\u00E8ncia feble pot esdevenir nul\u00B7la en qualsevol moment. La refer\u00E8ncia s'ha de promoure amb NewLocalRef o NewGlobalRef i, tot seguit, s'ha de comparar amb NULL abans de cridar %3$s.
JNCK089=S'ha detectat un error al marc de gestor d'una incid\u00E8ncia de JVMPI o JVMTI.\n
CFRE020=El PC d'inici de gestor d'excepcions no \u00E9s v\u00E0lid
CFRE021=Camp duplicat
CFRE022=thisClass ha de ser una classe
CFRE023=Agrupaci\u00F3 de constants buida
CFRE024=El nom de classe ha de ser una cadena
CFRE025=El camp t\u00E9 dos atributs ConstantValue
CFRE026=No s'ha reconegut el tipus de codi de bytes de newarray
CFRE027=El codi de bytes de multianewarray ha de fer refer\u00E8ncia a una classe de matriu
CFRE017=Diversos atributs StackMap/StackMapTable
CFRE018=La classe interna ha de ser una classe
CFRE019=Inici de PC de variable local no v\u00E0lid
CFRE031=L'excepci\u00F3 generada ha de ser una classe
CFRE032=La superclasse de la interf\u00EDcie ha de ser java.lang.Object
CFRE033=L'interval del gestor d'excepcions \u00E9s buit
CFRE034=Codi de bytes incomplet
CFRE035=El codi de bytes nou ha de fer refer\u00E8ncia a una classe
CFRE036=Destinaci\u00F3 no d'instrucci\u00F3 al codi de bytes de jump
CFRE037=Temp cont\u00E9 un tipus incorrecte
CFRE038=El m\u00E8tode t\u00E9 dos atributs Exceptions
CFRE030=Superclasse nul\u00B7la
CFRE028=El codi de bytes de ldc* ha de fer refer\u00E8ncia a una constant
CFRE029=El codi de bytes de multianewarray ha de fer refer\u00E8ncia a una classe
CFRE000=%1$s; classe\=%3$.*2$s, m\u00E8tode\=%5$.*4$s%7$.*6$s, pc\=%8$u
CFRE001=%1$s; classe\=%3$.*2$s, despla\u00E7ament\=%4$u
CFRE002=El nom del m\u00E8tode no \u00E9s v\u00E0lid
CFRE003=Versi\u00F3 principal incorrecta
CFRE004=Codi de bytes desconegut
CFRE005=Interf\u00EDcie duplicada
CFRE010=Recompte negatiu per als parells de coincid\u00E8ncia i despla\u00E7ament al codi de bytes de lookupswitch
CFRE011=El codi de bytes d'anewarray ha de fer refer\u00E8ncia a una classe
CFRE012=El valor constant ha de ser un valor
CFRE013=Longitud de PC de variable local no v\u00E0lida
CFRE014=S'ha especificat un atribut de codi per a un m\u00E8tode natiu o abstracte
CFRE015=Les interf\u00EDcies han de ser classes
CFRE016=L'\u00EDndex de variables local est\u00E0 fora de l'interval a l'increment
CFRE006=Atribut StackMap/StackMapTable no v\u00E0lid
CFRE007=La signatura de camp no \u00E9s v\u00E0lida
CFRE008=El valor alt \u00E9s m\u00E9s petit que el valor baix al codi de bytes de tableswitch
CFRE009=El camp d'interf\u00EDcie ha de ser est\u00E0tic p\u00FAblic i final
CFRE064=El descriptor ha de ser una cadena UTF8
CFRE065=Diversos atributs de m\u00E8tode de tancament
CFRE066=Diversos atributs InnerClasses
CFRE067=Etiqueta d'entrada d'agrupaci\u00F3 de constants
CFRE068=El nom de classe no \u00E9s v\u00E0lid
CFRE069=La longitud de l'atribut \u00E9s superior a les dades dels atributs
CFRE060=El PC final de gestor d'excepcions no \u00E9s una instrucci\u00F3 ni el final de la matriu de codis de bytes
CFRE061=El nom ha de ser una cadena UTF8
CFRE062=Els locals m\u00E0xims s\u00F3n m\u00E9s petits que la mida dels arguments
CFRE063=El codi de bytes d'invoke crida un m\u00E8tode no v\u00E0lid
JNCK039=Error de JNI a %1$s\: l'argument \#%2$d \u00E9s nul
JNCK037=Error de JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia local. El seu tipus \u00E9s\: %4$s
JNCK038=Error de JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia d'objecte v\u00E0lida. El seu tipus \u00E9s\: %4$s\n
JNCK031=Error de JNI a %1$s\: l'argument \#%2$d \u00E9s NULL
JNCK032=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s una jobjectArray
JNCK030=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 mentre la recollida de deixalles est\u00E0 inhabilitada (probablement la crida s'ha fet des d'una incid\u00E8ncia de JVMPI o JVMTI)
JNCK035=Error de JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia global. El seu tipus \u00E9s\: %4$s
JNCK036=Error de JNI a %1$s\: l'argument \#%2$d (0x%3$p) no \u00E9s una refer\u00E8ncia global feble. El seu tipus \u00E9s\: %4$s
JNCK033=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s una jarray
JNCK034=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s una %3$s
CFRE075=Signatura de variable local no v\u00E0lida
CFRE076=N\u00FAmero m\u00E0gic incorrecte
CFRE077=Les interf\u00EDcies han de ser abstractes
CFRE078=L'\u00EDndex de classes de m\u00E8tode de tancament ha de fer refer\u00E8ncia a una classe
CFRE079=El PC de gestor d'excepcions no \u00E9s v\u00E0lid
CFRE070=PC de n\u00FAmero de l\u00EDnia no v\u00E0lid
CFRE071=La matriu de codis de bytes \u00E9s buida
CFRE072=Les entrades no estan ordenades al codi de bytes de lookupswitch
CFRE073=S'ha trobat l'atribut StackMap/StackMapTable fora de l'atribut Code
CFRE074=No s'ha especificat cap atribut Code
JNCK028=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 quan hi ha una excepci\u00F3 pendent.
JNCK029=Error JNI a %s\: no es pot cridar aquesta funci\u00F3 dins d'una secci\u00F3 cr\u00EDtica.
JNCK026=Error JNI a %s\: JNIEnv no sembla ser un fil v\u00E0lid, o la mem\u00F2ria s'ha malm\u00E8s, o b\u00E9 no \u00E9s una m\u00E0quina virtual J9
JNCK027=Error JNI a %s\: JNIEnv no \u00E9s el JNIEnv* per al fil actiu
JNCK020=refer\u00E8ncia del depurador
JNCK021=refer\u00E8ncia local en un altre fil
JNCK024=S'ha detectat un error JNI. S'est\u00E0 avortant.
JNCK025=Feu servir -Xcheck\:jni\:nonfatal per seguir amb l'execuci\u00F3 si es detecten errors.
JNCK022=refer\u00E8ncia local alliberada
JNCK023=S'ha detectat un error JNI. S'est\u00E0 continuant...
CFRE042=La mida de la matriu de codi de bytes \u00E9s superior a 65535
CFRE043=El codi de bytes no es pot eixamplar
CFRE044=El codi de bytes d'invokeinterface ha reservat una ranura no zero
CFRE045=L'\u00EDndex d'agrupacions de constants est\u00E0 fora de l'interval
CFRE046=Farciment de codi de bytes de switch incorrecte
CFRE047=La classe d'interf\u00EDcie nom\u00E9s pot ser p\u00FAblica, abstracta o anotaci\u00F3
CFRE048=L'\u00EDndex de variables local est\u00E0 fora de l'interval al magatzem
CFRE049=El codi de bytes de checkcast ha de fer refer\u00E8ncia a una classe
CFRE040=La longitud de l'atribut \u00E9s inferior a les dades dels atributs
CFRE041=Versi\u00F3 secund\u00E0ria err\u00F2nia
JNCK017=refer\u00E8ncia local
JNCK018=refer\u00E8ncia global
JNCK015=\thelp           imprimeix aquesta pantalla
JNCK016=NULL
JNCK019=refer\u00E8ncia global feble
CFRE039=L'\u00EDndex de variables local est\u00E0 fora de l'interval a la c\u00E0rrega
JNCK010=\tnonfatal       no surt de l'aplicaci\u00F3 si es detecten errors
JNCK013=\tnovalist       no comprova la reutilitzaci\u00F3 de va_list
JNCK014=\tpedantic       realitza comprovacions m\u00E9s detallades, per\u00F2 m\u00E9s lentes
JNCK011=\tnowarn         no visualitza avisos
JNCK012=\tnoadvice       no visualitza suggeriments
CFRE053=El m\u00E8tode t\u00E9 m\u00E9s de 255 ranures d'argument
CFRE054=El codi de bytes de camp ha de fer refer\u00E8ncia a Fieldref
CFRE055=El PC final de gestor d'excepcions no \u00E9s v\u00E0lid
CFRE056=Recompte incorrecte d'arguments de codi de bytes d'invokeinterface
CFRE057=El tipus de gestor d'excepcions ha de ser una classe
CFRE058=L'\u00EDndex de variables local est\u00E0 fora de l'interval al retorno de subrutina
CFRE059=El PC de gestor d'excepcions no \u00E9s una instrucci\u00F3
CFRE050=El m\u00E8tode d'interf\u00EDcie ha de ser p\u00FAblic i abstracte
CFRE051=La constant de cadena ha de ser una cadena
CFRE052=La cadena externa ha de ser una classe
JNCK006=\tall            comprova les classes d'aplicaci\u00F3 i sistema
JNCK007=\tverbose        rastreja determinades funcions i activitats JNI
JNCK004=jnichk - Programa d'utilitat JNI per al J9, Versi\u00F3 %s
JNCK005=\u00DAs\: -Xcheck\:jni\:[opci\u00F3[,opci\u00F3[,...]]]
JNCK008=\ttrace          rastreja totes les funcions JNI
JNCK009=\tnobounds       no realitza comprovacions de l\u00EDmits a les cadenes i matrius
JNCK002=Programa d'utilitat de comprovaci\u00F3 JNI\: no es pot registrar cap esdeveniment
JNCK003=Programa d'utilitat de comprovaci\u00F3 JNI\: no es pot assignar l'emmagatzematge local de la VM
JNCK000=-Xcheck\:jni\: no es reconeix l'opci\u00F3 --> '%s'
JNCK001=El programa d'utilitat de comprovaci\u00F3 JNI est\u00E0 instal\u00B7lat. Feu servir -Xcheck\:jni\:help pel seu \u00FAs
JNCK082=Suggeriment detectat al marc m\u00E9s extrem d'un fil connectat\n
JNCK083=Error detectat a JNI_OnLoad de la biblioteca %.*s\n
JNCK080=Error detectat al marc m\u00E9s extrem d'un fil connectat\n
JNCK081=Av\u00EDs detectat al marc m\u00E9s extrem d'un fil connectat\n
SHRC604=Reserva de <size> bytes d'espai de la mem\u00F2ria cau per a dades de classe sense processar
TRCE009=Error en escriure al fitxer breu
SHRC605=La mida de mem\u00F2ria per a "%s" \u00E9s massa gran, o especifica unitats que no s\u00F3n 'K','M' o 'G'.
TRCE008=Error en dur a terme la cerca al fitxer de tra\u00E7a\: %s
SHRC606=Afegeix consells JIT no funcionals als m\u00E8todes per a la comprovaci\u00F3; utilitzar amb -Xint i una mem\u00F2ria cau emplenada pr\u00E8viament.
SHRC607=Emmagatzemades %1$s dades adjuntes %2$s per a %8$.*7$s.%4$.*3$s%6$.*5$s
SHRC600=L'\u00E0rea de dades de classe sense processar est\u00E0 malmesa perqu\u00E8 l'emmagatzematge de %u bytes superar\u00E0 l'espai lliure de l'\u00E0rea disponible ('inici d'espai lliure'\=%p, 'final d'espai lliure'\=%p).
SHRC601=Mida de l'\u00E0rea de dades de classe sense processar    %*c\= %lu
SHRC602=\u00C0rea de dades de classe sense processar %% usat   %*c\= %lu%%
SHRC603=Bytes utilitzats de dades de classe sense processar  %*c\= %lu
JNCK075=Error de jnichk intern a %1$s\: no es reconeix el descriptor 0x%2$x
TRCE001=S'ha produ\u00EFt un error en processar l'opci\u00F3 de tra\u00E7a\: -Xtrace\:%s
JNCK076=Error intern de jnichk a %s\: mem\u00F2ria insuficient
TRCE000=Opci\u00F3 de tra\u00E7a no reconeguda\: -Xtrace\:%s
JNCK073=Suggeriment de JNI a %1$s\: s'ha especificat JNI_ABORT, per\u00F2 no es pot respectar perqu\u00E8 s'han modificat les dades.\n(CRC original\=0x%2$x, CRC nou\=0x%3$x).\nCom que %4$s ha tornat el contingut real de la matriu, els canvis no es descartaran. Probablement no \u00E9s el que voleu.
TRCE003=S'ha produ\u00EFt un error en processar l'opci\u00F3 de tra\u00E7a, detall\: %s
JNCK074=Suggeriment JNI a %s\: La mem\u00F2ria interm\u00E8dia sembla no haver estat modificada. Considereu la possibilitat d'utilitzar JNI_ABORT enlloc de mode 0.
TRCE002=S'ha produ\u00EFt un error en processar l'opci\u00F3 de tra\u00E7a\: -Xtrace\:%s\=%s
TRCE005=Error en escriure la cap\u00E7alera al fitxer de tra\u00E7a\: %s
SHRC608=S'han trobat %1$s dades adjuntes %2$s per a %8$.*7$s.%4$.*3$s%6$.*5$s
JNCK079=S'ha detectat un suggeriment a %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE004=S'ha produ\u00EFt un error en obrir el fitxer de tra\u00E7a\: %s
SHRC609=Actualitzades %1$s dades adjuntes %2$s per a %8$.*7$s.%4$.*3$s%6$.*5$s
TRCE007=S'ha produ\u00EFt un error en obrir la seg\u00FCent generaci\u00F3 del fitxer de tra\u00E7a\: %s
JNCK077=S'ha detectat un error a %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE006=S'ha produ\u00EFt un error en escriure %d bytes al fitxer de tra\u00E7a\: %s rc\: %d
JNCK078=S'ha detectat un av\u00EDs a %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK071=Av\u00EDs de JNI\: la mem\u00F2ria a 0x%1$p adquirida per %2$s no s'ha alliberat abans de tornar de la nativa. Probablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
JNCK072=Suggeriment de JNI a %1$s\: s'ha especificat JNI_COMMIT, per\u00F2 s'ignorar\u00E0. \nCom que %2$s ha tornat el contingut real de la matriu, la mem\u00F2ria interm\u00E8dia no ser\u00E0 v\u00E0lida despr\u00E9s d'aquesta crida. Probablement no \u00E9s el que voleu.
TRCE010=Error d'assignaci\u00F3 de mem\u00F2ria nativa, retrocedint a valors de tra\u00E7a no din\u00E0mics.
JNCK070=Av\u00EDs de JNI a %1$s\: les dades de la matriu original s'han modificat entre %2$s i %3$s.\n(CRC original\=0x%4$x, CRC nou\=0x%5$x).\nCom que %6$s ha tornat una c\u00F2pia del contingut de la matriu, es perdr\u00E0 el nou contingut.
TRCE019=El motor de traces no s'ha pogut inicialitzar correctament, RC \= %d
JNCK064=Av\u00EDs de JNI a %1$s\: la capacitat d'agrupaci\u00F3 de refer\u00E8ncia feble global ha augmentat autom\u00E0ticament de %2$d a %3$d.\nProbablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
TRCE012=No es pot obrir el fitxer comptador de punt de tra\u00E7a %s, comptadors redirigits a stderr.
JNCK065=Av\u00EDs de JNI a %1$s\: la capacitat d'agrupaci\u00F3 de marc de refer\u00E8ncia local ha augmentat autom\u00E0ticament de %2$d a %3$d. Hi ha %4$d refer\u00E8ncies en \u00FAs.\nUtilitzeu EnsureLocalCapacity o PushLocalFrame per fer que el marc augmenti expl\u00EDcitament.
TRCE011=El m\u00F2dul no est\u00E0 configurat per a la tra\u00E7a\: %s
JNCK062=Av\u00EDs JNI a %s\: no es pot cridar aquesta funci\u00F3 dins d'una secci\u00F3 cr\u00EDtica.
TRCE014=Ha fallat la inicialitzaci\u00F3 del motor de traces, no est\u00E0 habilitada la tra\u00E7a
JNCK063=Av\u00EDs de JNI a %1$s\: la capacitat d'agrupaci\u00F3 de refer\u00E8ncia global ha augmentat autom\u00E0ticament de %2$d a %3$d.\nProbablement s'ha produ\u00EFt per una p\u00E8rdua de mem\u00F2ria.
TRCE013=Escriptura d'informaci\u00F3 de recompte de tra\u00E7a a %s
TRCE016=L'emmagatzematge per a RasGlobalStorage no est\u00E0 disponible, la tra\u00E7a no est\u00E0 habilitada
JNCK068=Av\u00EDs de JNI a %1$s\: l'inici o l'\u00EDndex est\u00E0 fora de l'interval (%2$d >\= %3$d)
JNCK069=Av\u00EDs de JNI a %1$s\: el final est\u00E0 fora de l'interval (%2$d + %3$d > %4$d)
TRCE015=S'ha produ\u00EFt un error en registrar el subscriptor d'escriptura de tra\u00E7a
TRCE018=No es pot assignar la clau d'emmagatzematge local de fils UTE
JNCK066=Av\u00EDs de JNI a %1$s\: s'ha especificat un inici o un \u00EDndex negatiu (%2$d)
TRCE017=No es pot assignar la clau d'emmagatzematge local de fils RAS
JNCK067=Av\u00EDs de JNI a %1$s\: s'ha especificat una longitud de regi\u00F3 negativa (%2$d)
CFRE086=El m\u00E8tode t\u00E9 dos atributs Code
CFRE087=El codi de bytes de m\u00E8tode d'interf\u00EDcie ha de fer refer\u00E8ncia a una InterfaceMethodref
CFRE088=El nom de variable local ha de ser una cadena
CFRE089=S'espera un nom i un tipus
JNCK060=Av\u00EDs de JNI a %1$s\: l'argument \#%2$d \u00E9s una signatura de m\u00E8tode amb format incorrecte ("%3$s")
JNCK061=Av\u00EDs de JNI a %1$s\: l'argument \#%2$d \u00E9s una signatura de camp amb format incorrecte ("%3$s")
SHRC620=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. S'ha trobat que el fitxer de control est\u00E0 malm\u00E8s.
CFRE080=La signatura de m\u00E8tode no \u00E9s v\u00E0lida
SHRC621=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Discrep\u00E0ncia en l'ID de mem\u00F2ria compartida.
CFRE081=El fitxer d'origen ha de ser UTF8
CFRE082=\u00C9s possible que el m\u00E8tode <init> no sigui est\u00E0tic, final, sincronitzat, natiu o abstracte
CFRE083=La classe \u00E9s abstracta i final
CFRE084=Cap error
CFRE085=El nom intern ha de ser una cadena
SHRC626=No es poden obtenir les estad\u00EDstiques de la mem\u00F2ria cau compartida perqu\u00E8 no existeix cap mem\u00F2ria cau compartida v\u00E0lida.
SHRC627=No es pot tornar a crear cap fitxer de control de la mem\u00F2ria compartida quan s'executi en mode nom\u00E9s de lectura.
SHRC628=El fitxer de control de mem\u00F2ria compartida no es pot llegir.
JNCK059=Av\u00EDs de JNI a %1$s\: l'argument \#%2$d \u00E9s un identificador amb format incorrecte ("%3$s")
SHRC629=El fitxer de control de mem\u00F2ria compartida \u00E9s nom\u00E9s de lectura.
SHRC622=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Discrep\u00E0ncia en les claus de mem\u00F2ria compartida.
SHRC623=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Ha fallat la comprovaci\u00F3 de l'ID de grup.
SHRC624=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Ha fallat la comprovaci\u00F3 de l'ID d'usuari.
SHRC625=S'ha produ\u00EFt un error en obrir la regi\u00F3 de mem\u00F2ria compartida. Ha fallat la comprovaci\u00F3 de la mida de la mem\u00F2ria compartida.
JNCK053=Error JNI\: la secci\u00F3 cr\u00EDtica s'ha d'alliberar abans del retorn de la funci\u00F3
JNCK054=Error de JNI a %1$s\: opci\u00F3 de mode no reconeguda %2$d
JNCK051=Error de VM intern a %1$s\: la quantitat de bytes transferits %2$p \u00E9s inferior a la quantitats de bytes de refer\u00E8ncia de JNI %3$p
JNCK052=Error de JNI a %1$s\: la classe %3$.*2$s \u00E9s obsoleta
JNCK057=Error de JNI a %1$s\: no utilitzeu %2$s per alliberar mem\u00F2ria 0x%3$p adquirida mitjan\u00E7ant %4$s
JNCK058=Av\u00EDs de JNI a %1$s\: despr\u00E9s de cridar %2$s, cal que comproveu si hi ha excepcions amb ExceptionCheck, ExceptionClear o ExceptionOccurred abans de cridar %3$s
JNCK055=Error de JNI a %1$s\: cap funci\u00F3 de JNI no ha tornat el punter 0x%2$p, o ja s'havia alliberat.
JNCK056=Error de JNI a %1$s\: s'ha obtingut la mem\u00F2ria 0x%2$p de l'objecte 0x%3$p, alliberant-la de 0x%4$p
CFRE097=Entrada de classe interna duplicada a l'atribut InnerClasses
CFRE098=La signatura de variable local ha de ser una cadena
CFRE099=Modificadors de m\u00E8tode no permesos
JNCK050=Error JNI a %s\: s'ha cridat a PopLocalFrame sense un marc local a la pila
CFRE090=El codi de bytes nou no pot crear matrius
CFRE091=El PC d'inici de gestor d'excepcions no \u00E9s una instrucci\u00F3
SHRC610=Inhabilita el suport per a la instrumentaci\u00F3 de codi de byte.
CFRE092=Signatura no v\u00E0lida
CFRE093=El m\u00E8tode pot ser, com a molt, p\u00FAblic, privat o protegit
CFRE094=El codi de bytes d'instanceof ha de fer refer\u00E8ncia a una classe
CFRE095=Les anotacions han de ser interf\u00EDcies
CFRE096=Destinaci\u00F3 no d'instrucci\u00F3 al codi de bytes de switch
SHRC615=S'ha produ\u00EFt un error en obrir el sem\u00E0for. Discrep\u00E0ncia en la clau de sem\u00E0for.
SHRC616=S'ha produ\u00EFt un error en obrir el sem\u00E0for. Discrep\u00E0ncia en el nombre de sem\u00E0fors al conjunt de sem\u00E0fors.
SHRC617=S'ha produ\u00EFt un error en obrir el sem\u00E0for. No s'ha trobat el marcador de sem\u00E0fors al conjunt de sem\u00E0fors.
JNCK048=Error JNI a %s\: el receptor no \u00E9s comprensible
SHRC618=El fitxer de control de sem\u00E0for no es pot llegir.
JNCK049=Error JNI a %s\: s'ha detectat un \u00FAs repetit de va_list
SHRC611=La subopci\u00F3 "disableBCI" s'ha especificat, per\u00F2 la mem\u00F2ria cau existent es va crear amb la subopci\u00F3 "enableBCI".
SHRC612=Clau d'emmagatzematge (0- 15) definida artificialment al z/OS per a la comprovaci\u00F3.
SHRC613=S'ha produ\u00EFt un error en obrir el sem\u00E0for. S'ha trobat que el fitxer de control est\u00E0 malm\u00E8s.
SHRC614=S'ha produ\u00EFt un error en obrir el sem\u00E0for. Discrep\u00E0ncia en l'ID de sem\u00E0for.
JNCK042=Error de JNI a %1$s\: l'argument \#%2$d no \u00E9s una subclasse de %3$s
JNCK043=Error de JNI a %1$s\: argument \#%2$d; no es pot trobar %3$s
JNCK040=Error de JNI a %1$s\: l'argument \#%2$d \u00E9s fora de l'interval d'un %3$s (0x%4$x < 0x%5$x)
JNCK041=Error de JNI a %1$s\: l'argument \#%2$d \u00E9s fora de l'interval d'un %3$s (0x%4$x > 0x%5$x)
SHRC619=El fitxer de control de sem\u00E0for \u00E9s nom\u00E9s de lectura.
JNCK046=Error de JNI a %1$s\: el m\u00E8tode t\u00E9 un tipus de retorn incorrecte ('%2$c')
JNCK047=Error JNI a %s\: l'argument clazz \u00E9s incorrecte
JNCK044=Error JNI a %s\: el m\u00E8todes \u00E9s est\u00E0tic
JNCK045=Error JNI a %s\: el m\u00E8tode no \u00E9s est\u00E0tic
SHRC520=\t classpath   Imprimeix nom\u00E9s els tipus classpath a la mem\u00F2ria cau compartida.
SHRC521=\t url               Imprimeix nom\u00E9s els tipus url a la mem\u00F2ria cau compartida.
SHRC522=\t token           Imprimeix nom\u00E9s els tipus token a la mem\u00F2ria cau compartida.
SHRC527=\t zipcache     Imprimeix nom\u00E9s els tipus zipcache a la mem\u00F2ria cau compartida.
SHRC528=\t extra           Imprimeix tots els tipus privats seg\u00FCents a la mem\u00F2ria cau compartida.
SHRC529=\t orphan         Imprimeix nom\u00E9s els tipus orphan a la mem\u00F2ria cau compartida.
SHRC523=\t romclass     Imprimeix nom\u00E9s els tipus romclass a la mem\u00F2ria cau compartida.
SHRC524=\t rommethod   Imprimeix nom\u00E9s els tipus rommethod a la mem\u00F2ria cau compartida.
SHRC525=\t aot               Imprimeix nom\u00E9s els tipus aot a la mem\u00F2ria cau compartida.
SHRC526=\t jitprofile Imprimeix nom\u00E9s els tipus jitprofile a la mem\u00F2ria cau compartida.
SHRC510=Inhabilita la creaci\u00F3 d'abocaments de mem\u00F2ria a mem\u00F2ries cau malmeses
SHRC511=La mem\u00F2ria cau composta t\u00E9 un valor d'indicador d'inicialitzaci\u00F3 erroni. El valor de ccInitComplete \u00E9s %lu
SHRC516=Llista tots els elements de la mem\u00F2ria cau per defecte. Utilitzeu printallstats\=help per veure les opcions disponibles.
SHRC517=Subopci\u00F3 no reconeguda per a l'opci\u00F3 printallstats\= . Utilitzeu printallstats\=help per veure les opcions disponibles.
SHRC518=Opcions disponibles per a -Xshareclasses\:printAllStats\=<options>. Utilitzeu '+' per especificar diverses opcions. \u00C9s a dir, printallstats\=aot+url \n
SHRC519=\t all               Imprimeix tots els tipus seg\u00FCents a la mem\u00F2ria cau compartida.
SHRC512=no hi ha dades a la mem\u00F2ria cau
SHRC513=Defineix els permisos d'estil unix per crear directoris de mem\u00F2ria cau
SHRC514=Valor no v\u00E0lid per a l'opci\u00F3 cacheDirPerm. Ha de ser un perm\u00EDs de fitxer d'estil unix de l'interval 0700 - 0777 o 1700 - 1777 (en representaci\u00F3 octal).
SHRC515=No s'ha pogut obtenir el directori de mem\u00F2ria cau per defecte.
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC549=-Xshareclasses\:checkStringTableReset pot donar error. La taula de cadenes no \u00E9s prou gran. Ha de ser m\u00E9s gran que la mida d'una p\u00E0gina del sistema operatiu. Mida de la taula \= %d, Mida de la p\u00E0gina \= %d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC547=No es pot assignar mem\u00F2ria per a la matriu de car\u00E0cters a shrinit
SHRC548=For\u00E7a la comprovaci\u00F3 de reinici de la taula de cadenes quan estigui marcada com a malmesa. 
SHRC530=\t jithint       Imprimeix nom\u00E9s els tipus jithint a la mem\u00F2ria cau compartida.
SHRC531=\t aotch           Imprimeix nom\u00E9s els tipus aotch a la mem\u00F2ria cau compartida.
SHRC532=\t aotthunk     Imprimeix nom\u00E9s els tipus aotthunk a la mem\u00F2ria cau compartida.
SHRC533=\t aotdata       Imprimeix nom\u00E9s els tipus aotdata a la mem\u00F2ria cau compartida.
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC534=\t jcl               Imprimeix nom\u00E9s els tipus jcl a la mem\u00F2ria cau compartida.
SHRC535=\t bytedata     Imprimeix tota la resta de tipus de bytedata a la mem\u00F2ria cau compartida.
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s Adre\u00E7a\: 0x%5$p Mida\: %6$d
SHRC563=Com obrir una mem\u00F2ria cau en temps real, que no \u00E9s compatible amb aquesta JVM, utilitzeu l'opci\u00F3 -Xrealtime JVM per accedir a aquesta mem\u00F2ria cau
SHRC564=[-Xshareclasses mem\u00F2ria cau compartida de diversos convidats habilitada]
SHRC565=Crea mem\u00F2ria cau de classes compartides de diversos convidats
SHRC566=El reclam de cap\u00E7alera de mem\u00F2ria cau de classe compartides entre convidats no \u00E9s v\u00E0lid
SHRC560=El nom de la mem\u00F2ria cau interna no \u00E9s adequat.
SHRC561=No s'ha pogut inicialitzar la mem\u00F2ria cau de classes compartides, no hi ha prou espai al sistema de fitxers. Bytes d'espai lliure de disc disponibles \= %lld, bytes sol\u00B7licitats \= %lld.
SHRC562=Lectura de dades malmeses per a la cap\u00E7alera d'entrada de mem\u00F2ria cau 0x%p (longitud d'element no v\u00E0lida de %u bytes)
SHRC567=La mem\u00F2ria cau de classes compartides obertes de diversos convidats %1$s \u00E9s nom\u00E9s de lectura
SHRC568=Mem\u00F2ria cau de diversos convidats de classes compartides oberta %1$s
SHRC569=S'ha creat la mem\u00F2ria cau de diversos convidats de classes compartides %1$s
SHRC552=No es pot assignar la mida de bloc sol\u00B7licitada per a la mem\u00F2ria cau "%s". Bytes disponibles \= %d, Bytes sol\u00B7licitats \= %d
SHRC553=La mem\u00F2ria cau nom\u00E9s cont\u00E9 classes amb n\u00FAmeros de l\u00EDnia
SHRC554=La mem\u00F2ria cau nom\u00E9s cont\u00E9 classes sense n\u00FAmeros de l\u00EDnia
SHRC555=La mem\u00F2ria cau nom\u00E9s cont\u00E9 classes amb n\u00FAmeros de l\u00EDnia i classes sense n\u00FAmeros de l\u00EDnia
SHRC550=Falta l'indicador execuci\u00F3 ROUND_TO_PAGE_SIZE. -Xshareclasses\:checkStringTableReset requereix que la taula de cadenes s'arrodoneixi a la mida de la p\u00E0gina.
SHRC551=La mem\u00F2ria cau "%s" est\u00E0 marcada com a plena. No s'ha pogut assignar la mida de bloc \= %d.
SHRC556=Imprimeix el resum de les estad\u00EDstiques de la mem\u00F2ria cau. Utilitzeu printstats\=help per veure les opcions disponibles.
SHRC557=Subopci\u00F3 no reconeguda per a l'opci\u00F3 printstats\= . Utilitzeu printstats\=help per veure les opcions disponibles.
SHRC558=Opcions disponibles per a -Xshareclasses\:printStats\=<opcions>. Utilitzeu '+' per especificar diverses opcions. \u00C9s a dir, printstats\=aot+url \n
SHRC559=No s'ha pogut crear el directori "%s" per a la mem\u00F2ria cau de classes compartides
SHRC580=Error en alliberar el bloqueig de lectura de connexi\u00F3 de mem\u00F2ria cau de classes compartides de diversos convidats
SHRC101=\t\u00CDndex %1$d a la variable classpath 0x%2$p
SHRC585=Error en adquirir el bloqueig d'escriptura de cap\u00E7alera de mem\u00F2ria cau de classes compartides de diversos convidats
SHRC102=\tURL 0x%p
SHRC586=Error\: la mem\u00F2ria cau de classes compartides de diversos convidats t\u00E9 una cap\u00E7alera no v\u00E0lida
SHRC103=\tTestimoni 0x%p
SHRC587=S'ha produ\u00EFt un error en actualitzar l'hora de darrera desconnexi\u00F3 de la mem\u00F2ria cau de classes compartides de diversos convidats
SHRC104=%1$d\: 0x%2$p CLASSPATH
SHRC588=Error en alliberar el bloqueig de lectura de connexi\u00F3 de mem\u00F2ria cau de classes compartides de diversos convidats
SHRC581=Error en correlacionar un objecte compartit de diversos convidats
SHRC582=Error\: no es pot suprimir la mem\u00F2ria cau de classes compartides de visitant
SHRC583=S'ha produ\u00EFt un error en actualitzar "last detached" per la mem\u00F2ria cau de classes compartides de convidats
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s at 0x%5$p.
SHRC584=Error en adquirir el bloqueig de lectura de connexi\u00F3 de mem\u00F2ria cau de classes compartides de diversos convidats
SHRC109=DESFASAT\!
SHRC105=%1$d\: 0x%2$p URL
SHRC589=Crea la mem\u00F2ria cau amb suport per a la instrumentaci\u00F3 de codi de bytes.
SHRC106=%1$d\: 0x%2$p TOKEN
SHRC107=\t%.*s
SHRC108=\t%.*s
SHRC574=La mem\u00F2ria cau compartida de diversos convidats no es pot localitzar en un sistema de fitxers en xarxa. Seleccioneu "nonpersistent" o un altre cacheDir.
SHRC575=Error en adquirir el bloqueig d'escriptura per a la cap\u00E7alera a mem\u00F2ria cau de classe compartida entre convidats
SHRC576=La mem\u00F2ria cau compartida de diversos convidats no es pot obrir amb acc\u00E9s nom\u00E9s de lectura perqu\u00E8 encara no s'ha inicialitzat
SHRC577=No es pot crear una mem\u00F2ria cau compartida de diversos convidats en mode nom\u00E9s de lectura
SHRC570=La mem\u00F2ria cau compartida de diversos convidats "%1$s" s'ha destru\u00EFt
SHRC571=S'ha connectat la mem\u00F2ria cau de diversos convidats de classes compartides %1$s
SHRC572=Especificaci\u00F3 de destinaci\u00F3 incorrecta. La destinaci\u00F3 especificada a la cap\u00E7alera de mem\u00F2ria cau \u00E9s\: %s, per\u00F2 s'esperava\: %s.
SHRC573=L'opci\u00F3 de l\u00EDnia d'ordres "- Xshareclasses\:%s" requereix "-Xvirt"
SHRC578=S'ha produ\u00EFt un error en crear cap\u00E7alera a mem\u00F2ria cau de classes compartides de visitant
SHRC579=Error inicialitzar la cap\u00E7alera de dades de mem\u00F2ria cau compartida de diversos convidats
SHRC123=%% de classes obsoletes    \= %1$d%%\n
SHRC124=La mem\u00F2ria cau \u00E9s plena al %1$d%%.\n
SHRC125=No s'ha pogut assignar mem\u00F2ria per a la mem\u00F2ria interm\u00E8dia de cadenes a SH_CacheMap.
SHRC126=S'ha fet una sol\u00B7licitud per afegir massa elements a ClasspathItem.
SHRC120=\# URL           \= %d
SHRC121=\# Senyals         \= %d
SHRC122=\# Classes desfasades  \= %d
SHRC127=SH_CompositeCache\:\:enterMutex ha fallat amb el codi de retorn %d. Av\u00EDs\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa.
SHRC128=SH_CompositeCache\:\:exitMutex ha fallat amb el codi de retorn %d. Av\u00EDs\: \u00E9s possible que la mem\u00F2ria cau estigui malmesa.
SHRC129=S'ha intentat definir readerCount en -1.
SHRC590=La subopci\u00F3 "enableBCI" s'ha especificat, per\u00F2 la mem\u00F2ria cau existent no s'ha creat amb la subopci\u00F3 "enableBCI".
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
SHRC112=Punter d'assignaci\u00F3 \= 0x%p\n
SHRC596=Fes comprovacions addicionals en emmagatzemar i assignar dades de classes fora de l\u00EDnia
SHRC113=mida de mem\u00F2ria cau       \= %d
SHRC597=-Xshareclasses\:rcdSize\=%u bytes \u00E9s m\u00E9s gran que %u bytes d'espai lliure disponible,- Xshareclasses\:rcdSize\=%u s'utilitzar\u00E0 en el seu lloc.
SHRC114=bytes lliures       \= %d
SHRC598=L'\u00C0rea de dades de classe sense processar est\u00E0 malmesa perqu\u00E8 la seva mida de %lu \u00E9s superior a la mida de mem\u00F2ria cau total de %lu.
SHRC115=Bytes de ROMClass   \= %d
SHRC599=L'espai lliure de l'\u00E0rea de dades de classe sense processar est\u00E0 malmesa ('inici d'espai lliure'\=%p, 'final d'espai lliure'\=%p, 'mida lliure'\= %lu bytes)
SHRC592=BCI habilitat       \= true
SHRC593=BCI habilitat      \= false
SHRC110=\nAdre\u00E7a base       \= 0x%p
SHRC594=La subopci\u00F3 Xshareclasses\:cacheRetransformed no \u00E9s compatible amb una mem\u00F2ria cau compartida creada amb la subopci\u00F3 enableBCI
SHRC111=Adre\u00E7a final        \= 0x%p
SHRC595=Les opcions de la l\u00EDnia d'ordres "%s" i "%s" s\u00F3n incompatibles
SHRC116=Bytes de metadades   \= %d
SHRC117=Metadades %% utilitzades \= %1$d%%\n
SHRC118=\# ROMClasses     \= %d
SHRC119=\# Classpaths     \= %d
J9TI006=Renuncia a les possibilitats ampliades de capabilities_ptr.
J9TI007=Obt\u00E9n el conjunt actual de possibilitats ampliades mitjan\u00E7ant capabilities_ptr.
J9TI004=Torna mitjan\u00E7ant les possibilitats capabilities_ptr ampliades disponibles en aquest moment.
SHRC140=mida\:\t%1$d\t\t\t%2$d\n
J9TI005=Afegeix les noves possibilitats ampliades des de capabilities_ptr.
J9TI008=Indica l'inici d'una fase de compilaci\u00F3 JIT. (No hi ha la seguretat de crida de retorn)
J9TI009=Indica el final d'una fase de compilaci\u00F3 JIT. (No hi ha la seguretat de crida de retorn)
SHRC145=S'est\u00E0 cercant la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb l'URL %4$.*3$s...
SHRC146=S'est\u00E0 cercant la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d amb el testimoni %4$.*3$s...
VMUT001=(fil sense nom)
SHRC147=El car\u00E0cter %.*s no \u00E9s v\u00E0lid pel nom de la mem\u00F2ria cau
VMUT000=(sense mem\u00F2ria)
SHRC148=Permetre l'acc\u00E9s del grup a la mem\u00F2ria cau (a l'usuari \u00E9s per defecte)
VMUT003=No s'ha trobat el fitxer d'opcions
SHRC141=bytes no coincidents\:
VMUT002=(error d'acc\u00E9s)
SHRC142=\ta 0x%1$p\t\t%2$x \!\= %3$x
VMUT005=Opci\u00F3 massa gran\: '%s'
SHRC143=S'est\u00E0 emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s...
VMUT004=Opci\u00F3 mal formada\: '%s'
SHRC144=S'est\u00E0 emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb el testimoni %5$.*4$s...
SHRC149=Habilita la sortida detallada de cerca/magatzem
J9TI002=Agent_OnLoad no s'ha trobat a la biblioteca %s
J9TI003=Agent_OnLoad ha fallat per la biblioteca %s
J9TI000=Sense mem\u00F2ria s'ha intentat carregar un agent de la biblioteca %s
J9TI001=No s'ha pogut obrir la biblioteca d'agent %1$s (%2$s)
J9TI017=Controla diverses opcions de VM i compilaci\u00F3.
J9TI018=Defineix un m\u00E8tode per a la notificaci\u00F3 selectiva d'entrada i sortida.
J9TI015=Sol\u00B7licita un abocament de mem\u00F2ria del Java Lock Monitor (JLM).
J9TI016=Permet la col\u00B7locaci\u00F3 a la mateixa l\u00EDnia en pres\u00E8ncia d'incid\u00E8ncies d'entrada i sortida de m\u00E8tode (cosa que pot fer que es notifiquin de forma inacurada entrades i sortides)
J9TI019=Defineix el mode de notificaci\u00F3 per a les incid\u00E8ncies ampliades, cosa que permet la selectivitat de nivell de fil
SHRC134=No s'ha pogut crear l'agrupaci\u00F3 a SH_ROMClassManagerImpl.
VMUT010=Valor d'opci\u00F3 amb format incorrecte; l'opci\u00F3 "%1$s%3$.*2$s" cont\u00E9 car\u00E0cters finals "%4$s" que s'han ignorat
SHRC135=No s'ha pogut crear una taula de hash a SH_ROMClassManagerImpl.
SHRC136=No es pot crear el supervisor a SH_ROMClassManagerImpl.
VMUT012=%2$.*1$s no \u00E9s una superinterf\u00EDcie de directe %4$.*3$s.
VMUT011=No s'ha pogut assignar mem\u00F2ria per la matriu d'opcions de la l\u00EDnia d'ordres
SHRC137=MODALITAT SEGURA\: Av\u00EDs\: ROMClass %.*s no coincideix amb ROMClass a la mem\u00F2ria cau
SHRC130=S'ha intentat assignar mentre hi havia una confirmaci\u00F3 pendent.
VMUT014=La classe de receptor %2$.*1$s ha de ser la classe actual o un subtipus de la interf\u00EDcie %4$.*3$s.
SHRC131=No es pot assignar mem\u00F2ria per a l'element de la llista enlla\u00E7ada a ROMClassManagerImpl.
VMUT013=El fitxer d'opcions %s no \u00E9s v\u00E0lid.
SHRC132=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a ROMClassManagerImpl.
SHRC133=No es pot entrar al mutex de la taula d'aleatoritzaci\u00F3 ClasspathManager.
VMUT007=Valor amb format incorrecte per a JAVA_TOOL_OPTIONS
VMUT006=S'ha trobat una opci\u00F3 amb el format incorrecte %s a -Xoptionsfile
VMUT009=Valor mal format per -Xservice
VMUT008=Valor mal format per IBM_JAVA_OPTIONS
SHRC138=S'ha trobat m\u00E9s d'una ROMClass \u00F2rfena per a %.*s.
SHRC139=\n\tROMClass s'est\u00E0 emmagatzemant\tROMClass a la mem\u00F2ria cau
J9TI010=Entrada de m\u00E8tode amb informaci\u00F3 ampliada sobre el tipus de m\u00E8tode.
J9TI013=Permet les crides de retorn per a les assignacions instrumentables (les notificades per VMObjectAlloc).
J9TI014=Controla el Java Lock Monitor (JLM) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI011=Afegeix una opci\u00F3 -Xtrace din\u00E0mica
J9TI012=Afegeix una opci\u00F3 -Xdump din\u00E0mica
SHRC160=S'ha superat el temps d'espera per al mutex de creaci\u00F3 mentre s'obria el sem\u00E0for.
SHRC161=S'ha superat el temps d'espera per al mutex de creaci\u00F3 mentre es creava la mem\u00F2ria compartida.
SHRC162=S'ha superat el temps d'espera per al mutex de creaci\u00F3 mentre s'obria la mem\u00F2ria compartida.
SHRC167=Inhabilita l'\u00FAs compartit de les classes.
SHRC168=Bytes totals de classes compartides llegits\=%1$lld. Bytes totals emmagatzemats\=%2$d
SHRC169=S'ha detectat un canvi a %2$.*1$s...\n \t...S'han marcat %3$d classes emmagatzemades a la mem\u00F2ria cau com a obsoletes.
SHRC163=[Sortida detallada de -Xshareclasses habilitada]
SHRC164=[Sortida d'E/S detallada de -Xshareclasses habilitada]
SHRC165=[Sortida detallada d'API d'ajuda de -Xshareclasses habilitada]
SHRC166=Connectat a la mem\u00F2ria cau "%1$s", mida\=%2$d bytes
SHRC150=Habilita la sortida detallada d'API d'ajuda
SHRC151=Suprimeix tots els missatges
SHRC156=Error en copiar el nom de grup al nom de mem\u00F2ria cau
SHRC157=No es poden assignar %1$d bytes de mem\u00F2ria compartida sol\u00B7licitada\n \tMem\u00F2ria compartida m\u00E0xima assignada correctament permesa (%2$d bytes) \n \t(Per augmentar la mem\u00F2ria compartida disponible, modifiqueu el valor SHMMAX del sistema)
SHRC158=S'ha creat la mem\u00F2ria cau de classes compartides "%1$s".
SHRC159=S'ha obert la mem\u00F2ria cau de classes compartides "%1$s".
SHRC152=Inicia sempre la JVM independentment dels errors/avisos
SHRC153=Especifiqueu el nom de la mem\u00F2ria cau compartida.\n \t(Utilitzeu %%g per substituir el nom de grup i %%u per al nom d'usuari).
SHRC154=El car\u00E0cter d'escapament %.*s no \u00E9s v\u00E0lid per a noms de mem\u00F2ria cau.
SHRC155=Error en copiar el nom d'usuari al nom de mem\u00F2ria cau
SHRC181=No es pot entrar al mutex de taula de hash de ClasspathManager.
SHRC182=No es pot crear el supervisor a ScopeManagerImpl.
SHRC183=No es pot crear la taula de hash a ScopeManagerImpl.
SHRC184=\tPartici\u00F3 %.*s
SHRC180=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash a ScopeManagerImpl.
SHRC189=N\u00FAm. m\u00E8todes AOT      \= %d
SHRC185=\tModContext %.*s
SHRC186=\tPartici\u00F3 %.*s a ModContext %.*s
SHRC187=Inhabilita l'emmagatzematge de dades AOT a la mem\u00F2ria cau est\u00E0ndard
SHRC188=Bytes AOT          \= %d
SHRC170=Especifiqueu el nom de la mem\u00F2ria cau compartida.\n \t(Utilitzeu %%u per substituir el nom d'usuari).
SHRC171=El z/OS no pot crear la mem\u00F2ria cau de la mida sol\u00B7licitada\: comproveu els par\u00E0metres BPXPRMxx del sistema z/OS.
SHRC172=No es pot crear la mem\u00F2ria cau de la mida sol\u00B7licitada a causa de restriccions del sistema operatiu.
SHRC173=Defineix el directori dels fitxers de control de la JVM (avan\u00E7at)
SHRC178=S'ignorar\u00E0 l'opci\u00F3 noIncrementalUpdates a caus de l'\u00FAs de l'opci\u00F3 singleJVM.
SHRC179=El segment ROMClass s'ha malm\u00E8s. Error en llegir ROMClass a 0x%p.
SHRC174=Habilita les optimitzacions per a un sol \u00FAs de la JVM
SHRC175=Fes que la mem\u00F2ria cau sigui persistent despr\u00E9s de les rearrencades (nom\u00E9s el Win)
SHRC176=Reubicaci\u00F3 d'invariants de cadena habilitada
SHRC177=No es pot treballar en mode segur a causa de l'opci\u00F3 singleJVM.
SHRC082=No es pot crear identifiedMutex a SH_ClasspathManagerImpl2.
J9VM039=-Xscmx s'ignora si no s'ha especificat -Xshareclasses
SHRC083=No es pot assignar mem\u00F2ria per a la matriu identifiedClasspaths a SH_ClasspathManagerImpl2
SHRC084=No es pot assignar mem\u00F2ria per a l'element de la llista enlla\u00E7ada.
SHRC085=ERROR\: No es pot assignar mem\u00F2ria per a la cap\u00E7alera d'element de llista vinculada.
SHRC080=No es pot assignar mem\u00F2ria per a l'entrada de taula de hash.
SHRC081=No es pot crear cpeTableMutex a SH_ClasspathManagerImpl2.
SHRC086=No es pot entrar al mutex de la taula d'aleatoritzaci\u00F3 ClasspathManager.
SHRC087=MarkStale ha fallat durant ClasspathManager\:\:update().
SHRC088=No s'ha pogut crear una mem\u00F2ria cau com a ROMImageSegment a SH_CacheMap.
SHRC089=No es pot crear el mutex de renovaci\u00F3 a SH_CacheMap.
J9TI060=Crea una subscripci\u00F3 amb registres de recollida de deixalles detallada
J9TI061=Cancel\u00B7la una subscripci\u00F3 amb registres de recollida de deixalles detallada
J9VM030=S'ha utilitzat UTF8 no v\u00E0lid a la funci\u00F3 JNI
J9VM031=La classe necess\u00E0ria %2$.*1$s ha d'estar al cam\u00ED d'acc\u00E9s de classes d'engegada, per\u00F2 s'ha trobat al cam\u00ED d'acc\u00E9s de classes de l'aplicaci\u00F3 a %4$.*3$s
J9TI064=La funci\u00F3 d'inicialitzaci\u00F3 de l'agent %s ha fallat per a la biblioteca %s, codi de retorn %d
CDRT000=No es pot localitzar la correlaci\u00F3 de pila JIT - s'est\u00E0 avortant la VM
J9VM032=Error no recuperable\: no es pot carregar %1$s\: %2$s
J9TI065=La funci\u00F3 d'inicialitzaci\u00F3 de l'agent %s no s'ha trobat a la biblioteca %s
J9VM033=Error no recuperable\: no s'ha pogut inicialitzar %s
J9TI062=Obt\u00E9n el punter J9VMThread des d'un jthread
CDRT002=PC amb errors\: %1$p (despla\u00E7alment %2$p), metaData \= %3$p
J9VM034=JVMRI requereix motor de traces\: s'executa amb el senyalador -Xtrace
J9TI063=Obt\u00E9n el punter J9Method des de JMethodID
CDRT001=M\u00E8tode\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
J9VM035=No es pot assignar OutOfMemoryError
J9VM036=divideix per zero
J9VM037=No s'ha pogut assignar el supervisor
J9TI066=Crea una subscripci\u00F3 als punts de rastreig de la MV
J9VM038=-Xthr\: no es reconeix l'opci\u00F3 --> '%s'
J9TI067=Cancel\u00B7la una subscripci\u00F3 als punts de rastreig de la VM
SHRC071=L'opci\u00F3 de l\u00EDnia d'ordres "%s" exigeix una subopci\u00F3.
J9VM028=\ta %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
SHRC072=No es reconeix l'opci\u00F3 de la l\u00EDnia d'ordres "%s"
J9VM029=\ta (m\u00E8tode desconegut)
SHRC073=S'est\u00E0 emmagatzemant la classe %2$.*1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %3$d amb l'URL %5$.*4$s (\u00EDndex %6$d)...
SHRC074=\ correcte.
SHRC070=S'han inhabilitat les actualitzacions incrementals
SHRC079=No es pot crear una taula de hash a SH_ClasspathManagerImpl2.
SHRC075=\ ha fallat.
SHRC076=S'est\u00E0 cercant la classe %1$s a la mem\u00F2ria cau compartida per a l'ID de carregador de classes %2$d...
SHRC077=No s'ha pogut crear l'agrupaci\u00F3 linkedListImpl a SH_ClasspathManagerImpl2.
SHRC078=No s'ha pogut crear l'agrupaci\u00F3 linkedListHdr a SH_ClasspathManagerImpl2.
J9VM020=Cercat a %.*s
J9VM021=Sense mem\u00F2ria per a la correlaci\u00F3 de piles d'int\u00E8rpret - avortant la VM
J9VM022=Ha fallat el mapatge de pila, resultat \= %p - s'avorta la VM
J9VM023=Aix\u00F2 pot indicar que JAVA_HOME \u00E9s incorrecte o que les biblioteques de classe no s'han instal\u00B7lat
J9VM024=Excepci\u00F3 al fil "%.*s"\# START NON-TRANSLATABLE
J9VM025=\ta %2$.*1$s.%4$.*3$s (m\u00E8tode nadiu)
J9VM026=\ta %2$.*1$s.%4$.*3$s (origen desconegut)
J9VM027=\ta %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM050=-Xjni\: opci\u00F3 no reconeguda --> '%s'
J9VM051=\u00DAs\:\n
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] estableix la mida m\u00E0xima de la matriu en mem\u00F2ria cau JNI\n
J9VM053=S'ha trobat una opci\u00F3 amb el format incorrecte %s a -Xoptionsfile
J9VM054=No s'ha pogut crear un fil\: retVal %1$zd, errno %2$zd
J9VM055=Error no recuperable\: versi\u00F3 principal de JXE diferent de %d
J9VM056=Versi\u00F3 principal
J9VM057=S'ha superat el l\u00EDmit de mem\u00F2ria cau de supervisi\u00F3
J9VM058=-Xscminaot s'ignora si no s'especifica -Xshareclasses
J9VM059=-Xscmaxaot s'ignora si no s'especifica -Xshareclasses
SHRC093=S'ha detectat una finalitzaci\u00F3 inesperada d'una altra JVM durant l'actualitzaci\u00F3.
SHRC094=S'ha trobat un orfe per\u00F2 la ROMClass local ha passat a addROMClassToCache.
SHRC095=No s'ha pogut fer una crida a markStale a elements de mem\u00F2ria cau compartida.
SHRC096=La mem\u00F2ria cau compartida "%s" \u00E9s plena. Utilitzeu -Xscmx per definir la mida de la mem\u00F2ria cau.
SHRC090=No s'ha pogut obtenir el mutex de mem\u00F2ria cau a l'inici de SH_CacheMap.
SHRC091=S'han llegit dades malmeses per a l'element 0x%p (dataType no v\u00E0lid).
SHRC092=Error ADD en llegir la mem\u00F2ria cau
SHRC097=La mem\u00F2ria cau compartida "%s" est\u00E0 malmesa. No s'assignaran noves JVM per connectar-se a la mem\u00F2ria cau.\n \tLes JVM existents poden continuar funcionant, per\u00F2 no poden actualitzar la mem\u00F2ria cau.
SHRC098=\nEstad\u00EDstiques actuals per a la mem\u00F2ria cau "%s"\: \n
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s at 0x%5$p.
JITM031=El valor per a '%s' no \u00E9s correcte
JITM032=L'opci\u00F3 '%1$s' no est\u00E0 completa, s'ha d'especificar el par\u00E0metre '%2$s'.
J9VM040=desbordament de pila de sistema operatiu
JITM030=El valor %s especificat \u00E9s massa llarg
J9VM041=nombre incorrecte d'arguments
JITM035=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa per a la mem\u00F2ria cau de codi JIT; es fa servir %3$zu%4$s %5$s alternativament
J9VM042=Configuraci\u00F3 de fils
JITM036=La mida de p\u00E0gina gran %1$zu%2$s %3$s no \u00E9s una mida de p\u00E0gina admesa per a la mem\u00F2ria cau de codi JIT; es fa servir %4$zu%5$s alternativament
J9VM043=-----------------------
JITM033=Els car\u00E0cters de coma addicional descoberts a l'opci\u00F3 '- Xlp' s'ignoraran
J9VM044=S'admeten supervisors de sistema de tres nivells
JITM034=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa per a la mem\u00F2ria cau de codi JIT; es fa servir %3$zu%4$s alternativament
J9VM045=No s'admeten supervisors de sistema de tres nivells
J9VM046=JLM adm\u00E8s
J9VM047=JLM no adm\u00E8s
JITM037=La mida de p\u00E0gina gran %1$zu%2$s %3$s no \u00E9s una mida de p\u00E0gina admesa per a la mem\u00F2ria cau de codi JIT; es fa servir %4$zu%5$s %6$s alternativament
J9VM048=S'admeten temps de retenci\u00F3 de JLM
J9VM049=No s'admeten temps de retenci\u00F3 de JLM
J9TI028=Notifica el final d'un abocament de mem\u00F2ria de RAS.
J9TI029=Consulta la configuraci\u00F3 d'agent d'abocament de mem\u00F2ria de RAS.
JITM019=Discrep\u00E0ncia a la caracter\u00EDstica Concurrent Scavenge. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI026=Activa un abocament de mem\u00F2ria amb la configuraci\u00F3 de RAS indicada.
J9TI027=Notifica l'inici d'un abocament de mem\u00F2ria de RAS.
J9RI019=jvmri->InjectOutOfMemory no est\u00E0 suportat.
J9RI017=No s'ha pogut assignar l'agent d'abocament de mem\u00F2ria a jvmri->SetOutOfMemoryHook; no s'ha registrat la funci\u00F3.
J9RI018=jvmri->NotifySignal que activa la senyal %d.
JITM020=Discrep\u00E0ncia a la caracter\u00EDstica software de barrera de lectura. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM021=Discrep\u00E0ncia a la caracter\u00EDstica TM. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM024=Discrep\u00E0ncia a Compressedrefs Shift. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI020=Obt\u00E9 un fil de sistema d'operatiu d'un jthread
J9RI015=jvmri->RunDumpRoutine\: el componentId es troba fora dels l\u00EDmits.
JITM025=L'SCC \u00E9s massa gran perqu\u00E8 el JIT pugui codificar despla\u00E7aments correctament. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI021=Obt\u00E9 la informaci\u00F3 de marc ampliada
J9RI016=S'ha cridat a jvmri->SetOutOfMemoryHook amb una crida de retorn NUL\u00B7LA; no s'ha registrat la funci\u00F3.
JITM022=Discrep\u00E0ncia a la paraula de bloqueig. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9RI013=jvmri->ReleaseRasInfo\: l'estructura t\u00E9 un camp de tipus no suportat.
JITM023=Discrep\u00E0ncia a la mida de l'Arrayset. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9RI014=jvmri->RunDumpRoutine\: no es pot recuperar les dades del component.
JITM028=La configuraci\u00F3 del sistema no admet el par\u00E0metre '%.*s' a l'opci\u00F3 '- Xlp'
J9TI024=Sortida de m\u00E8tode sense el valor de retorn.
J9RI011=L'estructura RasInfo t\u00E9 un camp de tipus no suportat.
JITM029=%s ha d'anar seguida d'un n\u00FAmero
J9TI025=Permet la JNI directe en pres\u00E8ncia d'incid\u00E8ncies d'entrada i sortida de m\u00E8tode (cosa que pot fer que es notifiquin de forma inacurada entrades i sortides)
J9RI012=S'ha cridat a jvmri->ReleaseRasInfo amb una estructura RasInfo NUL\u00B7LA.
JITM026=Problema desconegut. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI022=Obt\u00E9 la informaci\u00F3 de marc ampliada per a totes les traces de pila.
JITM027=JIT no ha pogut assignar mem\u00F2ria
J9TI023=Obt\u00E9 la informaci\u00F3 de marc ampliada per a una llista de fils.
J9RI010=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
J9TI039=Destrueix una mem\u00F2ria cau compartida indicada.
JITM008=La validaci\u00F3 de la cap\u00E7alera AOT ha fallat; l'inici del distintiu de la caracter\u00EDstica s'ha malm\u00E8s. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI037=Obt\u00E9 la mem\u00F2ria total d'emmagatzematge din\u00E0mic.
JITM009=La validaci\u00F3 de la cap\u00E7alera AOT ha fallat; el final del distintiu de la caracter\u00EDstica s'ha malm\u00E8s. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI038=Itera les mem\u00F2ries cau compartides.
J9RI008=jvmri->GetRasInfo no pot obtenir components.
J9RI009=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
J9RI006=S'ha cridat a jvmri->GetRasInfo amb una estructura RasInfo NUL\u00B7LA.
J9RI007=jvmri->GetRasInfo no pot assignar mem\u00F2ria.
JITM010=Discrep\u00E0ncia a la caracter\u00EDstica SMP. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
JITM013=Discrep\u00E0ncia a la caracter\u00EDstica habilita rastreig. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI031=Cancel\u00B7la la incid\u00E8ncia as\u00EDncrona en un sol fil o a tots els fils
J9RI004=No s'admet jvmri->DynamicVerbosegc.
JITM014=Discrep\u00E0ncia a la caracter\u00EDstica de recollida pr\u00E8via TLH. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI032=Indica que un fil ha processat la incid\u00E8ncia as\u00EDncrona
J9RI005=El component %s de jvmri->GetComponentDataArea no t\u00E9 cap dataArea a sota d'aquesta vm.
JITM011=Discrep\u00E0ncia a la caracter\u00EDstica de refer\u00E8ncies comprimides. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9RI002=S'ha cridat a jvmri->DumpRegister amb una crida de retorn NUL\u00B7LA; no s'ha registrat la funci\u00F3.
JITM012=Discrep\u00E0ncia a la caracter\u00EDstica DFP. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI030=Assenyala la incid\u00E8ncia as\u00EDncrona en un sol fil o a tots els fils
J9RI003=No s'ha pogut assignar l'agent d'abocament de mem\u00F2ria a jvmri->DumpRegister; no s'ha registrat la funci\u00F3.
JITM017=Discrep\u00E0ncia a la caracter\u00EDstica SIMD habilitat. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI035=El cicle de recollida de deixalles ha finalitzat.
J9RI000=jvmri->CreateThread no pot assignar mem\u00F2ria d'arguments de fils
JITM018=Discrep\u00E0ncia a la caracter\u00EDstica compilaci\u00F3 as\u00EDncrona. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI036=Obt\u00E9 la mem\u00F2ria lliure d'emmagatzematge din\u00E0mic actual.
J9RI001=Error intern en eliminar l'agent de buidatge a jvmri->DumpDeregister; \u00E9s posible que la funci\u00F3 d'abocament de mem\u00F2ria no s'hagi desregistrat
JITM015=Discrep\u00E0ncia a la caracter\u00EDstica metodologia trampol\u00ED. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI033=Restableix les opcions d'abocament de mem\u00F2ria de VM.
JITM016=Discrep\u00E0ncia a la caracter\u00EDstica HCR habilitat. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI034=El cicle de recollida de deixalles s'ha iniciat.
J9VM017=No s'ha pogut assignar mem\u00F2ria per a la matriu d'opcions de la l\u00EDnia d'ordres
J9VM018=No s'ha pogut assignar mem\u00F2ria a l'agrupaci\u00F3 de taules carregades de la biblioteca compartida
J9VM019=Error no recuperable\: no es pot trobar ni inicialitzar la classe necess\u00E0ria %.*s
J9TI048=Obt\u00E9 metadades de tra\u00E7a que es poden utilitzar amb el formatador per processar mem\u00F2ries interm\u00E8dies de tra\u00E7a
J9TI049=Torna els noms de classe, m\u00E8tode i paquet d'un conjunt de punters de m\u00E8tode de RAM
JITM002=S'ha produ\u00EFt un error en emmagatzemar codi AOT a la mem\u00F2ria cau de classes compartides. \u00C9s possible que la mem\u00F2ria cau de classes compartides s'hagi malm\u00E8s. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9TI042=Assenyala les etiquetes autom\u00E0tiques per a l'objecte acabat d'assignar i la seva classe.
JITM003=S'ha produ\u00EFt un error durant la inicialitzaci\u00F3 en temps d'execuci\u00F3 d'AOT. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9VM010=No s'ha pogut inicialitzar %s
J9TI043=Assenyala la c\u00E0rrega de classes nom\u00E9s per a les classes de matriu.
JITM000=Maquinari no adm\u00E8s [%d].
J9VM011=No es pot carregar %1$s\: %2$s
J9TI040=Afegeix la prestaci\u00F3 ampliada can_autotag_objects.
JITM001=No hi ha m\u00E9s espai per a codi AOT a la mem\u00F2ria cau de classes compartides. No es generar\u00E0 codi AOT nou.
J9VM012=No es pot descarregar %1$s\: %2$s
J9TI041=Asssenyala la incid\u00E8ncia reanomenada d'objecte(s) (despla\u00E7ada o suprimida).
JITM006=El codi AOT de la mem\u00F2ria cau de classes compartides no es pot executar amb la pol\u00EDtica de recollida de deixalles actual. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9VM013=Error d'inicialitzaci\u00F3 a la funci\u00F3 %1$s(%2$d)\: %3$s
J9TI046=Cancel\u00B7la una subscripci\u00F3 amb registres de tra\u00E7a externs
JITM007=El codi AOT de la mem\u00F2ria cau de classes compartides no es pot executar amb els par\u00E0metres de JVMPI o JVMTI actuals. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9VM014=Error d'aturada a la funci\u00F3 %1$s(%2$d)\: %3$s
J9TI047=Tots els registres de tra\u00E7a en \u00FAs es desactiven i es passen als suscriptors de tra\u00E7a
JITM004=El codi AOT de la mem\u00F2ria cau de classes compartides no es pot executar al processador actual. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9VM015=Error d'inicialitzaci\u00F3 a la biblioteca %1$s(%2$d)\: %3$s
J9TI044=Suprimeix totes les etiquetes d'objecte.
JITM005=El codi AOT de la mem\u00F2ria cau de classes compartides no es pot executar a la versi\u00F3 de JVM actual. S'ignorar\u00E0 el codi AOT de la mem\u00F2ria cau de classes compartides.
J9VM016=Error d'aturada a la biblioteca %1$s(%2$d)\: %3$s
J9TI045=Crea una subscripci\u00F3 amb registres de tra\u00E7a externs
MECK001=Opci\u00F3 -Xcheck\:memory no reconeguda\: %s
J9VM006=Opci\u00F3 de l\u00EDnia d'ordres no v\u00E0lida\: %s
MECK000=S'ha produ\u00EFt un error en inicialitzar la utilitat -Xcheck\:memory
J9VM007=No es reconeix l'opci\u00F3 de la l\u00EDnia d'ordres\: %s
J9VM008=No es troba J9VMDllMain
J9TI059=Obt\u00E9 la quantitat de mem\u00F2ria nativa utilitzada per la JVM, desglossada en categories de mem\u00F2ria.
MECK002=S'ha produ\u00EFt un error en crear l'estructura de dades de lloc de crida. La informaci\u00F3 de lloc de crida no es mostrar\u00E0.
J9VM009=Ha fallat J9VMDllMain
J9TI050=Obt\u00E9 un codi de hash de supervisor d'un objecte
J9TI053=Defineix les opcions de registre de VM.
J9TI054=Sol\u00B7licita un abocament de mem\u00F2ria del Java Lock Monitor (JLM) amb un especificador de format.
J9VM000=Valor mal format per IBM_JAVA_OPTIONS
J9TI051=Esborra un indicador per m\u00E8tode per a la notificaci\u00F3 selectiva d'entrada i sortida
J9VM001=Valor mal format per -Xservice
J9TI052=Consulta les opcions de registre de VM actuals.
J9VM002=No s'ha trobat el fitxer d'opcions
J9TI057=No s'ha pogut convertir la s\u00E8rie nativa de les opcions de registre de la JVM.
J9VM003=No s'ha trobat el compilador JIT "%s". Es far\u00E0 servir l'int\u00E8rpret.
J9TI058=No s'han pogut definir les opcions de registre de la JVM.
J9VM004=No s'ha pogut carregar la biblioteca que necessitava\: %s
J9TI055=No s'ha pogut assignar mem\u00F2ria interm\u00E8dia per a les opcions de registre de la JVM.
J9VM005=Valor no v\u00E0lid per a la variable d'entorn\: %s
J9TI056=No s'han pogut consultar les opcions de registre de la JVM.
PORT033=No s'ha pogut detectar un Hipervisor adm\u00E8s.
PORT032=L'operaci\u00F3 relacionada amb l'Hipervisor ha fallat.
PORT031=S'ha rebut la condici\u00F3 LE %s%i, que correspon a un senyal POSIX em\u00E8s pel programari.
PORT030=El par\u00E0metre %s "%s" especifica que cal connectar l'abocament de mem\u00F2ria principal a un programa extern.  S'est\u00E0 provant de canviar el nom del nucli.%d.\n
PORT037=No est\u00E0 en execuci\u00F3 en un Hipervisor.
PORT036=Codi de retorn inesperat del servei CSRSI a z/OS
PORT035=_malloc31 no ha pogut assignar mem\u00F2ria interm\u00E8dia a z/OS
PORT034=S'ha intentat connectar la mem\u00F2ria compartida creada a la clau de protecci\u00F3 d'emmagatzematge %lu, per\u00F2 actualment en execuci\u00F3 a la clau %lu.
PORT039=Ha fallat l'actualitzaci\u00F3 d'HYPFS
PORT038=Valor mal format per a IBM_JAVA_HYPERVISOR_SETTINGS
PORT022=S'est\u00E0 afegint .X&DS a la plantilla d'abocament de mem\u00F2ria especificat per l'usuari per habilitar diversos abocaments de mem\u00F2ria amb diverses parts.
PORT021=Heu obert un sem\u00E0for compartit de System V obsolet\: fitxer \:%1$s semid\:%2$d
PORT020=Heu obert una mem\u00F2ria compartida de System V obsoleta\: fitxer \:%1$s shmid\:%2$d
PORT026=El fitxer especificat \u00E9s un directori
PORT025=Tipus de bloqueig no v\u00E0lid per a l'operaci\u00F3 de bloqueig de fitxer. lockFlags\: %1$d
PORT024=IEATDUMP ha fallat perqu\u00E8 no hem pogut assignar el conjunt de dades d'abocament de mem\u00F2ria (comproveu l'espai de disc i els permisos de camp).
PORT023=IEATDUMP ha fallat perqu\u00E8 la plantilla d'abocament de mem\u00F2ria especificada per l'usuari era massa llarga. Es tornar\u00E0 a intentar l'abocament de mem\u00F2ria amb la plantilla per defecte.
PORT029=Nansa no v\u00E0lida. Nansa de fitxer\: %1$d.
PORT028=No s'ha pogut executar mmap perqu\u00E8 les opcions d'assignaci\u00F3 no s\u00F3n v\u00E0lides.
PORT027=No s'ha pogut executar mmap perqu\u00E8 hi ha un par\u00E0metre de protecci\u00F3 de mem\u00F2ria que no \u00E9s v\u00E0lid.
PORT011=No es pot assignar mem\u00F2ria mentre es prova de carregar una biblioteca compartida
PORT010=No s'ha atorgat perm\u00EDs per carregar la biblioteca compartida
PORT015=No es poden resoldre les refer\u00E8ncies de biblioteca compartida\: \u00E9s possible que falti una biblioteca compartida de prerequisit
PORT014=No s'ha pogut carregar el dll perqu\u00E8 no s'ha trobat
PORT013=Error en carregar la biblioteca compartida - No s'ha trobat la taula dll
PORT012=Error en carregar la biblioteca compartida a causa del bit PACE que s'est\u00E0 definint
PORT019=No es pot crear el directori %s.  Les classes compartides s'inhabilitaran fins que es cre\u00EF aquest directori.
PORT018=L'operaci\u00F3 ha fallat\: %1$d (%2$s failed\: %3$d)
PORT017=L'operaci\u00F3 ha fallat\: %d
PORT016=Error intern %i
PORT000=
ZIPS000=No es pot obrir %1$s (%2$s)
ZIPS001=No es pot obrir %s (falta l'exportaci\u00F3)
PORT009=No s'ha trobat la biblioteca compartida especificada
PORT004=Error en la resoluci\u00F3 del s\u00EDmbol
PORT003=No s'ha pogut carregar el m\u00F2dul dependent %s
PORT002=Error desconegut en carregar la biblioteca compartida
PORT001=No s'ha pogut assignar mem\u00F2ria en provar d'escriure en un fitxer.
PORT008=El m\u00F2dul no t\u00E9 l'arquitectura correcta
J9RI022=la inicialitzaci\u00F3 de JVMRI no pot assignar un supervisor d'abocament de mem\u00F2ria de jvmri
PORT007=El m\u00F2dul especificat no \u00E9s cap m\u00F2dul
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister i TraceListener ja no s'admeten; utilitzeu les noves versions a JVMRAS_VERSION_1_5
PORT006=El format del m\u00F2dul no \u00E9s correcte
J9RI020=jvmri->CreateThread no pot assignar el supervisor privat
PORT005=No s'ha pogut carregar la biblioteca compartida
J9RI021=jvmri->RunDumpRoutine no est\u00E0 suportat.
J9VM070=La mem\u00F2ria nativa s'ha exhaurit durant la vinculaci\u00F3 del m\u00E8tode natiu %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM071=S'ha intentat vincular de forma recursiva un m\u00E8tode natiu %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM072=S'ha exhaurit la mem\u00F2ria nativa
J9VM073=La classe %2$.*1$s est\u00E0 accedint de forma no permesa al membre %3$s de la classe %5$.*4$s
J9VM074=La classe %2$.*1$s est\u00E0 accedint de forma no permesa a la classe de %3$s %5$.*4$s
J9VM075=Operaci\u00F3 no permesa al fil eventron
J9VM076=La mem\u00F2ria nativa s'ha exhaurit assignant l'entrada de llista per a un objecte finalitzable o de refer\u00E8ncia
J9VM077=Nota\: -Xdfpbd no t\u00E9 cap efecte en aquesta versi\u00F3 de Java
J9VM078=Valor amb format incorrecte per a JAVA_TOOL_OPTIONS
J9VM079=triggerOneOffDump(%1$s) exigeix %2$s
J9VM060=runNamedDump(%1$s) necessita %2$s
J9VM061=insertDumpAgent necessita %s
J9VM062=removeDumpAgent necessita %s
J9VM063=seekDumpAgent necessita %s
J9VM064=setDumpOption necessita %s
J9VM065=l'objecte no \u00E9s una inst\u00E0ncia de classe de declaraci\u00F3
J9VM066=el tipus d'argument no coincideix
J9VM067=-Xshareclasses no habilita; s'ignora l'opci\u00F3 -Xzero\:sharezip
J9VM068=-Xshareclasses no habilita; s'ignora l'opci\u00F3 -Xzero\:sharestring
J9VM069=Violaci\u00F3 de restricci\u00F3 de c\u00E0rrega\: el carregador "%2$.*1$s@%3$x" ha iniciat anteriorment la c\u00E0rrega d'un tipus diferent amb el nom "%5$.*4$s" definit pel carregador "%7$.*6$s@%8$x"
SHRC500=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 l'espai lliure de l'adre\u00E7a inferior %p \u00E9s superior a l'espai lliure de l'adre\u00E7a superior %p
SHRC505=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 l'espai lliure de l'adre\u00E7a superior %p menys l'espai lliure de l'adre\u00E7a inferior %p sobrepassa la mida de regi\u00F3 de depuraci\u00F3 de %lu bytes
SHRC506=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 la seva mida de %lu \u00E9s superior a la mida de mem\u00F2ria cau total de %u emmagatzemada a la cap\u00E7alera de la mem\u00F2ria cau
J9VM090=Resposta lenta a la consulta de xarxa (%d segons); comproveu la configuraci\u00F3 IP DNS.
SHRC507=Fes comprovacions addicionals en emmagatzemar i assignar dades de depuraci\u00F3 de classes
J9VM091=S'admet el gir adaptatiu
SHRC508=S'ha adquirit un sem\u00E0for diferent del sem\u00E0for que s'utilitzava abans amb aquesta mem\u00F2ria cau. ID de sem\u00E0for antic\=%d, ID de sem\u00E0for nou\=%d
J9VM092=No s'admet el gir adaptatiu
SHRC501=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 les dades de taula de nombres de l\u00EDnia de l'adre\u00E7a inferior %p s\u00F3n superiors a les de l'adre\u00E7a superior %p
J9VM093=Aquesta versi\u00F3 de Java necessita una CPU que admeti extensions SSE2 o posteriors.  Vegeu la informaci\u00F3 sobre entorns admesos de la Guia de l'usuari d'IBM Java per obtenir-ne m\u00E9s detalls.
SHRC502=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 les dades de taula de variables locals de l'adre\u00E7a inferior %p s\u00F3n superiors a les de l'adre\u00E7a superior %p
J9VM094=La "%s" encara est\u00E0 activa despr\u00E9s d'executar els lligams d'aturada.
SHRC503=L'\u00E0rea de depuraci\u00F3 est\u00E0 malmesa perqu\u00E8 l'emmagatzematge de %d bytes de la taula de nombres de l\u00EDnia i de %d bytes de la taula de variables locals donar\u00E0 lloc a %p dades de taula de nombres de l\u00EDnia de l'adre\u00E7a superior, que \u00E9s superior a les %p dades de la taula de variables locals de l'adre\u00E7a superior
J9VM095=Violaci\u00F3 de restricci\u00F3 de c\u00E0rrega en resoldre el m\u00E8tode "%2$.*1$s.%4$.*3$s%6$.*5$s"\: el carregador "%8$.*7$s@%9$x" de la classe "%11$.*10$s" i el carregador "%13$.*12$s@%14$x" de la classe "%16$.*15$s" tenen diferents tipus per a la signatura de m\u00E8tode
SHRC504=L'inici de dades de la mem\u00F2ria cau \u00E9s nul. Inici de dades\: %p
J9VM096=-Xscdmx s'ignora si no s'especifica -Xshareclasses
J9VM097=\n\u00DAs\:\n
J9VM098=-Xsyslog\:help              Imprimeix l'ajuda de -Xsyslog de la JVM.
J9VM099=-Xsyslog\:none              Inhabilita les opcions de registre de la JVM especificades anteriorment, incloent-hi els valors per defecte.
SHRC509=Crea una mem\u00F2ria cau d'una generaci\u00F3 anterior a la generaci\u00F3 actual.
PORT040=No s'ha pogut llegir HYPFS
PORT044=No s'ha pogut assignar mem\u00F2ria mentre es recuperava la informaci\u00F3 de l'hipervisor.
PORT043=%1$d\: no s'ha pogut recuperar la informaci\u00F3 de %2$s.
PORT042=No es pot llegir /proc/sysinfo
PORT041=HYPFS no est\u00E0 muntat
J9VM080=queryVmDump exigeix %s
J9VM081=Valor d'opci\u00F3 amb format incorrecte; l'opci\u00F3 "%1$s%3$.*2$s" cont\u00E9 car\u00E0cters finals "%4$s" que s'han ignorat
J9VM082=No es pot commutar al processador IFA; emeteu "extattr +a lib%s.so"
J9VM083=Error en commutar al processador IFA; rc\: %08x
J9VM084=Error d'IFA\: codi de retorn inesperat %08x del servei de commutaci\u00F3 d'IFA
J9VM085=Opci\u00F3 mal formada\: '%s'
PORT048=No s'ha pogut crear cap abocament de mem\u00F2ria del sistema perqu\u00E8 hi ha un fitxer no habitual, "%s", amb el mateix nom que el fitxer d'abocament de mem\u00F2ria del sistema esperat
J9VM086=Opci\u00F3 massa gran\: '%s'
PORT047=No hi ha prou mem\u00F2ria interm\u00E8dia en intentar carregar una biblioteca compartida
J9VM087=resetDumpOption exigeix %s
PORT046=L'executable no s'ha pogut obrir
J9VM088=Av\u00EDs\: syscorepath no s'ha configurat, cosa que pot impedir la generaci\u00F3 del fitxer core del sistema (si en cal un).\n\t\tConsulteu les instruccions d'instal\u00B7laci\u00F3 del WebSphere Real Time per con\u00E8ixer els par\u00E0metres de configuraci\u00F3 correctes de syscorepath.\n\t\tNOTA\: s'ha de configurar cada vegada que es reinici\u00EF la m\u00E0quina.
PORT045=No s'ha pogut assignar mem\u00F2ria mentre es recuperava la informaci\u00F3 del sistema.
J9VM089=Av\u00EDs\: no es poden verificar els par\u00E0metres de syscorepath amb sysconfig\: %s.
SHRC400=Bytes de mem\u00F2ria cau de zip                    %*c\= %d
SHRC401=Nombre de mem\u00F2ries cau de Zip                        %*c\= %d
SHRC406=Adre\u00E7a d'inici de metadades              %*c\= 0x%p
SHRC407=Identificadors de temps d'execuci\u00F3                       %*.c\= 0x%.16llX
SHRC408=Generaci\u00F3 de mem\u00F2ria cau                    %*.c\= %d\n
SHRC409=Bytes de codi AOT                      %*c\= %d
SHRC402=Bytes de dades JIT                      %*c\= %d
SHRC403=Bytes utilitzats d'\u00E0rea de depuraci\u00F3 de classes         %*c\= %u
SHRC404=No s'ha pogut obtenir el directori per a la mem\u00F2ria cau
SHRC405=No s'ha pogut crear el directori per a la mem\u00F2ria cau
SHRC420=Nombre d'entrades de dades AOT                  %*c\= %d
SHRC421=Nombre de jerarquia de classe AOT               %*c\= %d
SHRC422=Nombre de thunks AOT                        %*c\= %d
SHRC423=Nombre de hints JIT                         %*c\= %d
SHRC428=S'ha eliminat la generaci\u00F3 antiga de la mem\u00F2ria cau de classes compartides "%s"
SHRC429=No s'ha pogut eliminar la generaci\u00F3 antiga de la mem\u00F2ria cau de classes compartides "%s"
SHRC424=Nombre de perfils JIT                      %*c\= %d
SHRC425=Nombre d'objectes Java                      %*c\= %d
SHRC426=Nombre d'entrades JCL                       %*c\= %d
SHRC427=Modificador utilitzat per imprimir estad\u00EDstiques de mem\u00F2ria cau detallades
SHRC410=Bytes de dades AOT                      %*c\= %d
SHRC411=Bytes de jerarquia de classes AOT         %*c\= %d
SHRC412=Bytes de thunk AOT                     %*c\= %d
SHRC417=Bytes de dades JCL                      %*c\= %d
SHRC418=Bytes de dades de byte                     %*c\= %d
SHRC419=Bytes de classe LocalVariableTable      %*c\= %u
SHRC413=Bytes de hint JIT                      %*c\= %d
SHRC414=Bytes de perfil JIT                    %*c\= %d
SHRC415=Bytes d'objecte Java                   %*c\= %d
SHRC416=Bytes de ReadWrite                     %*c\= %d
SHRC442=La mem\u00F2ria cau compartida "%s" est\u00E0 malmesa. El codi de corrupci\u00F3 \u00E9s %d. El valor malm\u00E8s \u00E9s 0x%p. No s'assignaran noves JVM per connectar-se a la mem\u00F2ria cau.\n \tLes JVM existents poden continuar funcionant, per\u00F2 no poden actualitzar la mem\u00F2ria cau.
SHRC443=El CRC de mem\u00F2ria cau indica de manera incorrecta una mem\u00F2ria cau corrupta. CRC de mem\u00F2ria cau incorrecte\: 0x%x.
SHRC444=Dades corruptes de lectura per a la cap\u00E7alera d'entrada de mem\u00F2ria cau 0x%p (longitud d'element no v\u00E0lida)
SHRC445=La mida de la mem\u00F2ria cau \u00E9s massa petita perqu\u00E8 sigui \u00FAtil. Mida de mem\u00F2ria cau no v\u00E0lida\: 0x%x.
SHRC440=El valor de -XscminJIT \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en el mateix valor que -Xscmx.
SHRC441=El valor de -XscmaxJIT \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en il\u00B7limitat.
SHRC446=No s'ha pogut adquirir el bloqueig d'escriptura de cap\u00E7alera durant l'inici de la mem\u00F2ria cau amb el codi d'error\: %d.
SHRC447=El reclam de cap\u00E7alera de mem\u00F2ria cau no \u00E9s v\u00E0lid. Adre\u00E7a de la s\u00E8rie de reclam de la cap\u00E7alera de mem\u00F2ria cau\: 0x%p.
SHRC448=El camp de mida de mem\u00F2ria cau de la cap\u00E7alera de mem\u00F2ria cau no \u00E9s v\u00E0lid. Mida de la mem\u00F2ria cau a la cap\u00E7alera de la mem\u00F2ria cau\: 0x%x.
SHRC449=El valor de farciment \u00E9s diferent de zero. Bytes de farciment a la cap\u00E7alera de mem\u00F2ria cau\: %u.
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC432=\ Signatura\: %2$.*1$s Adre\u00E7a\: 0x%3$p
SHRC433=\tper a ROMClass %2$.*1$s a 0x%3$p.
SHRC434=El valor\=%d passat per l'opci\u00F3 -Xitsn \u00E9s fora de l'interval de valors de nombre principal adm\u00E8s per la VM. Interval adm\u00E8s \= 0 - %u
SHRC430=No s'ha pogut eliminar la generaci\u00F3 actual de la mem\u00F2ria cau de classes compartides "%s"
SHRC439=El valor -XscminJIT no pot ser m\u00E9s gran que el valor -XscmaxJIT
SHRC435=-Xitsn%2$u utilitza %1$u bytes de mem\u00F2ria, que \u00E9s un valor superior a la mida de la mem\u00F2ria cau de classes compartides %3$u bytes
SHRC436=Error en adquirir el bloqueig d'escriptura de cap\u00E7alera de fitxer de mem\u00F2ria cau de classes compartides
SHRC437=Error en alliberar el bloqueig de lectura de cap\u00E7aleres de fitxers de mem\u00F2ria cau de classes compartides
SHRC438=Inhabilita l'emmagatzematge de dades JIT a la mem\u00F2ria cau compartida
JNCK101=Error JNI a %1$s\: L'argument \#%2$d ha de ser est\u00E0tic, per\u00F2 s'ha passat un ID de camp no est\u00E0tic a JNI
JNCK102=Error JNI a %1$s\: L'argument \#%2$d ha de ser no est\u00E0tic per\u00F2 s'ha passat un ID de camp est\u00E0tic a JNI
JNCK100=Consell de JNI a %1$s\: no es pot utilitzar la funci\u00F3 amb objectes empaquetats. Utilitzeu %2$s
SHRC464=Habilita la sortida detallada de dades de JIT
SHRC465=[Sortida detallada de dades JIT de -Xshareclasses habilitada]
SHRC466=S'han trobat %1$s dades adjuntes per a %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC467=No s'ha pogut trobar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s.%6$.*5$s, motiu\:%2$s
SHRC460=Inhabilita l'emmagatzematge de dades JIT a la mem\u00F2ria cau compartida
SHRC461=El valor de -Xscminjitdata no ha de ser superior al valor de -Xscmaxjitdata.
SHRC462=El valor de -Xscminjitdata \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en el mateix valor que -Xscmx.
SHRC463=El valor de -Xscmaxjitdata \u00E9s superior al valor de -Xscmx, per tant, s'ha definit en il\u00B7limitat.
SHRC468=S'han emmagatzemat %1$s dades adjuntes per a %7$.*6$s%3$.*2$s%5$.*4$s
SHRC469=No s'han emmagatzemat dades adjuntes 1$s per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\:%2$s
J9GC084=La resoluci\u00F3 del rellotge del SO reclama no donar suport al temps de pausa de destinaci\u00F3 sol\u00B7licitat.  Sobreescriptura degut a l'opci\u00F3 de l\u00EDnia d'ordres -Xgc\:overrideHiresTimerCheck
J9GC083=No s'ha pogut inicialitzar, l'opci\u00F3 d'inquilins m\u00FAltiples nom\u00E9s admet -Xgcpolicy\:balanced
J9GC086=No s'han pogut instanciar les metadades de refer\u00E8ncies comprimides; s'ha sol\u00B7licitat %1$zu%2$s.
J9GC085=grand\u00E0ria inicial de metadates de refer\u00E8ncies comprimides
J9GC088=No s'ha pogut satisfer la mida de p\u00E0gina sol\u00B7licitada d'objectheap %1$zu%2$s; en el seu lloc s'utilitza %3$zu%4$s
J9GC087=No es pot satisfer la mida de pila %1$zu%2$s amb la mida de p\u00E0gina %3$zu%4$s. La mida de pila es pot especificar amb -Xmx
J9GC089=L'opci\u00F3 -Xgc\:preferredHeapBase no s'admet al z/OS.
SHRC453=Llista tots els elements de la mem\u00F2ria cau, incloent-hi les classes \u00F2rfenes
SHRC454=Inhabilita la comprovaci\u00F3 si l'ID de sem\u00E0for SysV actual \u00E9s igual a l'ID de sem\u00E0for SysV de la mem\u00F2ria cau
SHRC455=For\u00E7a la comprovaci\u00F3 de la taula de s\u00E8ries en el proc\u00E9s d'inici
SHRC456=For\u00E7a el descobriment d'un canvi a l'ID de muntatge de la VM
SHRC450=El camp de longitud de dades de la cap\u00E7alera de mem\u00F2ria cau no \u00E9s v\u00E0lid. Longitud de dades de la cap\u00E7alera de mem\u00F2ria cau\: %u.
SHRC451=El camp d'inici de dades de la cap\u00E7alera de mem\u00F2ria cau no \u00E9s v\u00E0lid. Adre\u00E7a inicial de dades a la cap\u00E7alera de mem\u00F2ria cau\: 0x%p.
SHRC452=Inhabilita la protecci\u00F3 de mem\u00F2ria de l'\u00E0rea de lectura/escriptura (taula de s\u00E8ries)
SHRC457=Nom de mem\u00F2ria cau no v\u00E0lid, el nom de la mem\u00F2ria cau "%.*s" cont\u00E9 nom\u00E9s espais en blanc o \u00E9s buit
SHRC458=Inhabilita la capacitat de compartir classes sense inhabilitar les API d'utilitat
SHRC459=Inhabilita la capacitat de compartir classes i les API d'utilitat
SHRC480=hi ha massa actualitzacions durant la lectura
SHRC481=la mem\u00F2ria cau est\u00E0 malmesa
J9GC071=El valor per a '%s' no \u00E9s correcte
J9GC070=No s'ha pogut iniciar el recollidor de deixalles
SHRC002=en \u00FAs
SHRC486=Espai reservat per a bytes de dades JIT   %*c\= %d
SHRC003=\u00FAltima hora de desconnexi\u00F3
SHRC487=Espai m\u00E0xim per a bytes de dades JIT    %*c\= %d
SHRC004=No es pot destruir la mem\u00F2ria cau "%s".
SHRC488=El nombre total de valors -Xscminaot i -Xscminjitdata no pot ser superior a la mida de mem\u00F2ria cau disponible
SHRC005=No hi ha cap mem\u00F2ria cau de classes compartides disponible.
SHRC489=Si la mem\u00F2ria cau oberta est\u00E0 marcada com a malmesa, activa una incid\u00E8ncia d'abocament de mem\u00F2ria cau
SHRC482=l'adre\u00E7a no \u00E9s a la mem\u00F2ria cau
SHRC483=no s'ha pogut renovar la mem\u00F2ria cau
SHRC000=Mem\u00F2ria cau compartida
SHRC484=Espai reservat per a bytes AOT        %*c\= %d
SHRC001=shmid del sistema operatiu
SHRC485=Espai m\u00E0xim per a bytes AOT         %*c\= %d
J9GC069=No s'ha pogut inicialitzar el fil de finalitzaci\u00F3
SHRC006=El nombre de mem\u00F2ries cau caducades els darrers %1$d minuts \u00E9s %2$d.
SHRC007=No s'ha pogut eliminar la mem\u00F2ria cau de classes compartides "%s".
SHRC008=S'ha creat la mem\u00F2ria cau compartida\: mida de %1$s\: %2$d bytes
SHRC009=La mem\u00F2ria cau compartida s'ha obert\: mida de %1$s\: %2$d bytes
J9GC062=El valor de %s ha de ser un quadrat
J9GC061=Mida m\u00E0xima d'espai de mem\u00F2ria amb \u00E0mbit
J9GC064=No s'ha pogut assignar un espai anterior
J9GC063=No es pot obrir el fitxer '%s' per escriure'l
J9GC066=No s'ha pogut assignar la geometria de mem\u00F2ria d'emmagatzematge din\u00E0mic de divisi\u00F3 obligat\u00F2ria.
J9GC065=No s'ha pogut assignar un espai nou
J9GC068=ScopedMemory.join/joinAndEnter s'ha interromput
J9GC067=No s'ha pogut instanciar l'emmagatzematge din\u00E0mic de divisi\u00F3\: %1$s (mida nova %2$zu%3$s, mida anterior %4$zu%5$s)
SHRC470=S'han actualitzat %1$s dades adjuntes per a %7$.*6$s%3$.*2$s%5$.*4$s
J9GC080=La configuraci\u00F3 del sistema no admet el par\u00E0metre '%.*s' a l'opci\u00F3 '- Xlp'
J9GC082=La sol\u00B7licitud de %1$s mida de p\u00E0gina %2$zu%3$s%4$s no \u00E9s una mida de p\u00E0gina admesa; es fa servir %5$zu%6$s%7$s alternativament
J9GC081=Els car\u00E0cters de coma addicional descoberts a l'opci\u00F3 '- Xlp' s'ignoraran
SHRC475=no hi ha dades
SHRC476=les dades ja existeixen
SHRC477=no hi ha espai a la mem\u00F2ria cau per a %d bytes
SHRC478=la mida de dades %d \u00E9s superior a la mida %d disponible
SHRC471=No s'han pogut actualitzar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\: %2$s
SHRC472=no hi ha acc\u00E9s al recurs
SHRC473=error d'enterWriteMutex
SHRC474=error d'enterReadMutex
SHRC479=no s'han pogut assignar %d bytes de mem\u00F2ria
J9GC073=La mida de p\u00E0gina gran %1$zu%2$s %3$s no \u00E9s una mida de p\u00E0gina admesa; es fa servir %4$zu%5$s alternativament
J9GC072=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa; es fa servir %3$zu%4$s %5$s alternativament
J9GC075=S'ha produ\u00EFt un error en analitzar l'opci\u00F3 '-Xlp'
J9GC074=La mida de p\u00E0gina gran %1$zu%2$s %3$s no \u00E9s una mida de p\u00E0gina admesa; es fa servir %4$zu%5$s %6$s alternativament
J9GC077=La configuraci\u00F3 del sistema no admet la mida de p\u00E0gina gran sol\u00B7licitada %1$zu%2$s %3$s
J9GC076=La configuraci\u00F3 del sistema no admet la mida de p\u00E0gina gran sol\u00B7licitada %1$zu%2$s
J9GC079=L'opci\u00F3 '%1$s' no est\u00E0 completa, s'ha d'especificar el par\u00E0metre '%2$s'.
J9GC078='%1$s' no est\u00E0 especificat com a primer par\u00E0metre a l'opci\u00F3 '%2$s'
SHRC024=error de desconnexi\u00F3 de mem\u00F2ria compartida
SHRC025=error en connectar la mem\u00F2ria compartida
SHRC026=No es pot crear la mem\u00F2ria cau de la mida sol\u00B7licitada\: consulteu els valors de SHMMAX i SHMMIN
SHRC027=El nom de la mem\u00F2ria cau compartida \u00E9s massa llarg
SHRC020=S'ha produ\u00EFt un error en obrir el sem\u00E0for
SHRC021=S'ha retornat un codi d'error desconegut
SHRC022=Error en crear la regi\u00F3 de mem\u00F2ria compartida
SHRC023=La mem\u00F2ria cau no existeix
J9GC048=Imcrement d'espai anterior
J9GC047=Mida d'espai anterior m\u00E0xima
J9GC049=Mida de conjunt recordat
SHRC028=Perm\u00EDs denegat
SHRC029=No hi ha prou mem\u00F2ria al sistema
J9GC040=Opci\u00F3 desconeguda\: %s
J9GC042=La suma de %1$s i %2$s \u00E9s massa petita per a %3$s
J9GC041=No es coneix el tipus fvtest\: %s
J9GC044=Mida d'espai nou m\u00E0xima
J9GC043=Mida d'espai nou inicial
J9GC046=Mida d'espai anterior inicial
J9GC045=Mida de mem\u00F2ria inicial
SHRC490=For\u00E7a el descobriment d'una mem\u00F2ria cau de classes compartides malmesa
SHRC491=No s'han pogut emmagatzemar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\: %2$s
SHRC492=No s'han pogut actualitzar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\: %2$s
J9GC060=Mida d'espai de mem\u00F2ria permanent
SHRC013=L'eliminaci\u00F3 de la mem\u00F2ria de la mem\u00F2ria cau compartida "%s" ha fallat.
SHRC497=Placeholder, not used
SHRC014=L'eliminaci\u00F3 del sem\u00E0for de mem\u00F2ria cau compartida "%s" ha fallat.
SHRC498=Placeholder, not used
SHRC015=Error de la mem\u00F2ria cau de classes compartides\: identificador no v\u00E0lid
SHRC499=Placeholder, not used
SHRC016=Error de la mem\u00F2ria cau de classes compartides\:
SHRC493=No s'han pogut trobar %1$s dades adjuntes per a %8$.*7$s.%4$.*3$s%6$.*5$s, motiu\: %2$s
SHRC010=La mem\u00F2ria cau compartida "%s" s'ha destru\u00EFt.
SHRC494=No s'han trobat dades adjuntes %1$s per a l'adre\u00E7a 0x%2$p, motiu\: %3$s
SHRC011=Error\: no es pot obrir la mem\u00F2ria cau de classes compartides
SHRC495=No s'han emmagatzemat dades adjuntes %1$s per a l'adre\u00E7a 0x%2$p, motiu\: %3$s
SHRC012=No es pot eliminar la mem\u00F2ria cau compartida "%s" perqu\u00E8 encara hi ha connectades a la mem\u00F2ria cau.
SHRC496=No s'han actualitzat dades adjuntes %1$s per a l'adre\u00E7a 0x%2$p, motiu\: %3$s
J9GC059=-Xgcpolicy\:metronome no es permet sense -Xrealtime
J9GC058=No s'ha pogut assignar espai de mem\u00F2ria permanent
SHRC017=Codi d'error\: %d
SHRC018=no es pot assignar la mem\u00F2ria
SHRC019=la longitud de la sol\u00B7licitud \u00E9s massa petita
J9GC051=Increment del segment de la classe RAM
J9GC050=M\u00E0xim de mem\u00F2ria lleu
J9GC053=M\u00E0xim de mem\u00F2ria
J9GC052=Increment del segment de la classe ROM
J9GC055=Mida de p\u00E0gina gran
J9GC054=La mida de p\u00E0gina gran %1$zu%2$s no \u00E9s una mida de p\u00E0gina admesa; s'utilitzar\u00E0 %3$zu%4$s com a alternativa.
J9GC057=%1$s no ha de ser superior a %2$s
J9GC056=Mides de p\u00E0gina gran disponibles\:
SHRC040=Especifiqueu el nom de la mem\u00F2ria cau compartida
SHRC041=Destrueix la mem\u00F2ria cau compartida (utilitza el par\u00E0metre name o el valor per defecte)
SHRC046=Mostra totes les mem\u00F2ries cau compartides i les seves estad\u00EDstiques
SHRC047=Imprimeix el resum de les estad\u00EDstiques de la mem\u00F2ria cau
SHRC048=Llista tots els elements de la mem\u00F2ria cau
SHRC049=Modalitat de depuraci\u00F3 que comprova tots els codis de bits entrants
SHRC042=Destrueix totes les mem\u00F2ries cau compartides
SHRC043=Habilita l'\u00FAs compartit de codi de bytes modificat\n \t<modContext> \u00E9s un descriptor d'usuari que descriu el tipus de modificaci\u00F3\n \tLes JVM que utilitzen el mateix <modContext> han d'utilitzar les mateixes modificacions.
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC045=Destrueix les mem\u00F2ries cau que no s'han fet servir durant <t> min.
J9GC026=-Xverbosegclog no ha pogut assignar estructures internes
J9GC025=Suma de %1$s i %2$s
J9GC028=Opci\u00F3 massa gran\: '%s'
J9GC027=Opci\u00F3 mal formada\: '%s'
J9GC029=Error de l'opci\u00F3\: '%s'
J9GC020=%s massa gran per l'\u00E0rea d'emmagatzematge
J9GC022=La suma de %1$s i %2$s \u00E9s massa gran per a %3$s
J9GC021=%1$s ha de ser igual a %2$s
J9GC024=La suma de %1$s i %2$s \u00E9s massa gran per a l'emmagatzematge din\u00E0mic
J9GC023=La suma de %1$s i %2$s ha de ser igual a %3$s
SHRC030=La mem\u00F2ria cau de classes compartides a la qual us esteu connectant t\u00E9 una cap\u00E7alera no v\u00E0lida.
SHRC035=S'ha inhabilitat l'emmagatzematge a la mem\u00F2ria cau local de les variables classpath.
SHRC036=S'ha inhabilitat la reducci\u00F3 de contenci\u00F3 d'emmagatzematge simultani
SHRC037=S'han inhabilitat les actualitzacions incrementals
SHRC038=\u00DAs\:\n\njava -Xshareclasses[\:opci\u00F3,...]\n\n Les opcions v\u00E0lides que s'inclouen (amb un breu resum) s\u00F3n\:\n\n
SHRC031=La mem\u00F2ria cau de classes compartides a la qual us esteu connectant t\u00E9 una versi\u00F3 de JVM no compatible.
SHRC032=La mem\u00F2ria cau de classes compartides a la qual us esteu connectant t\u00E9 un nivell de modificaci\u00F3 erroni.
SHRC033=S'ha inhabilitat el blocatge de taules hash locals
SHRC034=S'ha inhabilitat la comprovaci\u00F3 de la indicaci\u00F3 de l'hora
J9GC037=%1$s no s'admet amb valors que no siguin %2$zu
J9GC036=El valor de %1$s ha de ser superior a %2$zu
J9GC039=%1$s s'ha deixat d'utilitzar; utilitzeu %2$s com a alternativa
J9GC038=El valor %s especificat \u00E9s massa llarg
SHRC039=Imprimeix l'ajuda general compartida
J9GC031=%1$s i %2$s no es poden especificar conjuntament
J9GC030=El valor %1$s de %2$.2f ha de ser, com a m\u00EDnim, %3$s inferior al valor %4$s de %5$.2f
J9GC033=El valor de %1$s ha d'estar entre %2$.2f i %3$.2f (tots dos inclosos)
J9GC032=La configuraci\u00F3 del sistema no d\u00F3na suport a l'opci\u00F3 '%s'
J9GC035=%s ha d'anar seguida d'un n\u00FAmero
J9GC034=El valor de %1$s ha d'estar entre %2$zu i %3$zu (tots dos inclosos)
SHRC060=No es pot assignar mem\u00F2ria per a la mem\u00F2ria interm\u00E8dia de la cadena a shrinit\:\:hookFindSharedClass.
SHRC061=El nom de la mem\u00F2ria cau no hauria de ser tenir una longitud superior a 64 car\u00E0cters. No s'ha creat la mem\u00F2ria cau.
SHRC062=Error en copiar el nom d'usuari al nom de la mem\u00F2ria cau per defecte
SHRC063=No es pot assignar mem\u00F2ria per a sharedClassConfig a shrinit.
SHRC068=S'ha inhabilitat l'emmagatzematge a la mem\u00F2ria cau local de les variables classpath.
SHRC069=S'ha inhabilitat la reducci\u00F3 de contenci\u00F3 d'emmagatzematge simultani
SHRC064=No s'ha pogut crear configMonitor a shrinit
SHRC065=No es pot assignar cap agrupaci\u00F3 a shrinit.
SHRC066=S'ha inhabilitat el blocatge de taules hash locals
SHRC067=S'ha inhabilitat la comprovaci\u00F3 de la indicaci\u00F3 de l'hora
J9GC004=No s'ha pogut particularitzar el recollidor d'escombraries globals
J9GC003=No s'ha pogut particularitzar l'expenedor de tasques
J9GC006=No s'ha pogut inicialitzar; sense mem\u00F2ria
J9GC005=No s'ha pogut inicialitzar
J9GC008=No s'ha pogut inicialitzar les extensions de m\u00F2dul
J9GC007=No s'ha pogut inicialitzar; no es pot analitzar la l\u00EDnia d'ordres
J9GC009=No s'ha pogut inicialitzar el mutex per les estad\u00EDstiques GC
J9GC000=Error intern; sense mem\u00F2ria
J9GC002=No s'ha pogut instanciar l'emmagatzematge din\u00E0mic; s'ha sol\u00B7licitat %1$zu%2$s
J9GC001=No s'ha pogut particularitzar l'\u00E0rea d'emmagatzematge
SHRC050=Habilita la sortida detallada
SHRC051=Desconnectas les actualitzacions din\u00E0miques
SHRC052=Inhabilita l'emmagatzematge a la mem\u00F2ria cau de la variable classpath local
SHRC057=Par\u00E0metres erronis per a l'opci\u00F3 expire
SHRC058=No es pot assignar mem\u00F2ria per a ClasspathItem a shrinit\:\:hookStoreSharedClass.
SHRC059=No es pot assignar mem\u00F2ria per a ClasspathItem a shrinit\:\:hookFindSharedClass.
SHRC053=Inhabilita el blocatge de la taula d'aleatoritzaci\u00F3 local
SHRC054=Inhabilita l'algorisme per reduir la contenci\u00F3 d'emmagatzematge
SHRC055=Inhabilita les actualitzacions de mem\u00F2ria cau incrementals
SHRC056=No es reconeix l'opci\u00F3 de la l\u00EDnia d'ordres "%s"
J9GC015=No s'ha pogut assignar l'espai de mem\u00F2ria per defecte
J9GC014=No s'ha pogut assignar els segments de mem\u00F2ria de classe VM
J9GC017=%1$s massa petit; ha de tenir, com a m\u00EDnim %2$zu %3$s bytes
J9GC016=No s'ha pogut assignar un segment de supervivent a l'espai de mem\u00F2ria per defecte
J9GC019=%1$s \u00E9s massa gran per a %2$s
J9GC018=%1$s \u00E9s massa petit per a %2$s
J9GC011=No s'ha pogut inicialitzar l'agrupaci\u00F3 d'espais de mem\u00F2ria
J9GC010=No s'ha pogut inicialitzar la gsti\u00F3 de finalitzaci\u00F3
J9GC013=No s'ha pogut assignar els segments de mem\u00F2ria d'objectes VM
J9GC012=No s'ha pogut assignar els segments de mem\u00F2ria VM
