#Thu Jan 21 02:08:20 CST 2021
EXEL070=La imagen ROM tiene una versi\u00F3n incorrecta
EXEL079=\  -Xscmx<x>       establece el tama\u00F1o de la nueva memoria cach\u00E9 de clase compartida en <x>
J9VM151=No se ha podido abrir la biblioteca jimage
J9VM150=-Xscsoftmx se ignora si no se especifica -Xshareclasses
J9VM153=Se est\u00E1 pasando al lector jimage interno porque la JVM no puede utilizar la biblioteca jimage
EXEL071=No se ha podido encontrar el nombre de clase main
J9VM152=No se podido buscar el s\u00EDmbolo %s en la biblioteca jimage
EXEL072=Error de inicio de m\u00E1quina virtual\: memoria agotada
J9VM155=Valor err\u00F3neo para -Xpatch; no se ha especificado la v\u00EDa de acceso del parche en la propiedad %s\=%s.
EXEL073=Error interno de m\u00E1quina virtual\: error al crear la m\u00E1quina virtual Java
J9VM154=Valor err\u00F3neo para -Xpatch; no se ha especificado el valor de la propiedad %s.
EXEL074=
J9VM157=La clase %2$.*1$s(%3$s) no puede acceder a la classe %5$.*4$s(%6$s) porque el m\u00F3dulo %3$s no lee el m\u00F3dulo %6$s
EXEL075=\  -Xquickstart    mejora el tiempo de inicio retardando las optimizaciones
J9VM156=-XX\:SharedCacheHardLimit\= se ignora si no se especifica -Xshareclasses
EXEL076=JIT  - %s\n
J9VM159=Error\: %s requiere la especificaci\u00F3n de la v\u00EDa de acceso del m\u00F3dulo.
EXEL077=\  -Xssi<x>        establece el incremento de pila de hebra java en <x>
J9VM158=La clase %2$.*1$s(%3$s) no puede acceder a la classe %5$.*4$s(%6$s) porque el m\u00F3dulo %6$s no exporta el paquete %7$s al m\u00F3dulo %3$s
EXEL078=\  -Xshareclasses[\:opciones]  habilita la compartici\u00F3n de datos de clase (utilice la ayuda si desea obtener detalles)\n
J9VM149=%s ya no est\u00E1 soportado. A\u00F1ada las bibliotecas o archivos jar necesarios a la classpath.
EXEL068=Error interno de m\u00E1quina virtual\: no se ha podido establecer el elemento matriz para %s
EXEL069=No se ha podido encontrar la imagen ROM
J9VM140=El interlocutor no est\u00E1 anotado como @sun.reflect.CallerSensitive.
J9VM142=La opci\u00F3n de l\u00EDnea de mandatos -Xrealtime no recibe soporte en esta versi\u00F3n de IBM SDK
EXEL060=Error interno de m\u00E1quina virtual\: no se ha podido crear una matriz de bytes para el nombre de clase %s
J9VM141=m\u00E9todos predeterminados en conflicto para '%2$.*1$s%4$.*3$s' in %6$.*5$s de clases [%7$s]
EXEL061=Error interno de m\u00E1quina virtual\: no se ha podido crear java/lang/String para el nombre de clase %s
J9VM144=demasiados par\u00E1metros\: 255 + 1
EXEL062=Error interno de VM\: Memoria insuficiente al convertir la serie a caracteres UTF para el nombre de clase %s
J9VM143=La opci\u00F3n de l\u00EDnea de mandatos %s no recibe soporte en esta versi\u00F3n de IBM SDK
EXEL063=La clase %s no implementa main()
J9VM146=invokeinterface del m\u00E9todo no p\u00FAblico '%4$.*3$s%6$.*5$s' in %2$.*1$s
EXEL064=El m\u00E9todo principal debe declararse public, static y void.
J9VM145=%s no se admite en z/OS.
EXEL065=Error interno de m\u00E1quina virtual\: no se ha podido crear la matriz de argumentos
J9VM148=%s ya no est\u00E1 soportado. El mecanismo de alteraci\u00F3n temporal endorsed-standards s\u00F3lo est\u00E1 soportado a trav\u00E9s de m\u00F3dulos actualizables.
EXEL066=Error interno de m\u00E1quina virtual\: no se ha podido crear la matriz de bytes para el argumento %s
J9VM147=No se puede adjuntar la hebra actual
EXEL067=Error interno de m\u00E1quina virtual\: no se ha podido crear java/lang/String para el argumento %s
SMAP000=
EXEL090=\  -Xscmaxaot<x>   establece el espacio m\u00E1ximo de memoria cach\u00E9 de clases compartidas permitido para datos AOT en <x>
EXEL091=\n  -Xcheck[\:opci\u00F3n[\:...]]  comprobaci\u00F3n de control, utilice -Xcheck\:help para obtener m\u00E1s informaci\u00F3n
EXEL092=\n  -Xdump[\:opci\u00F3n,...]  controles de volcado, use -Xdump\:help para m\u00E1s informaci\u00F3n
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP005=
J9VM171=Intento de establecer un campo final de instancia %2$.*1$s.%4$.*3$s desde el m\u00E9todo "%6$.*5$s" que no es <init>
J9VM170=Intento de establecer un campo est\u00E1tico final %2$.*1$s.%4$.*3$s desde el m\u00E9todo "%6$.*5$s" que no es <clinit>
J9VM173=La clase %2$.*1$s y su anfitri\u00F3n de anidado %4$.*3$s tienen que tener el mismo paquete.
J9VM172=La clase %2$.*1$s y su anfitri\u00F3n de anidado %4$.*3$s deben tener el mismo cargador de clase.
J9VM175=No se ha podido cargar la biblioteca %1$s requerida por el m\u00F3dulo\: %2$s
EXEL093=Las opciones siguientes controlan la configuraci\u00F3n de VM global\:
J9VM174=La clase %2$.*1$s tiene que ser reclamada por su anfitri\u00F3n de anidado %4$.*3$s
EXEL094=\  -Xcompressedrefs              usar referencias de almacenamiento din\u00E1mico comprimidas
J9VM177=La clase %2$.*1$s tiene que ser capaz de cargar su anfitri\u00F3n de anidado %4$.*3$s.
EXEL095=\  -Xrealtime                    habilitar extensiones en tiempo real
J9VM176=violaci\u00F3n de restricci\u00F3n de carga en la alteraci\u00F3n temporal del m\u00E9todo "%2$.*1$s.%4$.*3$s%6$.*5$s" durante la creaci\u00F3n de la clase "%18$.*17$s"\: el cargador "%8$.*7$s@%9$x" de la clase "%11$.*10$s" y el cargador "%13$.*12$s@%14$x" de la clase "%16$.*15$s" tienen diferentes tipos para la firma del m\u00E9todo
EXEL096=\  -Xgcpolicy\:metronome          habilitar extensiones en tiempo real
J9VM179=El m\u00F3dulo no tiene nombre.
EXEL097=\  -Xrealtime                    habilitar soft en tiempo real
J9VM178=El m\u00F3dulo es nulo.
EXEL098=\  -Xgcpolicy\:metronome          habilitar soft en tiempo real
EXEL099=\  -Xrealtime -Xnortsj           habilitar soft en tiempo real
EXEL080=java versi\u00F3n "%s"
EXEL081=java versi\u00F3n "%1$s/%2$s"
J9VM160=Error\: %s requiere que se especifiquen los m\u00F3dulos.
J9VM162=\ten %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s)
J9VM161=\ten %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s\:%9$u)
J9VM164=\ten %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s)
EXEL082=\  -Xlp<x>         establece el tama\u00F1o de p\u00E1gina grande en <x>
J9VM163=\ten %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s\:%8$u)
EXEL083=No se ha podido abrir el archivo\: %s
J9VM166=\ten %2$.*1$s.%4$.*3$s (%5$.*6$s)
EXEL084=No se puede hacer una copia de seguridad del archivo\: %s
J9VM165=\ten %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
EXEL085=\nAVISO\: se ha desechado el argumento de l\u00EDnea de mandatos "%s".\nAVISO\: Utilice "-jxe <v\u00EDa de acceso>" en su lugar.\n
J9VM168=
EXEL086=\n  -Xtrace[\:opci\u00F3n,...]  rastreo de control, utilice -Xtrace\:help para obtener m\u00E1s informaci\u00F3n
J9VM167=Las optimizaciones de GC en desocupado no est\u00E1n permitidas
EXEL087=\  -Xjni\:<opciones>              establece las opciones JNI
EXEL088=
J9VM169=
EXEL089=\  -Xscminaot<x>   establece el espacio m\u00EDnimo de memoria cach\u00E9 de clases compartidas reservado para datos AOT en <x>
J9VM117=Se ignora -Xitsn si no se especifica -Xshareclasses
J9VM116=noLockword\:%.*s
J9VM119=Se ignora -Xscmaxjit si no se especifica -Xshareclasses
J9VM118=Se ignora -Xscminjit si no se especifica -Xshareclasses
J9VM111=Se ha especificado una opci\u00F3n lockword no v\u00E1lida\:%s
J9VM110=Se ha especificado una modalidad lockword no v\u00E1lida\:%s
J9VM113=-----------------------------
J9VM112=Configuraci\u00F3n de Lockword
J9VM115=lockword\:%.*s
J9VM114=Modalidad de Lockword\=%s
J9VM106=Las opciones info, warn, error, vital y config se pueden combinar con coma (','); por ejemplo\:\n
J9VM105=-Xsyslog\:config            Registrar mensajes de configuraci\u00F3n de JVM.\n
J9VM108=-Xsyslog\:info,warn,error\n
J9VM107=-Xsyslog\:error,warn
J9VM109=Sistema operativo no soportado (%s)\: hace falta Windows XP o posterior.
J9VM100=-Xsyslog\:all               Registrar todos los mensajes JVM.
J9VM102=-Xsyslog\:warn              Registrar los mensajes de aviso de JVM.
J9VM101=-Xsyslog\:info              Registrar los mensajes informativos de JVM.
J9VM104=-Xsyslog\:vital             Registrar mensajes cr\u00EDticos de JVM. De forma predeterminada, esto est\u00E1 activado.
J9VM103=-Xsyslog\:error             Registrar los mensajes de error de JVM. De forma predeterminada, esto est\u00E1 activado.
J9VM139=
J9VM138=
J9VM131=Se ha finalizado el proceso utilizando CEE3AB2() con el final de tarea an\u00F3malo %1$u, raz\u00F3n %2$u, limpieza %3$u.
J9VM130=La aplicaci\u00F3n reanuda la ejecuci\u00F3n despu\u00E9s de encontrarse con una condici\u00F3n que no se puede recuperar y se ha devuelto ilegalmente o se ha llamado a Java (c\u00F3digo JIT'ed)
J9VM133=Se ha configurado ulimit permanente del tama\u00F1o de n\u00FAcleo del sistema en %d, los volcados podr\u00EDan estar truncados.
J9VM132=Se ha especificado una palabra de bloqueo no v\u00E1lida, java/lang/Class y java/lang/String no pueden tener palabras de bloqueo cuando -Xtenant est\u00E1 presente\: %s
J9VM135=/proc/sys/kernel/core_pattern valor "%s" especifica que los volcados del n\u00FAcleo se redirigen a un programa externo. La JVM podr\u00EDa no estar disponible para ubicar volcados de n\u00FAcleo ni para cambiarles el nombre.
J9VM134=La opci\u00F3n de fullcore del sistema se ha configurado en FALSE, los volcados podr\u00EDan estar truncados.
J9VM137=Clase %2$.*1$s tiene valores por defecto en conflicto para el m\u00E9todo %4$.*3$s%6$.*5$s
J9VM136=/proc/sys/kernel/core_pattern valor "%s" especifica una serie de formato para cambiar el nombre de volcados de n\u00FAcleo. La JVM podr\u00EDa no estar disponible para ubicar volcados de n\u00FAcleo ni para cambiarles el nombre.
J9VM128=Espacio de almacenamiento din\u00E1mico de Java
J9VM127=El tama\u00F1o inicial del subasignador de 32 bits no se puede configurar en cero.
J9VM129=La aplicaci\u00F3n reanuda la ejecuci\u00F3n despu\u00E9s de encontrarse con una condici\u00F3n que no se puede recuperar y se ha devuelto ilegalmente o se ha llamado a Java
J9VM120=Se ignora -Xscminjitdata si no se especifica -Xshareclasses
J9VM122=Error al obtener el rango de direcciones de user32.dll necesario para -Xprotectcontiguous.
J9VM121=Se ignora -Xscmaxjitdata si no se especifica -Xshareclasses
J9VM124=No se puede definir la clase %.*s\: '%.*s' es un paquete protegido del sistema
J9VM123=Intentando la ejecuci\u00F3n en un procesador sin soporte; JVM terminar\u00E1.
J9VM126=El tama\u00F1o de la confirmaci\u00F3n del subasignador de 32 bits no se puede configurar en cero.
J9VM125=El tama\u00F1o de la confirmaci\u00F3n del subasignador de 32 bits es mayor que el tama\u00F1o inicial. Tama\u00F1o de confirmaci\u00F3n \= %1$u, tama\u00F1o inicial \= %2$u.
SHRC802=La cach\u00E9 tiene un %1$d%% ocupado\n
SHRC803=Habilita la protecci\u00F3n de memoria para p\u00E1ginas parcialmente cumplimentadas durante el inicio.
SHRC804=La JVM ha habilitado la protecci\u00F3n de p\u00E1ginas parcial de memoria cach\u00E9 compartida durante el inicio a medida que se crea la memoria cach\u00E9 compartida existente con protecci\u00F3n de p\u00E1ginas parcial habilitada durante el inicio.
SHRC805=La JVM no ha habilitado la protecci\u00F3n de p\u00E1ginas parcialmente rellenadas de memoria cach\u00E9 compartida en el arranque.
SHRC800=La memoria cach\u00E9 compartida est\u00E1 llena. El espacio AOT/de datos JIT m\u00EDnimo reservado y m\u00E1ximo permitido y el l\u00EDmite softmx ya no pueden ajustarse.
SHRC801=bytes softmx                        %*c\= %d
SHRC806=Se ha destruido la memoria cach\u00E9 compartida persistente de referencias comprimidas "%1$s". Utilice la opci\u00F3n -Xnocompressedrefs si desea destruir una memoria cach\u00E9 de referencias no comprimidas.
SHRC807=Se ha destruido la memoria cach\u00E9 compartida persistente de referencias no comprimidas "%1$s". Utilice la opci\u00F3n -Xcompressedrefs si desea destruir una memoria cach\u00E9 de referencias comprimidas.
SHRC808=Se ha destruido la memoria cach\u00E9 compartida de referencias comprimidas "%s". Utilice la opci\u00F3n -Xnocompressedrefs si desea destruir una memoria cach\u00E9 de referencias no comprimidas.
SHRC809=Se ha destruido la memoria cach\u00E9 compartida de referencias no comprimidas "%s". Utilice la opci\u00F3n -Xcompressedrefs si desea destruir una memoria cach\u00E9 de referencias comprimidas.
DUMP001=Suceso de volcado no reconocido\: ...%s
DUMP000=Opci\u00F3n de volcado no reconocida\: -Xdump\:%s
DUMP003=Agente de volcado no reconocido\: %s
DUMP002=Se\u00F1al no reconocida\: %%%1$c
DUMP012=Error en el volcado %1$s\: %2$s
DUMP011=El volcado %1$s ha creado el proceso %2$d
DUMP014=Acci\u00F3n de VM no reconocida\: ...%s
DUMP013=Suceso de volcado "%1$s" procesado, detalle "%3$.*2$s".
DUMP010=Volcado de tipo %1$s grabado en %2$s
SHRC824=STARTUP HINTS DETAIL Flags\: %1$zu DATA1\: %2$zu DATA2\: %3$zu
DUMP009=El volcado %s no est\u00E1 disponible
SHRC825=\t startuphint       Imprime solo los tipos hints de inicio en la memoria cach\u00E9 compartida.
DUMP008=utilizando '%s'
SHRC826=Bytes hint de inicio                  %*c\= %d
SHRC827=\# Hints de inicio                     %*c\= %d
SHRC820=Inhabilitar el almacenamiento en memoria cach\u00E9 de las clases cargadas por el cargador de clases de arranque.
DUMP005=Falta la herramienta externa
SHRC821=Inhabilitar almacenamiento en memoria cach\u00E9 de las clases cargadas por los cargadores de la base no bootstrap. Esta opci\u00F3n tambi\u00E9n activa la opci\u00F3n "nonfatal".
DUMP004=Falta el nombre de archivo
SHRC822=No inicie la memoria cach\u00E9 compartida si se produce un error.
DUMP007=La JVM solicita volcado de tipo %1$s utilizando '%2$s'
SHRC823=%1$d\: 0x%2$p STARTUP HINTS KEY\: %4$.*3$s Address\: 0x%5$p Size\: %6$d
DUMP006=Procesando el suceso de volcado "%1$s", detalle "%3$.*2$s" - espere.
SHRC828=La ruta de acceso del directorio de la memoria cach\u00E9 compartida es demasiado larga.
SHRC829=No se puede utilizar el inicio del usuario como directorio de la memoria cach\u00E9 compartida predeterminada. No se puede obtener el directorio de inicio. Defina otro directorio a trav\u00E9s de la variable de entorno "HOME" o de la opci\u00F3n de la l\u00EDnea de mandatos "cacheDir\=", o corrija el directorio de inicio de la entrada del archivo de contrase\u00F1a.
DUMP023=La preparaci\u00F3n del almacenamiento din\u00E1mico solicitada no se ha realizado porque el acceso exclusivo no se ha solicitado o no se ha podido obtener.
DUMP022=La compactaci\u00F3n del almacenamiento din\u00E1mico solicitada no se ha realizado porque el acceso exclusivo no se ha solicitado o no se ha podido obtener.
DUMP025=Error IEATDUMP para DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=Se solicitaron varios volcados de almacenamiento din\u00E1mico (Heapdumps) pero falta %%id en la etiqueta de archivo\: los volcados se sobrescribir\u00E1n
DUMP021=El vuelco de almacenamiento din\u00E1mico solicitado no se ha producido porque el acceso exclusivo no se ha solicitado o no se ha podido obtener.
DUMP020=El volcado %s se ha grabado
SHRC813=Total de bytes no almacenados porque el valor de -Xscsoftmx es %u. Bytes AOT no almacenados porque el valor de -Xscmaxaot es %u. Bytes JIT no almacenados porque el valorde -Xscmaxjitdata es %u.
SHRC814=\t stale           Imprime todas las entradas obsoletas de la memoria cach\u00E9 compartida.
DUMP019=La JVM solicita volcado de tipo %s
SHRC815=bytes obsoletos                      %*c\= %u
SHRC816=El valor de %s es superior al tama\u00F1o de memoria cach\u00E9 compartida, por lo que se ha establecido en igual al valor de la memoria cach\u00E9 compartida.
DUMP016=Terminando anormalmente\: no se puede crear el archivo (%s)
SHRC810=Se ha destruido la instant\u00E1nea de memoria cach\u00E9 compartida de referencias comprimidas "%s". Utilice la opci\u00F3n -Xnocompressedrefs si desea destruir una instant\u00E1nea de memoria cach\u00E9 de referencias no comprimidas.
DUMP015=Terminando anormalmente\: no se puede abrir o leer (%s)
SHRC811=Se ha destruido la instant\u00E1nea de memoria cach\u00E9 compartida de referencias no comprimidas "%s". Utilice la opci\u00F3n -Xcompressedrefs si desea destruir una instant\u00E1nea de memoria cach\u00E9 de referencias comprimidas.
DUMP018=El suceso solicitado no est\u00E1 disponible\: ejecutar con el distintivo -Xdump\:dynamic
SHRC812=Funci\u00F3n                              \= %s
DUMP017=Terminando anormalmente\: no se puede comprimir el archivo (%s)
SHRC817=El valor de %s es superior al tama\u00F1o de memoria cach\u00E9 compartida, por lo que se ha establecido en ilimitado.
SHRC818=Total de bytes no almacenados porque el valor del m\u00E1ximo de software de memoria cach\u00E9 compartida es %u. Bytes AOT no almacenados porque el valor de -Xscmaxaot es %u. Bytes JIT no almacenados porque el valorde -Xscmaxjitdata es %u.
SHRC819=No se ha podido iniciar la memoria compartida. La memoria cach\u00E9 compartida existente se ha creado con una compilaci\u00F3n de JVM distinta y no coincide con la JVM existente.
SHRC840=No se ha podido iniciar la memoria compartida.
SHRC841=Especifique el n\u00FAmero de la capa superior. Cree una nueva capa de memoria cach\u00E9 compartida si la capa especificada no existe.
SHRC846=\nEstad\u00EDsticas actuales para la capa superior de la memoria cach\u00E9 "%s"\: \n
SHRC847=capa de memoria cach\u00E9                         %*.c\= %d
SHRC848=\nEstad\u00EDsticas actuales para todas las capas de la memoria cach\u00E9 "%s"\: \n
J9VM191=%2$.*1$s no es visible
SHRC849=Imprimir resumen de las estad\u00EDsticas de memoria cach\u00E9 solo desde la capa superior. Utilizar printTopLayerStats\=help para ver las opciones disponibles.
J9VM190=Superclase %2$.*1$s no puede ser una interfaz
SHRC842=Crear una capa de memoria cach\u00E9 compartida nueva.
J9VM193=A partir de Java 13 -Xverify\:none y -noverify quedaron en desuso para eliminarse y es posible que no se acepten m\u00E1s adelante.
SHRC843=N\u00FAmero de capa no v\u00E1lido %d encontrado para "%s". El n\u00FAmero de capa deber\u00EDa ser inferior a %d.
J9VM192=%2$.*1$s no es una interfaz
SHRC844=N\u00FAmero de capa no v\u00E1lido %d. La capa superior existente es %d. El n\u00FAmero de capa nuevo deber\u00EDa ser %d.
J9VM195=La matriz del paquete es nula.
SHRC845=No comprobar el espacio libre de disco antes de crear una cach\u00E9 permanente.
J9VM194=Relaci\u00F3n de carga de clase no v\u00E1lida para hijo\: %2$.*1$s, padre\: %4$.*3$s
J9VM197=%1$s no est\u00E1 soportado con %2$s.
J9VM196=La serie del paquete es nula.
J9VM199=La clase %2$.*1$s no puede heredar de su superinterfaz sellada.
J9VM198=La clase %2$.*1$s no puede heredar de su superclase sellada.
SHRC830=No se puede utilizar el inicio del usuario como directorio de la memoria cach\u00E9 compartida predeterminada. La ruta de acceso es demasiado larga\: No se puede obtener el directorio de inicio. Defina otro directorio a trav\u00E9s de la variable de entorno "HOME" o de la opci\u00F3n de la l\u00EDnea de mandatos "cacheDir\=", o corrija el directorio de inicio de la entrada del archivo de contrase\u00F1a.
SHRC835=Compruebe las indicaciones de fecha y hora del archivo jar/zip de URL no bootstrap de cada carga de clase.
SHRC836=Destruir todas las capas de memoria cach\u00E9 compartida con el mismo nombre (utilizar el par\u00E1metro name o el valor predeterminado)
SHRC837=No se ha podido asignar un descriptor de memoria cach\u00E9
J9VM180=El nombre del m\u00F3dulo no es v\u00E1lido.
SHRC838=No se ha podido iniciar la memoria compartida. Se ha detectado una modificaci\u00F3n en una memoria cach\u00E9 compartida de capa inferior. El ID de memoria cach\u00E9 exclusivo esperado es %s
SHRC831=No se puede utilizar el inicio del usuario como directorio de la memoria cach\u00E9 compartida predeterminada. Est\u00E1 en un sistema de archivos de red. No se puede obtener el directorio de inicio. Defina otro directorio a trav\u00E9s de la variable de entorno "HOME" o de la opci\u00F3n de la l\u00EDnea de mandatos "cacheDir\=", o corrija el directorio de inicio de la entrada del archivo de contrase\u00F1a.
J9VM182=Solamente el cargador de clase de arranque o de plataforma pueden definir el paquete java o java.*
SHRC832=No se puede utilizar el inicio del usuario como directorio de la memoria cach\u00E9 compartida predeterminada. El c\u00F3digo de error es %1$d.
J9VM181=Solamente el cargador de clases de arranque puede definir el m\u00F3dulo java.base.
SHRC833=No se ha podido asignar la memoria nativa necesaria para obtener el directorio de la memoria cach\u00E9 compartido.
J9VM184=clase err\u00F3nea %2$.*1$s\: el campo de instancia Qtype no es un tipo de valor
SHRC834=Minimice la indicaci\u00F3n de fecha y hora comprobando los archivos jar/zip de URL.
J9VM183=El miembro anidado %2$.*1$s tiene que ser capaz de cargar su anfitri\u00F3n de anidado %4$.*3$s
J9VM186=tipo de objeto err\u00F3neo %2$.*1$s\: el objeto apilado no es un tipo de valor
J9VM185=clase err\u00F3nea %2$.*1$s\: classref no es un tipo de valor
J9VM188=No se ha podido crear una hebra\: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 0x%4$x
J9VM187=el tipo de objeto err\u00F3neo %2$.*1$s\: el objeto sincronizado es un tipo de valor
SHRC839=No se ha podido iniciar la memoria compartida. Se ha producido un error al obtener el ID exclusivo de una memoria cach\u00E9 de prerrequisito de una capa inferior.
J9VM189=Superclase final %2$.*1$s no se puede ampliar
SHRC850=Opciones disponibles para -Xshareclasses\:%1$s<options>. Utilice '+' para especificar varias opciones. Es decir, %2$saot+url \n
SHRC851=Desactiva la comprobaci\u00F3n de indicaci\u00F3n horaria al encontrar clases en la memoria cach\u00E9 compartida. Las clases obsoletas se pueden descargar desde la memoria cach\u00E9 compartida.
SHRC852=Se ha suprimido la capa superior (capa %d) de la memoria cach\u00E9. Se ha detectado una modificaci\u00F3n de la capa %d de la memoria cach\u00E9 compartida. El ID exclusivo de memoria cach\u00E9 esperado es %s, el ID exclusivo de memoria cach\u00E9 actual es %s.
SHRC853=Caracter\u00EDsticas de procesador        \= %s
VRFY007=m\u00E9todo final reemplazado
VRFY008=el \u00EDndice de matriz no es un entero
VRFY009=la matriz no es de tipo compatible
SHRC761=No se ha podido definir el permiso de acceso a grupo seg\u00FAn se solicita con la subopci\u00F3n 'groupAccess' en el archivo de instant\u00E1nea de memoria compartida.
VRFY000=%1$s; clase\=%3$.*2$s, m\u00E9todo\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC762=Error al obtener estad\u00EDsticas del archivo de memoria cach\u00E9 de clase compartida al verificar su permiso de acceso a grupo.
VRFY001=%1$s; clase\=%3$.*2$s, m\u00E9todo\=%5$.*4$s%7$.*6$s
SHRC763=Todas las subopciones de clases compartidas en total no deben tener m\u00E1s de %u caracteres.
VRFY002=secuencia de bytecode no v\u00E1lida
SHRC764=No se puede crear una memoria compartida de %1$d bytes seg\u00FAn se solicita. \n  \tSe ha ajustado a la memoria m\u00E1xima compartida permitida (%2$d bytes) \n \t(Para aumentar la memoria compartida disponible, modifique el valor SHMMAX del sistema) \n  \t Si se utiliza -Xscdmx, el \u00E1rea de atributos de depuraci\u00F3n se ajusta de forma proporcional\n  \t seg\u00FAn la relaci\u00F3n original con el valor -Xscmx.
VRFY003=la clase no contiene datos de preverificaci\u00F3n
VRFY004=la incorporaci\u00F3n de c\u00F3digo jsr ha encontrado demasiadas jsr
VRFY005=local no es de tipo compatible
VRFY006=el tama\u00F1o de la nueva matriz no es un entero
SHRC760=No se ha podido definir el permiso de acceso a grupo seg\u00FAn se solicita con la subopci\u00F3n 'groupAccess' en el archivo de control de memoria compartida asociado con la memoria cach\u00E9 de clases compartida.
SHRC769=La JVM ha habilitado la protecci\u00F3n de p\u00E1ginas parcial de memoria cach\u00E9 compartida a medida que se crea la memoria cach\u00E9 compartida existente con protecci\u00F3n de p\u00E1ginas parcial habilitada.
SHRC765=La protecci\u00F3n de p\u00E1ginas de memoria en datos de tiempo de ejecuci\u00F3n, los datos de lectura-grabaci\u00F3n de serie y las p\u00E1ginas parcialmente rellenas se han habilitado satisfactoriamente.
SHRC766=La protecci\u00F3n de p\u00E1ginas de memoria en datos de tiempo de ejecuci\u00F3n y las p\u00E1ginas parcialmente rellenas se ha habilitado satisfactoriamente.
SHRC767=La protecci\u00F3n de p\u00E1ginas de memoria en datos de tiempo de ejecuci\u00F3n y en datos de lectura-grabaci\u00F3n de serie se ha habilitado satisfactoriamente.
SHRC768=La protecci\u00F3n de p\u00E1ginas de memoria en datos de tiempo de ejecuci\u00F3n se ha habilitado satisfactoriamente.
VRFY018=se ha excedido el tama\u00F1o m\u00E1ximo de pila
VRFY019=ha fallado la carga de clase
VRFY010=varias jsr utilizan un solo retorno
SHRC750=Ning\u00FAn m\u00E9todo AOT coincide las especificaciones de m\u00E9todo.
VRFY011=el par\u00E1metro lookupswitch no es un entero
SHRC751=No se han podido analizar las especificaciones de m\u00E9todo. No se permiten m\u00E1s de %d especificaciones de m\u00E9todo.
VRFY012=tama\u00F1o de pila incoherente
SHRC752=No se han podido analizar las especificaciones de m\u00E9todo.
VRFY013=se ha violado una restricci\u00F3n de carga de clases
SHRC753=No se ha podido obtener el mutex de escritura en cach\u00E9.
VRFY014=bytecode de retorno incompatible con tipo de retorno
VRFY015=varios retornos en una sola jsr
VRFY016=el par\u00E1metro de bytecode shift no es un entero
VRFY017=<init> no llama a este <init> o super <init>
SHRC758=No se ha podido definir el permiso de acceso a grupo seg\u00FAn se solicita con la subopci\u00F3n 'groupAccess' en la memoria compartida shmid\=%d asociado con la memoria cach\u00E9 de clases compartida.
SHRC759=No se ha podido definir el permiso de acceso a grupo seg\u00FAn se solicita con la subopci\u00F3n 'groupAccess' en el archivo de control de sem\u00E1foros asociado con la memoria cach\u00E9 de clases compartida.
SHRC754=No est\u00E1 permitida la recreaci\u00F3n de un archivo de control de memoria compartida.
SHRC755=\t invalidatedaot S\u00F3lo imprime los tipos AOT invalidados en la cach\u00E9 compartida.
SHRC756=No se ha podido definir el permiso de acceso a grupo en el archivo de memoria cach\u00E9 compartida seg\u00FAn se solicita con la subopci\u00F3n 'groupAccess'.
VRFY020=los argumentos de invocaci\u00F3n no son de tipo compatible
SHRC757=No se ha podido definir el permiso de acceso a grupo seg\u00FAn se solicita con la subopci\u00F3n 'groupAccess' en el sem\u00E1foro definido con semid\=%d asociado con la memoria cach\u00E9 de clases compartida.
SHRC783=El espacio de datos JIT m\u00E1ximo permitido no debe ser superior al l\u00EDmite softmx de %u bytes definido en el uso de memoria cach\u00E9 compartida.
SHRC300=La memoria cach\u00E9 de clases compartidas est\u00E1 siendo utilizada por otra VM, no puede hacer crecer la memoria cach\u00E9 anidada
SHRC784=No se puede definir el tama\u00F1o de espacio AOT o espacio de datos JIT m\u00E1ximo permitido de la forma solicitada. El l\u00EDmite softmx establecido en el uso de memoria compartida o el tama\u00F1o de memoria cach\u00E9 total no es suficientemente grande.
SHRC301=No es posible hacer crecer la memoria cach\u00E9 anidada "%s", no ha podido asignarse la nueva supermemoria cach\u00E9 para sugerencias
SHRC785=Los bytes AOT m\u00EDnimos reservados se han establecido en %d.
SHRC302=No es posible hacer crecer la memoria cach\u00E9 anidada "%s", no ha podido asignarse el bloque para sugerencias
SHRC786=Los bytes AOT m\u00E1ximos permitidos se han establecido en %d.
SHRC780=El tama\u00F1o m\u00E1ximo del espacio AOT no debe ser inferior a los bytes AOT (%d) ya almacenados en la memoria cach\u00E9.
SHRC781=El espacio AOT m\u00E1ximo permitido no debe ser superior al l\u00EDmite softmx de %u bytes definido en el uso de memoria cach\u00E9 compartida.
SHRC782=El tama\u00F1o m\u00E1ximo del espacio de datos JIT no debe ser inferior a los bytes JIT (%d) ya almacenados en la memoria cach\u00E9.
SHRC307=\tROMMETHOD\: %2$.*1$s Firma\: %4$.*3$s Direcci\u00F3n\: 0x%5$p
SHRC308=No se ha podido serializar la memoria cach\u00E9 "%s". No se han podido actualizar los desplazamientos de clase ROM en m\u00E9todos AOT.
SHRC309=No pueden utilizarse las opciones "grow" y "readonly" juntas.
SHRC303=No se ha podido crear la memoria cach\u00E9 anidada "%s"
SHRC787=Los bytes de datos JIT m\u00EDnimos reservados se han establecido en %d.
SHRC304=No ha sido posible sustituir la memoria cach\u00E9 "%s"
SHRC788=Los bytes de datos JIT m\u00E1ximos permitidos se han establecido en %d.
SHRC305=No es posible asignar memoria para la tabla de b\u00FAsqueda de sugerencias en SH_ClasspathManagerImpl2
SHRC789=Los bytes softmx se han establecido en %u.
SHRC306=\ Firma\: %2$.*1$s Direcci\u00F3n\: 0x%3$p
SHRC772=Se ha alcanzado el l\u00EDmite softmx para el uso de memoria compartida "%s". Utilice la opci\u00F3n "%s" para aumentar el l\u00EDmite de softmx.
SHRC773=El espacio para datos AOT en la memoria compartida "%s" est\u00E1 lleno.
SHRC774=El espacio para datos JIT en la memoria compartida "%s" est\u00E1 lleno.
SHRC775=El l\u00EDmite softmx establecido para el uso de memoria compartida es superior al tama\u00F1o total de la memoria cach\u00E9 de %u bytes. Se establecer\u00E1 en el mismo valor que el tama\u00F1o total de la memoria cach\u00E9.
SHRC770=La JVM ha inhabilitado la protecci\u00F3n de p\u00E1ginas parcialmente rellenas. Si se especifica '-Xshareclasses\:mprotect\=onfind', tambi\u00E9n se ignora.
SHRC771=Habilita la protecci\u00F3n de memoria para p\u00E1ginas parcialmente cumplimentadas. En z/OS equivale a 'partialpagesonstartup'.
SHRC776=El l\u00EDmite softmx para el uso de memoria cach\u00E9 compartida es inferior al n\u00FAmero de bytes %u en una memoria compartida que ya est\u00E1 en uso.
SHRC777=El l\u00EDmite softmx para el uso de memoria cach\u00E9 compartida es inferior al valor m\u00EDnimo de %u.
SHRC778=El espacio AOT m\u00EDnimo reservado no debe ser superior al espacio AOT m\u00E1ximo permitido.
SHRC779=El espacio de datos JIT m\u00EDnimo reservado no debe ser superior al espacio de datos JIT m\u00E1ximo permitido.
SHRC321=Recuperaci\u00F3n de errores\: cerrando sem\u00E1foros de memoria compartida.
SHRC322=No se han podido inicializar los sem\u00E1foros para la memoria cach\u00E9 de clases compartidas. Aviso\: puede que la memoria cach\u00E9 est\u00E9 da\u00F1ada. Si experimenta problemas utilizando la memoria cach\u00E9 compartida, es recomendable que la destruya y la vuelva a crear.
SHRC323=ERROR\: Error al especificar mutex para la cabecera de memoria cach\u00E9 de clase compartida. Aviso\: puede que la memoria cach\u00E9 est\u00E9 da\u00F1ada. Si experimenta problemas utilizando la memoria cach\u00E9 compartida, es recomendable que la destruya y la vuelva a crear.
SHRC324=ERROR\: Error al salir de mutex para la cabecera de memoria cach\u00E9 de clase compartida. Aviso\: puede que la memoria cach\u00E9 est\u00E9 da\u00F1ada. Si experimenta problemas utilizando la memoria cach\u00E9 compartida, es recomendable que la destruya y la vuelva a crear.
SHRC320=Recuperaci\u00F3n de errores\: destruyendo sem\u00E1foros de memoria compartida.
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex no ha podido adquirir el m\u00FAtex de tabla de series (c\u00F3digo de retorno %d).
SHRC325=No ha sido posible publicar el bloqueo de cabecera de memoria cach\u00E9 de clases compartidas durante la inicializaci\u00F3n. Aviso\: puede que la memoria cach\u00E9 est\u00E9 da\u00F1ada. Si experimenta problemas utilizando la memoria cach\u00E9 compartida, es recomendable que la destruya y la vuelva a crear.
SHRC326=No ha sido posible publicar el bloqueo de usuario de cabecera de memoria cach\u00E9 de clases compartidas durante la inicializaci\u00F3n. Aviso\: puede que la memoria cach\u00E9 est\u00E9 da\u00F1ada. Si experimenta problemas utilizando la memoria cach\u00E9 compartida, es recomendable que la destruya y la vuelva a crear.
SHRC327=La llamada SH_OSCachesysv\:\:acquireWriteLock() a j9shsem_wait ha fallado con el error %d.
SHRC328=IPC de System V ha informado del siguiente error '%s'
VERB032=espacio m\u00EDnimo reservado de memoria cach\u00E9 de clases compartidas para datos JIT
SHRC310=No se puede encontrar la memoria cach\u00E9 persistente en un sistema de archivos de red. Seleccione un cacheDir distinto.
SHRC794=Ajuste el espacio m\u00E1ximo de memoria cach\u00E9 de clases compartida para datos JIT en <tama\u00F1o>.
VERB033=espacio m\u00E1ximo permitido de memoria cach\u00E9 de clases compartidas para datos JIT
SHRC311=Error al liberar el bloqueo de escritura de conexi\u00F3n de archivo de memoria cach\u00E9 de clases compartidas
SHRC795=La suma de %d bytes de AOT m\u00EDnimos reservados y %d bytes de JIT m\u00EDnimos reservados no debe ser superiero a %d bytes de softmx.
VERB034=tama\u00F1o de p\u00E1gina grande para memoria cach\u00E9 de c\u00F3digo JIT
SHRC312=Error al liberar el bloqueo de escritura de cabecera de archivo de memoria cach\u00E9 de clases compartidas
SHRC796=El espacio AOT m\u00EDnimo reservado no debe ser superior al l\u00EDmite %d sftmx definido en el uso de la memoria cach\u00E9.
VERB035=tama\u00F1os de p\u00E1gina grande disponibles para memoria cach\u00E9 de c\u00F3digo JIT\:
SHRC313=No se ha podido crear jclCacheMutex en shrinit
SHRC797=El espacio de datos JIT m\u00EDnimo reservado no debe ser superior al l\u00EDmite %d sftmx definido en el uso de la memoria cach\u00E9.
VERB036=tama\u00F1o inicial de metadatos de referencias comprimidas
SHRC790=Ajuste el tama\u00F1o de softmx en la memoria cach\u00E9 en <tama\u00F1o>.
VERB037=tama\u00F1o de memoria cach\u00E9 de clase compartida
SHRC791=Ajuste el espacio de memoria cach\u00E9 de clases m\u00EDnima compartida reservada para datos AOT en <tama\u00F1o>.
VERB038=tama\u00F1o m\u00E1ximo de memoria cach\u00E9 de clase compartida
SHRC792=Ajuste el espacio m\u00E1ximo de memoria cach\u00E9 de clases compartida para datos AOT en <tama\u00F1o>.
SHRC793=Ajuste el espacio de memoria cach\u00E9 de clases m\u00EDnima compartida reservada para datos JIT en <tama\u00F1o>.
SHRC318=Recuperaci\u00F3n de errores\: destruyendo memoria compartida.
SHRC319=Recuperaci\u00F3n de errores\: cerrando memoria compartida.
SHRC314=No ha sido posible asignar memoria para la tabla de b\u00FAsqueda de sugerencias en SH_Manager
SHRC798=El espacio AOT m\u00E1ximo permitido no debe ser superior al l\u00EDmite %d sftmx definido en el uso de la memoria cach\u00E9.
SHRC315=No ha sido posible inicializar los segmentos de memoria de clase de cachelet
SHRC799=El espacio de datos JIT m\u00E1ximo permitido no debe ser superior al l\u00EDmite %d sftmx definido en el uso de la memoria cach\u00E9.
VERB030=espacio m\u00E1ximo permitido de memoria cach\u00E9 de clases compartidas para JIT
SHRC316=No es posible serializar la memoria cach\u00E9 porque no existe una hebra de VM actual.
VERB031=espacio reservado de memoria cach\u00E9 de clases compartidas para atributos de depuraci\u00F3n de clases
SHRC317=Imprimir el nombre del archivo de memoria cach\u00E9 de clases compartidas que ser\u00E1 utilizado.
VRFY029=returnAddress no v\u00E1lida para instrucci\u00F3n ret
VRFY021=el objeto generado no es de tipo throwable
SHRC343=Se ha encontrado la clase %1$s de la memoria cach\u00E9 compartida para el ID de cargador de clase %2$d con URL %4$.*3$s.
VRFY022=las subrutinas se deben recorrer de nuevo para cada jsr
SHRC344=No se ha podido encontrar la clase %1$s de la memoria cach\u00E9 compartida para el ID de cargador de clase %2$d con URL %4$.*3$s.
VRFY023=el par\u00E1metro tableswitch no es un entero
SHRC345=Se ha encontrado la clase %1$s de la memoria cach\u00E9 compartida para el ID de cargador de clase %2$d con se\u00F1al %4$.*3$s.
VRFY024=los argumentos no son de tipo compatible
SHRC346=No se ha podido encontrar la clase %1$s de la memoria cach\u00E9 compartida para el ID de cargador de clase %2$d con se\u00F1al %4$.*3$s.
VRFY025=acceso incorrecto a datos protegidos
VRFY026=fin de archivo inesperado
SHRC340=La comprobaci\u00F3n CRC de la memoria cach\u00E9 compartida ha fallado. CRC almacenado %1$x, CRC calculado %2$x
VRFY027=el destinatario es incompatible con la clase declarada
SHRC341=Buscando clase %1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %2$d.
VRFY028=dimensi\u00F3n incorrecta
SHRC342=No ha sido posible encontrar la clase %1$s de la memoria cach\u00E9 compartida para el ID de cargador de clase %2$d.
SHRC347=Clase %2$.*1$s almacenada en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con URL %5$.*4$s (\u00EDndice %6$d)...
SHRC348=No ha sido posible almacenar la clase %2$.*1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con URL %5$.*4$s (\u00EDndice %6$d)...
VRFY030=tipo incorrecto en la pila
SHRC349=Clase %2$.*1$s almacenada en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con URL %5$.*4$s...
VRFY031=se ha intentado utilizar iinc para un valor que no es un entero
J2SE000=\n
VRFY032=destinatario incorrecto para <init>
SHRC332=Protecci\u00F3n de p\u00E1ginas de memoria de datos habilitada satisfactoriamente para memoria cach\u00E9
VRFY033=el campo no es de tipo compatible
SHRC333=La protecci\u00F3n de p\u00E1ginas de memoria predeterminada se ha habilitado satisfactoriamente para la memoria cach\u00E9
VRFY034=PC de destino no v\u00E1lida
SHRC334=Recuperaci\u00F3n de error fallida\: la destrucci\u00F3n de la memoria compartida ha fallado
VRFY035=no hay ning\u00FAn error
SHRC335=Recuperaci\u00F3n de error fallida\: la destrucci\u00F3n del sem\u00E1foro compartido ha fallado
VRFY036=subdesbordamiento de pila
VRFY037=objeto no inicializado durante ramificaci\u00F3n hacia atr\u00E1s
VRFY038=invokespecial en destino no v\u00E1lido
SHRC330=SH_CompositeCacheImpl\:\:runExitCode no ha podido adquirir el m\u00FAtex de \u00E1rea de escritura (c\u00F3digo de retorno %d).
VRFY039=bytecode desconocido
SHRC331=Se ha adquirido un sem\u00E1foro distinto del utilizado anteriormente con esta memoria cach\u00E9.
SHRC336=C\u00F3digo de error de capa de puerto \= %1$d
VRFY040=el verificador no ha podido asignar memoria nativa
SHRC337=Mensaje de plataforma de error\: %1$s
SHRC338=C\u00F3digo de error de capa de puerto \= %1$d
VRFY041=invokespecial de inicializador incorrecto
VRFY042=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u; Discrepancia de tipo, argument %9$d en la firma %11$.*10$s.%13$.*12$s\:%15$.*14$s noi coincide.
SHRC339=Mensaje de plataforma de error\: %1$s
VERB007=tama\u00F1o de pila de hebras del sistema operativo
VERB008=Tama\u00F1o inicial de pila de hebra de java
VERB009=Incremento de pila de hebra de java
SHRC360=No se han podido encontrar los datos de bytes para la clave %.*s de la memoria cach\u00E9 compartida.
SHRC365=Permite el almacenamiento de informaci\u00F3n de depuraci\u00F3n de clases en la clase compartida.
EXEL109=\  -XX\:ShareClassesEnableBCI   crear memoria cach\u00E9 de clase compartida con soporte de instrumentaci\u00F3n de c\u00F3digos de byte
SHRC366=depuraci\u00F3n habilitada      \= verdadero
VERB000=Pila detallada\: "%2$.*1$s" ha usado used %3$zd/%4$zd bytes en pilas Java/C
SHRC367=depuraci\u00F3n habilitada      \= falso
VERB001=
SHRC368=Cerrando memoria cach\u00E9 de clases compartidas no habilitadas para la depuraci\u00F3n
VERB002=Pila verbosa\: el uso m\u00E1ximo de pila m\u00E1ximo fue de %1$zd/%2$zd bytes en pilas Java/C
SHRC361=Error al conectarse a la memoria compartida durante la apertura/creaci\u00F3n
VERB003=Error\: el n\u00FAmero de archivos de -Xverbosegclog debe ser mayor que 0
SHRC362=No se puede asignar memoria para ClasspathItem
VERB004=Error\: el n\u00FAmero de ciclos de -Xverbosegclog debe ser mayor que 0
SHRC363=No se puede asignar API para clases compartidas en shrinit
VERB005=Error\: falta el nombre de archivo en -Xverbosegclog
SHRC364=La llamada SH_OSCachesysv\:\:acquireWriteLock() a j9shsem_wait en semid %d ha fallado con el error %d.
VERB006=No se ha podido inicializar
EXEL112=\  -Xscsoftmx<x>   establece el tama\u00F1o m\u00E1ximo de la nueva memoria cach\u00E9 de clases compartida en <x>
EXEL113=\  -Xscmx<x>       establece el tama\u00F1o (o el tama\u00F1o m\u00E1ximo de software si la opci\u00F3n -XX\:SharedCacheHardLimit\= est\u00E1 presente) de la nueva memoria cach\u00E9 de clase compartida en <x>
EXEL114=\  -XX\:SharedCacheHardLimit\=<x>   establece el tama\u00F1o de la nueva memoria cach\u00E9 de clase compartida en <x>
EXEL115=\  -XX\:+ShareAnonymousClasses   habilitar almacenamiento y encontrar clases an\u00F3nimas en la memoria cach\u00E9 de clase compartida
SHRC369=-Xnolinenumbers    \= true
EXEL116=\  -XX\:-ShareAnonymousClasses   inhabilitar almacenamiento y b\u00FAsqueda de clases an\u00F3nimas en la memoria cach\u00E9 de clase compartida
EXEL117=\  -XX\:+ShareUnsafeClasses   habilitar almacenamiento y b\u00FAsqueda de clases poco seguras y no an\u00F3nimas en la memoria cach\u00E9 de clase compartida
EXEL118=\  -XX\:-ShareUnsafeClasses   inhabilitar el almacenamiento y la b\u00FAsqueda de clases poco seguras no an\u00F3nimas en la memoria cach\u00E9 de clase compartida
EXEL119=\  -XX\:+UseGCStartupHints   habilitar almacenamiento y b\u00FAsqueda hints de inicio GC en la memoria cach\u00E9 de clase compartida
EXEL110=\  -XX\:ShareClassesDisableBCI   crear memoria cach\u00E9 de clase compartida sin soporte de instrumentaci\u00F3n de c\u00F3digos de byte
EXEL111=\  -XX\:+StoreIntermediateClassfile   almacenar datos de clases sin procesar para utilizar durante la retransformaci\u00F3n
SHRC354=No se ha podido encontrar el c\u00F3digo AOT para ROMMethod 0x%1$p de la memoria cach\u00E9 compartida.
SHRC355=C\u00F3digo AOT almacenado para ROMMethod 0x%1$p en memoria cach\u00E9 compartida.
SHRC356=No se ha podido almacenar el c\u00F3digo AOT para ROMMethod 0x%1$p de la memoria cach\u00E9 compartida.
SHRC357=Datos de bytes almacenados para la clave %.*s de la memoria cach\u00E9 compartida.
SHRC350=No se ha podido almacenar la clase %2$.*1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con URL %5$.*4$s.
SHRC351=Clase %2$.*1$s almacenada en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con se\u00F1al %5$.*4$s...
SHRC352=No se ha podido almacenar la clase %2$.*1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con se\u00F1al %5$.*4$s...
SHRC353=C\u00F3digo AOT encontrado para ROMMethod 0x%1$p de la memoria cach\u00E9 compartida.
EXEL101=\n  -Xhealthcenter  habilitar el agente de Health Center
EXEL102=
EXEL103=\  -Xscdmx<x>      establecer el tama\u00F1o del \u00E1rea de atributo de depuraci\u00F3n de memoria cach\u00E9 compartida en <x>
EXEL104=\  -Xscminjit<x>   establece el espacio m\u00EDnimo de memoria cach\u00E9 de clases compartidas reservado para datos JIT en <x>
SHRC358=No se han podido almacenar los datos de bytes para la clave %.*s de la memoria cach\u00E9 compartida.
EXEL105=\  -Xscmaxjit<x>   establece el espacio m\u00E1ximo de memoria cach\u00E9 de clases compartidas permitido para datos JIT en <x>
SHRC359=Se han encontrado datos de bytes para la clave %.*s memoria cach\u00E9 compartida...
EXEL106=\  -Xscminjitdata<x>   establece el espacio m\u00EDnimo de memoria cach\u00E9 de clases compartidas reservado para datos JIT en <x>
EXEL107=\  -Xscmaxjitdata<x>   establece el espacio m\u00E1ximo de memoria cach\u00E9 de clases compartidas permitido para datos JIT en <x>
EXEL108=\    - Xzero\:nosharebootzip     no comparte las memorias cach\u00E9 de entrada bootstrap jar en la memoria cach\u00E9 de clases compartidas
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj habilitar soft en tiempo real
VERB029=espacio m\u00EDnimo reservado de memoria cach\u00E9 de clases compartidas para JIT
SHRC380=\u00C1rea de depuraci\u00F3n de clases %% utilizada             %*c\= %u%%
SHRC381=Bytes de la clase LineNumberTable        %*c\= %u
SHRC382=Bytes del \u00E1rea de depuraci\u00F3n de clases LocalVariableTable %*c\= %u\n
VERB021=Entrada de classpath no v\u00E1lida\: %s (tipo de archivo no soportado)
SHRC387=bytes libres                          %*c\= %d
VERB022=Entrada de classpath no v\u00E1lida\: %s (tipo de archivo desconocido)
SHRC388=bytes de ROMClass                      %*c\= %d
VERB023=Entrada de classpath no v\u00E1lida\: %s (error desconocido)
SHRC389=Bytes de metadatos                      %*c\= %d
VERB024=Entrada de classpath no v\u00E1lida\: %s (jxe no contiene rom.classes)
VERB025=Entrada de classpath no v\u00E1lida\: %s (cabecera de imagen da\u00F1ada de jxe)
SHRC383=\ndirecci\u00F3n base                        %*c\= 0x%p
VERB026=Entrada de classpath no v\u00E1lida\: %s (jxe con orden de bytes contrario no soportado)
SHRC384=direcci\u00F3n final                         %*c\= 0x%p
VERB027=Pila detallada\: la hebra en ejecuci\u00F3n "%2$.*1$s" est\u00E1 usando %3$zd/%4$zd bytes en pilas Java/C
SHRC385=puntero de asignaci\u00F3n                  %*c\= 0x%p\n
VERB028=Pila detallada\: no se ha podido imprimir la informaci\u00F3n de pila para las hebras actualmente en ejecuci\u00F3n
SHRC386=tama\u00F1o de memoria cach\u00E9                           %*c\= %d
VERB020=Entrada de classpath no v\u00E1lida\: %s (archivo da\u00F1ado)
VERB018=Entrada de classpath no v\u00E1lida\: %s (error en E/S de archivo)
VERB019=Entrada de classpath no v\u00E1lida\: %s (error en lectura de archivo)
SHRC370=-Xnolinenumbers    \= false
SHRC371=Comprimir bytes de memoria cach\u00E9    \= %d
VERB010=Tama\u00F1o m\u00E1ximo de pila de hebra de java
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC377=El valor -Xscdmx de %u bytes es mayor que los %u bytes de espacio libre disponible. En su lugar, se utilizar\u00E1 un valor de %u bytes para -Xscdmx.
VERB011=Tama\u00F1o de pila de hebra de java
VERB012=Incremento de segmento de clase RAM
SHRC378=\n Opciones de l\u00EDnea de mandatos relacionadas\:\n
VERB013=Incremento de segmento de clase ROM
SHRC379=Tama\u00F1o del \u00E1rea de depuraci\u00F3n de clases                %*c\= %u
VERB014=memoria m\u00E1xima
SHRC372=\# Comprimir memorias cach\u00E9       \= %d
VERB015=tama\u00F1o de memoria cach\u00E9 de clase compartida
SHRC373=Bytes de datos de JIT     \= %d
SHRC374=Memoria cach\u00E9 creada con\:
VERB016=espacio m\u00EDnimo reservado de memoria cach\u00E9 de clases compartidas para AOT
SHRC375=El nombre de la memoria cach\u00E9 es demasiado largo cuando se incluye el nombre del usuario. Existen %d bytes restantes en este almacenamiento intermedio y el nombre de usuario tiene %d bytes.
VERB017=espacio m\u00E1ximo permitido de memoria cach\u00E9 de clases compartidas para AOT
EXEL120=\  -XX\:-UseGCStartupHints   inhabilitar almacenamiento y b\u00FAsqueda de hints de inicio GC en la memoria cach\u00E9 de clase compartida
EXEL121=\  -XX\:+PortableSharedCache   habilita la caracter\u00EDstica que intenta maximizar la portabilidad de la memoria cach\u00E9 compartida entre las m\u00E1quinas
EXEL122=\  -XX\:-PortableShareCache   inhabilita la caracter\u00EDstica que intenta maximizar la portabilidad de la memoria cach\u00E9 compartida entre las m\u00E1quinas
SHRC390=Metadatos %% utilizados                     %*c\= %d%%
SHRC391=N\u00FAm. de ROMClasses                        %*c\= %d
SHRC392=N\u00FAm. de Classpaths                        %*c\= %d
SHRC393=N\u00FAm. de URL                              %*c\= %d
SHRC398=N\u00FAm. de m\u00E9todos AOT                       %*c\= %d
SHRC399=Bytes de datos                          %*c\= %d
SHRC394=N\u00FAm. de se\u00F1ales                            %*c\= %d
SHRC395=N\u00FAm. de clases obsoletas                     %*c\= %d
SHRC396=Clases obsoletas %%                     %*c\= %d%%\n
SHRC397=Bytes de AOT                           %*c\= %d
CFRE100=demasiadas dimensiones solicitadas en c\u00F3digo de bytes multianewarray
CFRE101=desplazamiento fuera de rango del c\u00F3digo de bytes switch
CFRE102=firma de campo no v\u00E1lida
CFRE103=el m\u00E9todo abstract no puede ser private, static, final, native, synchronized o strict
CFRE104=el campo puede ser como mucho uno public, private o protected
CFRE110=constante incompatible para el campo
CFRE111=UTF8 mal formado
CFRE112=VM no soporta la verificaci\u00F3n din\u00E1mica
CFRE113=fin de archivo inesperado
CFRE114=el nombre de campo no es v\u00E1lido
CFRE115=dimensiones de matriz > 255
CFRE105=superClass debe ser una clase
CFRE106=m\u00E9todo duplicado
CFRE107=desplazamiento fuera de rango del c\u00F3digo de bytes jump
CFRE108=el \u00EDndice de m\u00E9todo de inclusi\u00F3n debe hacer referencia a un nombre y lugar
CFRE109=firma de m\u00E9todo no v\u00E1lida
CFRE141=method_info tiene m\u00E1s de un atributo RuntimeInvisibleParameterAnnotations o RuntimeVisibleParameterAnnotations
CFRE142=La clase tiene m\u00E1s de un atributo RuntimeInvisibleAnnotations o RuntimeVisibleAnnotations
CFRE143=Atributos m\u00FAltiples de pareja de anidado
CFRE144=El anfitri\u00F3n de anidado de atributos de un miembro del anidado tiene que ser una clase constante
CFRE145=El anfitri\u00F3n de anidado tiene que ser una clase constante
CFRE146=El m\u00E9todo <clinit> no es est\u00E1tico
CFRE147=El m\u00E9todo <clinit> tiene una firma no permitida
CFRE148=La interfaz no puede tener un m\u00E9todo llamado <init>
CFRE140=method_info tiene m\u00E1s de un atributo AnnotationDefault
CFRE138=El atributo Classfile hace referencia a una entrada de la agrupaci\u00F3n de constantes que no existe
CFRE139=La clase tiene m\u00E1s de un atributo SourceDebugExtension
CFRE152=module-info no es una clase porque el access_flag ACC_MODULE est\u00E1 establecido
CFRE153=Entrada de agrupaci\u00F3n constante no v\u00E1lida en archivos de clase con versiones < 55.0
CFRE154=Los c\u00F3digos de bytes ldc y ldc_2 deben hacer referencia a constant o Constant_Dynamic
CFRE155=El c\u00F3digo de bytes ldc2_w debe hacer referencia a constant o Constant_Dynamic
CFRE156=Las entradas Constant_Dynamic referenciadas por los c\u00F3digos de byte ldc y ldc_w no deben devolver 'long' ni 'double'
CFRE157=Las entradas Constant_Dynamic referenciadas por el c\u00F3digo de byte ldc2_w deben devolver 'long' o 'double'
CFRE158=Entrada de agrupaci\u00F3n constante no v\u00E1lida en archivos de clase con versiones < 49.0
CFRE159=Entrada de agrupaci\u00F3n constante no v\u00E1lida en archivos de clase con versiones < 51.0
CFRE150=Etiqueta constante desconocida 20 en el archivo de clase
CFRE151=Entrada de agrupaci\u00F3n constante no v\u00E1lida en archivos de clase con versiones < 53.0
CFRE149=Etiqueta constante desconocida 19 en el archivo de clase
CFRE120=los opcodes jsr y jsr_w no son v\u00E1lidos en archivos de clase con versiones >\= 51.0
CFRE121=nombre de campo ilegal
CFRE122=la clase puede ser como mucho public o module
CFRE123=las constantes MethodHandle deben hacer referencia a un campo o a una referencia de m\u00E9todo
CFRE124=el c\u00F3digo de valor del elemento de anotaci\u00F3n no es v\u00E1lido
CFRE125=El c\u00F3digo de bytes invokedynamic debe hacer referencia a una entrada de agrupaci\u00F3n constante InvokeDynamic
CFRE126=la ranura reservada del bytecode invokedynamic no es cero
CFRE116=el bytecode invoke debe hacer referencia a una Methodref
CFRE117=el campo no puede ser final y vol\u00E1til
CFRE118=bytes adicionales despu\u00E9s de EOF
CFRE119=varios atributos SourceFile
CFRE130=varios atributos BootstrapMethods
CFRE131=el atributo BootstrapMethods requerido por invokedynamic no se encuentra o es demasiado peque\u00F1o
CFRE132=type_annotation target_type no reconocidos
CFRE133=El m\u00E9todo tiene dos atributos MethodParameters
CFRE134=El par\u00E1metro de m\u00E9todo tiene un distintivo no v\u00E1lido.
CFRE135=El nombre de par\u00E1metro del m\u00E9todo no es UTF8
CFRE136=Modificadores no v\u00E1lidos para m\u00E9todo de interfaz
CFRE137=La clase tiene m\u00E1s de un atributo RuntimeInvisibleTypeAnnotations o RuntimeVisibleTypeAnnotations
CFRE127=el \u00EDndice de m\u00E9todos del programa de arranque debe hacer referencia a una entrada de la agrupaci\u00F3n constante MethodHandle
CFRE128=firma methodtype no v\u00E1lida
CFRE129=entrada de agrupaci\u00F3n constante no v\u00E1lida en archivos de clase con versiones < 51.0
CFRE163=El archivo de clase es una versi\u00F3n de vista previa, pero tiene la versi\u00F3n principal incorrecta o bien la vista previa no est\u00E1 habilitada.
CFRE164=El \u00EDndice en LocalVariableTable est\u00E1 fuera de rango
CFRE165=El \u00EDndice en LocalVariableTypeTable est\u00E1 fuera de rango
CFRE166=No se permiten entradas duplicadas en LocalVariableTypeTable
CFRE167=varios atributos Record
CFRE168=Las clases de Record no pueden ser abstractas
CFRE169=El nombre de Record debe ser una serie
CFRE160=Entrada de agrupaci\u00F3n constante no v\u00E1lida en archivos de clase con versiones < 55.0
CFRE161=Los argumentos BootstrapMethod (%1$d) contienen una entrada constantpool no v\u00E1lida en el \u00EDndice (\#%2$u) de tipo (%3$u); clase\=%5$.*4$s, compensaci\u00F3n\=%6$u
CFRE162=ValueTypes solo se habilitan con la opci\u00F3n -XX\:+EnableValhalla
SHRC703=No se ha podido abrir el archivo de instant\u00E1nea de memoria cach\u00E9 compartida "%s"
SHRC704=C\u00F3digo de error de capa de puerto \= %1$d
SHRC705=Mensaje de plataforma de error\: %1$s
SHRC706=No se ha podido adquirir el bloqueo de archivo en el archivo de instant\u00E1nea de memoria cach\u00E9 compartida
SHRC700=Se ha creado la instant\u00E1nea de la memoria cach\u00E9 compartida no persistente "%s"
SHRC701=No se ha podido crear una instant\u00E1nea de la memoria cach\u00E9 compartida no persistente "%s"
SHRC702=No se ha podido obtener un directorio para la instant\u00E1nea de la memoria cach\u00E9 compartida
SHRC707=No se ha podido adquirir el m\u00FAtex de la memoria cach\u00E9 "%s"
SHRC708=No se ha podido truncar el archivo de instant\u00E1nea de memoria cach\u00E9 compartida no persistente existente "%s"
SHRC709=La JVM est\u00E1 creando una instant\u00E1nea de la memoria cach\u00E9 compartida no persistente "%s", pero ya existe un archivo de instant\u00E1nea "%s" y se sobrescribir\u00E1.
CFRE174=m\u00FAltiples atributos PermittedSubclasses
CFRE175=las clases finales no se pueden sellar
CFRE176=El nombre PermittedSubclasses debe ser una serie
CFRE177=La entrada de clase PermittedSubclasses no es un tipo de clase
CFRE178=Las clases selladas deben tener como m\u00EDnimo una subclase permitida.
CFRE170=El nombre de RecordComponent debe ser una serie
CFRE171=El descriptor de RecordComponent debe ser una serie
CFRE172=Record es impl\u00EDcitamente final
CFRE173=La entrada LocalVariableTypeTable no coincide con ninguna entrada LocalVariableTable
SHRC720=No est\u00E1 permitida la recreaci\u00F3n de un archivo de control de memoria compartida al crear una instant\u00E1nea de lea memoria cach\u00E9
SHRC725=La longitud del archivo de instant\u00E1nea de memoria cach\u00E9 compartida no persistente "%s" no es v\u00E1lida. La longitud del archivo es de %lld. Un archivo de instant\u00E1nea v\u00E1lido suele tener como m\u00EDnimo %d bytes y como m\u00E1ximo %lld.
SHRC726=La memoria cach\u00E9 compartida no persistente "%s" ya existe. No se puede restaurar a partir de la instant\u00E1nea.
SHRC727=Se ha producido un error al crear la nueva memoria cach\u00E9 compartida no persistente.
SHRC728=No se ha podido leer el archivo de instant\u00E1nea de memoria cach\u00E9 compartida no persistente "%s"
SHRC721=La JVM no se ha configurado para acceder al archivo de instant\u00E1nea de memoria cach\u00E9 compartida no persistente "%s". Para abrir el archivo, utilice la subopci\u00F3n 'groupAccess'.
SHRC722=La JVM no permite el acceso al archivo de instant\u00E1nea de memoria cach\u00E9 compartida "%s" porque el ID de usuario y el ID de grupo de proceso de la JVM son distintos del ID de usuario y del ID de grupo del propietario del archivo de instant\u00E1nea de memoria cach\u00E9 compartida y el ID de usuario del proceso de JVM no perteneces al grupo de propietarios del archivo de instant\u00E1nea de memoria cach\u00E9 compartida.
SHRC723=La JVM no ha podido comprobar los permisos del archivo de instant\u00E1nea de memoria cach\u00E9 compartida "%s"
SHRC724=El archivo de instant\u00E1nea de memoria cach\u00E9 compartida "%s" no existe
SHRC729=La instant\u00E1nea ha sido creada por una compilaci\u00F3n de JVM distinta y no coincide con la JVM en ejecuci\u00F3n
SHRC714=No hay ninguna instant\u00E1nea de memoria cach\u00E9 compartida disponible
SHRC715=Se ha eliminado la generaci\u00F3n m\u00E1s antigua de la instant\u00E1nea de la memoria cach\u00E9 compartida "%s"
SHRC716=No se ha podido eliminar la generaci\u00F3n m\u00E1s antigua de la instant\u00E1nea de memoria cach\u00E9 compartida "%s"
SHRC717=No se ha podido eliminar la generaci\u00F3n actual de instant\u00E1nea de memoria cach\u00E9 compartida "%s"
SHRC710=No se ha podido escribir en el archivo de instant\u00E1nea de memoria cach\u00E9 compartida no persistente "%s"
SHRC711=No se ha podido ubicar de nuevo el desplazamiento del descriptor de archivo en el archivo de instant\u00E1nea de memoria cach\u00E9 compartida no persistente "%s"
SHRC712=Se est\u00E1n intentando destruir todas las instant\u00E1neas de memoria cach\u00E9 compartida en cacheDir "%s"
SHRC713=No se ha podido obtener la longitud del archivo de instant\u00E1nea de memoria cach\u00E9 compartida "%s"
SHRC718=La instant\u00E1nea de memoria cache compartida no existe
SHRC719=La instant\u00E1nea de memoria cach\u00E9 compartida "%s" se ha destruido
SHRC740=Uso\: %s{<especificaci\u00F3n_m\u00E9todo>[,<especificaci\u00F3n_m\u00E9todo>]}
SHRC741=El formato de <especificaci\u00F3n_m\u00E9todo> es [\!]{*|[*]<nombrepaquete/nombreclase>[*]}[.{*|[*]<nombrem\u00E9todo>[*]}[({*|[*]<par\u00E1metros>[*]})]], p.ej.\:\n \n \t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC742=IMPORTANTE\: Puede pasar varias especificaciones de m\u00E9todo separadas mediante comas. Si un valor de opci\u00F3n contiene comas, debe estar entre llaves. \n\tEs posible que deba poner opciones entre comillas para evitar que el shell intercepte y fragmente l\u00EDneas de mandatos separadas mediante comas como, por ejemplo\: \n\n\t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" o\n\t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC747=No se han podido invalidar los m\u00E9todos AOT.
SHRC748=No se han podido revalidar los m\u00E9todos AOT.
SHRC749=No se han podido encontrar los m\u00E9todos AOT.
SHRC743=Especificaciones de m\u00E9todo no v\u00E1lidas para la opci\u00F3n "%s".
SHRC744=Invalidados los m\u00E9todos AOT %d
SHRC745=Se han revalidado los m\u00E9todos AOT %d
SHRC746=Se han encontrado los m\u00E9todos AOT %d
SHRC730=La JVM ha creado una memoria cach\u00E9 compartida con la opci\u00F3n '-Xshareclasses\:restrictClasspaths'. Las invocaciones subsiguientes de la JVM no podr\u00E1n almacenar v\u00EDas de acceso a clase en la memoria cach\u00E9 compartida
SHRC731=La JVM ha ignorado la opci\u00F3n '-Xshareclasses\:restrictClasspaths' porque la memoria cach\u00E9 compartida existente se cre\u00F3 sin la opci\u00F3n '-Xshareclasses\:restrictClasspaths'
SHRC736=Invalide los m\u00E9todos AOT que coincidan con las especificaciones de m\u00E9todo.
SHRC737=Revalide los m\u00E9todos AOT que coincidan con las especificaciones de m\u00E9todo.
SHRC738=Imprima los m\u00E9todos AOT que coincidan con las especificaciones de m\u00E9todo.\n\t<especificaci\u00F3n_m\u00E9todo> se define como\: [\!]{*|[*]<nombrepaquete/nombreclase>[*]}[.{*|[*]<nombrem\u00E9todo>[*]}[({*|[*]<par\u00E1metros>[*]})]].
SHRC739=INVALIDADO
SHRC732=La JVM puede almacenar v\u00EDas de acceso a clases en la memoria cach\u00E9 compartida creada con la opci\u00F3n '-Xshareclasses\:restrictClasspaths'
SHRC733=La JVM no puede almacenar v\u00EDas de acceso a clases en la memoria cach\u00E9 compartida porque la memoria cach\u00E9 se cre\u00F3 con la opci\u00F3n '-Xshareclasses\:restrictClasspaths'
SHRC734=Imprimir el nombre del archivo de instant\u00E1nea de memoria cach\u00E9 de clases compartidas que ser\u00E1 utilizado.
SHRC735=Utilice una JVM de %d-bit para realizar la operaci\u00F3n solicitada en la memoria cach\u00E9 compartida de %d-bit "%s" porque la JVM de %d-bit no puede verificar si la memoria compartida fue creada por la JVM
SHRC640=JVM est\u00E1 utilizando la memoria cach\u00E9 de clases compartidas existente en modalidad de diagn\u00F3stico mprotect (mediante la opci\u00F3n - Xshareclasses\:mprotect\=diagnostic), pero la memoria cach\u00E9 no se ha creado en esta modalidad. La utilizaci\u00F3n de la memoria cach\u00E9 en esta modalidad puede afectar al rendimiento.
SHRC641=JVM est\u00E1 intentando utilizar la memoria cach\u00E9 de clases compartidas existente en modalidad de diagn\u00F3stico mprotect (mediante la opci\u00F3n - Xshareclasses\:mprotect\=diagnostic), pero la memoria cach\u00E9 no se ha creado en esta modalidad. En este caso, la opci\u00F3n mprotect\=diagnostic se pasa por alto en z/OS.
SHRC642=JVM ha creado una memoria cach\u00E9 de clases compartidas en modalidad de diagn\u00F3stico mprotect (mediante la opci\u00F3n - Xshareclasses\:mprotect\=diagnostic). La utilizaci\u00F3n de la memoria cach\u00E9 en esta modalidad puede afectar al rendimiento.
SHRC643=JVM se ha conectado a la memoria cach\u00E9 de clases compartidas creada en modalidad de diagn\u00F3stico mprotect (mediante la opci\u00F3n - Xshareclasses\:mprotect\=diagnostic). La utilizaci\u00F3n de la memoria cach\u00E9 en esta modalidad puede afectar al rendimiento.
SHRC648=JVM no est\u00E1 configurado para acceder al conjunto de sem\u00E1foros asociado a la memoria cach\u00E9 compartida no permanente existente. Para conectarse a la memoria cach\u00E9 de clases compartidas no permanente, utilice la subopci\u00F3n 'groupAccess'.
SHRC649=JVM no permite el acceso al conjunto de sem\u00E1foros de la memoria cach\u00E9 compartida creado por otro usuario (y propiedad del mismo) que no est\u00E9 en su grupo.
J9CL030=No se ha podido asignar memoria para los datos nativos de inquilino
J9CL031=No se ha podido registrar dbgwrapper.dll como biblioteca de proceso de arranque. C\u00F3digo de error \= %zu
J9CL032=%1$d\: No se ha podido recuperar informaci\u00F3n de %2$s.
SHRC644=JVM se ha conectado a la memoria cach\u00E9 de clases compartidas creada en modalidad de diagn\u00F3stico mprotect (mediante la opci\u00F3n - Xshareclasses\:mprotect\=diagnostic). La opci\u00F3n -Xshareclasses\:mprotect\=none se pasar\u00E1 por alto.
SHRC645=Habilitar la modalidad de diagn\u00F3stico mprotect
SHRC646=JVM no ha podido comprobar los permisos del conjunto de sem\u00E1foros asociado con la memoria cach\u00E9 compartida.
SHRC647=JVM ha detectado que un ID de usuario efectivo del proceso es el propietario pero no el creador del conjunto de sem\u00E1foros asociado con la memoria cach\u00E9 compartida. JVM no se conectar\u00E1 a la memoria cach\u00E9 compartida para impedir un acceso no intencionado a la memoria cach\u00E9 compartida.
J9CL037=No se puede recuperar la informaci\u00F3n de uso de la CPU de la JVM si se ha especificado -XX\:-EnableCPUMonitor
J9CL038=Error al recuperar la informaci\u00F3n de uso de la CPU de la JVM.
J9CL039=La indicaci\u00F3n de fecha y hora no es v\u00E1lida cuando se recupera la informaci\u00F3n de uso de la CPU de la JVM.
J9CL033=No se ha podido registrar %s como biblioteca de proceso de arranque. C\u00F3digo de error \= %zu
J9CL034=%1$d\: No se ha podido recuperar informaci\u00F3n de %2$s. %3$s
J9CL035=Los m\u00E9todos privados de interfaz requieren invokespecial
J9CL036=cargando violaci\u00F3n de restricci\u00F3n\: %2$.*1$s no visible desde %4$.*3$s
J9CL019=No se puede asignar el almacenamiento intermedio SIOCGIFCONF
SHRC630=Espacio lleno para almacenar datos no AOT o no JIT, como clases, en la memoria cach\u00E9 compartida "%s".
SHRC631=El espacio reservado para datos AOT en la memoria cach\u00E9 compartida "%s" est\u00E1 lleno. Utilice -Xscminaot para aumentar el espacio reservado para datos AOT.
SHRC632=El espacio reservado para datos JIT en la memoria cach\u00E9 compartida "%s" est\u00E1 lleno. Utilice- Xscminjitdata para aumentar el espacio reservado para datos JIT.
SHRC637=La subopci\u00F3n -Xshareclasses\:cacheRetransformed no es compatible con la memoria cach\u00E9 compartida habilitada para BCI existente.
SHRC638=La creaci\u00F3n de memoria cach\u00E9 con la opci\u00F3n cacheRetransformed fuerza la modalidad disableBCI.
SHRC639=Las opciones del programa de utilidad de memoria cach\u00E9 compartida solo pueden utilizarse en combinaci\u00F3n con -Xmt. Establezca otras opciones de memoria cach\u00E9 compartida en el archivo javad.options.
J9CL020=No hay memoria suficiente para leer datos de entorno local
J9CL021=No hay memoria suficiente para creaer lista de \u00EDndice
SHRC633=Se ha especificado la opci\u00F3n "-XX\:+StoreIntermediateClassfile" pero no se ha creado la memoria cach\u00E9 con la opci\u00F3n "-XX\:+StoreIntermediateClassfile".
SHRC634=Se ha especificado la opci\u00F3n "-XX\:-StoreIntermediateClassfile" pero se ha creado la memoria cach\u00E9 con la opci\u00F3n "-XX\:+StoreIntermediateClassfile".
SHRC635=Store intermediate classfile \= true
SHRC636=La subopci\u00F3n "disableBCI" no es compatible con la memoria cach\u00E9 compartida habilitada para BCI existente.
J9CL026=No se ha podido asignar memoria para el contenido post de HTTP
J9CL027=Error de lectura del archivo zip
J9CL028=Error interno al leer el archivo zip; c\u00F3digo de error %d
J9CL029=se han encontrado caracteres mal formados o que no se pueden correlacionar
J9CL022=No hay memoria suficiente para mostrar la lista de los almacenes de registros
J9CL023=No hay memoria suficiente disponible para leer el registro
J9CL024=Memoria agotada
J9CL025=No se ha podido asignar memoria para las cabeceras de respuesta HTTP
SHRC662=Recuperaci\u00F3n de error\: se ha destruido el sem\u00E1foro establecido asociado con la memoria cach\u00E9 de clases compartida.
SHRC663=Recuperaci\u00F3n de error\: se ha destruido el conjunto de sem\u00E1foros con id\=%d asociado con la memoria cach\u00E9 de clases compartida.
SHRC664=No se ha podido recuperar el error\: no se ha podido destruir el conjunto de sem\u00E1foros con semid\=%d asociado con la memoria cach\u00E9 de clases compartida. Solo puede destruir el conjunto de sem\u00E1foros su creador, su propietario o un usuario con derechos administrativos.
SHRC665=No se ha podido recuperar el error\: no se ha podido destruir el conjunto de sem\u00E1foros con semid\=%d asociado con la memoria cach\u00E9 de clases compartida.
SHRC660=La m\u00E1quina virtual java no ha podido asociar el conjunto de sem\u00E1foros id\=%d con la memoria cach\u00E9 de clase compartida.
SHRC661=La m\u00E1quina virtual Java no ha podido asociar la memoria compartida id\=%d con la memoria cach\u00E9 de clase compartida.
SHRC666=Recuperaci\u00F3n de error\: se ha destruido la memoria compartida asociada con la memoria cach\u00E9 de clases compartida.
SHRC667=Recuperaci\u00F3n de error\: se ha destruido la memoria compartida con id\=%d asociada con la memoria cach\u00E9 de clases compartida.
SHRC668=No se ha podido recuperar el error\: no se ha podido destruir la memoria compartida con shmid\=%d asociada con la memoria cach\u00E9 de clases compartida. Solo puede destruir la memoria compartida su creador, su propietario o un usuario con derechos administrativos.
SHRC669=No se ha podido recuperar el error\: no se ha podido destruir la memoria compartida con shmid\=%d asociada con la memoria cach\u00E9 de clases compartida.
SHRC651=JVM ha detectado que un ID de usuario efectivo del proceso es el propietario pero no el creador de la memoria compartida asociada con la memoria cach\u00E9 compartida. JVM no se conectar\u00E1 a la memoria cach\u00E9 compartida para impedir un acceso no intencionado a la memoria cach\u00E9 compartida.
SHRC652=JVM no est\u00E1 configurado para acceder a la memoria compartida asociada a la memoria cach\u00E9 compartida no permanente existente. Para conectarse a la memoria cach\u00E9 de clases compartidas no permanente, utilice la subopci\u00F3n 'groupAccess'.
SHRC653=JVM no est\u00E1 configurado para acceder a la memoria compartida asociada a la memoria cach\u00E9 compartida no permanente existente. Para conectarse a la memoria cach\u00E9 de clases compartidas no permanente, utilice la subopci\u00F3n 'groupAccess' y 'readonly'.
SHRC654=JVM no permite el acceso a la regi\u00F3n de memoria compartida creada por otro usuario (y propiedad del mismo) que no est\u00E9 en su grupo.
SHRC650=JVM no ha podido comprobar los permisos de la memoria compartida asociada con la memoria cach\u00E9 compartida.
SHRC659=Se ha producido un error al abrir la memoria compartida
J9CL040=No se puede asignar memoria para la nueva referencia global de JNI
J9CL041=La clase anfitriona %2$.*1$s y la clase an\u00F3nima %4$.*3$s est\u00E1n en paquetes distintos.
J9CL042=El miembro de anidado %2$.*1$s de %4$.*3$s declara un anfitri\u00F3n de anidado distinto de %6$.*5$s
SHRC655=El usuario actual puede acceder a la memoria cach\u00E9 \= %s
SHRC656=JVM no est\u00E1 configurado para acceder al archivo de memoria cach\u00E9 compartida. Para conectarse a la memoria cach\u00E9 de clases compartidas, utilice la subopci\u00F3n 'groupAccess'.
SHRC657=JVM no permite el acceso al archivo de memoria cach\u00E9 compartida porque el ID de usuario y el ID de grupo del proceso de JVM no coinciden con el ID de usuario e ID de grupo del propietario del archivo de memoria cach\u00E9 compartida y el ID de usuario del proceso de JVM no pertenece al grupo del propietario del archivo de memoria cach\u00E9 compartida.
SHRC658=JVM no ha podido comprobar los permisos del archivo de memoria cach\u00E9 compartida.
SHRC200=\ B\u00FAsqueda de %2$.*1$s satisfactoria.
SHRC684=Se ha producido un error al abrir el sem\u00E1foro. No se ha podido bloquear el archivo de control.
DUMP034=El usuario ha solicitado el volcado %1$s usando de '%2$s' a %3$s
SHRC201=\ Sustituci\u00F3n de %2$.*1$s satisfactoria.
SHRC685=Se ha producido un error al abrir la memoria compartida. No se ha podido bloquear el archivo de control.
DUMP033=La JVM ha solicitado el volcado %1$s en respuesta a un suceso
SHRC202=No ha sido posible inicializar las agrupaciones en el gestor de clases compartidas
SHRC686=No se ha podido iniciar la memoria cach\u00E9 de clases compartida. Se sigue sin utilizarla porque se ha especificado -Xshareclasses\:nonfatal.
DUMP036=Falta el filtro -Xdump o bien no es v\u00E1lido
SHRC203=No se puede crear tabla hash de tabla hash en la clase compartida Manager
SHRC687=No se puede crear una nueva memoria cach\u00E9 de clases compartida cuando se utiliza la opci\u00F3n -Xshareclasses\:readonly
DUMP035=El usuario ha solicitado el volcado %1$s hasta %2$s
SHRC680=No se ha podido recuperar el error\: no se ha podido eliminar el archivo de control %s del conjunto de sem\u00E1foros asociado con la memoria cach\u00E9 de clase compartida.
DUMP030=No se puede escribir el volcado en el archivo %s\: %s
SHRC681=Se ha alcanzado el l\u00EDmite del sistema para el n\u00FAmero m\u00E1ximo de sem\u00E1foros o el n\u00FAmero m\u00E1ximo de sem\u00E1foros en todo el sistema.
SHRC682=Se ha alcanzado el n\u00FAmero m\u00E1ximo de regiones de memoria compartida o el l\u00EDmite del sistema en la memoria asignada para regiones de memoria compartida.
DUMP032=La JVM ha solicitado el volcado %1$s usando '%2$s' en respuesta a un suceso
SHRC683=Se ha alcanzado el n\u00FAmero total de archivos abiertos.
DUMP031=El vuelco de almacenamiento din\u00E1mico solicitado no se ha producido porque no se ha solicitado el bloqueo exclusivo de la m\u00E1quina virtual. A\u00F1ada request\=exclusive+prepwalk+compact a su opci\u00F3n de l\u00EDnea de comandos -Xdump\:heap\:
SHRC208=No se puede asignar memoria para la agrupaci\u00F3n de elementos de tabla hash en CompiledMethodManagerImpl
SHRC209=Habilite salida detallada de datos de bytes
SHRC204=No se puede crear m\u00FAtex de tabla hash en la clase compartida Manager
SHRC688=Las v\u00EDas de acceso de clases solo pueden a\u00F1adirse si primero la JVM inicializa la memoria cach\u00E9.
DUMP027=El vuelco de almacenamiento din\u00E1mico solicitado no se ha producido porque otro componente mantiene un bloqueo exclusivo de la m\u00E1quina virtual.
SHRC205=No ha sido posible crear un nuevo elemento de tabla hash en CompiledMethodManagerImpl
SHRC689=Permite a una JVM v\u00EDas de acceso de clases en la memoria cach\u00E9 creada con la opci\u00F3n "restrictClasspaths".
DUMP026=El nombre IEATDUMP sobrepasa la longitud m\u00E1xima permitida. Se utiliza el nombre predeterminado.
SHRC206=No se puede asignar memoria para entrada de tabla hash en CompiledMethodManagerImpl
DUMP029=La solicitud de prepwalk o compact antes de obtener un volcado del sistema se ignorar\u00E1 porque no se ha solicitado el bloqueo exclusivo de la m\u00E1quina virtual.
SHRC207=No es posible especificar el m\u00FAtex de tabla hash de CompiledMethodManager
DUMP028=El bloqueo exclusivo de la m\u00E1quina virtual no se ha podido lograr antes de obtener el volcado del sistema.
SHRC673=No se ha podido destruir el conjunto de sem\u00E1foros con semid\=%d asociado con la memoria cach\u00E9 de clases compartida.
DUMP045=El n\u00FAmero de opciones de volcado debe ser inferior a %d, incluidas las opciones establecidas de forma predeterminada.
SHRC674=El usuario n tiene permiso para destruir la memoria compartida con shmid\=%d. Solo puede destruir la memoria compartida su creador, su propietario o un usuario con derechos administrativos.
DUMP044=Valor no v\u00E1lido o valor v\u00E1lido reservado para %s
SHRC675=No se ha podido destruir la memoria compartida asociada con la memoria cach\u00E9 de clases compartida.
DUMP047=La m\u00E1quina virtual se est\u00E1 cerrando. Motivo\: desconocido
SHRC676=No se ha podido destruir la memoria compartida con shmid\=%d asociada con la memoria cach\u00E9 de clases compartida.
DUMP046=La m\u00E1quina virtual se est\u00E1 cerrando. Motivo\: %2$.*1$s
DUMP041=Uso incorrecto de -Xdump msg_filter
SHRC670=Recuperaci\u00F3n de error\: se intenta utilizar la memoria cach\u00E9 compartida en modalidad de solo lectura si existe la regi\u00F3n de memoria compartida, como respuesta a la opci\u00F3n "-Xshareclasses\:nonfatal"
DUMP040=Volcado %1$s escrito en conjunto(s) de datos utilizando la plantilla con el nombre %2$s
SHRC671=El usuario no tiene permiso para destruir el conjunto de sem\u00E1foros con semid\=%d. Solo puede destruir el conjunto de sem\u00E1foros su creador, su propietario o un usuario con derechos administrativos.
DUMP043=%s no se admite en esta plataforma
SHRC672=No se ha podido destruir el sem\u00E1foro establecido asociado con la memoria cach\u00E9 de clases compartida.
DUMP042=Se ha recibido una se\u00F1al de aborto durante la ejecuci\u00F3n en la pila Java. No se han podido ejecutar los agentes de volcado de JVM.
SHRC677=C\u00F3digo de error de capa de puerto \= %1$d
DUMP038=El volcado breve no se graba debido al rastreo al archivo\: %1$s
SHRC678=Mensaje de plataforma de error\: %1$s
DUMP037=Error en el volcado %1$s\: %2$s ha sido err\u00F3neo, c\u00F3digo de error\: %3$d
SHRC679=No se ha podido recuperar el error\: no se ha podido eliminar el archivo de control %s del conjunto de sem\u00E1foros asociado con la memoria cach\u00E9 de clase compartida.
DUMP039=Procesando el suceso de volcado "%1$s", detalles "%3$.*2$s" en %4$s - espere.
J9CL008=valor de tiempo de espera en nanosegundos fuera de intervalo
J9CL009=Ya se ha iniciado la hebra
SHRC222=No se pueden crear/utilizar memorias cach\u00E9 de clases compartidas persistentes ya que la correlaci\u00F3n de memoria no da soporte a las posibilidades requeridas
SHRC223=No se pueden crear/utilizar memorias cach\u00E9 de clases compartidas persistentes ya que el bloqueo de archivos no est\u00E1 soportado
SHRC224=Memoria agotada para la copia local del nombre de memoria cach\u00E9
SHRC225=Error al obtener la v\u00EDa de acceso del archivo de memoria cach\u00E9
SHRC220=C\u00F3digo de error de capa de puerto \= %1$d
SHRC221=Mensaje de plataforma de error\: %1$s
J9CL010=No se ha podido asignar JNIEnv
SHRC226=Error al abrir archivo de memoria cach\u00E9 de clases compartidas
SHRC227=Error al adquirir bloqueo de escritura de cabecera de archivo de memoria cach\u00E9 de clases compartidas
SHRC228=Error al actualizar la fecha de \u00FAltima conexi\u00F3n a la memoria cach\u00E9 de clases compartidas
SHRC229=Error\: el archivo de memoria cach\u00E9 de clases compartidas tiene una cabecera no v\u00E1lida
J9CL015=No se ha podido crear un rastreo de pila (debido probablemente a falta de memoria de sistema operativo)
J9CL016=no se ha podido crear una entrada de v\u00EDa de acceso de clases nueva
J9CL017=no se ha podido asignar para recurso de huso horario
J9CL018=no se ha podido asignar para entrada de huso horario
J9CL011=No se ha podido ejecutar fork de la hebra de SO
J9CL012=
J9CL013=No se ha podido asignar el supervisor de SO
J9CL014=Argumento de l\u00EDnea de mandatos JCL no v\u00E1lido
SHRC690=Restringir v\u00EDas de acceso a clases                  \= verdadero
SHRC211=Buscando datos de bytes para la clave %.*s en el c\u00F3digo compartido...
SHRC695=Restaurar una memoria cach\u00E9 compartida no persistente a partir de una instant\u00E1nea
SHRC212=Almacenando datos de bytes para la clave %.*s en memoria cach\u00E9 compartida...
SHRC696=Las subopciones "%s" y "%s" no son compatibles. La subopci\u00F3n "%s" se ignora.
SHRC213=No se puede asignar memoria para entrada de tabla hash en ByteDataManagerImpl
SHRC697=No se ha podido obtener un directorio para la memoria cach\u00E9 compartida
SHRC214=No se puede entrar el m\u00FAtex de tabla hash de ByteDataManager
SHRC698=La memoria cach\u00E9 compartida no persistente "%s" se ha restaurado correctamente a partir de la instant\u00E1nea.
SHRC691=Restringir v\u00EDas de acceso a clases                  \= falso
SHRC692=Crear una instant\u00E1nea de una memoria cach\u00E9 compartida no persistente existente
SHRC693=Destruir la instant\u00E1nea de una memoria cach\u00E9 compartida (utilizar el par\u00E1metro name o el valor predeterminado)
SHRC210=[salida detallada de datos de bytes de -Xshareclasses habilitada]
SHRC694=Destruir todas las instant\u00E1neas de memorias cach\u00E9 compartidas
SHRC219=[acceso de grupo de -Xshareclasses habilitado para nuevas memorias cach\u00E9]
SHRC215=Crear memoria cach\u00E9 de clases compartidas persistente
SHRC699=No se ha podido restaurar la memoria cach\u00E9 compartida no persistente "%s" a partir de la instant\u00E1nea.
SHRC216=Crear memoria cach\u00E9 de clases compartidas no persistente
SHRC217=[memoria cach\u00E9 persistente de -Xshareclasses habilitada]
SHRC218=[memoria cach\u00E9 persistente de -Xshareclasses inhabilitada]
J9CL004=Versi\u00F3n de biblioteca de clases incompatible\: se esperaba JCL v%1$i, pero se ha encontrado v%2$i
J9CL005=Versi\u00F3n de biblioteca de clases incompatible\: hace falta la m\u00E1quina virtual v%1$i, pero se ha encontrado v%2$i
J9CL006=Sin verificaci\u00F3n previa de datos de java/lang/Object
J9CL007=el valor de tiempo de espera es negativo
J9CL000=Biblioteca de clases incompatible
J9CL001=Intente ejecutar con -jcl\:%s
J9CL002=Las clases proceden de una biblioteca que no es J9 o de un JXE reducido incorrectamente
J9CL003=Versi\u00F3n de biblioteca de clases incompatible\: JCL %1$x, m\u00E1quina virtual %2$x
SHRC244=Error al obtener longitud de archivo de memoria cach\u00E9 de clases compartidas
SHRC245=Error al correlacionar archivo de memoria cach\u00E9 de clases compartidas
SHRC246=Se ha conectado la memoria cach\u00E9 persistente de clases compartidas %1$s
SHRC247=Error\: el punto de atenci\u00F3n de la cabecera de archivo de memoria cach\u00E9 de clases compartidas no es v\u00E1lido
SHRC240=Error\: no se puede adquirir bloqueo de escritura de conexi\u00F3n a archivo de memoria cach\u00E9 de clases compartidas
SHRC241=Error\: no se puede suprimir archivo de memoria cach\u00E9 de clases compartidas
SHRC242=Error al actualizar la fecha de \u00FAltima desconexi\u00F3n del archivo de memoria cach\u00E9 de clases compartidas
SHRC243=Error al liberar bloqueo de lectura de conexi\u00F3n a archivo de memoria cach\u00E9 de clases compartidas
SHRC248=Error\: la versi\u00F3n de la cabecera de archivo de memoria cach\u00E9 de clases compartidas no es v\u00E1lida
SHRC249=Error\: el nivel de modificaci\u00F3n de la cabecera de archivo de memoria cach\u00E9 de clases compartidas no es v\u00E1lido
SHRC233=Error al crear cabecera de archivo de memoria cach\u00E9 de clases compartidas
SHRC234=Error al adquirir bloqueo de lectura de conexi\u00F3n a archivo de memoria cach\u00E9 de clases compartidas
SHRC235=Error al liberar bloqueo de lectura de conexi\u00F3n a archivo de memoria cach\u00E9 de clases compartidas
SHRC236=Se ha creado la memoria cach\u00E9 persistente de clases compartidas %1$s
SHRC230=Error al inicializar la cabecera de datos de memoria cach\u00E9 compartida
SHRC231=Error al establecer longitud de archivo de memoria cach\u00E9 de clases compartidas
SHRC232=No se puede crear una memoria cach\u00E9 en modalidad de s\u00F3lo lectura
SHRC237=Se ha abierto la memoria cach\u00E9 persistente de clases compartidas %1$s
SHRC238=Error\: la memoria cach\u00E9 de clases compartidas no est\u00E1 conectada
SHRC239=Error\: no se puede adquirir bloqueo de escritura de cabecera de archivo de memoria cach\u00E9 de clases compartidas
SHRC260=No se ha podido crear agrupaci\u00F3n en ByteDataManager
SHRC261=Habilitar salida detallada interna de serie
SHRC266=[almacenado en memoria cach\u00E9 de -Xshareclasses de clases retransformadas habilitado]
SHRC267=Inhabilitar almacenamiento en memoria cach\u00E9 de clases de bootclasspath
SHRC268=[Almacenamiento en memoria cach\u00E9 de -Xshareclasses de entradas de bootclasspath inhabilitado]
SHRC269=El sistema no da soporte a la protecci\u00F3n de p\u00E1ginas de memoria
SHRC262=Bytes de datos         \= %d
SHRC263=Habilitar p\u00E1ginas detalladas de CompositeCache
SHRC264=No redondear \u00E1reas de memoria cach\u00E9 a l\u00EDmites de p\u00E1ginas
SHRC265=Clases de memoria cach\u00E9 retransformadas mediante JVMTI
EXEL013=\  -Xmn<x>         establece el nuevo tama\u00F1o de espacio en <x>
EXEL014=\  -Xmn<x>         establece el nuevo tama\u00F1o de espacio inicial/m\u00E1ximo en <x>
EXEL015=\  -Xmns<x>        establece el nuevo tama\u00F1o de espacio inicial en <x>
EXEL016=\  -Xmnx<x>        establece el nuevo tama\u00F1o de espacio m\u00E1ximo en <x>
EXEL017=\  -Xmo<x>         establece el anterior tama\u00F1o de espacio en <x>
EXEL018=\  -Xmo<x>         establece el tama\u00F1o anterior de espacio inicial/m\u00E1ximo en <x>
EXEL019=\  -Xmos<x>        establece el tama\u00F1o anterior de espacio inicial en <x>
EXEL010=Los valores con sufijo "k" (kilo) o "m" (mega) se calcular\u00E1n de modo correspondiente.\n
EXEL011=\  -Xmca<x>        establece el incremento del segmento de clase RAM en <x>
EXEL012=\  -Xmco<x>        establece el incremento del segmento de clase ROM en <x>
SHRC250=La memoria cach\u00E9 no se puede abrir en modalidad de s\u00F3lo lectura ya que todav\u00EDa no se ha inicializado
SHRC255=Error al actualizar la fecha de \u00FAltima desconexi\u00F3n del archivo de memoria cach\u00E9 de clases compartidas en salida JVM
SHRC256=La memoria cach\u00E9 compartida persistente "%1$s" se ha destruido
SHRC257=No se puede asignar memoria para elemento de lista enlazada en Manager
SHRC258=No se puede asignar memoria para entrada de tabla hash en Manager
SHRC251=No suprimir autom\u00E1ticamente memorias cach\u00E9 de distintos buildIDs
SHRC252=Error al buscar en archivo de memoria cach\u00E9 de clases compartidas
SHRC253=Error al escribir cabecera en archivo de memoria cach\u00E9 de clases compartidas
SHRC254=Error al establecer longitud de archivo de memoria cach\u00E9 de clases compartidas
EXEL002=\  -Xbootclasspath/p\:<v\u00EDa de acceso>  a\u00F1ade <v\u00EDa de acceso> al final a la classpath de la rutina de carga
EXEL003=\  -Xbootclasspath/a\:<v\u00EDa de acceso>  a\u00F1ade <v\u00EDa de acceso> a la classpath de la rutina de carga
EXEL004=\n  -Xrun<biblioteca>[\:opciones]  cargar biblioteca de agente nativo\n                            (en desuso en favor de -agentlib)\n
EXEL005=\  -Xint           se ejecuta s\u00F3lo interpretado (equivalente a -Xnojit -Xnoaot)
SHRC259=No se puede entrar el m\u00FAtex de tabla hash Manager
EXEL006=\  -Xnojit         inhabilita JIT
EXEL007=\  -Xnoaot         no ejecuta el c\u00F3digo precompilado
EXEL008=\  -Xfuture        habilita comprobaciones m\u00E1s estrictas, anticipando el valor predeterminado futuro
EXEL009=\nLos argumentos a las opciones siguientes se expresan en bytes.
EXEL000=Las opciones siguientes no son est\u00E1ndar y est\u00E1n sujetas a cambios sin previo aviso.\n
EXEL001=\  -Xbootclasspath\:<v\u00EDa de acceso>    establece la classpath de la rutina de carga en <v\u00EDa de acceso>
SHRC280=Listando todas las memorias cach\u00E9 en cacheDir %s
SHRC281=Intentando destruir todas las memorias cach\u00E9 en cacheDir %s
SHRC282=El tama\u00F1o de p\u00E1gina del sistema operativo es incompatible con esta memoria cach\u00E9. Se est\u00E1 intentando volver a crear la memoria cach\u00E9.
SHRC283=Abra la memoria cach\u00E9 con permisos de s\u00F3lo lectura
SHRC288=ID de memoria compartida   \= %d
SHRC289=No detectar cu\u00E1ndo se encuentra una memoria cach\u00E9 en un sistema de archivos de red
SHRC284=No se puede crear una memoria cach\u00E9 en modalidad de s\u00F3lo lectura
SHRC285=Se ha abierto la memoria cach\u00E9 persistente de clases compartida %1$s en modalidad de s\u00F3lo lectura
SHRC286=Se ha abierto la memoria cach\u00E9 de clases compartidas %1$s en modalidad de s\u00F3lo lectura
SHRC287=No se puede encontrar la memoria cach\u00E9 persistente en un sistema de archivos de red. Seleccione "nonpersistent" o un cacheDir distinto.
EXEL035=\  -Xminf<x>       porcentaje m\u00EDnimo de almacenamiento din\u00E1mico libre despu\u00E9s de GC
EXEL036=\  -Xmaxf<x>       porcentaje m\u00E1ximo de almacenamiento din\u00E1mico libre despu\u00E9s de GC
EXEL037=\nLos argumentos para las opciones siguientes se expresan como n\u00FAmeros decimales.\n
EXEL038=\  -Xgcthreads<x>                establece el n\u00FAmero de hebras de GC
EXEL039=\  -Xnoclassgc                   inhabilita la carga din\u00E1mica de clases
EXEL030=\  -Xss<x>         establece el tama\u00F1o de pila de hebra en <x>
EXEL031=\  -Xmine<x>       establece el tama\u00F1o m\u00EDnimo de expansi\u00F3n de almacenamiento din\u00E1mico en <x>
EXEL032=\  -Xmaxe<x>       establece el tama\u00F1o m\u00E1ximo de expansi\u00F3n de almacenamiento din\u00E1mico en <x>
EXEL033=\nLos argumentos a las opciones siguientes se expresan como un decimal de 0 a 1.
EXEL034=Un valor de 0,3 representa una solicitud de 30%%\n
SHRC270=Configurar la protecci\u00F3n de p\u00E1ginas de memoria de memoria cach\u00E9
SHRC271=Subopci\u00F3n no reconocida para opci\u00F3n mprotect\=
SHRC272=La protecci\u00F3n de p\u00E1ginas de memoria completa se ha habilitado satisfactoriamente para la memoria cach\u00E9
SHRC277=Para ejecutar el programa de utilidad "%s" en una memoria cach\u00E9 compartida no persistente "%s", tambi\u00E9n debe utilizar la subopci\u00F3n "nonpersistent"
SHRC278=Tenga en cuenta que el programa de utilidad "%s" no puede funcionar en la memoria cach\u00E9 de clases incompatible "%s". Utilice una JVM del nivel correcto.
SHRC279=Volver a crear la memoria compartida durante el inicio
SHRC273=La protecci\u00F3n de p\u00E1ginas de memoria predeterminada se ha habilitado satisfactoriamente para la memoria cach\u00E9
SHRC274=La protecci\u00F3n de p\u00E1ginas de memoria se ha inhabilitado para la memoria cach\u00E9
SHRC275=Establecer la ubicaci\u00F3n de los archivos de memoria cach\u00E9 JVM
SHRC276=Para ejecutar el programa de utilidad "%s" en la memoria cach\u00E9 de clases persistente "%s", no utilice la subopci\u00F3n "nonpersistent"
EXEL024=\  -Xmx<x>         establece la memoria m\u00E1xima en <x>
EXEL025=\  -Xmr<x>         establece el tama\u00F1o del conjunto recordado en <x>
EXEL026=\  -Xmrx<x>        establece el tama\u00F1o m\u00E1ximo del conjunto recordado en <x>
EXEL027=\  -Xmso<x>        establece el tama\u00F1o de pila de hebra del SO en <x>
EXEL028=\  -Xiss<x>        establece el tama\u00F1o de pila de hebra java inicial en <x>
EXEL029=\  -Xss<x>         establece el tama\u00F1o de pila de hebra java m\u00E1ximo en <x>
EXEL020=\  -Xmox<x>        establece el tama\u00F1o anterior de espacio m\u00E1ximo en <x>
EXEL021=\  -Xmoi<x>        establece el incremento de espacio anterior en <x>
EXEL022=\  -Xms<x>         establece el tama\u00F1o anterior de espacio en <x>
EXEL023=\  -Xms<x>         establece el tama\u00F1o inicial de memoria en <x>
EXEL057=
EXEL058=Error interno de m\u00E1quina virtual\: memoria agotada
EXEL059=Error interno de m\u00E1quina virtual\: no se ha podido encontrar la clase java/lang/String
EXEL050=\  -Xrdbginfo\:<host>\:<puerto>    habilita el servidor de informaci\u00F3n de depuraci\u00F3n remoto
EXEL051=\nAVISO\: se ha desechado el argumento de l\u00EDnea de mandatos "%s".\nAVISO\: utilice "-classpath <v\u00EDa de acceso>" o "-cp <v\u00EDa de acceso>".
EXEL052=\nAVISO\: se ha desechado el argumento de l\u00EDnea de mandatos "%s".\nAVISO\: utilice el -X equivalente.
EXEL053=
EXEL054=
EXEL055=Destino\: %s
EXEL056=
SHRC291=No se puede asignar memoria para entrada de tabla hash en ROMClassResourceManager
SHRC292=No es posible especificar el m\u00FAtex de tabla hash de ROMClassResourceManager
SHRC293=No se puede asignar memoria para la agrupaci\u00F3n de elementos de tabla hash en ROMClassResourceManager
SHRC294=%1$d\: 0x%2$p CHARARRAY\: en 0x%3$p.
SHRC290=No ha sido posible crear un nuevo elemento de tabla hash en ROMClassResourceManager
SHRC299=La memoria cach\u00E9 de clases compartidas "%s" no ha sido creada con la opci\u00F3n nested, no puede hacer crecer la memoria cach\u00E9
SHRC295=Desactivar dependencia de tener CORE_MMAP en AIX
SHRC296=Ejecutar con la opci\u00F3n "noCoreMmap" quiere decir que ser\u00E1 poco probable que IBM pueda ayudarle con cualquier cuelgue ya que los datos de clases no estar\u00E1n presentes en los volcados de sistema
SHRC297=Para utilizar memorias cach\u00E9 de clases compartidas persistentes en AIX, la variable de entorno CORE_MMAP debe estar establecida en "yes"
SHRC298=Para ejecutar el programa de utilidad "%s" en la memoria cach\u00E9 de clases persistente "%s", utilice la subopci\u00F3n "persistent"
EXEL046=\  -Xlp                          habilita el soporte de p\u00E1ginas de gran tama\u00F1o
EXEL047=\n  -Xdbg\:<opciones>              habilita la depuraci\u00F3n, opciones est\u00E1ndar de JDWP
EXEL048=\  -Xrunjdwp\:<opciones>          habilita la depuraci\u00F3n, opciones est\u00E1ndar de JDWP
EXEL049=\  -Xdbginfo\:<v\u00EDa de acceso de archivo de s\u00EDmbolos>  habilita el servidor de informaci\u00F3n de depuraci\u00F3n
EXEL040=\  -Xclassgc                     habilita la carga din\u00E1mica de clases
EXEL041=\  -Xalwaysclassgc               habilita la carga din\u00E1mica de clases en todos los GC
EXEL042=\  -Xnocompactexplicitgc         inhabilita la compactaci\u00F3n en un sistema GC
EXEL043=\  -Xcompactexplicitgc           habilita la compactaci\u00F3n en todos los sistemas GC
EXEL044=\  -Xcompactgc                   habilita la compactaci\u00F3n
EXEL045=\  -Xnocompactgc                 inhabilita la compactaci\u00F3n
SHRC192=El valor de -Xscmaxaot es mayor que el valor de -Xscmx, por lo que se ha establecido en ilimitado
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC194=\tpara ROMClass %2$.*1$s en 0x%3$p.
SHRC195=Habilitar salida detallada de AOT
SHRC190=El valor de -Xscminaot no debe ser superior que el valor de -Xscmaxaot
SHRC191=El valor de -Xscminaot es mayor que el valor de -Xscmx, por lo que se ha establecido en igual al valor de -Xscmx
SHRC196=[salida detallada de AOT -Xshareclasses AOT habilitada]
SHRC197=Encontrando c\u00F3digo AOT para ROMMethod 0x%1$p en almacenamiento compartido...
SHRC198=Almacenando c\u00F3digo de AOT para ROMMethod 0x%1$p en memoria cach\u00E9 compartida...
SHRC199=\ Almacenamiento de %2$.*1$s satisfactorio.
TRCE020=Se ha producido el tiempo de espera durante la terminaci\u00F3n del motor de rastreo
JNCK097=\tadvice         muestra las sugerencias
JNCK098=Error de JNI en %1$s\: argumento \#%2$d se espera %3$s %4$s, el argumento real es %5$s %6$s
JNCK095=Error JNI en el valor devuelto\: el tipo devuelto es una referencia pero el valor (0x%1$p) no es una referencia de objeto v\u00E1lida. Su tipo es\: %2$s
JNCK096=\twarn           muestra los avisos
JNCK099=Error de JNI en %1$s\: el argumento \#%2$d requiere un tipo sin matriz
JNCK090=Se ha detectado un aviso en la trama de manejador de un suceso JVMPI o JVMTI\n
JNCK093=Error de JNI en %s\: el m\u00E9todo no es un constructor
JNCK094=Error de JNI en %1$s\: Los datos a los que apunta el argumento \#%2$d se han modificado durante la ejecuci\u00F3n de %3$s. Los datos los puede haber modificado otra hebra o una llamada anidada. Es posible que el resultado de %4$s sea incorrecto y que VM sea inestable
JNCK091=Se ha detectado una sugerencia en la trama de manejador de un suceso JVMPI o JVMTI\n
JNCK092=\tvalist         comprobar si se reutiliza una va_list
JNCK086=Aviso de JNI en %1$s\: El argumento \#%2$d no es un java/nio/Buffer. %3$s devolver\u00E1 un c\u00F3digo de error
JNCK087=Error de JNI en %1$s\: Argumento \#%2$d no es un java/lang/reflect/Method o java/lang/reflect/Constructor
JNCK084=Se ha detectado un aviso en JNI_OnLoad de la biblioteca %.*s\n
JNCK085=Se ha detectado una sugerencia en JNI_OnLoad de la biblioteca %.*s\n
JNCK088=Aviso de JNI en %1$s\: El argumento \#%2$d es una referencia d\u00E9bil. Una referencia d\u00E9bil puede convertirse en NULL en cualquier momento. La referencia deber\u00EDa promocionarse utilizando NewLocalRef o NewGlobalRef y luego compararse con NULL antes de llamar a %3$s
JNCK089=Se ha detectado un error en la trama de manejador de un suceso JVMPI o JVMTI\n
CFRE020=el PC de inicio del manejador de sucesos de excepciones no es v\u00E1lido
CFRE021=campo duplicado
CFRE022=thisClass debe ser una clase
CFRE023=agrupaci\u00F3n constante vac\u00EDa
CFRE024=el nombre de clase debe ser una serie
CFRE025=el campo tiene dos atributos ConstantValue
CFRE026=tipo de c\u00F3digo de bytes newarray no reconocido
CFRE027=el c\u00F3digo de bytes multianewarray debe hacer referencia a una clase de matriz
CFRE017=m\u00FAltiples atributos StackMap/StackMapTable
CFRE018=la clase interna debe ser una clase
CFRE019=inicio de PC de variable local no v\u00E1lido
CFRE031=la excepci\u00F3n generada debe ser una clase
CFRE032=la superclase interface debe ser java.lang.Object
CFRE033=el rango del manejador de excepciones est\u00E1 vac\u00EDo
CFRE034=c\u00F3digo de bytes incompleto
CFRE035=el bytecode new debe hacer referencia a una clase
CFRE036=el destino no es una instrucci\u00F3n en el c\u00F3digo de bytes jump
CFRE037=temp contiene el tipo incorrecto
CFRE038=el m\u00E9todo tiene dos atributos Exceptions
CFRE030=superclase nula
CFRE028=el c\u00F3digo de bytes ldc* debe hacer referencia a una constante
CFRE029=el c\u00F3digo de bytes multianewarray debe hacer referencia a una clase
CFRE000=%1$s; clase\=%3$.*2$s, m\u00E9todo\=%5$.*4$s%7$.*6$s, pc\=%8$u
CFRE001=%1$s; clase\=%3$.*2$s, offset\=%4$u
CFRE002=el nombre del m\u00E9todo no es v\u00E1lido
CFRE003=versi\u00F3n mayor incorrecta
CFRE004=bytecode desconocido
CFRE005=interfaz duplicada
CFRE010=cuenta negativa para parejas de coincidencia y desplazamiento en bytecode lookupswitch
CFRE011=el c\u00F3digo de bytes de anewarray debe hacer referencia a una clase
CFRE012=el valor de constant debe ser un valor
CFRE013=longitud de variable local de PC no v\u00E1lida
CFRE014=se ha especificado un atributo Code para un m\u00E9todo nativo o abstracto
CFRE015=las interfaces deben ser clases
CFRE016=\u00EDndice de variable local fuera de rango en incremento
CFRE006=atributo StackMap/StackMapTable no v\u00E1lido
CFRE007=la firma del campo no es v\u00E1lida
CFRE008=c\u00F3digo de bytes de tableswitch alto < bajo
CFRE009=el campo interfaz debe ser public static y final
CFRE064=el descriptor debe ser una serie UTF8
CFRE065=varios atributos de m\u00E9todo de inclusi\u00F3n
CFRE066=m\u00FAltiples atributos InnerClasses
CFRE067=c\u00F3digo de entrada de agrupaci\u00F3n constante desconocido
CFRE068=el nombre de clase no es v\u00E1lido
CFRE069=longitud de atributos mayor que datos de atributos
CFRE060=el PC final del manejador de excepciones no es una instrucci\u00F3n o el final de la matriz de c\u00F3digo de bytes
CFRE061=el nombre debe ser una serie UTF8
CFRE062=m\u00E1ximo de locales m\u00E1s peque\u00F1o que el tama\u00F1o de los argumentos
CFRE063=el bytecode invoke llama a un m\u00E9todo no v\u00E1lido
JNCK039=Error de JNI en %1$s\: Argumento \#%2$d es NULL
JNCK037=Error de JNI en %1$s\: Argumento \#%2$d (0x%3$p) no es una referencia local. Su tipo es\: %4$s
JNCK038=Error de JNI en %1$s\: Argumento \#%2$d (0x%3$p) no es una referencia de objeto v\u00E1lido. Su tipo es\: %4$s\n
JNCK031=Error de JNI en %1$s\: Argumento \#%2$d es NULL
JNCK032=Error de JNI en %1$s\: Argumento \#%2$d no es un jobjectArray
JNCK030=Error de JNI en %s\: no se puede llamar a esta funci\u00F3n cuando GC est\u00E1 inhabilitado (probablemente se haya llamado desde un suceso JVMPI o JVMTI)
JNCK035=Error de JNI en %1$s\: Argumento \#%2$d (0x%3$p) no es una referencia global. Su tipo es\: %4$s
JNCK036=Error de JNI en %1$s\: Argumento \#%2$d (0x%3$p) no es una referencia global d\u00E9bil. Su tipo es\: %4$s
JNCK033=Error de JNI en %1$s\: Argumento \#%2$d no es un jarray
JNCK034=Error de JNI en %1$s\: Argumento \#%2$d no es un %3$s
CFRE075=firma de variable local no v\u00E1lida
CFRE076=n\u00FAmero m\u00E1gico incorrecto
CFRE077=las interfaces deben ser de tipo abstract
CFRE078=el \u00EDndice de clase de m\u00E9todo de inclusi\u00F3n debe hacer referencia a una clase
CFRE079=el PC del manejador de excepciones no es v\u00E1lido
CFRE070=PC de n\u00FAmero de l\u00EDnea no v\u00E1lido
CFRE071=matriz de c\u00F3digo de bytes est\u00E1 vac\u00EDa
CFRE072=las entradas no est\u00E1n ordenadas en el c\u00F3digo de bytes de lookupswitch
CFRE073=se ha encontrado un atributo StackMap/StackMapTable fuera del atributo Code
CFRE074=no se ha especificado ning\u00FAn atributo Code
JNCK028=Error de JNI en %s\: no se puede llamar a esta funci\u00F3n cuando hay una excepci\u00F3n pendiente
JNCK029=Error de JNI en %s\: no se puede llamar a esta funci\u00F3n dentro de una secci\u00F3n cr\u00EDtica
JNCK026=Error de JNI en %s\: JNIEnv no parece ser una hebra v\u00E1lida, o la memoria se ha da\u00F1ado o esta no es una m\u00E1quina virtual J9
JNCK027=Error de JNI en %s\: JNIEnv no es el JNIEnv para la hebra activa
JNCK020=referencia de depurador
JNCK021=referencia local en otra hebra
JNCK024=Se ha detectado un error de JNI. Terminando anormalmente.
JNCK025=Utilice -Xcheck\:jni\:nonfatal para seguir con la ejecuci\u00F3n cuando se detecten errores.
JNCK022=referencia local liberada
JNCK023=Se ha detectado un error de JNI. Continuando...
CFRE042=tama\u00F1o de matriz de c\u00F3digo de bytes > 65535
CFRE043=el c\u00F3digo de bytes no puede ensancharse
CFRE044=la ranura reservada del bytecode invokeinterface no es cero
CFRE045=\u00EDndice de agrupaci\u00F3n constante fuera de rango
CFRE046=relleno de c\u00F3digo de bytes de conmutaci\u00F3n incorrecto
CFRE047=la clase interface solo puede ser public, abstract o annotation
CFRE048=\u00EDndice de variables locales fuera de rango en almac\u00E9n
CFRE049=el c\u00F3digo de bytes checkcast debe hacer referencia a una clase
CFRE040=longitud del atributo inferior a datos del atributo
CFRE041=versi\u00F3n menor incorrecta
JNCK017=referencia local
JNCK018=referencia global
JNCK015=\thelp           imprime esta pantalla
JNCK016=NULL
JNCK019=referencia global d\u00E9bil
CFRE039=\u00EDndice de variables locales fuera de rango en carga
JNCK010=\tnonfatal       no salir cuando se detecten errores
JNCK013=\tnovalist       no comprobar si se reutiliza una va_list
JNCK014=\tpedantic       realiza comprobaciones m\u00E1s rigurosas, pero m\u00E1s lentas
JNCK011=\tnowarn         no mostrar avisos
JNCK012=\tnoadvice       no mostrar consejos
CFRE053=el m\u00E9todo tiene m\u00E1s de 255 ranuras de argumentos
CFRE054=el bytecode del campo debe hacer referencia a una Fieldref
CFRE055=el PC final del manejador de excepciones no es v\u00E1lido
CFRE056=cuenta de argumentos incorrecta del bytecode invokeinterface
CFRE057=el tipo del manejador de excepciones debe ser una clase
CFRE058=\u00EDndice de variables locales fuera de rango en retorno de subrutina
CFRE059=el PC del manejador de excepciones no es una instrucci\u00F3n
CFRE050=el m\u00E9todo interface debe ser public y abstract
CFRE051=la constante string debe ser una serie
CFRE052=la clase outer debe ser una clase
JNCK006=\tall            comprueba la aplicaci\u00F3n y las clases de sistema
JNCK007=\tverbose        rastrea determinadas funciones y actividades de JNI
JNCK004=jnichk - programa de utilidad de comprobaci\u00F3n de JNI para J9, versi\u00F3n %s
JNCK005=Uso\: -Xcheck\:jni\:[opci\u00F3n[,opci\u00F3n[,...]]]
JNCK008=\ttrace          rastrea todas las funciones JNI
JNCK009=\tnobounds       no realizar comprobaci\u00F3n de l\u00EDmites en series y matrices
JNCK002=Programa de utilidad de comprobaci\u00F3n de JNI\: no se puede enganchar el suceso
JNCK003=Programa de utilidad de comprobaci\u00F3n de JNI\: no se puede asignar el almacenamiento local de m\u00E1quina virtual
JNCK000=-Xcheck\:jni\: opci\u00F3n no reconocida --> '%s'
JNCK001=Programa de utilidad de comprobaci\u00F3n de JNI instalado. Utilice -Xcheck\:jni\:help si desea instrucciones de uso
JNCK082=Se ha detectado una sugerencia en la trama m\u00E1s exterior de una hebra conectada\n
JNCK083=Se ha detectado un error en JNI_OnLoad de la biblioteca %.*s\n
JNCK080=Se ha detectado un error en la trama m\u00E1s exterior de una hebra conectada\n
JNCK081=Se ha detectado un aviso en la trama m\u00E1s exterior de una hebra conectada\n
SHRC604=Reservar <size> bytes de espacio de memoria cach\u00E9 para datos de clase sin procesar
TRCE009=Error al escribir en el archivo breve
SHRC605=El tama\u00F1o de memoria para "%s" es demasiado grande, o especifica unidades que no son 'K', 'M' o 'G'.
TRCE008=Error al realizar una b\u00FAsqueda en el archivo de rastreo\: %s
SHRC606=A\u00F1adir sugerencias JIT no funcionales a m\u00E9todos para probar; utilizar con -Xint y una memoria cach\u00E9 llenada previamente.
SHRC607=Se han almacenado %1$s datos adjuntos %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
SHRC600=El \u00E1rea de datos de clase sin procesar est\u00E1 da\u00F1ado porque el almacenamiento de %u bytes superar\u00E1 el espacio libre del \u00E1rea disponible ('espacio libre inicial'\=%p, 'espacio libre final'\=%p)
SHRC601=Tama\u00F1o de \u00E1rea de datos de clase sin procesar            %*c\= %lu
SHRC602=Se utiliza el \u00E1rea de datos de clase sin procesar %%          %*c\= %lu%%
SHRC603=Bytes utilizados de datos de clase sin procesar           %*c\= %lu
JNCK075=Error de jnichk interno en %1$s\: descriptor 0x%2$x no reconocido
TRCE001=Error al procesar la opci\u00F3n de rastreo\: -Xtrace\:%s
JNCK076=Error de jnichk interno en %s\: memoria agotada
TRCE000=Opci\u00F3n de rastreo no reconocida\: -Xtrace\:%s
JNCK073=Sugerencia de JNI en %1$s\: se ha especificado JNI_ABORT, pero no se puede aceptar porque se han modificado los datos.\n(Original CRC\=0x%2$x, nuevo CRC\=0x%3$x).\nDado que %4$s ha devuelto el contenido real de la matriz, no se desechar\u00E1n los cambios. Quiz\u00E1 esto no sea lo deseado.
TRCE003=Error al procesar la opci\u00F3n de rastreo, detalle\: %s
JNCK074=Sugerencia de JNI en %s\: parece que no se ha modificado el almacenamiento intermedio. Considere utilizar JNI_ABORT en lugar de la modalidad 0.
TRCE002=Error al procesar la opci\u00F3n de rastreo\: -Xtrace\:%s\=%s
TRCE005=Error al grabar la cabecera en el archivo de rastreo\: %s
SHRC608=Se han encontrado %1$s datos adjuntos %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
JNCK079=Se ha detectado una sugerencia en %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE004=Error al abrir el archivo de rastreo\: %s
SHRC609=Se han actualizado %1$s datos adjuntos %2$s para %8$.*7$s.%4$.*3$s%6$.*5$s
TRCE007=Error al abrir la generaci\u00F3n de archivos de rastreo siguiente\: %s
JNCK077=Se ha detectado un error en %2$.*1$s.%4$.*3$s%6$.*5$s\n
TRCE006=Error al grabar %d bytes en el archivo de rastreo\: %s rc\: %d
JNCK078=Se ha detectado un aviso en %2$.*1$s.%4$.*3$s%6$.*5$s\n
JNCK071=Aviso de JNI\: la memoria en 0x%1$p adquirida por %2$s no se ha liberado antes de volver del c\u00F3digo nativo. Probablemente se trate de falta de memoria.
JNCK072=Sugerencia de JNI en %1$s\: se ha especificado JNI_COMMIT, pero se ignorar\u00E1.\nDado que %2$s ha devuelto el contenido real de la matriz, el almacenamiento intermedio no ser\u00E1 v\u00E1lido a continuaci\u00F3n de esta llamada. Quiz\u00E1 esto no sea lo deseado.
TRCE010=Error en la asignaci\u00F3n de memoria nativa, repliegue a valores de rastreo no din\u00E1mico.
JNCK070=Aviso de JNI en %1$s\: los datos de la matriz inicial se han modificado entre %2$s y %3$s.\n(Original CRC\=0x%4$x, nuevo CRC\=0x%5$x).\nDado que %6$s ha devuelto una copia del contenido de la matriz, se perder\u00E1 el nuevo contenido.
TRCE019=El motor de rastreo no ha podido inicializarse correctamente, RC \= %d
JNCK064=Aviso de JNI en %1$s\: La capacidad de la agrupaci\u00F3n de referencias d\u00E9biles globales ha aumentado autom\u00E1ticamente de %2$d a %3$d.\nEsto puede ser un indicador de una fuga de memoria.
TRCE012=No se ha podido abrir el archivo contador de puntos de rastreo %s, los contadores redirigen a stderr.
JNCK065=Aviso de JNI en %1$s\: La capacidad de la trama de referencias locales ha aumentado autom\u00E1ticamente de %2$d a %3$d. Se est\u00E1n utilizando %4$d referencias.\nUtilice EnsureLocalCapacity o PushLocalFrame para aumentar expl\u00EDcitamente la trama.
TRCE011=M\u00F3dulo no configurado para el rastreo\: %s
JNCK062=Aviso de JNI en %s\: no se debe llamar a esta funci\u00F3n desde el interior de una secci\u00F3n cr\u00EDtica
TRCE014=Ha fallado la inicializaci\u00F3n del motor de rastreo, el rastreo no est\u00E1 habilitado
JNCK063=Aviso de JNI en %1$s\: La capacidad de la agrupaci\u00F3n de referencias globales ha aumentado autom\u00E1ticamente de %2$d a %3$d.\nEsto puede ser un indicador de una fuga de memoria.
TRCE013=Grabando informaci\u00F3n de recuento de rastreo en %s
TRCE016=Almacenamiento para RasGlobalStorage no disponible, el rastreo no est\u00E1 habilitado
JNCK068=Aviso de JNI en %1$s\: inicio o \u00EDndice fuera de rango (%2$d >\= %3$d)
JNCK069=Aviso de JNI en %1$s\: final fuera de rango (%2$d + %3$d > %4$d)
TRCE015=Error de registro del suscriptor de grabaci\u00F3n de rastreo
TRCE018=No se ha podido asignar la clave de almacenamiento local de hebra UTE
JNCK066=Aviso de JNI en %1$s\: se ha especificado un inicio o \u00EDndice (%2$d) negativo
TRCE017=No se ha podido asignar la clave de almacenamiento local de hebra RAS
JNCK067=Aviso de JNI en %1$s\: se ha especificado una longitud de regi\u00F3n (%2$d) negativa
CFRE086=el m\u00E9todo tiene dos atributos Code
CFRE087=el bytecode del m\u00E9todo de interfaz debe hacer referencia a una InterfaceMethodref
CFRE088=el nombre de variable local debe ser una serie
CFRE089=se esperaba un nombre y tipo
JNCK060=Aviso de JNI en %1$s\: el argumento \#%2$d es una firma de m\u00E9todo mal formada ("%3$s")
JNCK061=Aviso de JNI en %1$s\: el argumento \#%2$d es una firma de campo mal formada ("%3$s")
SHRC620=Error al abrir la regi\u00F3n de memoria compartida. El archivo de control est\u00E1 da\u00F1ado.
CFRE080=la firma del m\u00E9todo no es v\u00E1lida
SHRC621=Error al abrir la regi\u00F3n de memoria compartida. Discrepancia de ID de memoria compartida.
CFRE081=el archivo de origen debe ser UTF8
CFRE082=el m\u00E9todo <init> no puede ser est\u00E1tico, final, sincronizado, nativo o abstracto
CFRE083=la clase es abstract y final
CFRE084=no hay ning\u00FAn error
CFRE085=el nombre interno debe ser una serie
SHRC626=El estado de la memoria cach\u00E9 compartida no se puede obtener porque no existe ninguna memoria cach\u00E9 compartida que sea v\u00E1lida.
SHRC627=No est\u00E1 permitida la recreaci\u00F3n de un archivo de control de memoria compartida al ejecutar en modalidad de solo lectura.
SHRC628=No se puede leer el archivo de control de memoria compartida.
JNCK059=Aviso de JNI en %1$s\: el argumento \#%2$d es un identificador mal formado ("%3$s")
SHRC629=El archivo de control de memoria compartida es de s\u00F3lo lectura.
SHRC622=Error al abrir la regi\u00F3n de memoria compartida. Discrepancia de clave de memoria compartida.
SHRC623=Error al abrir la regi\u00F3n de memoria compartida. La comprobaci\u00F3n del ID de grupo ha fallado.
SHRC624=Error al abrir la regi\u00F3n de memoria compartida. La comprobaci\u00F3n del ID de usuario ha fallado.
SHRC625=Error al abrir la regi\u00F3n de memoria compartida. La comprobaci\u00F3n del tama\u00F1o de memoria compartida ha fallado.
JNCK053=Error de JNI\: debe liberarse la secci\u00F3n cr\u00EDtica antes de que la funci\u00F3n devuelva el control
JNCK054=Error de JNI en %1$s\: opci\u00F3n de modalidad no reconocida %2$d
JNCK051=Error interno de VM en %1$s\: El n\u00FAmero de bytes enviados %2$p es menor que el n\u00FAmero de bytes de referencia JNI %3$p
JNCK052=Error de JNI en %1$s\: la clase %3$.*2$s est\u00E1 obsoleta
JNCK057=Error de JNI en %1$s\: No utilice %2$s para liberar memoria 0x%3$p adquirida utilizando %4$s
JNCK058=Aviso de JNI en %1$s\: despu\u00E9s de llamar a %2$s, debe comprobar si hay excepciones utilizando ExceptionCheck, ExceptionClear o ExceptionOccurred antes de llamar a %3$s
JNCK055=Error de JNI en %1$s\: ninguna funci\u00F3n JNI ha devuelto el puntero 0x%2$p o ya se ha liberado
JNCK056=Error de JNI en %1$s\: Se ha obtenido la memoria 0x%2$p del objeto 0x%3$p, liberando de 0x%4$p
CFRE097=entrada de clase interna duplicada en el atributo InnerClasses
CFRE098=la firma de variable local debe ser una serie
CFRE099=modificadores de m\u00E9todos no permitidos
JNCK050=Error de JNI en %s\: se ha llamado a PopLocalFrame sin una trama local en la pila
CFRE090=el bytecode new no puede crear matrices
CFRE091=el PC de inicio del manejador de excepciones no es una instrucci\u00F3n
SHRC610=Inhabilitar el soporte para la instrumentaci\u00F3n de c\u00F3digos de byte.
CFRE092=firma no v\u00E1lida
CFRE093=el m\u00E9todo puede ser como mucho uno public, private o protected
CFRE094=el c\u00F3digo de bytes instanceof debe hacer referencia a una clase
CFRE095=las anotaciones deben ser interfaces
CFRE096=el destino no es una instrucci\u00F3n en c\u00F3digo de bytes switch
SHRC615=Se ha producido un error al abrir el sem\u00E1foro. Discrepancia de clave de sem\u00E1foro.
SHRC616=Se ha producido un error al abrir el sem\u00E1foro. Discrepancia en el n\u00FAmero de sem\u00E1foros del conjunto de sem\u00E1foros.
SHRC617=Se ha producido un error al abrir el sem\u00E1foro. Marcador de sem\u00E1foro no encontrado en el conjunto de sem\u00E1foros.
JNCK048=Error de JNI en %s\: destinatario inelegible
SHRC618=No se puede leer el archivo de control de sem\u00E1foro.
JNCK049=Error de JNI en %s\: se ha detectado la reutilizaci\u00F3n de va_list
SHRC611=La subopci\u00F3n "disableBCI" se ha especificado pero la memoria cach\u00E9 existente se ha creado con la subopci\u00F3n "enableBCI".
SHRC612=Se ha establecido artificialmente la clave de almacenamiento (0- 15) en z/OS para pruebas.
SHRC613=Se ha producido un error al abrir el sem\u00E1foro. El archivo de control est\u00E1 da\u00F1ado.
SHRC614=Se ha producido un error al abrir el sem\u00E1foro. Discrepancia de ID de sem\u00E1foro.
JNCK042=Error de JNI en %1$s\: Argumento \#%2$d no es una subclase de %3$s
JNCK043=Error de JNI en %1$s\: Argumento \#%2$d; no se puede encontrar %3$s
JNCK040=Error de JNI en %1$s\: Argumento \#%2$d est\u00E1 fuera de rango para un %3$s (0x%4$x < 0x%5$x)
JNCK041=Error de JNI en %1$s\: Argumento \#%2$d est\u00E1 fuera de rango para un %3$s (0x%4$x > 0x%5$x)
SHRC619=El archivo de control de sem\u00E1foro es de s\u00F3lo lectura.
JNCK046=Error de JNI en %1$s\: el m\u00E9todo tiene un tipo de devoluci\u00F3n incorrecto ('%2$c')
JNCK047=Error de JNI en %s\: argumento clazz incorrecto
JNCK044=Error de JNI en %s\: el m\u00E9todo es est\u00E1tico
JNCK045=Error de JNI en %s\: el m\u00E9todo no es est\u00E1tico
SHRC520=\t classpath   Imprime solo los tipos classpath de la memoria cach\u00E9 compartida.
SHRC521=\t url               Imprime solo los tipos de URL de la memoria cach\u00E9 compartida.
SHRC522=\t token           Imprime solo los tipos de se\u00F1al de la memoria cach\u00E9 compartida.
SHRC527=\t zipcache     Imprime solo los tipos zipcache de la memoria cach\u00E9 compartida.
SHRC528=\t extra           Imprime todos los tipos privados siguientes de la memoria cach\u00E9 compartida.
SHRC529=\t orphan         Imprime solo los tipos hu\u00E9rfanos de la memoria cach\u00E9 compartida.
SHRC523=\t romclass     Imprime solo los tipos de romclass de la memoria cach\u00E9 compartida.
SHRC524=\t rommethod   Imprime solo los tipos rommethod de la memoria cach\u00E9 compartida.
SHRC525=\t aot               Imprime solo los tipos aot de la memoria cach\u00E9 compartida.
SHRC526=\t jitprofile Imprime solo los tipos jitprofile de la memoria cach\u00E9 compartida.
SHRC510=Inhabilitar la creaci\u00F3n de volcados en memorias cach\u00E9 corruptas
SHRC511=La memoria cach\u00E9 compuesta tiene un valor de distintivo de inicializaci\u00F3n err\u00F3neo. El valor de ccInitComplete es %lu
SHRC516=Enumerar todos los elementos que se encuentran en la memoria cach\u00E9 de forma predeterminada. Utilice printallstats\=help para ver las opciones disponibles.
SHRC517=Subopci\u00F3n no reconocida para la opci\u00F3n printallstats\= . Utilice printallstats\=help para ver las opciones disponibles.
SHRC518=Opciones disponibles para -Xshareclasses\:printAllStats\=<opciones>. Utilice '+' para especificar varias opciones. Es decir, printallstats\=aot+url \n
SHRC519=\t all               Imprime todos los tipos siguientes de la memoria cach\u00E9 compartida.
SHRC512=no hay datos en la memoria cach\u00E9
SHRC513=Establecer los permisos de tipo unix para la creaci\u00F3n de directorios de memoria cach\u00E9
SHRC514=Valores no v\u00E1lidos para la opci\u00F3n cacheDirPerm. Debe ser un permiso de archivo de estilo unix en el rango 0700 - 0777 o 1700 - 1777 (en representaci\u00F3n octal).
SHRC515=No se ha podido obtener el directorio de memoria cach\u00E9 predeterminado.
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC549=-Xshareclasses\:checkStringTableReset puede fallar. La tabla de series no es lo suficientemente grande. Debe ser superior al tama\u00F1o de la p\u00E1gina del sistema operativo. Tama\u00F1o de tabla \= %d, Tama\u00F1o de p\u00E1gina \= %d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC547=No se puede asignar memoria para matriz de caracteres en shrinit
SHRC548=Forzar comprobar si la tabla de series se restablece cuando se marca como da\u00F1ada.
SHRC530=\t jithint       Imprime solo los tipos jithint de la memoria cach\u00E9 compartida.
SHRC531=\t aotch           Imprime solo los tipos aotch de la memoria cach\u00E9 compartida.
SHRC532=\t aotthunk     Imprime solo los tipos aotthunk de la memoria cach\u00E9 compartida.
SHRC533=\t aotdata       Imprime solo los tipos aotdata de la memoria cach\u00E9 compartida.
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC534=\t jcl               Imprime solo los tipos jcl de la memoria cach\u00E9 compartida.
SHRC535=\t bytedata     Imprime todos los tipos bytedata de la memoria cach\u00E9 compartida.
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s Direcci\u00F3n\: 0x%5$p Tama\u00F1o\: %6$d
SHRC563=Apertura de una memoria cach\u00E9 en tiempo real, que no es compatible con esta JVM, utilice la opci\u00F3n -Xrealtime JVM para acceder a esta memoria cach\u00E9
SHRC564=[Memoria cach\u00E9 compartida entre varios invitados -Xshareclasses habilitada]
SHRC565=Crear memoria cach\u00E9 de clases compartidas entre varios invitados
SHRC566=El punto de atenci\u00F3n de la cabecera de memoria cach\u00E9 de clases compartidas entre invitados no es v\u00E1lido
SHRC560=El nombre de la memoria cach\u00E9 interna no es correcto.
SHRC561=No se ha podido inicializar la memoria cach\u00E9 de clase compartida, no hay suficiente espacio en el sistema de archivos. Bytes de espacio del disco disponibles \= %lld, bytes solicitados \= %lld.
SHRC562=Se han le\u00EDdo datos da\u00F1ados para la cabecera de entrada de la memoria cach\u00E9 0x%p (longitud de elemento de %u bytes no v\u00E1lida)
SHRC567=La memoria cach\u00E9 de varios invitados de clases compartidas abierta %1$s es de s\u00F3lo lectura
SHRC568=Se ha abierto la memoria cach\u00E9 de varios invitados de clases compartidas %1$s
SHRC569=Se ha creado la memoria cach\u00E9 de varios invitados de clases compartidas %1$s
SHRC552=No se ha podido asignar el tama\u00F1o de bloque de solicitud para la memoria cach\u00E9 "%s". Bytes disponibles \= %d, bytes solicitados \= %d
SHRC553=La memoria cach\u00E9 contiene solo clases con n\u00FAmeros de l\u00EDnea
SHRC554=La memoria cach\u00E9 contiene solo clases sin n\u00FAmeros de l\u00EDnea
SHRC555=La memoria cach\u00E9 contiene clases con n\u00FAmeros de l\u00EDnea y clases sin n\u00FAmeros de l\u00EDnea
SHRC550=Falta el distintivo de tiempo de ejecuci\u00F3n ROUND_TO_PAGE_SIZE. -Xshareclasses\:checkStringTableReset requiere que la tabla de series se redondee al tama\u00F1o de la p\u00E1gina.
SHRC551=La memoria cach\u00E9 "%s" est\u00E1 marcada como llena. No se ha podido asignar el tama\u00F1o de bloque \= %d.
SHRC556=Imprimir resumen de las estad\u00EDsticas de la memoria cach\u00E9. Utilice printstats\=help para ver las opciones disponibles.
SHRC557=Subopci\u00F3n no reconocida para opci\u00F3n printstats\= . Utilice printstats\=help para ver las opciones disponibles.
SHRC558=Opciones disponibles para -Xshareclasses\:printStats\=<opciones>. Utilice '+' para especificar varias opciones. Es decir, printstats\=aot+url \n
SHRC559=No se ha podido crear un directorio "%s" para la memoria cach\u00E9 de clase compartida
SHRC580=Error al liberar bloqueo de lectura de conexi\u00F3n de memoria cach\u00E9 de clases compartidas entre invitados
SHRC101=\tIndex %1$d en classpath 0x%2$p
SHRC585=Error al adquirir bloqueo de escritura de cabecera de memoria cach\u00E9 de clases compartidas entre invitados
SHRC102=\tURL 0x%p
SHRC586=Error\: la memoria cach\u00E9 de clases compartidas entre invitados tiene una cabecera no v\u00E1lida
SHRC103=\tSe\u00F1al 0x%p
SHRC587=Error al actualizar la fecha de \u00FAltima conexi\u00F3n de la memoria cach\u00E9 de clases compartidas entre invitados
SHRC104=%1$d\: 0x%2$p CLASSPATH
SHRC588=Error al liberar bloqueo de lectura de cabecera de memoria cach\u00E9 de clases compartidas entre invitados
SHRC581=Error al correlacionar en el objeto compartido entre varios invitados
SHRC582=Error\: no se puede suprimir memoria cach\u00E9 de clases compartidas entre invitados
SHRC583=Error al actualizar la hora de \u00FAltima desconexi\u00F3n para memoria cach\u00E9 de clases compartidas entre invitados
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s en 0x%5$p.
SHRC584=Error al adquirir bloqueo de lectura de conexi\u00F3n de memoria cach\u00E9 de clases compartidas entre invitados
SHRC109=\!OBSOLETO\!
SHRC105=%1$d\: URL 0x%2$p
SHRC589=Crear la memoria cach\u00E9 con soporte de instrumentaci\u00F3n de c\u00F3digos de byte.
SHRC106=%1$d\: 0x%2$p TOKEN
SHRC107=\t%.*s
SHRC108=\t%.*s
SHRC574=La memoria cach\u00E9 compartida entre varios invitados no puede estar ubicada en un sistema de archivos en red. Seleccione "nonpersistent" o un cacheDir distinto.
SHRC575=Error al adquirir el bloqueo de grabaci\u00F3n ara la cabecera de memoria cach\u00E9 de clases compartidas entre invitados
SHRC576=La memoria cach\u00E9 compartida entre varios invitados no se puede abrir en modalidad de s\u00F3lo lectura ya que todav\u00EDa no se ha inicializado
SHRC577=No se puede crear una memoria cach\u00E9 compartida entre varios invitados en modalidad de s\u00F3lo lectura
SHRC570=Se ha destruido la memoria cach\u00E9 compartida entre varios invitados "%1$s"
SHRC571=Se ha adjuntado la memoria cach\u00E9 de varios invitados de clases compartidas %1$s
SHRC572=Se ha encontrado una especificaci\u00F3n de destino incorrecta. El destino especificado en la cabecera de la memoria cach\u00E9 es\: %s, pero se esperaba\: %s.
SHRC573=La opci\u00F3n de l\u00EDnea de mandatos "-Xshareclasses\: %s" requiere "-Xvirt"
SHRC578=Error al crear cabecera en memoria cach\u00E9 de clases compartidas entre invitados
SHRC579=Error al inicializar la cabecera de datos de memoria cach\u00E9 compartida entre invitados
SHRC123=%% clases obsoletas    \= %1$d%%\n
SHRC124=La memoria cach\u00E9 tiene %1$d%% ocupado\n
SHRC125=No se ha podido asignar memoria para el almacenamiento intermedio de serie en SH_CacheMap
SHRC126=Se ha realizado una petici\u00F3n para a\u00F1adir demasiados elementos a ClasspathItem
SHRC120=Nro. de URL           \= %d
SHRC121=Nro. de se\u00F1ales         \= %d
SHRC122=Nro. de clases obsoletas \= %d
SHRC127=SH_CompositeCache\:\:enterMutex ha fallado con el c\u00F3digo de retorno %d. Aviso\: puede que la memoria cach\u00E9 est\u00E9 da\u00F1ada.
SHRC128=SH_CompositeCache\:\:exitMutex ha fallado con el c\u00F3digo de retorno %d. Aviso\: puede que la memoria cach\u00E9 est\u00E9 da\u00F1ada.
SHRC129=\u00A1Se ha intentado establecer readerCount en -1\!
SHRC590=La subopci\u00F3n "enableBCI" se ha especificado pero no se ha creado la memoria cach\u00E9 existente con la subopci\u00F3n "enableBCI".
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
SHRC112=puntero de asignaci\u00F3n \= 0x%p\n
SHRC596=Realice comprobaciones adicionales cuando almacene y vuelva a asignar datos de clases fuera de l\u00EDnea.
SHRC113=tama\u00F1o de memoria cach\u00E9       \= %d
SHRC597=-Xshareclasses\:rcdSize\=%u bytes es mayor que %u bytes de espacio libre disponible, -Xshareclasses\:rcdSize\=%u se utilizar\u00E1 en su lugar.
SHRC114=bytes libres       \= %d
SHRC598=El \u00E1rea de datos de clase sin procesar est\u00E1 da\u00F1ada porque su tama\u00F1o %lu es mayor que el tama\u00F1o de memoria cach\u00E9 total de %lu.
SHRC115=bytes de ROMClass   \= %d
SHRC599=El espacio libre del \u00E1rea de datos de clase sin procesar est\u00E1 da\u00F1ado ('espacio libre inicial'\=%p, 'espacio libre final'\=%p, 'espacio libre'\=%lu bytes)
SHRC592=BCI Enabled        \= true
SHRC593=BCI Enabled        \= false
SHRC110=\ndirecci\u00F3n base       \= 0x%p
SHRC594=La subopci\u00F3n Xshareclasses\:cacheRetransformed es incompatible con una memoria cach\u00E9 compartida creada con la subopci\u00F3n enableBCI
SHRC111=direcci\u00F3n final        \= 0x%p
SHRC595=Las opciones de l\u00EDnea de mandatos "%s" y "%s" son incompatibles
SHRC116=Bytes de metadatos   \= %d
SHRC117=Metadatos %% utilizados    \= %1$d%%\n
SHRC118=Nro. de ROMClasses     \= %d
SHRC119=Nro. de classpaths     \= %d
J9TI006=Renuncia a las nuevas posibilidades ampliadas de capabilities_ptr.
J9TI007=Obtiene el conjunto de posibilidades ampliadas actuales mediante capabilities_ptr.
J9TI004=Devuelve mediante capabilities_ptr las posibilidades ampliadas disponibles en este momento.
SHRC140=tama\u00F1o\:\t%1$d\t\t\t%2$d\n
J9TI005=A\u00F1ade las nuevas posibilidades ampliadas de capabilities_ptr.
J9TI008=Indica el inicio de una fase de compilaci\u00F3n JIT. (No es seguro para devoluci\u00F3n de llamada)
J9TI009=Indica el final de una fase de compilaci\u00F3n JIT. (No es seguro para devoluci\u00F3n de llamada)
SHRC145=Buscando clase %1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %2$d con URL %4$.*3$s...
SHRC146=Buscando clase %1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %2$d con se\u00F1al %4$.*3$s...
VMUT001=(hebra sin nombre)
SHRC147=Car\u00E1cter %.*s no v\u00E1lido para nombres de memoria cach\u00E9
VMUT000=(memoria insuficiente)
SHRC148=Permitir el acceso del grupo a memoria cach\u00E9 (toma como valor predeterminado user)
VMUT003=Archivo de opciones no encontrado
SHRC141=bytes que no coinciden\:
VMUT002=(error de acceso)
SHRC142=\ten 0x%1$p\t\t%2$x \!\= %3$x
VMUT005=Opci\u00F3n con un valor demasiado grande\: '%s'
SHRC143=Almacenamiento de clase %2$.*1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con URL %5$.*4$s...
VMUT004=Opci\u00F3n mal formada\: '%s'
SHRC144=Almacenando clase %2$.*1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con se\u00F1al %5$.*4$s...
SHRC149=Habilitar salida de b\u00FAsqueda/almac\u00E9n detallada
J9TI002=No se ha encontrado Agent_OnLoad en la biblioteca %s
J9TI003=Error de Agent_OnLoad para la biblioteca %s
J9TI000=Memoria agotada al intentar cargar la biblioteca de agente %s
J9TI001=No se ha podido abrir la biblioteca de agente %1$s (%2$s)
J9TI017=Controla diversas opciones de VM y de compilaci\u00F3n.
J9TI018=Establece un m\u00E9todo para la notificaci\u00F3n de entrada y salida selectiva.
J9TI015=Solicitar un volcado de Java Lock Monitor (JLM).
J9TI016=Permitir la incorporaci\u00F3n de c\u00F3digo en caso de sucesos de entrada y salida de m\u00E9todo (dando como resultado una informaci\u00F3n de entrada y salida posiblemente inexacta)
J9TI019=Establece la modalidad de notificaci\u00F3n para sucesos ampliados, permitiendo selectividad a nivel de hebra.
SHRC134=No se ha podido crear agrupaci\u00F3n en SH_ROMClassManagerImpl
VMUT010=Valor de opci\u00F3n mal formado; la opci\u00F3n "%1$s%3$.*2$s" contiene caracteres "%4$s" al final que se han omitido
SHRC135=No se ha podido crear tabla hash en SH_ROMClassManagerImpl
SHRC136=No se puede crear supervisor en SH_ROMClassManagerImpl
VMUT012=%2$.*1$s no es una superinterfaz directa de %4$.*3$s.
VMUT011=No se ha podido asignar memoria para la matriz de opciones de l\u00EDnea de mandatos
SHRC137=MODALIDAD SEGURA\: Aviso\: la ROMClass %.*s no coincide con la ROMClass que hay en memoria cach\u00E9
SHRC130=Intento de asignaci\u00F3n mientras la confirmaci\u00F3n a\u00FAn est\u00E1 pendiente
VMUT014=La clase de receptor %2$.*1$s debe ser la clase actual de un subtipo de la interfaz %4$.*3$s
SHRC131=No se puede asignar memoria para elemento de lista enlazada en ROMClassManagerImpl
VMUT013=El archivo de opciones %s no es v\u00E1lido.
SHRC132=No se puede asignar memoria para entrada de tabla hash en ROMClassManagerImpl
SHRC133=No se puede entrar el m\u00FAtex de tabla hash ROMClassManager
VMUT007=Valor mal formado para JAVA_TOOL_OPTIONS
VMUT006=Se ha encontrado la opci\u00F3n %s mal formada en -Xoptionsfile
VMUT009=Valor mal formado para -Xservice
VMUT008=Valor mal formado para IBM_JAVA_OPTIONS
SHRC138=Se han encontrado m\u00E1s de una ROMClass hu\u00E9rfana para %.*s
SHRC139=\n\tROMClass que se va a almacenar\tROMClass en memoria cach\u00E9
J9TI010=Entrada de m\u00E9todo con informaci\u00F3n ampliada sobre el tipo de m\u00E9todo.
J9TI013=Permite devoluciones de llamada para asignaciones instrumentables (las que VMObjectAlloc no informa).
J9TI014=Controla Java Lock Monitor (JLM) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI011=A\u00F1ade una opci\u00F3n -Xtrace din\u00E1mica
J9TI012=A\u00F1ade una opci\u00F3n -Xdump din\u00E1mica
SHRC160=Se ha excedido el tiempo de espera para la creaci\u00F3n del m\u00FAtex al abrir el sem\u00E1foro.
SHRC161=Se ha excedido el tiempo de espera para la creaci\u00F3n la memoria compartida.
SHRC162=La espera del m\u00FAtex de creaci\u00F3n mientras se abr\u00EDa la memoria compartida ha excedido el tiempo de espera.
SHRC167=Inhabilita la compartici\u00F3n de clases
SHRC168=Total de byte de clase compartida le\u00EDdos\=%1$lld. Total de bytes almacenados\=%2$d
SHRC169=Cambio detectado en %2$.*1$s...\n \t...marcado %3$d clases de memoria cach\u00E9 como obsoletas
SHRC163=[salida detallada de -Xshareclasses habilitada]
SHRC164=[salida de E/S detallada de -Xshareclasses habilitada]
SHRC165=[salida detallada de la API de Helper -Xshareclasses habilitada]
SHRC166=Conectado a memoria cach\u00E9 "%1$s", tama\u00F1o\=%2$d bytes
SHRC150=Habilitar salida detallada de API de helper
SHRC151=Suprimir todos los mensajes
SHRC156=Error al copiar el nombre de grupo en nombre de memoria cach\u00E9.
SHRC157=No ha sido posible asignar %1$d bytes de memoria solicitada \n \tSe ha asignado satisfactoriamente el m\u00E1ximo de memoria compartida permitida (%2$d bytes) \n \t(para aumentar la memoria compartida disponible, modifique el valor SHMMAX del sistema)
SHRC158=Se ha creado la memoria cach\u00E9 de clases compartidas "%1$s"
SHRC159=Se ha abierto la memoria cach\u00E9 de clases compartidas "%1$s"
SHRC152=Iniciar siempre JVM independientemente de errores/avisos
SHRC153=Especificar el nombre de memoria cach\u00E9 compartida\n \t(utilice %%g para sustituir nombre de grupo y %%u por nombre de usuario)
SHRC154=El car\u00E1cter de escape %.*s no es v\u00E1lido para el nombre de la memoria cach\u00E9
SHRC155=Error al copiar el nombre de usuario en nombre de memoria cach\u00E9
SHRC181=No se puede entrar el m\u00FAtex de tabla hash ScopeManagerImpl
SHRC182=No se puede crear supervisor en ScopeManagerImpl
SHRC183=No se puede crear tabla hash en ScopeManagerImpl
SHRC184=\tPartici\u00F3n %.*s
SHRC180=No se puede asignar memoria para entrada de tabla hash en ScopeManagerImpl
SHRC189=\# M\u00E9todos AOT      \= %d
SHRC185=\tContextoMod %.*s
SHRC186=\tPartici\u00F3n %.*s en ContextoMod %.*s
SHRC187=Inhabilitar almacenamiento de datos AOT en memoria cach\u00E9 compartida
SHRC188=Bytes de AOT          \= %d
SHRC170=Especifique el nombre de la memoria cach\u00E9 compartida\n \t(utilice %%u para sustituir el nombre de usuario)
SHRC171=z/OS no puede crear la memoria cach\u00E9 del tama\u00F1o solicitado\: compruebe la configuraci\u00F3n BPXPRMxx del sistema z/OS
SHRC172=No se puede crear una memoria cach\u00E9 del tama\u00F1o solicitado debido a restricciones del sistema operativo
SHRC173=Establezca el directorio para los archivos de control de JVM (avanzado)
SHRC178=Se ignorar\u00E1 la opci\u00F3n noIncrementalUpdates debido al uso de singleJVM
SHRC179=El segmento ROMClass ha quedado da\u00F1ado. Error al leer ROMClass en 0x%p
SHRC174=Habilitar optimizaciones para uso \u00FAnico de JVM
SHRC175=Hacer que la memoria cach\u00E9 no cambie despu\u00E9s de reinicios (s\u00F3lo en Win)
SHRC176=Reubicaci\u00F3n de invariable de serie habilitada
SHRC177=No es posible ejecutar safemode debido el uso de la opci\u00F3n singleJVM
SHRC082=No se puede crear identifiedMutex en SH_ClasspathManagerImpl2
J9VM039=Se ignora -Xscmx si no se especifica -Xshareclasses
SHRC083=No se puede asignar memoria para la matriz identifiedClasspaths en SH_ClasspathManagerImpl2
SHRC084=No se puede asignar memoria para elemento de lista enlazada
SHRC085=No se puede asignar memoria para cabecera de elemento de lista enlazada
SHRC080=No se puede asignar memoria para la entrada de tabla hash
SHRC081=No se puede crear cpeTableMutex en SH_ClasspathManagerImpl2
SHRC086=No se puede entrar el m\u00FAtex de tabla hash ClasspathManager
SHRC087=MarkStale ha fallado durante ClasspathManager\:\:update()
SHRC088=No se ha podido crear memoria cach\u00E9 como ROMImageSegment en SH_CacheMap
SHRC089=No se puede crear m\u00FAtex de renovaci\u00F3n en SH_CacheMap
J9TI060=Crear una suscripci\u00F3n a los registros detallados de recogida de basura
J9TI061=Cancelar una suscripci\u00F3n a los registros detallados de recogida de basura
J9VM030=Se ha utilizado un UTF8 no v\u00E1lido en la funci\u00F3n JNI
J9VM031=La clase %2$.*1$s necesaria debe estar en la classpath de arranque, pero se ha encontrado en la classpath de la aplicaci\u00F3n en %4$.*3$s
J9TI064=Ha fallado la funci\u00F3n de inicializaci\u00F3n del agente %s para la biblioteca %s, c\u00F3digo de retorno %d
CDRT000=No se ha podido localizar una correlaci\u00F3n de pila JIT - terminando anormalmente la m\u00E1quina virtual
J9VM032=Error irrecuperable\: no se puede cargar %1$s\: %2$s
J9TI065=No se ha encontrado la funci\u00F3n de inicializaci\u00F3n del agente %s en la biblioteca %s
J9VM033=Error irrecuperable\: no se ha podido inicializar %s
J9TI062=Obtiene el puntero de J9VMThread de un jthread
CDRT002=PC err\u00F3neo\: %1$p (desplazamiento %2$p), metaData \= %3$p
J9VM034=JVMRI requiere el motor de rastreo\: ejec\u00FAtelo con el distintivo -Xtrace
J9TI063=Obtiene el puntero de J9Method de JMethodID
CDRT001=M\u00E9todo\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
J9VM035=No se puede asignar OutOfMemoryError
J9VM036=dividir por cero
J9VM037=No se ha podido asignar el supervisor
J9TI066=Crear una suscripci\u00F3n a puntos de rastreo de VM
J9VM038=-Xthr\: opci\u00F3n no reconocida --> '%s'
J9TI067=Cancelar una suscripci\u00F3n a puntos de rastreo de VM
SHRC071=La opci\u00F3n de l\u00EDnea de mandatos "%s" requiere una subopci\u00F3n
J9VM028=\ten %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
SHRC072=Opci\u00F3n de l\u00EDnea de mandatos "%s" no reconocida
J9VM029=\ten (m\u00E9todo desconocido)
SHRC073=Almacenando clase %2$.*1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %3$d con URL %5$.*4$s (\u00EDndice %6$d)...
SHRC074=\ Satisfactorio.
SHRC070=Se han inhabilitado las actualizaciones incrementales
SHRC079=No se puede crear la tabla hash en SH_ClasspathManagerImpl2
SHRC075=\ Error.
SHRC076=Buscando clase %1$s en memoria cach\u00E9 compartida para el ID de cargador de clase %2$d...
SHRC077=No se ha podido crear la agrupaci\u00F3n linkedListImpl en SH_ClasspathManagerImpl2
SHRC078=No se ha podido crear la agrupaci\u00F3n linkedListHdr en SH_ClasspathManagerImpl2
J9VM020=Buscado en %.*s
J9VM021=Memoria agotada para la correlaci\u00F3n de pila del int\u00E9rprete - terminando anormalmente la m\u00E1quina virtual
J9VM022=Error de correlaci\u00F3n de pila, resultado \= %p - terminando anormalmente m\u00E1quina virtual
J9VM023=Esto puede indicar que JAVA_HOME es incorrecto o que no est\u00E1n instaladas las bibliotecas de clases
J9VM024=Excepci\u00F3n en hebra "%.*s"\# START NON-TRANSLATABLE
J9VM025=\ten %2$.*1$s.%4$.*3$s (M\u00E9todo nativo)
J9VM026=\ten %2$.*1$s.%4$.*3$s (origen desconocido)
J9VM027=\ten %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM050=-Xjni\: opci\u00F3n no reconocida --> '%s'
J9VM051=Uso\:\n
J9VM052=\   -Xjni\:arrayCacheMax\=[<x>|unlimited] establecer el tama\u00F1o m\u00E1ximo de la matriz en memoria cach\u00E9 JNI\n
J9VM053=Se ha encontrado la opci\u00F3n %s mal formada en -Xoptionsfile
J9VM054=No se ha podido crear una hebra\: retVal %1$zd, errno %2$zd
J9VM055=Error irrecuperable\: versi\u00F3n principal JXE distinta de %d
J9VM056=Versi\u00F3n principal
J9VM057=Se ha sobrepasado el l\u00EDmite de memoria cach\u00E9 de supervisor
J9VM058=Se ignora -Xscminaot si no se especifica -Xshareclasses
J9VM059=Se ignora -Xscmaxaot si no se especifica -Xshareclasses
SHRC093=Detectada la terminaci\u00F3n inesperada de otra JVM durante la actualizaci\u00F3n
SHRC094=Se ha encontrado una hu\u00E9rfana pero se ha pasado ROMClass local a addROMClassToCache
SHRC095=Los intentos de llamar a markStale en elementos de memoria cach\u00E9 compartida han fallado
SHRC096=La memoria cach\u00E9 compartida "%s" est\u00E1 llena. Utilice -Xscmx para establecer el tama\u00F1o de memoria cach\u00E9.
SHRC090=No se ha podido obtener m\u00FAtex de memoria cach\u00E9 en el inicio de SH_CacheMap
SHRC091=Se han le\u00EDdo datos da\u00F1ados para el elemento 0x%p (dataType no v\u00E1lido)
SHRC092=Anomal\u00EDa en ADD al leer la memoria cach\u00E9
SHRC097=La memoria cach\u00E9 compartida "%s" est\u00E1 da\u00F1ada. No se permitir\u00E1 que nuevas JVM conecten con la memoria cach\u00E9.\n \tLas JVM pueden continuar funcionando, pero no es posible actualizar la memoria cach\u00E9.
SHRC098=\nEstad\u00EDsticas actuales para la memoria cach\u00E9 "%s"\: \n
SHRC099=%1$d\: 0x%2$p ORPHAN\: %4$.*3$s en 0x%5$p.
JITM031=El valor para '%s' no es correcto
JITM032=La opci\u00F3n '%1$s' no est\u00E1 completa, debe especificar el par\u00E1metro '%2$s'.
J9VM040=desbordamiento de pila del sistema operativo
JITM030=El valor de %s especificado es demasiado elevado
J9VM041=n\u00FAmero incorrecto de argumentos
JITM035=El tama\u00F1o de p\u00E1gina grande %1$zu%2$s no es un tama\u00F1o de p\u00E1gina compatible con la memoria cach\u00E9 de c\u00F3digo JIT; se utiliza %3$zu%4$s %5$s en su lugar
J9VM042=Configuraci\u00F3n de las hebras
JITM036=El tama\u00F1o de p\u00E1gina grande %1$zu%2$s %3$s no es un tama\u00F1o de p\u00E1gina compatible con la memoria cach\u00E9 de c\u00F3digo JIT; se utiliza %4$zu%5$s en su lugar
J9VM043=---------------------------
JITM033=Se ignoran los caracteres de coma adicionales descubiertos en la opci\u00F3n '- Xlp'
J9VM044=Supervisores del sistema de tres niveles soportados
JITM034=El tama\u00F1o de p\u00E1gina grande %1$zu%2$s no es un tama\u00F1o de p\u00E1gina compatible con la memoria cach\u00E9 de c\u00F3digo JIT; se utiliza %3$zu%4$s en su lugar
J9VM045=Supervisores del sistema de tres niveles no soportados
J9VM046=JLM soportado
J9VM047=JLM no soportado
JITM037=El tama\u00F1o de p\u00E1gina grande %1$zu%2$s %3$s no es un tama\u00F1o de p\u00E1gina compatible con la memoria cach\u00E9 de c\u00F3digo JIT; se utiliza %4$zu%5$s %6$s en su lugar
J9VM048=Tiempo de retenci\u00F3n JLM soportado
J9VM049=Tiempo de retenci\u00F3n JLM no soportado
J9TI028=Informar del final de un volcado RAS.
J9TI029=Configuraci\u00F3n del agente de volcado RAS de consulta
JITM019=Discrepacia en la caracter\u00EDstica Concurrent Scavenge. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI026=Desencadenar un volcado utilizando la configuraci\u00F3n RAS espec\u00EDfica.
J9TI027=Informar del inicio de un volcado RAS.
J9RI019=jvmri->InjectOutOfMemory no soportada.
J9RI017=No se puede asignar el agente de volcado en jvmri->SetOutOfMemoryHook, no se ha registrado la funci\u00F3n.
J9RI018=jvmri->NotifySignal lanza la se\u00F1al %d.
JITM020=Discrepancia en la caracter\u00EDstica de software de barrera de lectura. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
JITM021=Discrepancia en la caracter\u00EDstica TM. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
JITM024=Discrepancia en Compressedrefs Shift. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI020=Obtiene el ID de hebra de OS de un jthread
J9RI015=jvmri->RunDumpRoutine\: componentId est\u00E1 fuera de los l\u00EDmites.
JITM025=El SCC es demasiado grande para que el JIT codifique correctamente los desplazamientos. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI021=Obtener informaci\u00F3n de trama extendida
J9RI016=Se ha llamado a jvmri->SetOutOfMemoryHook con una devoluci\u00F3n de llamada NULL, no se ha registrado la funci\u00F3n.
JITM022=Discrepancia en la palabra de bloqueo. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9RI013=jvmri->ReleaseRasInfo\: la estructura tiene un campo de tipo no admitido.
JITM023=Discrepancia en el tama\u00F1o de Arraylet. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9RI014=jvmri->RunDumpRoutine\: no se pueden recuperar datos de componente.
JITM028=La configuraci\u00F3n del sistema no admite el par\u00E1metro '%.*s' en la opci\u00F3n '-Xlp'
J9TI024=Salida de m\u00E9todo sin el valor de retorno.
J9RI011=La estructura RasInfo tiene un campo de tipo no admitido.
JITM029=%s debe ir seguido de un n\u00FAmero
J9TI025=Permitir JNI directa en caso de sucesos de entrada y salida de m\u00E9todo (dando como resultado una informaci\u00F3n de entrada y salida posiblemente inexacta)
J9RI012=Se ha llamado a jvmri->ReleaseRasInfo con una estructura RasInfo NULL.
JITM026=Problema desconocido. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI022=Obtener informaci\u00F3n de trama extendida para todos los rastreos de pila.
JITM027=JIT no ha podido asignar memoria
J9TI023=Obtener informaci\u00F3n de trama extendida para una lista de hebras.
J9RI010=jvmri->GetRasInfo no puede asignar memoria.
J9TI039=Destruir una memoria cach\u00E9 compartida nombrada.
JITM008=La validaci\u00F3n de la cabecera AOT ha fallado; el comienzo del distintivo de la caracter\u00EDstica se ha da\u00F1ado un poco. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI037=Obtener la memoria total del almacenamiento din\u00E1mico.
JITM009=La validaci\u00F3n de la cabecera AOT ha fallado; el final del distintivo de la caracter\u00EDstica se ha da\u00F1ado un poco. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI038=Iterar sobre las memoria cach\u00E9s compartidas.
J9RI008=jvmri->GetRasInfo no puede obtener componentes.
J9RI009=jvmri->GetRasInfo no puede asignar memoria.
J9RI006=Se ha llamado a jvmri->GetRasInfo con la estructura RasInfo NULL.
J9RI007=jvmri->GetRasInfo no puede asignar memoria.
JITM010=Discrepancia en la caracter\u00EDstica SMP. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
JITM013=Discrepancia en la caracter\u00EDstica de habilitar rastreo. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI031=Cancelar el suceso as\u00EDncrono en una sola hebra o en todas las hebras
J9RI004=No se admite jvmri->DynamicVerbosegc.
JITM014=Discrepancia en la caracter\u00EDstica de captaci\u00F3n previa TLH. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI032=Indica que una hebra ha procesado el suceso as\u00EDncrono
J9RI005=El componente jvmri->GetComponentDataArea %s no dispone de dataArea bajo esta m\u00E1quina virtual.
JITM011=Discrepancia en la caracter\u00EDstica de referencias comprimidas. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9RI002=Se ha llamado a jvmri->DumpRegister con una devoluci\u00F3n de llamada NULL, no se ha registrado la funci\u00F3n.
JITM012=Discrepancia en la caracter\u00EDstica DFP. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI030=Se\u00F1alar el suceso as\u00EDncrono en una sola hebra o en todas las hebras
J9RI003=No se puede asignar el agente de volcado en jvmri->DumpRegister, no se ha registrado la funci\u00F3n.
JITM017=Discrepancia en la caracter\u00EDstica de SIMD habilitado. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI035=Se ha finalizado el ciclo de recogida de basura.
J9RI000=jvmri->CreateThread no puede asignar memoria de argumentos de hebra
JITM018=Discrepancia en la caracter\u00EDstica de compilaci\u00F3n as\u00EDncrona. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI036=Obtener la memoria libre del almacenamiento intermedio actual.
J9RI001=Error interno al eliminar el agente de volcado en jvmri->DumpDeregister, quiz\u00E1 no se haya anulado el registro de la funci\u00F3n de vuelco.
JITM015=Discrepancia en la caracter\u00EDstica de metodolog\u00EDa trampol\u00EDn. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI033=Restablecer las opciones de vuelco de VM.
JITM016=Discrepancia en la caracter\u00EDstica de HCR habilitado. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI034=Se ha iniciado el ciclo de recogida de basura.
J9VM017=No se ha podido asignar memoria para la matriz de opciones de l\u00EDnea de mandatos
J9VM018=No se ha podido asignar memoria para la agrupaci\u00F3n de tablas de carga de bibliotecas compartidas
J9VM019=Error irrecuperable\: no se puede encontrar e inicializar la clase %.*s necesaria
J9TI048=Obtiene los metadatos de rastreo que se pueden utilizar con el formateador para procesar los almacenamientos intermedios de rastreo
J9TI049=Nombre de Clase de retorno, M\u00E9todo y Paquete para un conjunto de punteros de M\u00E9todo RAM
JITM002=Anomal\u00EDa al almacenar c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas. La memoria cach\u00E9 de clases compartidas puede estar da\u00F1ada. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9TI042=Se\u00F1ala los c\u00F3digos autom\u00E1ticos para los objetos reci\u00E9n asignados y sus clases.
JITM003=Anomal\u00EDa durante la inicializaci\u00F3n en tiempo de ejecuci\u00F3n de AOT. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9VM010=No se ha podido inicializar %s
J9TI043=Se\u00F1ala la carga de clases s\u00F3lo para clases de matriz.
JITM000=Hardware sin soporte [%d].
J9VM011=No se ha podido cargar %1$s\: %2$s
J9TI040=A\u00F1ade la posibilidad extendida can_autotag_objects.
JITM001=No hay m\u00E1s espacio para c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas. No se generar\u00E1 nuevo c\u00F3digo AOT.
J9VM012=No se ha podido descargar %1$s\: %2$s
J9TI041=Se\u00F1ala el suceso de objeto/s redenominado/s (movidos o suprimidos)
JITM006=El c\u00F3digo AOT de la memoria cach\u00E9 de clases compartidas no se puede ejecutar con la pol\u00EDtica actual de recogida de basura. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9VM013=Error de inicializaci\u00F3n en la funci\u00F3n %1$s(%2$d)\: %3$s
J9TI046=Cancelar una suscripci\u00F3n a registros de rastreo externos
JITM007=El c\u00F3digo AOT de la memoria cach\u00E9 de clases compartidas no se puede ejecutar con los valores JVMPI o JVMTI actuales. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9VM014=Error de conclusi\u00F3n en la funci\u00F3n %1$s(%2$d)\: %3$s
J9TI047=Todos los registros de rastreo se conmutan y se pasan a suscriptores de rastreo
JITM004=El c\u00F3digo AOT de la memoria cach\u00E9 de clases compartidas no se puede ejecutar en el procesador actual. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9VM015=Error de inicializaci\u00F3n para la biblioteca %1$s(%2$d)\: %3$s
J9TI044=Suprimir todos los c\u00F3digos de objeto.
JITM005=El c\u00F3digo AOT de la memoria cach\u00E9 de clases compartidas no se puede ejecutar en el release de JVM actual. Se ignorar\u00E1 el c\u00F3digo AOT en la memoria cach\u00E9 de clases compartidas.
J9VM016=Error de conclusi\u00F3n para la biblioteca %1$s(%2$d)\: %3$s
J9TI045=Crear una suscripci\u00F3n a registros de rastreo externos
MECK001=Opci\u00F3n de -Xcheck\:memory no reconocida\: %s
J9VM006=Opci\u00F3n de l\u00EDnea de mandatos no v\u00E1lida\: %s
MECK000=Se ha producido un error al inicializar el programa de utilidad -Xcheck\:memory
J9VM007=Opci\u00F3n de l\u00EDnea de mandatos no reconocida\: %s
J9VM008=J9VMDllMain no encontrado
J9TI059=Obtener la cantidad de memoria nativa usada por la JVM, desglosada por categor\u00EDas de memoria.
MECK002=Se ha producido un error al crear la estructura de datos de sitio de llamada. No se visualizar\u00E1 informaci\u00F3n de sitio de llamada
J9VM009=Error de J9VMDllMain
J9TI050=Obtener un c\u00F3digo hash para un supervisor del objeto.
J9TI053=Establecer las opciones de registro de VM.
J9TI054=Solicitar un volcado de Java Lock Monitor (JLM) con un especificador de formato.
J9VM000=Valor mal formado para IBM_JAVA_OPTIONS
J9TI051=Quitar el distintivo per-method para la notificaci\u00F3n de entrada y salida selectiva.
J9VM001=Valor mal formado para -Xservice
J9TI052=Consultar las opciones de registro VM actuales.
J9VM002=Archivo de opciones no encontrado
J9TI057=No se ha podido convertir la serie nativa de opciones de registro de JVM.
J9VM003=Compilador JIT "%s" no encontrado. Se utilizar\u00E1 el int\u00E9rprete.
J9TI058=No se han podido establecer las opciones de registro de JVM.
J9VM004=No se puede cargar la biblioteca que requiere\: %s
J9TI055=No se ha podido asignar el almacenamiento intermedio para las opciones de registro de JVM.
J9VM005=Valor no v\u00E1lido para variable de entorno\: %s
J9TI056=No se han podido consultar las opciones de registro de JVM.
PORT033=No se ha podido detectar un Hipervisor soportado.
PORT032=Error en la operaci\u00F3n relacionada con el Hipervisor.
PORT031=Se ha recibido la condici\u00F3n LE %s%i, que corresponde a una se\u00F1al POSIX generada por el software
PORT030=%s valor "%s" especifica que el volcado del n\u00FAcleo se redirige a un programa externo.  Intentando renombrar core o core.%d.\n
PORT037=No se ejecuta en un Hipervisor.
PORT036=C\u00F3digo de retorno inesperado del servicio CSRSI en z/OS
PORT035=__malloc31 no ha podido asignar almacenamiento intermedio en z/OS
PORT034=Se ha intentado adjuntar memoria compartida creada en la clave de protecci\u00F3n de almacenamiento %lu, pero actualmente se est\u00E1 ejecutando en la clave %lu.
PORT039=Ha fallado la actualizaci\u00F3n de HYPFS
PORT038=Valor mal formado para IBM_JAVA_HYPERVISOR_SETTINGS
PORT022=A\u00F1adiendo .X&DS a la plantilla de volcado especificada por el usuario para habilitar volcados de partes m\u00FAltiples.
PORT021=Ha abierto un sem\u00E1foro compartido de System V obsoleto\:  archivo\:%1$s semid\:%2$d
PORT020=Ha abierto una memoria compartida de System V obsoleta\:  archivo\:%1$s shmid\:%2$d
PORT026=El archivo especificado es un directorio
PORT025=Tipo de bloqueo no v\u00E1lido para la operaci\u00F3n de bloqueo de archivo. lockFlags\: %1$d
PORT024=IEATDUMP ha fallado porque no se ha podido asignar el conjunto de datos de volcado (compruebe el espacio de disco y los permisos de campo).
PORT023=IEATDUMP ha sido err\u00F3neo porque la plantilla de volcado definida por el usuario es demasiado larga. Reintentando volcado con plantilla predeterminada.
PORT029=Manejador no v\u00E1lido. Manejador de archivo\: %1$d.
PORT028=mmap ha sido err\u00F3neo debido a opciones de correlaci\u00F3n no v\u00E1lidas
PORT027=mmap ha sido err\u00F3neo debido a un par\u00E1metro de protecci\u00F3n de memoria no v\u00E1lido
PORT011=No se ha podido asignar memoria durante el intento de cargar una biblioteca compartida
PORT010=El permiso para cargar la biblioteca compartida no se ha otorgado
PORT015=No se pueden resolver las referencias de biblioteca compartida - puede que falte una biblioteca compartida prerrequisito
PORT014=No se ha podido cargar la dll, ya que no se ha encontrado
PORT013=Error al cargar la biblioteca compartida - la tabla dll no se ha podido encontrar
PORT012=Error al cargar la biblioteca compartida debido al establecimiento del bit PAGE
PORT019=No se ha podido crear el directorio %s.  Las clases compartidas se inhabilitar\u00E1n hasta que se cree este directorio.
PORT018=Operaci\u00F3n err\u00F3nea\: %1$d (%2$s ha sido err\u00F3nea\: %3$d)
PORT017=Operaci\u00F3n con error\: %d
PORT016=Error interno %i
PORT000=
ZIPS000=No se ha podido abrir %1$s (%2$s)
ZIPS001=No se puede abrir %s (falta la exportaci\u00F3n)
PORT009=La biblioteca compartida especificada no se ha podido encontrar
PORT004=Anomal\u00EDa en la resoluci\u00F3n de s\u00EDmbolo
PORT003=No se ha podido cargar el m\u00F3dulo dependiente %s
PORT002=Error desconocido al cargar la biblioteca compartida
PORT001=Error al asignar memoria mientras se intentaba escribir en un archivo.
PORT008=El m\u00F3dulo no es de la arquitectura correcta
J9RI022=inicializar JVMRI, no puede asignar supervisor de volcados jvmri
PORT007=El m\u00F3dulo especificado no es un m\u00F3dulo
J9RI023=Ya no hay soporte para jvmri->TraceRegister, jvmri->TraceDeregister y TraceListener; utilice las  versiones nuevas en JVMRAS_VERSION_1_5
PORT006=El formato de m\u00F3dulo no es correcto
J9RI020=jvmri->CreateThread no puede asignar un supervisor privado
PORT005=No se ha podido cargar la biblioteca compartida
J9RI021=jvmri->RunDumpRoutine no soportada.
J9VM070=la memoria nativa se ha agotado durante el enlace del m\u00E9todo nativo %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM071=se ha intentado enlazar recursivamente el m\u00E9todo nativo %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM072=la memoria nativa se ha agotado
J9VM073=Clase %2$.*1$s accediendo de forma no permitida al miembro %3$s de la clase %5$.*4$s
J9VM074=Clase %2$.*1$s accediendo de forma no permitida a %3$s clase %5$.*4$s
J9VM075=operaci\u00F3n no permitida en la hebra eventron
J9VM076=La memoria nativa se ha agotado asignando la entrada de lista para objeto de referencia o finalizable.
J9VM077=Nota\: -Xdfpbd no tiene efecto en este release de Java
J9VM078=Valor mal formado para JAVA_TOOL_OPTIONS
J9VM079=triggerOneOffDump(%1$s) precisa de %2$s
J9VM060=runNamedDump(%1$s) requiere %2$s
J9VM061=insertDumpAgent requiere %s
J9VM062=removeDumpAgent requiere %s
J9VM063=seekDumpAgent requiere %s
J9VM064=setDumpOption requiere %s
J9VM065=el objeto no es una instancia de la clase declarada
J9VM066=discrepancia en el tipo de argumento
J9VM067=-Xshareclasses no habilitada, la opci\u00F3n -Xzero\:sharezip se ignora
J9VM068=-Xshareclasses no habilitada, la opci\u00F3n -Xzero\:sharestring se ignora
J9VM069=cargando incumplimiento de restricciones\: el cargador "%2$.*1$s@%3$x" ha iniciado la carga previamente para un tipo distinto con el nombre "%5$.*4$s" definido por el cargador "%7$.*6$s@%8$x"
SHRC500=El \u00E1rea de depuraci\u00F3n est\u00E1 corrupta porque la direcci\u00F3n baja del espacio libre %p, es mayor que la direcci\u00F3n alta del espacio libre %p
SHRC505=El \u00E1rea de depuraci\u00F3n est\u00E1 corrupta porque la direcci\u00F3n alta del espacio libre %p menos la direcci\u00F3n baja del espacio libre %p sobrepasa el tama\u00F1o de regi\u00F3n de depuraci\u00F3n de %lu bytes
SHRC506=El \u00E1rea de depuraci\u00F3n est\u00E1 corrupta porque su tama\u00F1o %lu es mayor que el tama\u00F1o de memoria cach\u00E9 local de %u almacenado en la cabecera de la memoria cach\u00E9
J9VM090=Respuesta lenta a una consulta de red (%d segundos), compruebe su configuraci\u00F3n IP DNS
SHRC507=Realice comprobaciones adicionales cuando almacene y asigne datos de depuraci\u00F3n de clases
J9VM091=Rotaci\u00F3n adaptativa soportada
SHRC508=Se ha adquirido un sem\u00E1foro distinto del utilizado anteriormente con esta memoria cach\u00E9. antiguo semid\=%d, nuevo semid\=%d
J9VM092=Rotaci\u00F3n adaptativa no soportada
SHRC501=El \u00E1rea de depuraci\u00F3n est\u00E1 corrupta porque la direcci\u00F3n baja de los 'datos de tabla del n\u00FAmero de l\u00EDnea' %p, es mayor que la direcci\u00F3n alta %p
J9VM093=Esta versi\u00F3n de Java precisa de una CPU con soporte para SSE2 o extensiones posteriores.  Consulte la informaci\u00F3n 'Entornos con soporte' en la Gu\u00EDa de usuario de IBM Java para obtener m\u00E1s detalles.
SHRC502=El \u00E1rea de depuraci\u00F3n est\u00E1 corrupta porque la direcci\u00F3n baja de los 'datos de tabla de variable local' %p, es mayor que la direcci\u00F3n alta %p
J9VM094=La hebra "%s" a\u00FAn est\u00E1 activa tras la ejecuci\u00F3n de los enganches de cierre.
SHRC503=El \u00E1rea de depuraci\u00F3n est\u00E1 corrupta porque el almacenamiento de %d bytes de 'tabla de n\u00FAmero de l\u00EDnea' y %d bytes de 'tabla de variable local' tendr\u00E1 como resultado la direcci\u00F3n alta de 'datos de tabla de n\u00FAmero de l\u00EDnea' %p, que ser\u00E1 mayor que la nueva direcci\u00F3n baja %p de 'datos de tabla de variable local'
J9VM095=infracci\u00F3n de restricci\u00F3n de carga al resolver el m\u00E9todo "%2$.*1$s.%4$.*3$s%6$.*5$s" \: el cargador "%8$.*7$s@%9$x" de la clase "%11$.*10$s" y el cargador "%13$.*12$s@%14$x" de la clase "%16$.*15$s" tienen distintos tipos para la firma de m\u00E9todo
SHRC504=El inicio de datos de memoria cach\u00E9 es nulo. inicio de datos\: %p
J9VM096=Se ignora -Xscdmx si no se especifica -Xshareclasses
J9VM097=\nUso\:\n
J9VM098=-Xsyslog\:help              Imprimir la ayuda JVM -Xsyslog.
J9VM099=-Xsyslog\:none              Inhabilitar las opciones de registro de JVM anteriormente especificadas, incluyendo los valores predeterminados.
SHRC509=Crear una memoria cach\u00E9 que sea una generaci\u00F3n anterior a la memoria cach\u00E9 actual.
PORT040=Ha fallado la lectura de HYPFS
PORT044=No se ha podido asignar memoria al recuperar la informaci\u00F3n de hipervisor.
PORT043=%1$d\: No se ha podido recuperar informaci\u00F3n de %2$s.
PORT042=No se puede leer /proc/sysinfo
PORT041=HYPFS no est\u00E1 montado
J9VM080=queryVmDump precisa de %s
J9VM081=Valor de opci\u00F3n mal formado; la opci\u00F3n "%1$s%3$.*2$s" contiene caracteres "%4$s" al final que se han omitido
J9VM082=No se ha podido conmutar al procesador IFA - emitir "extattr +a lib%s.so"
J9VM083=Error al conmutar al procesador IFA; c\u00F3digo de retorno\: %08x
J9VM084=Error de IFA\: c\u00F3digo de retorno inesperado %08x desde el servicio de conmutaci\u00F3n IFA
J9VM085=Opci\u00F3n mal formada\: '%s'
PORT048=No se ha podido crear el volcado del sistema debido a que existe un archivo no regular "%s" con el mismo nombre que el archivo de volcado del sistema esperado
J9VM086=Opci\u00F3n con un valor demasiado grande\: '%s'
PORT047=Memoria intermedia insuficiente al intentar cargar una biblioteca compartida
J9VM087=resetDumpOption precisa de %s
PORT046=El ejecutable no se ha podido abrir
J9VM088=Aviso\: syscorepath no se ha configurado, lo que puede impedir la generaci\u00F3n del archivo central del sistema (si hiciera falta).\n\t\tConsulte las instrucciones de instalaci\u00F3n de WebSphere Real Time para ver los valores de configuraci\u00F3n adecuados de syscorepath.\n\t\tNOTA\: syscorepath se debe configurar cada vez que se reinicie la m\u00E1quina.
PORT045=No se ha podido asignar memoria al recuperar la informaci\u00F3n del sistema.
J9VM089=Aviso\: no se han podido verificar los valores de syscorepath usando sysconfig\: %s.
SHRC400=Comprimir bytes de memoria cach\u00E9                       %*c\= %d
SHRC401=Comprimir memorias cach\u00E9                         %*c\= %d
SHRC406=direcci\u00F3n de inicio de metadatos              %*c\= 0x%p
SHRC407=distintivos de tiempo de ejecuci\u00F3n                       %*.c\= 0x%.16llX
SHRC408=generaci\u00F3n de memoria cach\u00E9                    %*.c\= %d\n
SHRC409=Bytes de c\u00F3digo AOT                      %*c\= %d
SHRC402=Bytes de datos de JIT                       %*c\= %d
SHRC403=Bytes del \u00E1rea de depuraci\u00F3n de clases utilizados         %*c\= %u
SHRC404=No se ha podido obtener un directorio para la memoria cach\u00E9
SHRC405=No se ha podido crear un directorio para la memoria cach\u00E9
SHRC420=N\u00FAm. de entradas de datos AOT                  %*c\= %d
SHRC421=N\u00FAmero de jerarqu\u00EDa de clases de AOT               %*c\= %d
SHRC422=N\u00FAm. de Thunks AOT                       %*c\= %d
SHRC423=N\u00FAm. de sugerencias de JIT                         %*c\= %d
SHRC428=Se ha eliminado la generaci\u00F3n anterior de memoria cach\u00E9 de clase compartida "%s"
SHRC429=No se ha podido eliminar la generaci\u00F3n anterior de memoria cach\u00E9 de clase compartida "%s"
SHRC424=N\u00FAm. de perfiles de JIT                      %*c\= %d
SHRC425=N\u00FAmero de Java Objects                      %*c\= %d
SHRC426=N\u00FAm. de entradas de JCL                       %*c\= %d
SHRC427=El modificador utilizado para imprimir las estad\u00EDsticas detalladas de la memoria cach\u00E9
SHRC410=Bytes de datos de AOT                      %*c\= %d
SHRC411=Bytes de jerarqu\u00EDa de clases de AOT           %*c\= %d
SHRC412=Bytes thunk de AOT                     %*c\= %d
SHRC417=Bytes de datos de JCL                      %*c\= %d
SHRC418=Bytes de datos de Byte                       %*c\= %d
SHRC419=Bytes de clase LocalVariableTable      %*c\= %u
SHRC413=Bytes de sugerencia de JIT                      %*c\= %d
SHRC414=Bytes de perfil de JIT                    %*c\= %d
SHRC415=Bytes de Java Object                   %*c\= %d
SHRC416=Bytes de ReadWrite                     %*c\= %d
SHRC442=La memoria cach\u00E9 compartida "%s" est\u00E1 da\u00F1ada. El c\u00F3digo de corrupci\u00F3n es %d. El valor da\u00F1ado es 0x%p. No se permitir\u00E1 que nuevas JVM conecten con la memoria cach\u00E9.\n \tLas JVM pueden continuar funcionando, pero no es posible actualizar la memoria cach\u00E9.
SHRC443=La CRC de la memoria cach\u00E9 no es correcta al indicar una memoria cach\u00E9 corrupta. CRC de memoria cach\u00E9 incorrecta\: 0x%x.
SHRC444=Se han le\u00EDdo datos da\u00F1ados para la cabecera de entrada de la memoria cach\u00E9 0x%p (longitud de elemento no v\u00E1lida)
SHRC445=El tama\u00F1o de la memoria cach\u00E9 es demasiado peque\u00F1o para ser \u00FAtil. Tama\u00F1o de memoria cach\u00E9 no v\u00E1lido\: 0x%x.
SHRC440=El valor -XscminJIT no debe ser superior que el valor -Xscmx, por lo que se ha establecido en igual al valor de -Xscmx
SHRC441=El valor de -XscmaxJIT es mayor que el valor de -Xscmx, por lo que se ha establecido en ilimitado
SHRC446=No se ha podido adquirir el bloqueo de escritura de cabecera durante el inicio de la memoria cach\u00E9 con el c\u00F3digo de error\: %d.
SHRC447=El punto de atenci\u00F3n de la cabecera de la memoria cach\u00E9 no es v\u00E1lido. Direcci\u00F3n de la serie del punto de atenci\u00F3n en la cabecera de la memoria cach\u00E9\: 0x%p.
SHRC448=El campo del tama\u00F1o de memoria cach\u00E9 en la cabecera de la memoria cach\u00E9 no es v\u00E1lido. El tama\u00F1o de memoria cach\u00E9 en la cabecera de la memoria cach\u00E9 es\: 0x%x.
SHRC449=El relleno no es cero. Los bytes de relleno en la cabecera de la memoria cach\u00E9 son\: %u.
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC432=\ Firma\: %2$.*1$s Direcci\u00F3n\: 0x%3$p
SHRC433=\tpara ROMClass %2$.*1$s en 0x%3$p.
SHRC434=El valor\=%d pasado por la opci\u00F3n -Xitsn est\u00E1 fuera del rango de valores de n\u00FAmeros primos soportados por la m\u00E1quina virtual. Rango soportado \= 0 - %u
SHRC430=No se ha podido eliminar la generaci\u00F3n actual de memoria cach\u00E9 de clase compartida "%s"
SHRC439=El valor -XscminJIT no debe ser superior que el valor de -XscmaxJIT
SHRC435=-Xitsn%2$u utiliza %1$u bytes de memoria, la cual es m\u00E1s grande que el tama\u00F1o de memoria cach\u00E9 de las clases compartidas de %3$u bytes
SHRC436=Error al adquirir bloqueo de escritura de cabecera de archivo de memoria cach\u00E9 de clases compartidas
SHRC437=Error al liberar el bloqueo de lectura de cabecera de archivo de memoria cach\u00E9 de clases compartidas
SHRC438=Inhabilitar almacenamiento de datos JIT en memoria cach\u00E9 compartida
JNCK101=Error de JNI en %1$s\: El argumento \#%2$d se espera que sea est\u00E1tico, pero se ha pasado un ID de campo no est\u00E1tico a JNI
JNCK102=Error de JNI en %1$s\: El argumento \#%2$d se espera que no sea est\u00E1tico, pero se ha pasado un ID de campo est\u00E1tico a JNI
JNCK100=Consejo de JNI en %1$s\: No se puede utilizar esta funci\u00F3n con objetos empaquetados. Utilice %2$s
SHRC464=Habilitar salida detallada de datos de JIT
SHRC465=[salida detallada de datos -Xshareclasses habilitada]
SHRC466=Se han encontrado %1$s datos adjuntos para %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC467=No se han podido encontrar %1$s datos adjuntos para %8$.*7$s.%4$.*3$s.%6$.*5$s, raz\u00F3n\: %2$s
SHRC460=Inhabilitar almacenamiento de datos JIT en memoria cach\u00E9 compartida
SHRC461=El valor de -Xscminjitdata no debe ser superior que el valor de -Xscmaxjitdata
SHRC462=El valor -Xscminjitdata es superior que el valor -Xscmx, por lo que se ha establecido en igual al valor -Xscmx
SHRC463=El valor -Xscmaxjitdata es mayor que el valor -Xscmx, por lo que se ha establecido en ilimitado
SHRC468=Se han almacenado %1$s datos adjuntos para %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC469=No se han podido almacenar 1$s datos adjuntos para %8$.*7$s.%4$.*3$s%6$.*5$s, raz\u00F3n\: %2$s
J9GC084=La resoluci\u00F3n del reloj del SO reclama no soportar el tiempo de pausa de destino solicitado.  Sobreecritura debido a la opci\u00F3n de l\u00EDnea de mandatos -Xgc\:overrideHiresTimerCheck
J9GC083=No se ha podido inicializar, la opci\u00F3n de inquilinos m\u00FAltiples s\u00F3lo da soporte a -Xgcpolicy\:balanced
J9GC086=No se han podido crear la instancia de metadatos de referencias comprimidas; se solicita %1$zu%2$s
J9GC085=tama\u00F1o inicial de metadatos de referencias comprimidas
J9GC088=El tama\u00F1o de p\u00E1gina de objectheap solicitado %1$zu%2$s no se ha podido satisfacer; se utiliza %3$zu%4$s en su lugar
J9GC087=No se puede satisfacer el tama\u00F1o de pila %1$zu%2$s con el tama\u00F1o de p\u00E1gina%3$zu%4$s. El tama\u00F1o de pila se puede especificar con -Xmx
J9GC089=La opci\u00F3n -Xgc\:preferredHeapBase no est\u00E1 soportada en z/OS.
SHRC453=Enumerar todos los elementos en la memoria cach\u00E9, incluidas las clases hu\u00E9rfanas
SHRC454=Inhabilitar la verificaci\u00F3n si el id de sem\u00E1foro de SysV actual es el mismo que el id de sem\u00E1foro de SysV en memoria cach\u00E9
SHRC455=Forzar la verificaci\u00F3n de la tabla de series en el inicio
SHRC456=Forzar el descubrimiento de un cambio en el ID de compilaci\u00F3n de VM
SHRC450=El campo de longitud de datos en la cabecera de la memoria cach\u00E9 no es v\u00E1lido. La longitud de datos en la cabecera de la memoria cach\u00E9 es\: %u.
SHRC451=El campo de inicio de datos en la cabecera de la memoria cach\u00E9 no es v\u00E1lido. La direcci\u00F3n de inicio de datos en la cabecera de la memoria cach\u00E9 es\: 0x%p.
SHRC452=Inhabilitar protecci\u00F3n de memoria del \u00E1rea de lectura/escritura (tabla de series)
SHRC457=Nombre de memoria cach\u00E9 no v\u00E1lido, el nombre de memoria cach\u00E9 "%.*s" s\u00F3lo contiene espacios en blanco o est\u00E1 vac\u00EDo
SHRC458=Inhabilita el uso compartido de clases sin inhabilitar las API del programa de utilidad
SHRC459=Inhabilita el uso compartido de clases y las API del programa de utilidad
SHRC480=demasiadas actualizaciones durante la lectura
SHRC481=la memoria cach\u00E9 est\u00E1 da\u00F1ada
J9GC071=El valor para '%s' no es correcto
J9GC070=No se ha podido iniciar el recopilador de basura
SHRC002=en uso
SHRC486=Espacio reservado para bytes de datos JIT  %*c\= %d
SHRC003=hora en que se desconect\u00F3 la \u00FAltima vez
SHRC487=Espacio m\u00E1ximo para bytes de datos JIT %*c\= %d
SHRC004=No es posible destruir la memoria cach\u00E9 "%s"
SHRC488=El total de los valores -Xscminaot y -Xscminjitdata no puede ser mayor que el tama\u00F1o de memoria cach\u00E9 disponible
SHRC005=No hay memorias cach\u00E9 de clases compartidas disponibles.
SHRC489=Si la memoria cach\u00E9 abierta est\u00E1 marcada como corrupta, active un suceso de volcado de memoria cach\u00E9
SHRC482=la direcci\u00F3n no est\u00E1 en memoria cach\u00E9
SHRC483=ha fallado la renovaci\u00F3n de la memoria cach\u00E9
SHRC000=Memoria cach\u00E9 compartida
SHRC484=Espacio reservado para bytes AOT    %*c\= %d
SHRC001=shmid de SO
SHRC485=Espacio m\u00E1ximo para bytes AOT       %*c\= %d
J9GC069=No se ha podido inicializar la hebra finalizada
SHRC006=El n\u00FAmero de memorias cach\u00E9 que han caducado en los \u00FAltimos %1$d minutos es %2$d
SHRC007=No se ha podido eliminar la memoria cach\u00E9 de clases compartidas "%s"
SHRC008=Se ha creado la memoria cach\u00E9 compartida\: %1$s tama\u00F1o\: %2$d bytes
SHRC009=Se ha abierto la memoria cach\u00E9 compartida\: %1$s tama\u00F1o\: %2$d bytes
J9GC062=El valor %s debe ser potencia de 2
J9GC061=tama\u00F1o m\u00E1ximo de espacio de memoria con \u00E1mbito
J9GC064=No se ha podido asignar espacio antiguo
J9GC063=No se ha podido abrir el archivo '%s' para escritura
J9GC066=La divisi\u00F3n necesaria de la geometr\u00EDa de memoria del almacenamiento din\u00E1mico no se ha podido asignar
J9GC065=No se ha podido asignar espacio nuevo
J9GC068=ScopedMemory.join/joinAndEnter interrumpido
J9GC067=No se ha podido crear una instancia del almacenamiento din\u00E1mico de divisi\u00F3n\: %1$s (tama\u00F1o nuevo %2$zu%3$s, tama\u00F1o antiguo %4$zu%5$s)
SHRC470=Se han actualizado %1$s datos adjuntos para %7$.*6$s.%3$.*2$s%5$.*4$s
J9GC080=La configuraci\u00F3n del sistema no admite el par\u00E1metro '%.*s' en la opci\u00F3n '-Xlp'
J9GC082=La solicitud de %1$s para el tama\u00F1o de p\u00E1gina %2$zu%3$s%4$s no es un tama\u00F1o de p\u00E1gina compatible; se utiliza %5$zu%6$s%7$s en su lugar
J9GC081=Se ignoran los caracteres de coma adicionales descubiertos en la opci\u00F3n '- Xlp'
SHRC475=no existen datos
SHRC476=los datos ya existen
SHRC477=no hay espacio en la memoria cach\u00E9 para %d bytes
SHRC478=tama\u00F1o de datos %d m\u00E1s grande que %d disponible
SHRC471=No se han podido actualizar %1$s datos adjuntos para %8$.*7$s.%4$.*3$s%6$.*5$s, raz\u00F3n\:%2$s
SHRC472=no hay acceso al recurso
SHRC473=enterWriteMutex ha fallado
SHRC474=enterReadMutex ha fallado
SHRC479=ha fallado la asignaci\u00F3n de memoria de %d bytes
J9GC073=El tama\u00F1o de p\u00E1gina grande %1$zu%2$s %3$s no es un tama\u00F1o de p\u00E1gina compatible; se utiliza %4$zu%5$s en su lugar
J9GC072=El tama\u00F1o de p\u00E1gina grande %1$zu%2$s no es un tama\u00F1o de p\u00E1gina compatible; se utiliza %3$zu%4$s %5$s en su lugar
J9GC075=Se ha producido un error al analizar la opci\u00F3n '-Xlp'
J9GC074=El tama\u00F1o de p\u00E1gina grande %1$zu%2$s %3$s no es un tama\u00F1o de p\u00E1gina compatible; se utiliza %4$zu%5$s %6$s en su lugar
J9GC077=La configuraci\u00F3n del sistema no admite el tama\u00F1o de p\u00E1gina grande %1$zu%2$s %3$s solicitado
J9GC076=La configuraci\u00F3n del sistema no admite el tama\u00F1o de p\u00E1gina grande %1$zu%2$s solicitado
J9GC079=La opci\u00F3n '%1$s' no est\u00E1 completa, debe especificar el par\u00E1metro '%2$s'.
J9GC078='%1$s' no est\u00E1 especificado como primer par\u00E1metro en la opci\u00F3n '%2$s'
SHRC024=error de desconexi\u00F3n de memoria compartida
SHRC025=error al conectar la memoria compartida
SHRC026=No se puede crear la memoria cach\u00E9 del tama\u00F1o solicitado\: compruebe los valores de SHMMAX y SHMMIN
SHRC027=El nombre de la memoria cach\u00E9 compartida es demasiado largo
SHRC020=Se ha producido un error al abrir el sem\u00E1foro
SHRC021=Se ha devuelto un c\u00F3digo de error desconocido
SHRC022=Error al crear la regi\u00F3n de memoria compartida
SHRC023=No existe la memoria cach\u00E9
J9GC048=incremento de espacio antiguo
J9GC047=tama\u00F1o de espacio antiguo m\u00E1ximo
J9GC049=tama\u00F1o recordado del conjunto
SHRC028=Permiso denegado
SHRC029=No queda memoria suficiente en el sistema
J9GC040=Opci\u00F3n desconocida\: %s
J9GC042=La suma de %1$s y %2$s es demasiado peque\u00F1a para %3$s
J9GC041=Tipo fvtest desconocido\: %s
J9GC044=tama\u00F1o de espacio nuevo m\u00E1ximo
J9GC043=tama\u00F1o de espacio nuevo inicial
J9GC046=tama\u00F1o de espacio antiguo inicial
J9GC045=tama\u00F1o de memoria inicial
SHRC490=Forzar el descubrimiento de una memoria cach\u00E9 de clases compartidas corrupta
SHRC491=No se han podido almacenar %1$s datos adjuntos para %8$.*7$s.%4$.*3$s%6$.*5$s, raz\u00F3n\: %2$s
SHRC492=No se han podido actualizar %1$s datos adjuntos para %8$.*7$s.%4$.*3$s%6$.*5$s, raz\u00F3n\:%2$s
J9GC060=tama\u00F1o de espacio de memoria immortal
SHRC013=La eliminaci\u00F3n de la memoria de la memoria cach\u00E9 compartida "%s" ha fallado
SHRC497=Placeholder, not used
SHRC014=La eliminaci\u00F3n del sem\u00E1foro de memoria cach\u00E9 compartida "%s" ha fallado
SHRC498=Placeholder, not used
SHRC015=Error de memoria cach\u00E9 de clases compartidas\: distintivo no v\u00E1lido
SHRC499=Placeholder, not used
SHRC016=Error de memoria cach\u00E9 de clases compartidas\:
SHRC493=No se han podido encontrar %1$s datos adjuntos para %8$.*7$s.%4$.*3$s.%6$.*5$s, raz\u00F3n\: %2$s
SHRC010=La memoria cach\u00E9 compartida "%s" se ha destruido
SHRC494=No se han podido encontrar los datos adjuntos %1$s para la direcci\u00F3n 0x%2$p, motivo\: %3$s
SHRC011=Error\: no se puede abrir la memoria cach\u00E9 de clases compartidas
SHRC495=No se han podido almacenar los datos adjuntos %1$s para la direcci\u00F3n 0x%2$p, motivo\: %3$s
SHRC012=No es posible eliminar la memoria cach\u00E9 compartida "%s" ya que a\u00FAn hay JVM conectadas a la memoria cach\u00E9
SHRC496=No se han podido actualizar los datos adjuntos %1$s para la direcci\u00F3n 0x%2$p, motivo\: %3$s
J9GC059=-Xgcpolicy\:metronome no est\u00E1 permitido sin -Xrealtime
J9GC058=No se ha podido asignar espacio de memoria inmortal
SHRC017=C\u00F3digo de error\: %d
SHRC018=no se puede asignar memoria
SHRC019=la longitud de la solicitud es demasiado peque\u00F1a
J9GC051=Incremento de segmento de clase RAM
J9GC050=m\u00E1ximo de memoria de software
J9GC053=memoria m\u00E1xima
J9GC052=Incremento de segmento de clase ROM
J9GC055=tama\u00F1o de p\u00E1gina grande
J9GC054=El tama\u00F1o de p\u00E1gina %1$zu%2$s grande no es un tama\u00F1o de p\u00E1gina con soporte; en su lugar se usar\u00E1 %3$zu%4$s
J9GC057=%1$s no debe ser mayor que %2$s
J9GC056=tipos de p\u00E1gina grande disponibles\:
SHRC040=Especificar el nombre de la memoria cach\u00E9 compartida
SHRC041=Destruir la memoria cach\u00E9 compartida (utilizar el par\u00E1metro name o el valor predeterminado)
SHRC046=Mostrar todas las memorias cach\u00E9 compartidas y sus estad\u00EDsticas
SHRC047=Imprimir resumen de estad\u00EDsticas de memoria cach\u00E9
SHRC048=Enumerar todos los elementos que se encuentran en memoria cach\u00E9
SHRC049=Modalidad de depuraci\u00F3n que comprueba todo el c\u00F3digo de bytes de entrada
SHRC042=Destruir todas las memorias cach\u00E9 compartidas
SHRC043=Habilitar la compartici\u00F3n de c\u00F3digo de bytes modificado\n \t<contextoMod> es el descriptor-usuario que describe el tipo de modificaci\u00F3n\n \tLas JVM que utilizan el mismo <contextoMod> deben utilizar las mismas modificaciones
SHRC044=OPTION_MODIFIED_EQUALS"<contextoMod>"
SHRC045=Destruir las memorias cach\u00E9 que han estado sin utilizarse durante <t> minutos
J9GC026=-Xverbosegclog no ha podido asignar estructuras internas
J9GC025=Suma de %1$s y %2$s
J9GC028=Opci\u00F3n con un valor demasiado grande\: '%s'
J9GC027=Opci\u00F3n mal formada\: '%s'
J9GC029=Error de opci\u00F3n\: '%s'
J9GC020=%s demasiado grande para almacenamiento din\u00E1mico
J9GC022=La suma de %1$s y %2$s es demasiado grande para %3$s
J9GC021=%1$s no debe ser igual que %2$s
J9GC024=La suma de %1$s y %2$s es demasiado grande para el almacenamiento din\u00E1mico
J9GC023=La suma de %1$s y %2$s debe ser igual que %3$s
SHRC030=La cabecera de la memoria cach\u00E9 de clases compartidas que est\u00E1 adjuntando no es correcta.
SHRC035=Se ha inhabilitado el almacenamiento en memoria cach\u00E9 local de v\u00EDas de acceso de clases
SHRC036=Se ha inhabilitado la reducci\u00F3n de contenci\u00F3n de almacenamiento concurrente
SHRC037=Se han inhabilitado las actualizaciones incrementales
SHRC038=Uso\:\n\njava -Xshareclasses[\:opci\u00F3n,...]\n\n Las opciones v\u00E1lidas incluidas (con un breve resumen) son\:\n\n
SHRC031=La memoria cach\u00E9 de clases compartidas que est\u00E1 conectando tiene una versi\u00F3n de JVM incompatible.
SHRC032=La memoria cach\u00E9 de clases compartidas que est\u00E1 conectando tiene un nivel de modificaci\u00F3n incorrecto.
SHRC033=Se ha inhabilitado el bloqueo de tablas hash locales
SHRC034=Se ha inhabilitado la comprobaci\u00F3n de indicaciones de fecha y hora
J9GC037=%1$s no tiene soporte con valores distintos a %2$zu
J9GC036=El valor %1$s debe ser superior a %2$zu
J9GC039=%1$s est\u00E1 en desuso; utilice %2$s en su lugar
J9GC038=El valor de %s especificado es demasiado elevado
SHRC039=Imprimir ayuda compartida general
J9GC031=No se puede especificar %1$s y %2$s a la vez
J9GC030=El valor %1$s de %2$.2f debe ser al menos %3$s inferior que el valor %4$s de %5$.2f
J9GC033=El valor %1$s debe estar entre %2$.2f y %3$.2f (inclusive)
J9GC032=La configuraci\u00F3n del sistema no admite la opci\u00F3n '%s'
J9GC035=%s debe ir seguido de un n\u00FAmero
J9GC034=El valor de %1$s debe estar entre %2$zu y %3$zu (inclusive)
SHRC060=No se puede asignar memoria para el almacenamiento intermedio de serie en shrinit\:\:hookFindSharedClass
SHRC061=El nombre de memoria cach\u00E9 no debe tener m\u00E1s de 64 caracteres. No se ha creado la memoria cach\u00E9.
SHRC062=Error al copiar nombre de usuario en el nombre de memoria cach\u00E9 predeterminado
SHRC063=No se puede asignar memoria para sharedClassConfig en shrinit
SHRC068=Se ha inhabilitado el almacenamiento en memoria cach\u00E9 local de v\u00EDas de acceso de clases
SHRC069=Se ha inhabilitado la reducci\u00F3n de contenci\u00F3n de almacenamiento concurrente
SHRC064=No se ha podido crear configMonitor en shrinit
SHRC065=No se puede asignar agrupaci\u00F3n en shrinit
SHRC066=Se ha inhabilitado el bloqueo de tablas hash locales
SHRC067=Se ha inhabilitado la comprobaci\u00F3n de indicaciones de fecha y hora
J9GC004=No se ha podido crear una instancia de recolector de basura global
J9GC003=No se ha podido crear una instancia de asignador de tareas
J9GC006=No se ha podido inicializar; memoria agotada
J9GC005=No se ha podido inicializar
J9GC008=No se han podido inicializar las extensiones de m\u00F3dulo
J9GC007=No se ha podido inicializar; imposible analizar la l\u00EDnea de mandatos
J9GC009=No se ha podido inicializar el mutex para estad\u00EDsticas GC
J9GC000=Error interno; memoria agotada
J9GC002=No se ha podido crear una instancia del almacenamiento din\u00E1mico; %1$zu%2$s solicitado
J9GC001=No se ha podido crear una instancia de almacenamiento din\u00E1mico
SHRC050=Habilitar salida detallada
SHRC051=Desconectar actualizaciones din\u00E1micas
SHRC052=Inhabilitar almacenamiento en memoria cach\u00E9 local de v\u00EDas de acceso de clases
SHRC057=Par\u00E1metros incorrectos para opci\u00F3n expire
SHRC058=No se puede asignar memoria para ClasspathItem en shrinit\:\:hookStoreSharedClass
SHRC059=No se puede asignar memoria para ClasspathItem en shrinit\:\:hookFindSharedClass
SHRC053=Inhabilitar bloqueo de tabla hash local
SHRC054=Inhabilitar algoritmo para reducir la contenci\u00F3n de almacenes
SHRC055=Inhabilitar actualizaciones de memoria cach\u00E9 incrementales
SHRC056=Opci\u00F3n de l\u00EDnea de mandatos "%s" no reconocida
J9GC015=No se ha podido asignar espacio de memoria predeterminado
J9GC014=No se han podido asignar segmentos de memoria de clases de m\u00E1quina virtual
J9GC017=%1$s es demasiado peque\u00F1o, al menos debe ser de %2$zu %3$sbytes
J9GC016=No se ha podido asignar el segmento superviviente en el espacio de memoria predeterminado
J9GC019=%1$s demasiado grande para %2$s
J9GC018=%1$s demasiado peque\u00F1o para %2$s
J9GC011=No se ha podido inicializar la agrupaci\u00F3n de espacios de memoria
J9GC010=No se ha podido inicializar la gesti\u00F3n de finalizaci\u00F3n
J9GC013=No se han podido asignar segmentos de memoria de objetos de m\u00E1quina virtual
J9GC012=No se han podido asignar segmentos de memoria de m\u00E1quina virtual
