#Thu Jan 21 02:08:20 CST 2021
EXEL070=Slika ROM je napa\u010Dne razli\u010Dice
EXEL079=\  -Xscmx<x>       nastavi velikost novega predpomnilnika razredov v skupni rabi na <x>
J9VM151=Knji\u017Enice jimage ni mogo\u010De odpreti
J9VM150=-Xscsoftmx se prezre, \u010De -Xshareclasses ni podan
J9VM153=Preklop na notranji bralnik jimage, ker JVM ne more uporabiti knji\u017Enice jimage
EXEL071=Iskanje glavnega imena razreda ni uspelo
J9VM152=Simbola %s ni bilo mogo\u010De najti v knji\u017Enici jimage
EXEL072=Zagonska napaka VM\: Zmanjkalo je pomnilnika
J9VM155=Neveljavna vrednost za -Xpatch; pot do popravka ni podana v lastnosti %s\=%s
EXEL073=Notranja napaka VM\: Izdelava Java VM ni uspela
J9VM154=Neveljavna vrednost za -Xpatch; vrednost lastnosti %s ni podana
EXEL074=
J9VM157=Razred %2$.*1$s(%3$s) ne more dostopati do razreda %5$.*4$s(%6$s), ker modul %3$s ne prebere modula %6$s
EXEL075=\  -Xquickstart    izbolj\u0161anje zagonskega \u010Dasa z zakasnitvijo optimizacij
J9VM156=-XX\:SharedCacheHardLimit\= se prezre, \u010De -Xshareclasses ni podan
EXEL076=JIT  \u2013 %s\n
J9VM159=Napaka\: %s zahteva, da se poda pot do modula
EXEL077=\  -Xssi<x>        nastavi prirastek javanskega nitnega sklada na <x>
J9VM158=Razred %2$.*1$s(%3$s) ne more dostopiti do razreda %5$.*4$s(%6$s), ker modul %6$s ne izvozi paketa %7$s v modul %3$s
EXEL078=\  -Xshareclasses[\:options]  Omogo\u010Di podatke razreda v skupni rabi (za podrobnosti uporabite pomo\u010D)\n
J9VM149=Funkcija %s ni ve\u010D podprta. V pot razreda dodajte zahtevane knji\u017Enice/datoteke jar.
EXEL068=Notranja napaka VM\: Nastavitev elementa polja za %s ni uspela
EXEL069=Iskanje slike ROM ni uspelo
J9VM140=Kli\u010Do\u010Di ni anotiran kot @sun.reflect.CallerSensitive.
J9VM142=Mo\u017Enost ukazne vrstice -Xrealtime v tej razli\u010Dici IBM SDK-ja ni podprta
EXEL060=Notranja napaka VM\: Izdelava polja bajtov za ime razreda %s ni uspela
J9VM141=neskladne privzete metode za '%2$.*1$s%4$.*3$s' v %6$.*5$s iz razredov [%7$s]
EXEL061=Notranja napaka VM\: Izdelava java/lang/String za ime razreda %s ni uspela
J9VM144=preve\u010D parametrov\: 255 + 1
EXEL062=Notranja napaka VM\: pri pretvarjanju niza v znake UTF za ime razreda %s je zmanjkalo pomnilnika.
J9VM143=Mo\u017Enost ukazne vrstice %s v tej razli\u010Dici IBM SDK-ja ni podprta
EXEL063=Razred %s ne implementira main()
J9VM146=invokeinterface nejavne metode '%4$.*3$s%6$.*5$s' v %2$.*1$s
EXEL064=Metoda main mora biti priznana za javno, stati\u010Dno in neveljavno.
J9VM145=Mo\u017Enost %s ni podprta v sistemu z/OS.
EXEL065=Notranja napaka VM\: Izdelava polja argumentov ni uspela
J9VM148=Funkcija %s ni ve\u010D podprta. Mehanizem za preglasitev podprtih standardov je podprt le prek nadgradljivih modulov.
EXEL066=Notranja napaka VM\: Izdelava polja bajtov za argument %s ni uspela
J9VM147=Trenutne niti ni mogo\u010De priklju\u010Diti
EXEL067=Notranja napaka VM\: Izdelava java/lang/String za argument %s ni uspela
SMAP000=
EXEL090=\  -Xscmaxaot<x>   nastavi najve\u010Dji prostor predpomnilnika razreda v skupni rabi, dovoljenega za podatke AOT, na <x>
EXEL091=\n  -Xcheck[\:option[\:...]]  preverjanje krmilnih elementov; za podrobnosti vnesite -Xcheck\:help
EXEL092=\n  -Xdump[\:option,...]  izpisi krmilnih elementov; ve\u010D podrobnosti poi\u0161\u010Dite s -Xdump\:help
SMAP004=
SMAP003=
SMAP002=
SMAP001=
SMAP005=
J9VM171=Poskus nastavljanja kon\u010Dnega polja primerka %2$.*1$s.%4$.*3$s iz metode "%6$.*5$s", ki ni <init>
J9VM170=Poskus nastavljanja stati\u010Dnega kon\u010Dnega polja %2$.*1$s.%4$.*3$s iz metode "%6$.*5$s", ki ni <clinit>
J9VM173=Razred %2$.*1$s in njegov ugnezdeni gostitelj %4$.*3$s morata imeti isti paket.
J9VM172=Razred %2$.*1$s in njegov ugnezdeni gostitelj %4$.*3$s morata imeti isti nalagalnik razredov.
J9VM175=Nalaganje knji\u017Enice %1$s, ki jo potrebuje modul\: %2$s, ni uspelo
EXEL093=Naslednje mo\u017Enosti nadzirajo globalno konfiguracijo navideznega ra\u010Dunalnika\:
J9VM174=Razred %2$.*1$s mora zahtevati njegov ugnezdeni gostitelj %4$.*3$s
EXEL094=\  -Xcompressedrefs              uporabi stisnjene sklice kopice
J9VM177=Razred %2$.*1$s mora imeti zmo\u017Enost nalaganja svojega ugnezdenega gostitelja %4$.*3$s.
EXEL095=\  -Xrealtime                    omogo\u010Di pripone realtime
J9VM176=kr\u0161itev omejitve nalaganja pri pregla\u0161anju metode "%2$.*1$s.%4$.*3$s%6$.*5$s" med ustvarjanjem razreda "%18$.*17$s"\: nalagalnik "%8$.*7$s@%9$x" razreda "%11$.*10$s" in nalagalnik "%13$.*12$s@%14$x" razreda "%16$.*15$s" imata razli\u010Dna tipa za podpis metode
EXEL096=\  -Xgcpolicy\:metronome          omogo\u010Di pripone realtime
J9VM179=Modul nima imena.
EXEL097=\  -Xrealtime                    omogo\u010Di mehak realtime
J9VM178=Modul je ni\u010Deln
EXEL098=\  -Xgcpolicy\:metronome          omogo\u010Di mehak realtime
EXEL099=\  -Xrealtime -Xnortsj           omogo\u010Di mehak realtime
EXEL080=java razli\u010Dice "%s"
EXEL081=java razli\u010Dice "%1$s/%2$s"
J9VM160=Napaka\: %s zahteva, da se poda module
J9VM162=\tat %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s)
J9VM161=\tat %2$.*1$s.%4$.*3$s (%5$s@%6$s/%8$.*7$s\:%9$u)
J9VM164=\tat %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s)
EXEL082=\  -Xlp<x>         nastavi veliko velikost strani na <x>
J9VM163=\tat %2$.*1$s.%4$.*3$s (%5$s/%7$.*6$s\:%8$u)
EXEL083=Ni mogo\u010De odpreti datoteke\: %s
J9VM166=\tat %2$.*1$s.%4$.*3$s (%5$.*6$s)
EXEL084=Varnostne kopije datoteke ni bilo mogo\u010De izdelati\: %s
J9VM165=\tat %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
EXEL085=\nOPOZORILO\: Argument "%s" ukazne vrstice je odklonjen.\nOPOZORILO\: Raje uporabite "-jxe <path>."\n
J9VM168=
EXEL086=\n  -Xtrace[\:option,...]  sledenje krmilnim elementom; ve\u010D podrobnosti poi\u0161\u010Dite s -Xtrace\:help
J9VM167=Optimizacije GC v mirujo\u010Dem stanju niso podprte
EXEL087=\  -Xjni\:<options>               nastavi mo\u017Enosti JNI
EXEL088=
J9VM169=
EXEL089=\  -Xscminaot<x>   nastavi najmanj\u0161i prostor predpomnilnika razreda v skupni rabi, rezerviranega za podatke AOT, na <x>
J9VM117=-Xitsn se prezre, \u010De -Xshareclasses ni podan
J9VM116=noLockword\:%.*s
J9VM119=-Xscmaxjit se prezre, \u010De -Xshareclasses ni podan
J9VM118=-Xscminjit se prezre, \u010De -Xshareclasses ni podan
J9VM111=Podana je neveljavna mo\u017Enost besede za zaklep\:%s
J9VM110=Podan je neveljaven na\u010Din besede za zaklep\:%s
J9VM113=-----------------------------
J9VM112=Konfiguracija besede za zaklep
J9VM115=lockword\:%.*s
J9VM114=Na\u010Din besede za zaklep\=%s
J9VM106=Mo\u017Enosti info, warn, error, vital in config je mogo\u010De kombinirati z ',', na primer\:\n
J9VM105=-Xsyslog\:config            Bele\u017Ei konfiguracijska sporo\u010Dila JVM. \n
J9VM108=-Xsyslog\:info,warn,error\n
J9VM107=-Xsyslog\:error,warn
J9VM109=Nepodprt operacijski sistem (%s)\: Zahtevan je Windows XP ali novej\u0161i.
J9VM100=-Xsyslog\:all               Bele\u017Ei vsa sporo\u010Dila JVM.
J9VM102=-Xsyslog\:warn              Bele\u017Ei opozorilna sporo\u010Dila JVM.
J9VM101=-Xsyslog\:info              Bele\u017Ei informativna sporo\u010Dila JVM.
J9VM104=-Xsyslog\:vital             Bele\u017Ei klju\u010Dna sporo\u010Dila JVM. Privzeto je to vklopljeno.
J9VM103=-Xsyslog\:error             Bele\u017Ei sporo\u010Dila o napakah JVM. Privzeto je to vklopljeno.
J9VM139=
J9VM138=
J9VM131=Ustavljanje procesa s CEE3AB2() s prekinitvijo %1$u, vzrok %2$u, \u010Di\u0161\u010Denje %3$u.
J9VM130=Aplikacija se izvaja naprej po obravnavi nepopravljivega stanja in se je neveljavno vrnila v Javo oziroma je bila poklicana vanjo (koda JIT'ed)
J9VM133=Omejitev ulimit velikosti sistemskega jedra je nastavljena na %d, izpisi pomnilnika sistema bodo morda skraj\u0161ani.
J9VM132=Podan je neveljaven na\u010Din besede za zaklep, java/lang/Class in java/lang/String ne smeta vsebovati besed za zaklep, ko je prisoten -Xtenant\: %s
J9VM135=/proc/sys/kernel/core_pattern "%s" podaja, da bodo izpisi jedra medpomnilni\u0161ko obdelani v zunanjem programu. JVM morda ne bo mogel najti izpisov jedra in jih preimenovati.
J9VM134=Mo\u017Enost celotnega sistemskega jedra je nastavljena na FALSE, izpisi pomnilnika sistema bodo morda skraj\u0161ani.
J9VM137=privzete vrednosti razreda %2$.*1$s so v navzkri\u017Eju za metodo %4$.*3$s%6$.*5$s
J9VM136=/proc/sys/kernel/core_pattern "%s" podaja formatni niz za preimenovanje izpisov jedra. JVM morda ne bo mogel najti izpisov jedra in jih preimenovati.
J9VM128=Prostor kopice Java
J9VM127=Za\u010Detna velikost 32-bitnega poddodelilnika ne more biti nastavljena na ni\u010D.
J9VM129=Aplikacija se izvaja naprej po obravnavi nepopravljivega stanja in se je neveljavno vrnila v Javo oziroma je bila poklicana vanjo
J9VM120=-Xscminjitdata se prezre, \u010De -Xshareclasses ni podan
J9VM122=Pridobivanje obmo\u010Dja naslovov user32.dll, potrebnega za -Xprotectcontiguous, ni uspelo.
J9VM121=-Xscmaxjitdata se prezre, \u010De -Xshareclasses ni podan
J9VM124=Ni mogo\u010De definirati razreda %.*s \u2013 '%.*s' je za\u0161\u010Diten sistemski paket
J9VM123=Poskus izvajanja na nepodprtem procesorju, JVM se bo zaustavil.
J9VM126=Velikost odobritve 32-bitnega poddodelilnika ne more biti nastavljena na ni\u010D.
J9VM125=Velikost odobritve 32-bitnega poddodelilnika je ve\u010Dja od za\u010Detne velikosti. Velikost odobritve \= %1$u, za\u010Detna velikost \= %2$u.
SHRC802=Predpomnilnik je poln za %1$d%% mehke zgornje meje\n
SHRC803=Ob zagonu omogo\u010Di za\u0161\u010Dito pomnilnika delno zapolnjenih strani.
SHRC804=JVM je omogo\u010Dil delno za\u0161\u010Dito strani predpomnilnika v skupni rabi ob zagonu, ker je bila ob ustvarjanju obstoje\u010Dega predpomnilnika v skupni rabi omogo\u010Dena delna za\u0161\u010Dita strani ob zagonu.
SHRC805=JVM ob zagonu ni omogo\u010Dil za\u0161\u010Dite delno zapolnjenih strani predpomnilnika v skupni rabi.
SHRC800=Predpomnilnik v skupni rabi je poln. Najmanj\u0161ega rezerviranega in najve\u010Djega dovoljenega prostora za podatke AOT/JIT ter omejitve za softmx ni ve\u010D mogo\u010De prilagoditi.
SHRC801=bajti za softmx                        %*c\= %d
SHRC806=Stisnjeni trajni predpomnilnik z referencami v skupni rabi "%1$s" je uni\u010Den. \u010Ce \u017Eelite uni\u010Diti nestisnjen predpomnilnik z referencami, uporabite mo\u017Enost -Xnocompressedrefs.
SHRC807=Nestisnjeni trajni predpomnilnik z referencami v skupni rabi "%1$s" je uni\u010Den. \u010Ce \u017Eelite uni\u010Diti stisnjen predpomnilnik z referencami, uporabite mo\u017Enost -Xcompressedrefs.
SHRC808=Stisnjeni predpomnilnik z referencami v skupni rabi "%s" je uni\u010Den. \u010Ce \u017Eelite uni\u010Diti nestisnjen predpomnilnik z referencami, uporabite mo\u017Enost -Xnocompressedrefs.
SHRC809=Nestisnjeni predpomnilnik z referencami v skupni rabi "%s" je uni\u010Den. \u010Ce \u017Eelite uni\u010Diti stisnjen predpomnilnik z referencami, uporabite mo\u017Enost -Xcompressedrefs.
DUMP001=Neprepoznan dogodek izpisa pomnilnika\: ...%s
DUMP000=Neprepoznana mo\u017Enost izpisa pomnilnika\: -Xdump\:%s
DUMP003=Neprepoznan agent izpisa pomnilnika\: %s
DUMP002=Neprepoznan \u017Eeton\: %%%1$c
DUMP012=Napaka v izpisu pomnilnika %1$s\: %2$s
DUMP011=Izpis pomnilnika %1$s je izdelal proces %2$d
DUMP014=Dejanje VM ni prepoznano\: ...%s
DUMP013=Obdelan izpis pomnilnika "%1$s", podrobnost "%3$.*2$s".
DUMP010=Izpis pomnilnika %1$s je bil zapisan v %2$s
SHRC824=STARTUP HINTS DETAIL Oznake\: %1$zu DATA1\: %2$zu DATA2\: %3$zu
DUMP009=Izpis pomnilnika %s ni na voljo
SHRC825=\t startuphint       Natisne samo tipe zagonskih namigov v predpomnilniku v skupni rabi.
DUMP008=uporaba '%s'
SHRC826=Bajti zagonskega namiga                  %*c\= %d
SHRC827=\# Zagonski namigi       %*c\= %d
SHRC820=Onemogo\u010Dite predpomnjenje razredov, nalo\u017Eenih z nalagalnikom razredov samodejnega zagona.
DUMP005=Manjkajo\u010De zunanje orodje
SHRC821=Onemogo\u010Dite predpomnjenje, ki ga nalo\u017Eijo nalagalniki razredov, ki niso bootstrap. Ta mo\u017Enost vrne tudi mo\u017Enost "nonfatal".
DUMP004=Manjkajo\u010De ime datoteke
SHRC822=\u010Ce pride do napake, ne za\u017Eenite predpomnilnika v skupni rabi.
DUMP007=JVM zahteva izpis pomnilnika %1$s s pomo\u010Djo '%2$s'
SHRC823=%1$d\: 0x%2$p STARTUP HINTS KEY\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
DUMP006=Obdelava dogodka izpisa pomnilnika "%1$s", podrobnost "%3$.*2$s" \u2013 prosimo, po\u010Dakajte.
SHRC828=Pot imenika do predpomnilnika v skupni rabi je predolga.
SHRC829=Doma\u010Dega imenika uporabnika ni bilo mogo\u010De uporabiti kot privzetega imenika predpomnilnika v skupni rabi. Doma\u010Dega imenika ni mogo\u010De pridobiti. Nastavite drug imenik prek spremenljivke okolja "HOME" ali mo\u017Enosti ukazne vrstice "cacheDir\=" ali popravite doma\u010Di imenik v vnosu datoteke gesla.
DUMP023=Zahtevana priprava kopice ni bila izvedena, ker izklju\u010Dni dostop ni bil zahtevan oziroma ga ni bilo mogo\u010De pridobiti.
DUMP022=Zahtevano zgo\u0161\u010Devanje kopice ni bilo izvedeno, ker izklju\u010Dni dostop ni bil zahtevan oziroma ga ni bilo mogo\u010De pridobiti.
DUMP025=Napaka IEATDUMP za DSN\='%s' RC\=0x%08X RSN\=0x%08X
DUMP024=Zahtevanih je bilo ve\u010D izpisov pomnilnika kopic, vendar v oznaki datoteke manjka %%id\: izpisi pomnilnika bodo prepisani
DUMP021=Zahtevan izpis pomnilnika kopice ni bil izdelan, ker izklju\u010Dni dostop ni bil zahtevan ali pa ga ni bilo mogo\u010De pridobiti.
DUMP020=Zapisan je bil izpis pomnilnika %s
SHRC813=Skupno \u0161tevilo neshranjenih bajtov zaradi nastavitve -Xscsoftmx je %u. \u0160tevilo neshranjenih bajtov za AOT zaradi nastavitve -Xscmaxaot je %u. Skupno \u0161tevilo neshranjenih bajtov za JIT zaradi nastavitve -Xscmaxjitdata je %u.
SHRC814=\t zastarano               Izpi\u0161e vse zastarane vnose v predpomnilniku v skupni rabi.
DUMP019=JVM zahteva izpis pomnilnika %s
SHRC815=zastarani bajti                         %*c\= %u
SHRC816=Vrednost %s je ve\u010Dja od velikosti predpomnilnika v skupni rabi, zato je bila nastavljena tako, da je enaka velikosti predpomnilnika v skupni rabi.
DUMP016=Prekinjanje\: ni mogo\u010De izdelati datoteke (%s)
SHRC810=Posnetek stisnjenega predpomnilnika z referencami v skupni rabi "%s" je uni\u010Den. \u010Ce \u017Eelite uni\u010Diti posnetek nestisnjenega predpomnilnika z referencami, uporabite mo\u017Enost -Xnocompressedrefs.
DUMP015=Prekinjanje\: ni mogo\u010De odpreti ali brati (%s)
SHRC811=Posnetek nestisnjenega predpomnilnika z referencami v skupni rabi "%s" je uni\u010Den. \u010Ce \u017Eelite uni\u010Diti posnetek stisnjenega predpomnilnika z referencami, uporabite mo\u017Enost -Xcompressedrefs.
DUMP018=Zahtevani dogodek ni na voljo\: zagon z znakom -Xdump\:dynamic
SHRC812=Funkcija                              \= %s
DUMP017=Prekinjanje\: ni mogo\u010De stisniti datoteke (%s)
SHRC817=Vrednost %s je ve\u010Dja od velikosti predpomnilnika v skupni rabi, zato je bila nastavljena na neomejeno vrednost.
SHRC818=Skupno \u0161tevilo neshranjenih bajtov zaradi nastavitve mehke zgornje meje predpomnilnika v skupni rabi je %u. \u0160tevilo neshranjenih bajtov za AOT zaradi nastavitve -Xscmaxaot je %u. Skupno \u0161tevilo neshranjenih bajtov za JIT zaradi nastavitve -Xscmaxjitdata je %u.
SHRC819=Predpomnilnika v skupni rabi ni bilo mogo\u010De zagnati. Obstoje\u010Di predpomnilnik v skupni rabi je bil izdelan z drugo delovno razli\u010Dico navidezne naprave JVM in se ne ujema z navidezno napravo JVM, ki se izvaja.
SHRC840=Predpomnilnika v skupni rabi ni bilo mogo\u010De zagnati.
SHRC841=Podajte \u0161tevilko zgornje plasti. \u010Ce podana plast ne obstaja, ustvarite novo plast predpomnilnika v skupni rabi.
SHRC846=\nTrenutni statisti\u010Dni podatki za zgornjo plast predpomnilnika "%s"\: \n
SHRC847=plast predpomnilnika                         %*.c\= %d
SHRC848=\nTrenutni statisti\u010Dni podatki za vse plasti predpomnilnika "%s"\: \n
J9VM191=%2$.*1$s ni viden
SHRC849=Izpi\u0161e povzetek statisti\u010Dnih podatkov o predpomnilniku samo iz zgornje plasti. Za ogled razpolo\u017Eljivih mo\u017Enosti uporabite printTopLayerStats\=help.
J9VM190=Nadrazred %2$.*1$s ne sme biti vmesnik
SHRC842=Ustvarite novo plast predpomnilnika v skupni rabi.
J9VM193=Ker sta bila Java 13 -Xverify\:none in -noverify opu\u0161\u010Dena, v prihodnosti morda ne bosta ve\u010D na voljo.
SHRC843=Neveljavna \u0161tevilka plasti %d je bila najdena za "%s". \u0160tevilka plastni mora biti manj\u0161a od %d.
J9VM192=%2$.*1$s ni vmesnik
SHRC844=Neveljavna \u0161tevilka plasti %d. Obstoje\u010Da zgornja plast je %d. \u0160tevilka nove plasti mora biti %d.
J9VM195=Paketno polje je ni\u010Delno.
SHRC845=Preden ne ustvarite trajnega predpomnilnika, ne preverjajte nezasedenega prostora na disku.
J9VM194=Neveljavno razmerje nalaganja razreda za podrejenca\: %2$.*1$s, nadrejenec\: %4$.*3$s
J9VM197=%1$s ni podprt z mo\u017Enostjo %2$s.
J9VM196=Paketni niz je ni\u010Deln.
J9VM199=Razred %2$.*1$s nima dovoljenja za dedovanje iz svojega zape\u010Datenega nadvmesnika.
J9VM198=Razred %2$.*1$s nima dovoljenja za dedovanje iz svojega zape\u010Datenega nadrazreda.
SHRC830=Doma\u010Dega imenika uporabnika ni bilo mogo\u010De uporabiti kot privzetega imenika predpomnilnika v skupni rabi. Pot je predolga. Doma\u010Dega imenika ni mogo\u010De pridobiti. Nastavite drug imenik prek spremenljivke okolja "HOME" ali mo\u017Enosti ukazne vrstice "cacheDir\=" ali popravite doma\u010Di imenik v vnosu datoteke gesla.
SHRC835=Preverite \u010Dasovne \u017Eige datotek URL jar/zip, ki niso bootstrap, pri vsakem nalaganju razreda.
SHRC836=Uni\u010Di vse plasti predpomnilnika v skupni rabi z istim imenom (uporabite ime parm ali privzetek)
SHRC837=Deskriptorja predpomnilnika ni mogo\u010De dodeliti
J9VM180=Ime modula ni veljavno.
SHRC838=Predpomnilnika v skupni rabi ni bilo mogo\u010De zagnati. Zaznana je bila sprememba na predpomnilnik v skupni rabi ni\u017Eje plasti. Pri\u010Dakovani unikatni ID predpomnilnika je %s
SHRC831=Doma\u010Dega imenika uporabnika ni bilo mogo\u010De uporabiti kot privzetega imenika predpomnilnika v skupni rabi. Je v omre\u017Enem datote\u010Dnem sistemu. Doma\u010Dega imenika ni mogo\u010De pridobiti. Nastavite drug imenik prek spremenljivke okolja "HOME" ali mo\u017Enosti ukazne vrstice "cacheDir\=" ali popravite doma\u010Di imenik v vnosu datoteke gesla.
J9VM182=Samo nalagalnik razredov samodejnega zagona ali platforme lahko definira paket java ali java.*.
SHRC832=Doma\u010Dega imenika uporabnika ni bilo mogo\u010De uporabiti kot privzetega imenika predpomnilnika v skupni rabi. Koda napake je %1$d.
J9VM181=Samo nalagalnik razredov samodejnega zagona lahko definira java.base modula.
SHRC833=Izvirnega pomnilnika, potrebnega za pridobitev imenika predpomnilnik v skupni rabi, ni mogo\u010De dodeliti.
J9VM184=Neveljaven razred %2$.*1$s\: polje primerka Qtype ni tip vrednosti
SHRC834=Zmanj\u0161ajte preverjanje \u010Dasovnega \u017Eiga v datotekah URL jar/zip.
J9VM183=Ugnezdeni \u010Dlan %2$.*1$s mora imeti zmo\u017Enost nalaganja ugnezdenega gostitelja %4$.*3$s
J9VM186=Neveljaven tip objekta %2$.*1$s\: objekt v skladu ni tip vrednosti
J9VM185=Neveljaven razred %2$.*1$s\: classref ni tip vrednosti
J9VM188=Niti ni bilo mogo\u010De ustvariti\: retVal %1$zd, errno %2$zd (0x%3$zx), errno2 0x%4$x
J9VM187=Neveljaven tip objekta %2$.*1$s\: sinhroniziran objekt je tip vrednosti
SHRC839=Predpomnilnika v skupni rabi ni bilo mogo\u010De zagnati. Pri pridobivanju unikatnega ID-ja za obvezen predpomnilnik ni\u017Eje plasti je pri\u0161lo do napake.
J9VM189=Kon\u010Dni nadrazred %2$.*1$s ni mogo\u010De raz\u0161iriti.
SHRC850=Razpolo\u017Eljive mo\u017Enosti za -Xshareclasses\:%1$s<options>. Z znakom '+' podate ve\u010D mo\u017Enosti. \u010Ce je %2$saot+url \n
SHRC851=Izklopi preverjanje \u010Dasovnega \u017Eiga pri iskanju razredov v predpomnilniku v skupni rabi. Zastareli razredi so morda nalo\u017Eeni iz predpomnilnika v skupni rabi.
SHRC852=Zgornja plast (plast %d) predpomnilnika je uni\u010Dena. Zaznana je bila sprememba na plast %d predpomnilnika v skupni rabi. Pri\u010Dakovani unikatni ID predpomnilnika je %s, trenutni unikatni ID predpomnilnika je %s.
SHRC853=Mo\u017Enosti procesorja                   \= %s
VRFY007=kon\u010Dna metoda je nadome\u0161\u010Dena
VRFY008=indeks matrike ni celo \u0161tevilo
VRFY009=matrika ni zdru\u017Eljiva s tipom
SHRC761=Dovoljenja za skupinski dostop do predpomnilnika v skupni rabi na zahtevo podmo\u017Enosti 'groupAccess' v datoteki posnetka predpomnilnika v skupni rabi ni bilo mogo\u010De nastaviti.
VRFY000=%1$s; razred\=%3$.*2$s, metoda\=%5$.*4$s%7$.*6$s, pc\=%8$u
SHRC762=Napaka pri pridobivanju statistike predpomnilnika razredov v skupni rabi med preverjanjem dovoljenja za skupinski dostop.
VRFY001=%1$s; razred\=%3$.*2$s, metoda\=%5$.*4$s%7$.*6$s
SHRC763=Dol\u017Eina vseh podmo\u017Enosti razredov v skupni rabi ne sme presegati %u znakov.
VRFY002=zaporedje bitne kode ni veljavno
SHRC764=Zahtevanih %1$d bajtov pomnilnika v skupni rabi ni mogo\u010De ustvariti \n \tPrilagojeno na najve\u010Djo dovoljeno velikost pomnilnika v skupni rabi (%2$d bytes) \n \t(\u010Ce \u017Eelite pove\u010Dati pomnilnik v skupni rabi, ki je na voljo, spremenite vrednost sistema SHMMAX) \n \t \u010Ce je uporabljen -Xscdmx, se podro\u010Dje atributov razhro\u0161\u010Devanja sorazmerno prilagodi \n \t glede na svoje izvirno razmerje z vrednostjo -Xscmx.
VRFY003=razred ne vsebuje predpreverjenih podatkov
VRFY004=vstavljanje jsr-ja je odkrilo preve\u010D jsrs-jev
VRFY005=podro\u010Dna nastavitev ni zdru\u017Eljiva s tipom
VRFY006=nova velikost matrike ni celo \u0161tevilo
SHRC760=Dovoljenja za skupinski dostop na zahtevo podmo\u017Enosti 'groupAccess' v krmilni datoteki pomnilnika v skupni rabi, ki je povezan s predpomnilnikom razredov v skupni rabi, ni bilo mogo\u010De nastaviti.
SHRC769=JVM je omogo\u010Dil delno za\u0161\u010Dito strani predpomnilnika v skupni rabi, ker je bila ob ustvarjanju obstoje\u010Dega predpomnilnika v skupni rabi omogo\u010Dena delna za\u0161\u010Dita strani.
SHRC765=Za\u0161\u010Dita pomnilni\u0161ke strani za podatke o izvajanju, podatke za branje/pisanje nizov in delno zapolnjene strani je uspe\u0161no omogo\u010Dena
SHRC766=Za\u0161\u010Dita pomnilni\u0161ke strani za podatke o izvajanju in delno zapolnjene strani je uspe\u0161no omogo\u010Dena
SHRC767=Za\u0161\u010Dita pomnilni\u0161ke strani za podatke o izvajanju in podatke za branje/pisanje nizov je uspe\u0161no omogo\u010Dena
SHRC768=Za\u0161\u010Dita pomnilni\u0161ke strani za podatke o izvajanju je uspe\u0161no omogo\u010Dena
VRFY018=najve\u010Dji sklad je prese\u017Een
VRFY019=nalaganje razreda ni uspelo
VRFY010=ve\u010D jsrs-jev uporablja posamezno vrnitev
SHRC750=Nobena metoda AOT se ne ujema s specifikacijami metod
VRFY011=parameter lookupswitch ni celo \u0161tevilo
SHRC751=Raz\u010Dlemba specifikacij metod ni uspela. Dovoljeno je najve\u010D naslednje \u0161t. specifikacij metod\: %d.
VRFY012=oblika sklada ni skladna po obliki
SHRC752=Raz\u010Dlemba specifikacij metod ni uspela
VRFY013=kr\u0161ena omejitev nalaganja razreda
SHRC753=Pisanje medsebojnega izklju\u010Devanja v predpomnilniku ni uspelo
VRFY014=vrnjena bitna koda ni zdru\u017Eljiva z vrnitvenim tipom
VRFY015=ve\u010D vrnitev v posamezen jsr
VRFY016=parameter bitne kode shift ni celo \u0161tevilo
VRFY017=<init> ne kli\u010De tega <init> ali nad<init>
SHRC758=Dovoljenja za skupinski dostop na zahtevo podmo\u017Enosti 'groupAccess' v pomnilniku v skupni rabi (shmid\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, ni bilo mogo\u010De nastaviti.
SHRC759=Dovoljenja za skupinski dostop na zahtevo podmo\u017Enosti 'groupAccess' v krmilni datoteki, ki je povezana s predpomnilnikom razredov v skupni rabi, ni bilo mogo\u010De nastaviti.
SHRC754=Vnovi\u010Dno ustvarjanje krmilne datoteke skupnega pomnilnika ni dovoljeno.
SHRC755=\t invalidatedaot V skupni predpomnilnik natisne le razveljavljene tipe aot.
SHRC756=Dovoljenja za skupinski dostop do predpomnilnika v skupni rabi na zahtevo podmo\u017Enosti 'groupAccess' ni bilo mogo\u010De nastaviti.
VRFY020=argumenti klica niso zdru\u017Eljivi s tipom
SHRC757=Dovoljenja za skupinski dostop na zahtevo podmo\u017Enosti 'groupAccess' v naboru semaforjev (semid\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, ni bilo mogo\u010De nastaviti.
SHRC783=Najve\u010Dji dovoljeni prostor za podatke JIT ne sme presegati omejitve softmx %u bajtov, ki je nastavljena za uporabo predpomnilnika v skupni rabi.
SHRC300=Predpomnilnik razredov v skupni rabi uporablja drug vm, zato rast ugnezdenega predpomnilnika ni mogo\u010Da
SHRC784=Zahtevanega najmanj\u0161ega rezerviranega prostora za podatke AOT in/ali JIT ni mogo\u010De nastaviti. Velikost omejitve softmx, nastavljena za uporabo pomnilnika v skupni rabi, ali celotna velikost predpomnilnika ni dovolj velika.
SHRC301=Rast ugnezdenega predpomnilnika "%s" ni mogo\u010Da, dodeljevanje novega nadprostora za namige ni uspelo
SHRC785=Najmanj\u0161e rezervirano \u0161tevilo bajtov za AOT je nastavljeno na %d.
SHRC302=Rast ugnezdenega predpomnilnika "%s" ni mogo\u010Da, dodeljevanje bloka za namige ni uspelo
SHRC786=Najve\u010Dje rezervirano \u0161tevilo bajtov za AOT je nastavljeno na %d.
SHRC780=Velikost najve\u010Djega prostora za AOT ne sme biti manj\u0161a od \u0161tevila bajtov AOT (%d), ki so \u017Ee shranjeni v predpomnilniku.
SHRC781=Najve\u010Dji dovoljeni prostor za AOT ne sme presegati omejitve softmx %u bajtov, ki je nastavljena za uporabo predpomnilnika v skupni rabi.
SHRC782=Velikost najve\u010Djega prostora za podatke JIT ne sme biti manj\u0161i od \u0161tevila bajtov JIT (%d), ki so \u017Ee shranjeni v predpomnilniku v skupni rabi.
SHRC307=\tROMMETHOD\: %2$.*1$s Podpis\: %4$.*3$s Naslov\: 0x%5$p
SHRC308=Serializacija predpomnilnika "%s" ni uspela. Napaka pri posodabljanju odmikov razreda ROM v metodah AOT.
SHRC309=Mo\u017Enosti "grow" in "readonly" ne smeta biti uporabljeni skupaj.
SHRC303=Izdelava ugnezdenega predpomnilnika "%s" ni uspela
SHRC787=Najmanj\u0161e rezervirano \u0161tevilo bajtov za podatke JIT je nastavljeno na %d.
SHRC304=Zamenjava predpomnilnika "%s" ni uspela
SHRC788=Najve\u010Dje dovoljeno \u0161tevilo bajtov za JIT je nastavljeno na %d..
SHRC305=Pomnilnika za tabelo iskanja namigov v SH_ClasspathManagerImpl2 ni mogo\u010De dodeliti
SHRC789=\u0160tevilo bajtov za softmx je nastavljeno na %u.
SHRC306=\ Podpis\: %2$.*1$s Naslov\: 0x%3$p
SHRC772=Omejitev softmx za uporabo predpomnilnika v skupni rabi "%s" je dose\u017Eena. \u010Ce \u017Eelite pove\u010Dati omejitev softmx, uporabite mo\u017Enost "%s".
SHRC773=Prostor za podatke AOT v predpomnilniku v skupni rabi "%s" je poln.
SHRC774=Prostor za podatke JIT v predpomnilniku v skupni rabi "%s" je poln.
SHRC775=Omejitev softmx za uporabo predpomnilnika v skupni rabi presega celotno velikost predpomnilnika %u bajtov. Nastavljena bo na velikost, enako skupni velikosti predpomnilnika.
SHRC770=JVM je onemogo\u010Dil za\u0161\u010Dito delno zapolnjenih strani. \u010Ce je '-Xshareclasses\:mprotect\=onfind' naveden, je tudi prezrt.
SHRC771=Omogo\u010Di za\u0161\u010Dito pomnilnika delno zapolnjenih strani. V sistemu z/OS je enako 'partialpagesonstartup'.
SHRC776=Omejitev softmx za uporabo predpomnilnika v skupni rabi je manj\u0161a od \u0161tevila %u bajtov v predpomnilniku v skupni rabi, ki so \u017Ee v uporabi.
SHRC777=Omejitev softmx za uporabo predpomnilnika v skupni rabi je manj\u0161a od najmanj\u0161e mogo\u010De vrednosti %u bajtov.
SHRC778=Najmanj\u0161i rezerviran prostor za AOT ne sme presegati najve\u010Djega dovoljenega prostora za AOT.
SHRC779=Najmanj\u0161i rezerviran prostor za JIT ne sme presegati najve\u010Djega dovoljenega prostora za podatke JIT.
SHRC321=Okrevanje po napaki\: zapiranje semaforjev pomnilnika v skupni rabi.
SHRC322=Inicializiranje semaforjev za predpomnilnik razredov v skupni rabi ni uspelo. Opozorilo\: va\u0161 predpomnilnik je lahko pokvarjen. \u010Ce imate te\u017Eave pri uporabi predpomnilnika v skupni rabi, bo morda treba predpomnilnik uni\u010Diti in ga nato ponovno izdelati.
SHRC323=NAPAKA\: Napaka pri vnosu medsebojnega izklju\u010Devanja za glavo predpomnilnika razredov v skupni rabi. Opozorilo\: va\u0161 predpomnilnik je lahko pokvarjen. \u010Ce imate te\u017Eave pri uporabi predpomnilnika v skupni rabi, bo morda treba predpomnilnik uni\u010Diti in ga nato ponovno izdelati.
SHRC324=NAPAKA\: Napaka pri izhodu iz medsebojnega izklju\u010Devanja za glavo predpomnilnika razredov v skupni rabi. Opozorilo\: va\u0161 predpomnilnik je lahko pokvarjen. \u010Ce imate te\u017Eave pri uporabi predpomnilnika v skupni rabi, bo morda treba predpomnilnik uni\u010Diti in ga nato ponovno izdelati.
SHRC320=Okrevanje po napaki\: uni\u010Devanje semaforjev pomnilnika v skupni rabi.
SHRC329=SH_CompositeCacheImpl\:\:enterReadWriteAreaMutex ni uspel pridobiti mutexa nizovne tabele (povratna koda %d).
SHRC325=Napaka pri objavi predpomnilnika razredov v skupni rabi. Zaklepanje glave med inicializacijo ni uspelo. Opozorilo\: va\u0161 predpomnilnik je lahko pokvarjen. \u010Ce imate te\u017Eave pri uporabi predpomnilnika v skupni rabi, bo morda treba predpomnilnik uni\u010Diti in ga nato ponovno izdelati.
SHRC326=Napaka pri objavi predpomnilnika razredov v skupni rabi. Zaklepanje uporabnika med inicializacijo ni uspelo. Opozorilo\: va\u0161 predpomnilnik je lahko pokvarjen. \u010Ce imate te\u017Eave pri uporabi predpomnilnika v skupni rabi, bo morda treba predpomnilnik uni\u010Diti in ga nato ponovno izdelati.
SHRC327=Klic SH_OSCachesysv\:\:acquireWriteLock() v j9shsem_wait ni uspel z napako %d.
SHRC328=IPC sistema System V je javil naslednjo napako '%s'
VERB032=najmanj\u0161i rezerviran predpomnilni\u0161ki prostor razredov v skupni rabi za podatke JIT
SHRC310=V omre\u017Enem datote\u010Dnem sistemu ni mogo\u010De najti trajnega predpomnilnika. Izberite drug imenik predpomnilnika (cacheDir).
SHRC794=Prilagodi najve\u010Dji prostor predpomnilnika razreda v skupni rabi, dovoljenega za podatke JIT, na <size>.
VERB033=najve\u010Dji dovoljen predpomnilni\u0161ki prostor razredov v skupni rabi za podatke JIT
SHRC311=Napaka pri spro\u0161\u010Danju pisalne klju\u010Davnice pripenjanja datoteke predpomnilnika razredov v skupni rabi.
SHRC795=Vsota najmanj\u0161ega rezerviranega \u0161tevila bajtov za AOT %d in najmanj\u0161ega rezerviranega \u0161tevila bajtov za podatke JIT %d ne sme presegati \u0161tevila bajtov za softmx %d.
VERB034=velika velikost strani za kodni predpomnilnik JIT
SHRC312=Napaka pri spro\u0161\u010Danju pisalne klju\u010Davnice glave datoteke predpomnilnika razredov v skupni rabi.
SHRC796=Najmanj\u0161i rezerviran prostor za AOT ne sme presegati omejitve za softmx %d, ki je nastavljena za uporabo predpomnilnika v skupni rabi.
VERB035=razpolo\u017Eljive velike velikosti strani za kodni predpomnilnik JIT\:
SHRC313=Izdelava jclCacheMutex v shrinit ni uspela
SHRC797=Najmanj\u0161i rezerviran prostor za podatke JIT ne sme presegati omejitve za softmx %d, ki je nastavljena za uporabo predpomnilnika v skupni rabi.
VERB036=stisnjena za\u010Detna velikost metapodatkov referenc
SHRC790=Prilagodite velikost softmx v predpomnilniku na <size>.
VERB037=velikost predpomnilnika razreda v skupni rabi
SHRC791=Prilagodi najmanj\u0161i prostor predpomnilnika razreda v skupni rabi, rezerviranega za podatke AOT, na <size>.
VERB038=mehka najve\u010Dja velikost predpomnilnika razredov v skupni rabi
SHRC792=Prilagodi najve\u010Dji prostor predpomnilnika razreda v skupni rabi, dovoljenega za podatke AOT, na <size>.
SHRC793=Prilagodi najmanj\u0161i prostor predpomnilnika razreda v skupni rabi, dovoljenega za podatke JIT, na <size>.
SHRC318=Okrevanje po napaki\: uni\u010Devanje pomnilnika v skupni rabi.
SHRC319=Okrevanje po napaki\: zapiranje pomnilnika v skupni rabi.
SHRC314=Pomnilnika za tabelo iskanja namigov v SH_Manager ni mogo\u010De dodeliti
SHRC798=Najve\u010Dji dovoljen prostor za AOT ne sme presegati omejitve za softmx %d, ki je nastavljena za uporabo predpomnilnika v skupni rabi.
SHRC315=Ni mogo\u010De inicializirati segmentov pomnilnika razreda predpomnilni\u0161kega program\u010Dka
SHRC799=Najmanj\u0161i dovoljen prostor za podatke JIT ne sme presegati omejitve za softmx %d, ki je nastavljena za uporabo predpomnilnika v skupni rabi.
VERB030=najve\u010Dji dovoljen predpomnilni\u0161ki prostor razredov v skupni rabi za JIT
SHRC316=Serializiranje predpomnilnika ni mogo\u010De, ker ni trenutne niti VM.
VERB031=rezerviran predpomnilni\u0161ki prostor razredov v skupni rabi za atribute razhro\u0161\u010Devanja
SHRC317=Natisne ime datoteke predpomnilnika razredov v skupni rabi, ki bo uporabljeno.
VRFY029=neveljaven returnAddress za navodilo ret
VRFY021=vrnjenega objekta ni mogo\u010De vrniti
SHRC343=Najden razred %1$s v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d z URL-jem %4$.*3$s.
VRFY022=pomo\u017Ene programe je treba znova zagnati za vsak jsr
SHRC344=Razreda %1$s v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d z URL-jem %4$.*3$s ni bilo mogo\u010De najti.
VRFY023=parameter tableswitch ni celo \u0161tevilo
SHRC345=Najden razred %1$s v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d z \u017Eetonom %4$.*3$s.
VRFY024=argumenti niso zdru\u017Eljivi s tipom
SHRC346=Razreda %1$s v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d z \u017Eetonom %4$.*3$s ni bilo mogo\u010De najti.
VRFY025=neveljaven dostop do za\u0161\u010Ditenih podatkov
VRFY026=nepri\u010Dakovani EOF
SHRC340=Preverjanje CRC predpomnilnika v skupni rabi ni uspelo. Shranjen CRC %1$x, izra\u010Dunan CRC %2$x
VRFY027=prejemnik ni zdru\u017Eljiv z razredom, ki deklarira
SHRC341=Najden razred %1$s v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d.
VRFY028=neveljavna dimenzija
SHRC342=Razreda %1$s v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d ni bilo mogo\u010De najti.
SHRC347=Razred %2$.*1$s je bil shranjen v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z URL-jem %5$.*4$s (indeks %6$d).
SHRC348=Razreda %2$.*1$s ni bilo mogo\u010De shraniti v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z URL-jem %5$.*4$s (indeks %6$d).
VRFY030=neveljaven tip na skladu
SHRC349=Razred %2$.*1$s je bil shranjen v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z URL-jem %5$.*4$s.
VRFY031=poskus za iinc ni celo \u0161tevilo
J2SE000=\n
VRFY032=neveljaven prejemnik za <init>
SHRC332=Za\u0161\u010Dita podatkovne pomnilni\u0161ke strani je bila uspe\u0161no omogo\u010Dena za predpomnilnik.
VRFY033=polje ni zdru\u017Eljivo s tipom
SHRC333=Privzeta za\u0161\u010Dita pomnilni\u0161ke strani je bila uspe\u0161no omogo\u010Dena za predpomnilnik.
VRFY034=ciljni PC ni veljaven
SHRC334=Okrevanje po napaki ni uspelo\: Uni\u010Devanje pomnilnika v skupni rabi ni uspelo.
VRFY035=brez napak
SHRC335=Okrevanje po napaki ni uspelo\: Uni\u010Devanje semaforja v skupni rabi ni uspelo.
VRFY036=podtok sklada
VRFY037=neinicializirani objekt med vzvratno razvejitvijo
VRFY038=ukaz invokespecial na neveljavnem cilju
SHRC330=SH_CompositeCacheImpl\:\:runExitCode ni uspel pridobiti mutexa pisalnega podro\u010Dja (povratna koda %d).
VRFY039=neznana bitna koda
SHRC331=Pridobljen je bil druga\u010Den semafor od tistega, ki je bil predhodno uporabljen s tem predpomnilnikom
SHRC336=Koda napake plasti vrat \= %1$d
VRFY040=preverjalnik ni uspel dodeliti izvirnega pomnilnika
SHRC337=Sporo\u010Dilo o napaki platforme\: %1$s
SHRC338=Koda napake plasti vrat \= %1$d
VRFY041=ukaz invokespecial napa\u010Dnega inicializatorja
VRFY042=%1$s; class\=%3$.*2$s, method\=%5$.*4$s%7$.*6$s, pc\=%8$u; Neujemanje tipa, argument %9$d v podpisu %11$.*10$s.%13$.*12$s\:%15$.*14$s se ne ujema
SHRC339=Sporo\u010Dilo o napaki platforme\: %1$s
VERB007=velikost sklada niti operacijskega sistema
VERB008=za\u010Detna velikost nitnega sklada java
VERB009=prirastek nitnega sklada java
SHRC360=Bajtnih podatkov za klju\u010D %.*s ni bilo mogo\u010De najti v predpomnilniku v skupni rabi ...
SHRC365=Omogo\u010Di shrambo informacij o razhro\u0161\u010Devanju razreda v razredu v skupni rabi.
EXEL109=\  -XX\:ShareClassesEnableBCI   ustvari predpomnilnik razredov v skupni rabi s podporo za instrumentacijo bajtne kode
SHRC366=razhro\u0161\u010Devanje omogo\u010Deno      \= true
VERB000=Sklad z razlago\: "%2$.*1$s" uporabljenih %3$zd/%4$zd bajtov na skladih Java/C
SHRC367=razhro\u0161\u010Devanje omogo\u010Deno      \= false
VERB001=
SHRC368=Zaustavljanje predpomnilnika razredov v skupni rabi, ki nimajo omogo\u010Denega razhro\u0161\u010Devanja.
VERB002=Sklad z razlago\: najve\u010Dja uporaba sklada je bila %1$zd/%2$zd bajtov na skladih Java/C
SHRC361=Napaka pri pripenjanju k pomnilniku v skupni rabi med odpiranjem/shranjevanjem
VERB003=Napaka\: \u0161tevilo datotek -Xverbosegclog mora biti ve\u010Dje kot 0
SHRC362=Pomnilnika za ClasspathItem ni bilo mogo\u010De dodeliti
VERB004=Napaka\: \u0161tevilo ciklov -Xverbosegclog mora biti ve\u010Dje kot 0
SHRC363=API-ja za razrede v skupni rabi v shrinit ni bilo mogo\u010De dodeliti.
VERB005=Napaka\: manjkajo\u010De ime datoteke -Xverbosegclog
SHRC364=Klic SH_OSCachesysv\:\:acquireWriteLock() v j9shsem_wait na semid %d ni uspel z napako %d.
VERB006=Inicializacija ni uspela
EXEL112=\  -Xscsoftmx<x>   nastavi mehko najve\u010Djo velikost novega predpomnilnika razredov v skupni rabi na <x>
EXEL113=\  -Xscmx<x>       nastavi velikost (ali mehko najve\u010Djo velikost, \u010De je prisotna mo\u017Enost -XX\:SharedCacheHardLimit\=) novega predpomnilnika razredov v skupni rabi na <x>
EXEL114=\  -XX\:SharedCacheHardLimit\=<x>   nastavi velikost novega predpomnilnika razredov v skupni rabi na <x>
EXEL115=\  -XX\:+ShareAnonymousClasses   omogo\u010Di shranjevanje in iskanje anonimnih razredov v predpomnilniku razreda v skupni rabi.
SHRC369=-Xnolinenumbers    \= true
EXEL116=\  -XX\:-ShareAnonymousClasses   onemogo\u010Di shranjevanje in iskanje anonimnih razredov v predpomnilniku razreda v skupni rabi.
EXEL117=\  -XX\:+ShareUnsafeClasses   omogo\u010Di shranjevanje in iskanje razredov, ki niso anonimni in niso varni, v predpomnilniku razreda v skupni rabi.
EXEL118=\  -XX\:-ShareUnsafeClasses   onemogo\u010Di shranjevanje in iskanje razredov, ki niso anonimni in niso varni, v predpomnilniku razreda v skupni rabi.
EXEL119=\  -XX\:+UseGCStartupHints   omogo\u010Di shranjevanje in iskanje zagonskih namigov GC v predpomnilniku razreda v skupni rabi.
EXEL110=\  -XX\:ShareClassesDisableBCI   ustvari predpomnilnik razredov v skupni rabi brez podpore za instrumentacijo bajtne kode
EXEL111=\  -XX\:+StoreIntermediateClassfile   shrani neobdelane podatke razreda, ki se uporabljajo med ponovno pretvorbo
SHRC354=Kode AOT za ROMMethod 0x%1$p v predpomnilniku v skupni rabi ni bilo mogo\u010De najti.
SHRC355=Shranjena koda AOT za ROMMethod 0x%1$p v predpomnilniku v skupni rabi.
SHRC356=Kode AOT za ROMMethod 0x%1$p v predpomnilniku v skupni rabi ni bilo mogo\u010De shraniti.
SHRC357=Bajtni podatki za klju\u010D %.*s so bili shranjeni v predpomnilnik v skupni rabi.
SHRC350=Razreda %2$.*1$s ni bilo mogo\u010De shraniti v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z URL-jem %5$.*4$s.
SHRC351=Razred %2$.*1$s je bil shranjen v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z \u017Eetonom%5$.*4$s.
SHRC352=Razreda %2$.*1$s ni bilo mogo\u010De shraniti v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z \u017Eetonom %5$.*4$s.
SHRC353=Najdena koda AOT za ROMMethod 0x%1$p v predpomnilniku v skupni rabi.
EXEL101=\n  -Xhealthcenter  omogo\u010Di agenta za Zdravstveni center
EXEL102=
EXEL103=\  -Xscdmx<x>      podro\u010Dje atributov razhro\u0161\u010Devanja predpomnilnika razreda v skupni rabi nastavi na <x>
EXEL104=\  -Xscminjit<x>   nastavi najmanj\u0161i prostor predpomnilnika razreda v skupni rabi, rezerviranega za podatke JIT, na <x>
SHRC358=Bajtnih podatkov za klju\u010D %.*s ni bilo mogo\u010De shraniti v predpomnilnik v skupni rabi.
EXEL105=\  -Xscmaxjit<x>   nastavi najve\u010Dji prostor predpomnilnika razreda v skupni rabi, dovoljenega za podatke JIT, na <x>
SHRC359=Najdeni so bili bajtni podatki za klju\u010D %.*s v predpomnilniku v skupni rabi ...
EXEL106=\  -Xscminjitdata<x>   nastavi najmanj\u0161i prostor predpomnilnika razreda v skupni rabi, rezerviranega za podatke JIT, na <x>
EXEL107=\  -Xscmaxjitdata<x>   nastavi najve\u010Dji prostor predpomnilnika razreda v skupni rabi, dovoljenega za podatke JIT, na <x>
EXEL108=\  -Xzero\:nosharebootzip   predpomnilnikov vnosa bootstrap jar ne da v skupno rabo v predpomnilniku razredov v skupni rabi
EXEL100=\  -Xgcpolicy\:metronome -Xnortsj omogo\u010Di mehak realtime
VERB029=najmanj\u0161i rezerviran predpomnilni\u0161ki prostor razredov v skupni rabi za JIT
SHRC380=Uporabljenega %% podro\u010Dja za razhro\u0161\u010Devanje razredov             %*c\= %u%%
SHRC381=Bajti razreda LineNumberTable %*c\= %u
SHRC382=Bajti LocalVariableTable podro\u010Dja za razhro\u0161\u010Devanje razredov %*c\= %u\n
VERB021=Neveljaven vnos razredne poti\: %s (nepodprt tip datoteke)
SHRC387=prosti bajti                           %*c\= %d
VERB022=Neveljaven vnos razredne poti\: %s (neznan tip datoteke)
SHRC388=bajti ROMClass                      %*c\= %d
VERB023=Neveljaven vnos razredne poti\: %s (neznana napaka)
SHRC389=Bajti metapodatkov                      %*c\= %d
VERB024=Neveljaven vnos razredne poti\: %s (v jxe manjka rom.classes)
VERB025=Neveljaven vnos razredne poti\: %s (okvarjena glava slike jxe)
SHRC383=\nosnovni naslov                         %*c\= 0x%p
VERB026=Neveljaven vnos razredne poti\: %s (nasprotni endian jxe ni podprt)
SHRC384=kon\u010Dni naslov                         %*c\= 0x%p
VERB027=Sklad z razlago\: Izvajanje niti "%2$.*1$s" uporablja %3$zd/%4$zd bajtov na skladih Java/C
SHRC385=dodelitvena kazalka                  %*c\= 0x%p\n
VERB028=Sklad z razlago\: Ni mogo\u010De izpisati informacij o skladu za niti, ki se trenutno izvajajo
SHRC386=velikost predpomnilnika                          %*c\= %d
VERB020=Neveljaven vnos razredne poti\: %s (datoteka je okvarjena)
VERB018=Neveljaven vnos razredne poti\: %s (V/I datoteke ni uspel)
VERB019=Neveljaven vnos razredne poti\: %s (branje datoteke ni uspelo)
SHRC370=-Xnolinenumbers    \= false
SHRC371=Bajti predpomnilnika Zip \= %d
VERB010=najve\u010Dja velikost nitnega sklada java
SHRC376=%1$d\: 0x%2$p ZIPCACHE\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC377=-Xscdmx vrednost %u bajtov je ve\u010Dja od %u bajtov razpolo\u017Eljivega prostora. Namesto tega bo za -Xscdmx uporabljena vrednost %u bajtov.
VERB011=velikost nitnega sklada java
VERB012=prirastek segmentov razreda RAM
SHRC378=\nSorodne mo\u017Enosti ukazne vrstice\:\n
VERB013=prirastek segmentov razreda ROM
SHRC379=Velikost podro\u010Dja za razhro\u0161\u010Devanje razredov                %*c\= %u
VERB014=maksimum pomnilnika
SHRC372=\# predpomnilnikov Zip \= %d
VERB015=velikost predpomnilnika razreda v skupni rabi
SHRC373=Podatkovnih bajtov JIT \= %d
SHRC374=Predpomnilnik izdelan z\:
VERB016=najmanj\u0161i rezerviran predpomnilni\u0161ki prostor razredov v skupni rabi za AOT
SHRC375=Ime predpomnilnika je predolgo, \u010De je vklju\u010Deno uporabni\u0161ko ime. V tem medpomnilniku je ostalo %d bajtov, va\u0161e uporabni\u0161ko ime pa je dolgo %d bajtov.
VERB017=najve\u010Dji dovoljen predpomnilni\u0161ki prostor razredov v skupni rabi za AOT
EXEL120=\  -XX\:-UseGCStartupHints   onemogo\u010Di shranjevanje in iskanje zagonskih namigov GC v predpomnilniku razreda v skupni rabi.
EXEL121=\  -XX\:+PortableSharedCache   omogo\u010Di funkcijo, ki posku\u0161a maksimirati prenosljivost predpomnilnika v skupni rabi v ve\u010D ra\u010Dunalnikih
EXEL122=\  -XX\:-PortableShareCache   onemogo\u010Di funkcijo, ki posku\u0161a maksimirati prenosljivost predpomnilnika v skupni rabi v ve\u010D ra\u010Dunalnikih
SHRC390=Uporabljenih %% metapodatkov                     %*c\= %d%%
SHRC391=\# ROM razredov (ROMClasses)                        %*c\= %d
SHRC392=\# razrednih poti                        %*c\= %d
SHRC393=\# URL-jev                              %*c\= %d
SHRC398=\# metod AOT                        %*c\= %d
SHRC399=Podatkovni bajti                           %*c\= %d
SHRC394=\# \u017Eetonov                            %*c\= %d
SHRC395=\# zastaranih razredov                     %*c\= %d
SHRC396=%% zastaranih razredov                      %*c\= %d%%\n
SHRC397=bajti AOT                            %*c\= %d
CFRE100=preve\u010D zahtevanih dimenzij v bitni kodi multianewarray
CFRE101=odmik je izven dovoljenega obmo\u010Dja v bitni kodi za preklop
CFRE102=podpis polja ni veljaven
CFRE103=abstraktna metoda je lahko zasebna, stati\u010Dna, kon\u010Dna, izvorna, sinhronizirana ali stroga
CFRE104=polje je lahko javno, zasebno ali za\u0161\u010Diteno
CFRE110=nezdru\u017Eljiva konstanta za polje
CFRE111=nepravilno oblikovan UTF8
CFRE112=navidezni ra\u010Dunalnik ne podpira dinami\u010Dnega preverjanja
CFRE113=nepri\u010Dakovani EOF
CFRE114=ime polja ni veljavno
CFRE115=dimenzije matrike > 255
CFRE105=superClass mora biti razred
CFRE106=podvojena metoda
CFRE107=odmik je izven dovoljenega obmo\u010Dja v bitni kodi za skok
CFRE108=indeks ograditvene metode se mora sklicevati na ime in tip
CFRE109=podpis metode ni veljaven
CFRE141=method_info ima ve\u010D kot en atribut RuntimeInvisibleParameterAnnotations ali RuntimeVisibleParameterAnnotations
CFRE142=razred ima ve\u010D kot en atribut RuntimeInvisibleAnnotations ali RuntimeVisibleAnnotations
CFRE143=Ve\u010D ugnezdenih atributov mates
CFRE144=\u010Clan ugnezdenega gostitelja ugnezdenega atributa mora biti razred konstante
CFRE145=Ugnezdeni gostitelj mora biti razred konstante
CFRE146=Metoda <clinit> ni stati\u010Dna
CFRE147=Metoda <clinit> ima nedovoljen podpis
CFRE148=Vmesnik ne mora imeti metode z imenom <init>
CFRE140=method_info ima ve\u010D kot en atributAnnotationDefault
CFRE138=Atribut datoteke razreda se sklicuje na neobstoje\u010D vnos v podro\u010Dju konstant
CFRE139=Razred ima ve\u010D kot en atribut SourceDebugExtension
CFRE152=Informacije module-info niso razred, ker je nastavljen access_flag ACC_MODULE
CFRE153=Vnos v podro\u010Dje konstante ni veljaven v razrednih datotekah z razli\u010Dicami < 55.0
CFRE154=Bajtni kodi ldc in ldc_2 se morata sklicevati na konstanto ali Constant_Dynamic
CFRE155=Bajtna koda ldc2_w se mora sklicevati na konstanto ali Constant_Dynamic
CFRE156=Vnosi Constant_Dynamic, na katere se sklicujeta bajtni kodi ldc in ldc_w, ne smejo vrniti 'long' ali 'double'
CFRE157=Vnosi Constant_Dynamic, na katere se sklicuje bajtna koda ldc2_w, morajo vrniti 'long' ali 'double'
CFRE158=Vnos v podro\u010Dje konstante ni veljaven v razrednih datotekah z razli\u010Dicami < 49.0
CFRE159=Vnos v podro\u010Dje konstante ni veljaven v razrednih datotekah z razli\u010Dicami < 51.0
CFRE150=Neznana oznaka konstante 20 v datoteki razreda
CFRE151=Vnos v podro\u010Dje konstante ni veljaven v razrednih datotekah z razli\u010Dicami < 53.0
CFRE149=Neznana oznaka konstante 19 v datoteki razreda
CFRE120=operacijski kodi jsr in jsr_w nista veljavni v razrednih datotekah z razli\u010Dicami >\= 51.0
CFRE121=neveljavno ime polja
CFRE122=razred je lahko javen ali modul
CFRE123=Konstante MethodHandle se morajo sklicevati na polje ali sklic metode
CFRE124=oznaka vrednosti elementa zaznamka je neveljavna
CFRE125=bitna koda invokedynamic se mora sklicevati na vnos v podro\u010Dje konstante InvokeDynamic
CFRE126=bitna koda invokedynamic je rezervirala re\u017Ee, ki niso ni\u010D
CFRE116=bitna koda invoke se mora sklicevati na Methodref
CFRE117=polje ne more biti kon\u010Dno in neobstojno hkrati
CFRE118=dodatni bajti za EOF
CFRE119=ve\u010D atributov SourceFile
CFRE130=ve\u010D atributov BootstrapMethods
CFRE131=Atribut BootstrapMethods, ki ga zahteva invokedynamic, manjka ali je premajhen
CFRE132=ciljni tip razlage tipa ni prepoznan
CFRE133=Metoda ima dva atributa MethodParameters
CFRE134=Parameter metode ima neveljavno zastavico.
CFRE135=Ime parametra metode ni UTF8
CFRE136=neveljavni modifikatorji za metodo vmesnika
CFRE137=Razred ima ve\u010D kot en atribut RuntimeVisibleTypeAnnotations ali RuntimeInvisibleTypeAnnotations
CFRE127=indeks metode samodejnega zagona se mora nana\u0161ati na vnos v podro\u010Dje konstante MethodHandle
CFRE128=podpis methodtype ni veljaven
CFRE129=vnos v podro\u010Dje konstante ni veljaven v razrednih datotekah z razli\u010Dicami < 51.0
CFRE163=Razredna datoteka je razli\u010Dica predogleda, vendar ima napa\u010Dno glavno razli\u010Dico ali predogled ni omogo\u010Den.
CFRE164=Indeks v tabeli LocalVariableTable je izven dovoljenega obmo\u010Dja.
CFRE165=Indeks v tabeli LocalVariableTypeTable je izven dovoljenega obmo\u010Dja.
CFRE166=Podvojeni vnosi v tabeli LocalVariableTypeTable niso dovoljeni
CFRE167=Ve\u010D atributov zapisov
CFRE168=Razredi zapisov ne smejo biti abstraktni
CFRE169=Ime zapisa mora biti niz
CFRE160=Vnos v podro\u010Dje konstante ni veljaven v razrednih datotekah z razli\u010Dicami < 55.0
CFRE161=Argumenti BootstrapMethod (%1$d) vsebujejo neveljaven vnos v podro\u010Dje konstante v indeksu (\#%2$u) tipa (%3$u); class\=%5$.*4$s, offset\=%6$u
CFRE162=ValueTypes so omogo\u010Deni samo z mo\u017Enostjo -XX\:+EnableValhalla
SHRC703=Ni bilo mogo\u010De odpreti datoteke posnetka predpomnilnika v skupni rabi "%s"
SHRC704=Koda napake plasti vrat \= %1$d
SHRC705=Sporo\u010Dilo o napaki platforme\: %1$s
SHRC706=Ni bilo mogo\u010De pridobiti zaklepa datoteke posnetka predpomnilnika v skupni rabi
SHRC700=Izdelan je bil posnetek netrajnega predpomnilnika v skupni rabi "%s"
SHRC701=Ni bilo mogo\u010De izdelati posnetka netrajnega predpomnilnika razreda v skupni rabi "%s"
SHRC702=Imenika za posnetek predpomnilnika v skupni rabi ni bilo mogo\u010De pridobiti
SHRC707=Ni bilo mogo\u010De pridobiti mutexa predpomnilnika "%s"
SHRC708=Ni bilo mogo\u010De skraj\u0161ati obstoje\u010De datoteke posnetka netrajnega predpomnilnika v skupni rabi "%s"
SHRC709=JVM izdeluje posnetek netrajnega predpomnilnika v skupni rabi "%s", vendar datoteka posnetka "%s" \u017Ee obstaja in bo prepisana
CFRE174=Ve\u010D atributov PermittedSubclasses
CFRE175=Kon\u010Dnih razredov ni mogo\u010De zape\u010Datiti
CFRE176=Ime PermittedSubclasses mora bit niz
CFRE177=Vnos razreda PermittedSubclasses ni tipa razreda
CFRE178=Zape\u010Dateni razredi morajo imeti vsaj en dovoljen podrazred
CFRE170=Ime komponente RecordComponent mora biti niz
CFRE171=Deskriptor komponente RecordComponent mora biti niz
CFRE172=Zapis je implicitno kon\u010Den
CFRE173=Vnos LocalVariableTypeTable se ne ujema z nobenim vnosom v tabeli LocalVariableTable
SHRC720=Ponovna izdelava krmilne datoteke skupnega pomnilnika ni dovoljena, ko izdelujete posnetek predpomnilnika
SHRC725=Dol\u017Eina datoteke posnetka netrajnega predpomnilnika v skupni rabi "%s" ni veljavna. Dol\u017Eina datoteke je %lld bajtov. Dol\u017Eina veljavne datoteke posnetka zna\u0161a najmanj %d bajtov in najve\u010D %lld bajtov.
SHRC726=Netrajni predpomnilnik v skupni rabi "%s" \u017Ee obstaja. Ne morete ga obnoviti iz posnetka.
SHRC727=Pri izdelavi novega netrajnega predpomnilnika v skupni rabi je pri\u0161lo do napake.
SHRC728=Ni bilo mogo\u010De brati iz datoteke posnetka netrajnega predpomnilnika v skupni rabi "%s"
SHRC721=JVM ni konfiguriran za dostop do datoteke posnetka netrajnega predpomnilnika v skupni rabi "%s" \u010Ce \u017Eelite odpreti datoteko, uporabite podmo\u017Enost 'groupAccess'.
SHRC722=JVM ne dovoli dostopa do datoteke posnetka predpomnilnika v skupni rabi "%s", ker se ID uporabnika in ID skupine procesa JVM razlikujeta od ID-ja uporabnika in ID-ja skupine lastnika datoteke posnetka predpomnilnika v skupni rabi in ker ID uporabnika procesa JVM ni vklju\u010Den v skupino lastnika datoteke posnetka predpomnilnika v skupni rabi.
SHRC723=JVM ni mogel preveriti dovoljenj datoteke posnetka predpomnilnika v skupni rabi "%s"
SHRC724=Datoteka posnetka predpomnilnika v skupni rabi "%s" ne obstaja
SHRC729=Posnetek je izdelan z drugo delovno razli\u010Dico navidezne naprave JVM in se ne ujema z navidezno napravo JVM, ki se izvaja
SHRC714=Na voljo ni nobenih posnetkov predpomnilnika v skupni rabi
SHRC715=Odstranjena je bila starej\u0161a razli\u010Dica posnetka predpomnilnika v skupni rabi "%s"
SHRC716=Starej\u0161e razli\u010Dice posnetka predpomnilnika v skupni rabi "%s" ni uspelo odstraniti
SHRC717=Trenutne razli\u010Dice posnetka predpomnilnika v skupni rabi "%s" ni uspelo odstraniti
SHRC710=Ni bilo mogo\u010De pisati v datoteko posnetka netrajnega predpomnilnika v skupni rabi "%s"
SHRC711=Ni bilo mogo\u010De premestiti odmika opisovalnika datoteke v datoteko posnetka netrajnega predpomnilnika v skupni rabi "%s"
SHRC712=V teku je poskus uni\u010Denja vseh posnetkov predpomnilnika v skupni rabi v cacheDir "%s"
SHRC713=Ni bilo mogo\u010De pridobiti dol\u017Eine datoteke posnetka predpomnilnika v skupni rabi "%s"
SHRC718=Posnetek predpomnilnika v skupni rabi ne obstaja
SHRC719=Posnetek predpomnilnika v skupni rabi "%s" je uni\u010Den
SHRC740=Uporaba\: %s{<method_specification>[,<method_specification>]}
SHRC741=Oblika zapisa za <method_specification> je [\!]{*|[*]<packagename/classname>[*]}[.{*|[*]<methodname>[*]}[({*|[*]<parameters>[*]})]], e.g.\:\n\n\t-Xshareclasses\:name\=Cache1,%sjava/util/HashMap.hash(Ljava/lang/Object;)\n
SHRC742=POMEMBNO\: ve\u010D specifikacij metod lahko posredujete tako, da jih lo\u010Dite z vejicami . \u010Ce vrednost mo\u017Enosti vsebuje vejice, mora biti obdana z zavitimi oklepaji. \n\t\u010Ce \u017Eelite prepre\u010Diti, da bi lupina prestrezala in fragmentirala ukazne vrstice, lo\u010Dene z vejicami, mo\u017Enosti obdajte z narekovaji, npr.\: \n \n \t"-Xshareclasses\:name\=Cache1,%s{java/util/*.*(),java/lang/Object.*(*)}" or\n \t-Xshareclasses\:name\=Cache1,%s'{java/util/*.*(),\!java/util/*.*()}'\n
SHRC747=Ni bilo mogo\u010De razveljaviti metod AOT
SHRC748=Ni bilo mogo\u010De znova uveljaviti metod AOT
SHRC749=Ni bilo mogo\u010De najti metod AOT
SHRC743=Neveljavne specifikacije metod za mo\u017Enost "%s"
SHRC744=Metode AOT %d so razveljavljene
SHRC745=Metode AOT %d AOT so znova potrjene
SHRC746=Metode AOT %d so bile najdene
SHRC730=JVM je izdelal predpomnilnik v skupni rabi z mo\u017Enostjo '-Xshareclasses\:restrictClasspaths'. Nadaljnji priklici JVM ne bodo mogli shraniti poti razredov v predpomnilnik v skupni rabi
SHRC731=JVM je prezrl mo\u017Enost '-Xshareclasses\:restrictClasspaths', ker je bil obstoje\u010Di predpomnilnik v skupni rabi izdelan brez mo\u017Enosti '-Xshareclasses\:restrictClasspaths'
SHRC736=Razveljavite metode AOT, ki se ujemajo s specifikacijami metod.
SHRC737=Znova uveljavite metode AOT, ki se ujemajo s specifikacijami metod.
SHRC738=Natisnite metode AOT, ki se ujemajo s specifikacijami metod.\n\t<method_specification> je definirano kot\: [\!]{*|[*]<packagename/classname>[*]}[.{*|[*]<methodname>[*]}[({*|[*]<parameters>[*]})]].
SHRC739=RAZVELJAVLJENO
SHRC732=JVM lahko shranjuje poti razredov v predpomnilnik v skupni rabi z uporabo mo\u017Enosti '-Xshareclasses\:restrictClasspaths'
SHRC733=JVM ne more shranjevati poti razredov v predpomnilnik v skupni rabi, ker je bil predpomnilnik izdelan z uporabo mo\u017Enosti '-Xshareclasses\:restrictClasspaths'
SHRC734=Natisnite ime datoteke posnetka razreda v skupni rabi, ki bo v uporabi.
SHRC735=Uporabite %d-bitni JVM za izvedbo zahtevane operacije v %d-bitnem predpomnilniku v skupni rabi "%s", ker %d-bitni JVM ne more potrditi, da je bil skupni pomnilnik izdelan z uporabo JVM
SHRC640=JVM uporablja obstoje\u010Di predpomnilnik razredov v skupni rabi v na\u010Dinu diagnosticiranja mprotect (z uporabo mo\u017Enosti -Xshareclasses\:mprotect\=diagnostic), vendar predpomnilnik v tem na\u010Dinu ni ustvarjal. Uporaba medpomnilnika v tem na\u010Dinu lahko vpliva na zmogljivost.
SHRC641=JVM sku\u0161a uporabiti obstoje\u010Di predpomnilnik za razrede v skupni rabi v na\u010Dinu diagnosticiranja mprotect (z uporabo mo\u017Enosti -Xshareclasses\:mprotect\=diagnostic), vendar predpomnilnik v tem na\u010Dinu ni ustvarjal. V takem primeru z/OS prezre mo\u017Enost mprotect\=diagnostic.
SHRC642=JVM je ustvaril predpomnilnik za razrede v skupni rabi v na\u010Dinu diagnosticiranja mprotect (z uporabo mo\u017Enosti-Xshareclasses\:mprotect\=diagnostic). Uporaba medpomnilnika v tem na\u010Dinu lahko vpliva na zmogljivost.
SHRC643=JVM je pripel v predpomnilnik razredov v skupni rabi, ustvarjen v na\u010Dinu diagnosticiranja mprotect (z uporabo mo\u017Enosti -Xshareclasses\:mprotect\=diagnostic). Uporaba medpomnilnika v tem na\u010Dinu lahko vpliva na zmogljivost.
SHRC648=JVM ni konfiguriran za dostop do nabora semaforjev, povezanega z obstoje\u010Dim netrajnim predpomnilnikom razredov v skupni rabi. V netrajen predpomnilnik za razrede v skupni rabi pripenjajte s podmo\u017Enostjo 'groupAccess'.
SHRC649=JVM ne dovoli dostopa do nabora semaforjev medpomnilnika v skupni rabi, ki ga je ustvaril drug uporabnik, ki ni iz te skupine.
J9CL030=Ni mogo\u010De dodeliti pomnilnika za izvirne podatke imetnika
J9CL031=dbgwrapper.dll ni bilo mogo\u010De registrirati kot zagonsko knji\u017Enico. Koda napake \= %zu
J9CL032=%1$d\: Informacij %2$s ni bilo mogo\u010De pridobiti.
SHRC644=JVM je pripel v predpomnilnik razredov v skupni rabi, ustvarjen v na\u010Dinu diagnosticiranja mprotect (z uporabo mo\u017Enosti -Xshareclasses\:mprotect\=diagnostic). Mo\u017Enost -Xshareclasses\:mprotect\=none bo prezrta.
SHRC645=Omogo\u010Di na\u010Din diagnosticiranja mprotect
SHRC646=JVM ni mogel preveriti dovoljenj nabora semaforjev, povezanega z medpomnilnikom v skupni rabi.
SHRC647=JVM je odkril, da veljavni id uporabnika v postopku pripada lastniku, a ne ustvarjalcu nabora semaforjev, povezanega s predpomnilnikom v skupni rabi. Da bi JVM prepre\u010Dil dostop do ne\u017Eelenega predpomnilnika v skupni rabi, ne bo pripenjal vanj.
J9CL037=Informacij o uporabi CPE-ja za JVM ni mogo\u010De pridobiti, ko je podan -XX\:-EnableCPUMonitor.
J9CL038=Napaka pri pridobivanju informacij o uporabi CPE-ja za JVM.
J9CL039=\u010Casovni \u017Eig ni veljaven pri pridobivanju informacij o uporabi CPE-ja za JVM.
J9CL033=%s ni bilo mogo\u010De registrirati kot zagonsko knji\u017Enico. Koda napake \= %zu
J9CL034=%1$d\: pridobivanje informacij %2$s ni uspelo. %3$s
J9CL035=Metode zasebnih vmesnikov zahtevajo invokespecial
J9CL036=kr\u0161itev omejitve nalaganja\: %2$.*1$s ni viden iz %4$.*3$s
J9CL019=Ni mogo\u010De dodeliti medpomnilnika SIOCGIFCONF
SHRC630=Prostor za shranjevanje podatkov, ki niso vrste AOT/JIT, kot so na primer razredi, v predpomnilnik v skupni rabi "%s", je zaseden.
SHRC631=Prostor, rezerviran za podatke AOT v predpomnilniku v skupni rabi "%s", je zaseden. \u010Ce \u017Eelite pove\u010Dati prostor, rezerviran za podatke AOT, uporabite ukaz -Xscminaot.
SHRC632=Prostor, rezerviran za podatke JIT v predpomnilniku v skupni rabi "%s", je zaseden. \u010Ce \u017Eelite pove\u010Dati prostor, rezerviran za podatke JIT, uporabite ukaz -Xscminjitdata.
SHRC637=Podmo\u017Enost -Xshareclasses\:cacheRetransformed ni zdru\u017Eljiva z obstoje\u010Dim predpomnilnikom v skupni rabi, ki podpira BCI.
SHRC638=Izdelava predpomnilnika z mo\u017Enostjo cacheRetransformed uveljavi na\u010Din disableBCI.
SHRC639=V kombinaciji z ukazom -Xmt se lahko uporabljajo le funkcionalne mo\u017Enosti predpomnilnika v skupni rabi. Premaknite ostale mo\u017Enosti predpomnilnika v skupni rabi v datoteko javad.options.
J9CL020=Ni dovolj pomnilnika za branje podatkov podro\u010Dnih nastavitev
J9CL021=Ni dovolj pomnilnika za izdelavo seznama indeksa
SHRC633=Mo\u017Enost "-XX\:+StoreIntermediateClassfile" je bila podana, vendar obstoje\u010Di predpomnilnik ni bil ustvarjen z mo\u017Enostjo "-XX\:+StoreIntermediateClassfile".
SHRC634=Mo\u017Enost "-XX\:-StoreIntermediateClassfile" je bila podana, vendar je bil obstoje\u010Di predpomnilnik ustvarjen z mo\u017Enostjo "-XX\:+StoreIntermediateClassfile".
SHRC635=Shrani vmesno razredno datoteko \= true
SHRC636=Podmo\u017Enost "disableBCI" ni zdru\u017Eljiva z obstoje\u010Dim predpomnilnikom v skupni rabi, ki podpira BCI.
J9CL026=Ni mogo\u010De dodeliti pomnilnika za vsebino objave HTTP
J9CL027=Napaka pri branju datoteke Zip
J9CL028=Pri branju datoteke zip je pri\u0161lo do notranje napake, koda napake %d
J9CL029=najdeni so bili nepravilno oblikovani znaki/znaki, ki jih ni mogo\u010De preslikati
J9CL022=Ni dovolj pomnilnika za prikaz seznama shramb zapisov
J9CL023=Na voljo ni dovolj pomnilnika za branje zapisa
J9CL024=Zmanjkalo je pomnilnika
J9CL025=Ni mogo\u010De dodeliti pomnilnika za glave odziva HTTP
SHRC662=Okrevanje po napaki\: uni\u010Den nabor semaforjev, ki je povezan s predpomnilnikom razredov v skupni rabi.
SHRC663=Okrevanje po napaki\: nabor semaforjev (id\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, je uni\u010Den.
SHRC664=Okrevanje po napaki ni bilo uspe\u0161no\: nabora semaforjev (semid\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo uni\u010Diti. Nabor semaforjev lahko uni\u010Di samo izdelovalec, lastnik ali uporabnik s skrbni\u0161kimi pravicami.
SHRC665=Okrevanje po napaki ni bilo uspe\u0161no\: nabora semaforjev (semid\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo uni\u010Diti.
SHRC660=Navidezni stroj java ni mogel povezati nabora semaforjev id\=%d s skupnim predpomnilnikom razreda.
SHRC661=Navidezni stroj java ni mogel povezati skupnega pomnilnika id\=%d s skupnim predpomnilnikom razreda.
SHRC666=Okrevanje po napaki\: skupni pomnilnik, ki je povezan s predpomnilnikom razredov v skupni rabi, je uni\u010Den.
SHRC667=Okrevanje po napaki\: skupni pomnilnik (id\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, je uni\u010Den.
SHRC668=Okrevanje po napaki ni bilo uspe\u0161no\: skupnega pomnilnika (shmid\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo uni\u010Diti. Skupni pomnilnik lahko uni\u010Di samo izdelovalec, lastnik ali uporabnik s skrbni\u0161kimi pravicami.
SHRC669=Okrevanje po napaki ni bilo uspe\u0161no\: skupnega pomnilnika (shmid\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo uni\u010Diti.
SHRC651=JVM je odkril, da veljavni id uporabnika v postopku pripada lastniku, a ne ustvarjalcu pomnilnika v skupni rabi, povezanega s predpomnilnikom v skupni rabi. Da bi JVM prepre\u010Dil dostop do ne\u017Eelenega predpomnilnika v skupni rabi, ne bo pripenjal vanj.
SHRC652=JVM ni konfiguriran za dostop do pomnilnika v skupni rabi, povezanega z obstoje\u010Dim netrajnim predpomnilnikom razredov v skupni rabi. V netrajen predpomnilnik za razrede v skupni rabi pripenjajte s podmo\u017Enostjo 'groupAccess'.
SHRC653=JVM ni konfiguriran za dostop do pomnilnika v skupni rabi, povezanega z obstoje\u010Dim netrajnim predpomnilnikom razredov v skupni rabi. V netrajen predpomnilnik razredov v skupni rabi pripenjajte s podmo\u017Enostma 'groupAccess' in 'readonly'.
SHRC654=JVM ne dovoli dostopa do podro\u010Dja skupnega pomnilnika medpomnilnika v skupni rabi, ki ga je ustvaril drug uporabnik, ki ni iz te skupine.
SHRC650=JVM ni mogel preveriti dovoljenj skupnega pomnilnika, povezanega s predpomnilnikom v skupni rabi.
SHRC659=Med odpiranjem skupnega pomnilnika je pri\u0161lo do napake
J9CL040=Ni mogo\u010De dodeliti pomnilnika za nov globalni sklic JNI
J9CL041=Gostiteljski razred %2$.*1$s in anonimni razred %4$.*3$s sta v razli\u010Dnih paketih
J9CL042=Ugnezdeni \u010Dlan %2$.*1$s v %4$.*3$s navaja razli\u010Dnega ugnezdenega gostitelja %6$.*5$s
SHRC655=Predpomnilnik je dostopen trenutnemu uporabniku \= %s
SHRC656=JVM ni konfiguriran za dostop do datoteke predpomnilnika v skupni rabi. V predpomnilnik razrede v skupni rabi pripenjajte s podmo\u017Enostjo 'groupAccess'.
SHRC657=JVM ne dovoli dostopa do datoteke pomnilnika v skupni rabi, ker se uporabni\u0161ki ID in ID skupine postopka JVM razlikujeta od uporabni\u0161kega ID-ja in ID-ja skupine lastnika datoteke predpomnilnika v skupni rabi, uporabni\u0161ki ID postopka JVM pa ni del lastni\u0161ke skupine datoteke predpomnilnika v skupni rabi.
SHRC658=JVM ni mogel preveriti dovoljenj datoteke predpomnilnika v skupni rabi.
SHRC200=\ %2$.*1$s je bil uspe\u0161no najden.
SHRC684=Med odpiranjem semaforja je pri\u0161lo do napake. Krmilne datoteke ni bilo mo\u017Eno zakleniti.
DUMP034=Uporabnik je prek %3$s z uporabo '%2$s' zahteval izpis pomnilnika %1$s.
SHRC201=\ %2$.*1$s je bil uspe\u0161no zamenjan.
SHRC685=Med odpiranjem skupnega pomnilnika je pri\u0161lo do napake. Krmilne datoteke ni bilo mo\u017Eno zakleniti.
DUMP033=JVM je kot odgovor na dogodek zahteval izpis pomnilnika %1$s.
SHRC202=Podro\u010Dij v upravljalniku razreda v skupni rabi ni bilo mogo\u010De inicializirati
SHRC686=Predpomnilnika razredov v skupni rabi ni bilo mogo\u010De zagnati. Nadaljujte brez njegove uporabe, ker ste podali mo\u017Enost -Xshareclasses\:nonfatal
DUMP036=Neveljaven ali manjkajo\u010D filter -Xdump
SHRC203=V upravljalniku razreda v skupni rabi ni mogo\u010De izdelati razpr\u0161ilne tabele
SHRC687=Novega predpomnilnika razredov v skupni rabi ni mogo\u010De izdelati, \u010De je uporabljena mo\u017Enost -Xshareclasses\:readonly
DUMP035=Uporabnik je zahteval izpis pomnilnika %1$s prek %2$s
SHRC680=Okrevanje po napaki ni bilo uspe\u0161no\: krmilne datoteke nabora semaforjev %s, ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo odstraniti.
DUMP030=Izpisa pomnilnika ni mogo\u010De zapisati v datoteko %s\: %s
SHRC681=Dose\u017Eena je bila sistemska omejitev najve\u010Djega \u0161tevila semaforjev ali najve\u010Djega \u0161tevila semaforjev v celotnem sistemu.
SHRC682=Dose\u017Eena je bila sistemska omejitev najve\u010Djega \u0161tevila podro\u010Dij skupnega pomnilnika ali omejitev pomnilnika, ki je dodeljen podro\u010Djem skupnega pomnilnika v celotnem sistemu.
DUMP032=JVM je kot odgovor na dogodek z '%2$s' zahteval izpis pomnilnika %1$s.
SHRC683=Dose\u017Eena je bila sistemska omejitev skupnega \u0161tevila odprtih datotek.
DUMP031=Zahtevan izpis pomnilnika kopice ni bil izdelan, ker izklju\u010Dni zaklep VM ni bil zahtevan. V mo\u017Enost ukazne vrstice -Xdump\:heap\: dodajte request\=exclusive+prepwalk+compact.
SHRC208=Za podro\u010Dje postavke razpr\u0161ilne tabele v CompiledMethodManagerImpl ni mogo\u010De dodeliti pomnilnika
SHRC209=Omogo\u010Di izhodne bajtne podatke z razlago
SHRC204=V upravljalniku razredov v skupni rabi ni mogo\u010De izdelati mutexa razpr\u0161ilne tabele.
SHRC688=Poti razredov lahko dodate le, \u010De JVM najprej inicializira predpomnilnik.
DUMP027=Zahtevan izpis pomnilnika kopice ni bil izdelan, ker druga komponenta dr\u017Ei izklju\u010Dno zaklepanje VM.
SHRC205=Izdelava nove postavke razpr\u0161ilne tabele v CompiledMethodManagerImpl ni uspela
SHRC689=Omogo\u010Da, da lahko JVM shranjuje poti razredov v predpomnilnik, ki je bil ustvarjen z mo\u017Enostjo "restrictClasspaths".
DUMP026=Ime IEATDUMP presega najve\u010Djo dovoljeno dol\u017Eino. Uporabljeno je bilo privzeto ime.
SHRC206=Za vnos razpr\u0161ilne tabele v CompiledMethodManagerImpl ni mogo\u010De dodeliti pomnilnika
DUMP029=Zahteva za prepwalk ali compact pred izvedbo izpisa pomnilnika sistema bo prezrta, ker izklju\u010Dni zaklep VM ni bil zahtevan.
SHRC207=Mutexa razpr\u0161ilne tabele CompiledMethodManager ni mogo\u010De vnesti
DUMP028=Pred izpisom pomnilnika sistema ni bilo mogo\u010De pridobiti izklju\u010Dnega zaklepa VM.
SHRC673=Nabora semaforjev (semid\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo uni\u010Diti.
DUMP045=\u0160tevilo mo\u017Enosti izpisa pomnilnika mora biti manj\u0161e kot %d, vklju\u010Dno z mo\u017Enostmi, ki so nastavljene po privzetku.
SHRC674=Uporabniku ni dovoljeno uni\u010Diti skupnega pomnilnika (shmid\=%d). Skupni pomnilnik lahko uni\u010Di samo izdelovalec, lastnik ali uporabnik s skrbni\u0161kimi pravicami.
DUMP044=Neveljavna ali rezervirana veljavna vrednost za %s
SHRC675=Skupnega pomnilnika, ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo uni\u010Diti.
DUMP047=VM se zaustavlja. Razlog\: neznan
SHRC676=Skupnega pomnilnika (shmid\=%d), ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo uni\u010Diti.
DUMP046=VM se zaustavlja. Razlog\: %2$.*1$s
DUMP041=Nepravilna uporaba parametra -Xdump msg_filter
SHRC670=Okrevanje po napaki\: poskus uporabe predpomnilnika v skupni rabi v na\u010Dinu "samo za branje", \u010De obstaja podro\u010Dje pomnilnika v skupni rabi, kot odziv na mo\u017Enost "-Xshareclasses\:nonfatal".
DUMP040=Izpis pomnilnika %1$s je bil zapisan v podatkovne mno\u017Eice s predlogo imena %2$s
SHRC671=Uporabniku ni dovoljeno uni\u010Diti nabora semaforjev (semid\=%d). Nabor semaforjev lahko uni\u010Di samo izdelovalec, lastnik ali uporabnik s skrbni\u0161kimi pravicami.
DUMP043=Mo\u017Enost %s ni podprta na tej platformi.
SHRC672=Nabora semaforjev, ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo uni\u010Diti.
DUMP042=Prekinitveni signal je bil prejet med izvajanjem na javanskem skladu. Agentov za izpis pomnilnika JVM ni bilo mogo\u010De zagnati.
SHRC677=Koda napake plasti vrat \= %1$d
DUMP038=Posnetkovni izpis pomnilnika ni bil izpisan zaradi sledenja do datoteke\: %1$s
SHRC678=Sporo\u010Dilo o napaki platforme\: %1$s
DUMP037=Napaka v izpisu pomnilnika %1$s\: %2$s ni uspel, koda napake\: %3$d
SHRC679=Okrevanje po napaki ni bilo uspe\u0161no\: krmilne datoteke nabora semaforjev %s, ki je povezan s predpomnilnikom razredov v skupni rabi, ni uspelo odstraniti.
DUMP039=Obdelava dogodka izpisa pomnilnika "%1$s", podrobnost "%3$.*2$s" pri %4$s \u2013 prosimo, po\u010Dakajte.
J9CL008=vrednost \u010Dasovne omejitve v nanosekundah je zunaj obsega
J9CL009=Nit je \u017Ee zagnana
SHRC222=Trajnih predpomnilnikov razredov v skupni rabi ni mogo\u010De izdelati/uporabiti, ker preslikava pomnilnika ne podpira zahtevanih zmo\u017Enosti.
SHRC223=Trajnih predpomnilnikov razredov v skupni rabi ni mogo\u010De izdelati/uporabiti, ker zaklepanje datotek ni podprto.
SHRC224=Zmanjkalo je pomnilnika za lokalno kopijo imena predpomnilnika
SHRC225=Med pridobivanjem poti predpomnilni\u0161ke datoteke je pri\u0161lo do napake
SHRC220=Koda napake plasti vrat \= %1$d
SHRC221=Sporo\u010Dilo o napaki platforme\: %1$s
J9CL010=Dodelitev JNIEnv ni uspela
SHRC226=Napaka pri odpiranju datoteke predpomnilnika razredov v skupni rabi.
SHRC227=Napaka pri pridobivanju klju\u010Davnice za zaklepanje glave datoteke predpomnilnika razredov v skupni rabi.
SHRC228=Napaka pri posodabljanju \u010Dasa zadnjega pripenjanja predpomnilnika razredov v skupni rabi.
SHRC229=Napaka\: datoteka predpomnilnika razredov v skupni rabi ima neveljavno glavo.
J9CL015=Izdelava sledenja skladu ni uspela (najverjetneje zaradi pomanjkanja pomnilnika OS).
J9CL016=ni mogo\u010De izdelati novega vnosa razredne poti
J9CL017=ni mogo\u010De dodeliti za vir \u010Dasovnega pasu
J9CL018=ni mogo\u010De dodeliti za vnos \u010Dasovnega pasu
J9CL011=Veje niti OS ni bilo mogo\u010De izdelati
J9CL012=
J9CL013=Dodelitev nadzora OS ni uspela
J9CL014=Neveljaven argument ukazne vrstice JCL
SHRC690=Omejitev poti razredov                  \= true
SHRC211=Iskanje bajtnih podatkov za klju\u010D %.*s v predpomnilniku v skupni rabi ...
SHRC695=Obnovi novi netrajni predpomnilnik v skupni rabi iz posnetka
SHRC212=Shranjevanje bajtnih podatkov za klju\u010D %.*s v predpomnilniku v skupni rabi ...
SHRC696=Podmo\u017Enosti "%s" in "%s" sta nezdru\u017Eljivi. Podmo\u017Enost "%s" bo prezrta
SHRC213=Za vnos razpr\u0161ilne tabele v ByteDataManagerImpl ni mogo\u010De dodeliti pomnilnika
SHRC697=Imenika za predpomnilnik v skupni rabi ni bilo mogo\u010De pridobiti
SHRC214=Mutexa razpr\u0161ilne tabele ByteDataManager ni mogo\u010De vnesti
SHRC698=Netrajni predpomnilnik v skupni rabi "%s" je bil uspe\u0161no obnovljen iz posnetka
SHRC691=Omejitev poti razredov                  \= false
SHRC692=Ustvari posnetek obstoje\u010Dega netrajnega predpomnilnika v skupni rabi
SHRC693=Uni\u010Di posnetek predpomnilnika v skupni rabi (uporabi parameter imena ali privzeto)
SHRC210=[omogo\u010Deni izhodni podatki z razlago bajtnih podatkov -Xshareclasses]
SHRC694=Uni\u010Di vse posnetke predpomnilnika v skupni rabi
SHRC219=[Skupinski dostop -Xshareclasses omogo\u010Den za nove predpomnilnike]
SHRC215=Izdelaj trajni predpomnilnik razredov v skupni rabi
SHRC699=Netrajnega predpomnilnika v skupni rabi "%s" ni bilo mogo\u010De obnoviti iz posnetka
SHRC216=Izdelaj netrajni predpomnilnik razredov v skupni rabi
SHRC217=[Trajen predpomnilnik -Xshareclasses je omogo\u010Den]
SHRC218=[Trajen predpomnilnik -Xshareclasses je onemogo\u010Den]
J9CL004=Nezdru\u017Eljiva razli\u010Dica razredne knji\u017Enice\: pri\u010Dakovano JCL v%1$i, najdeno v%2$i
J9CL005=Nezdru\u017Eljiva razli\u010Dica razredne knji\u017Enice\: zahteva VM v%1$i, najdeno v%2$i
J9CL006=Brez prej potrjenih podatkov za java/lang/Object
J9CL007=vrednost \u010Dasovne omejitve je negativna
J9CL000=Nezdru\u017Eljiva razredna knji\u017Enica
J9CL001=Poskusite zagon z -jcl\:%s
J9CL002=Razredi so iz knji\u017Enice, ki ni J9 ali nepravilno zmanj\u0161ani JXE
J9CL003=Nezdru\u017Eljiva razli\u010Dica razredne knji\u017Enice\: JCL %1$x, VM %2$x
SHRC244=Napaka pri pridobivanju dol\u017Eine datoteke predpomnilnika razredov v skupni rabi.
SHRC245=Napaka pri preslikovanju datoteke predpomnilnika razredov v skupni rabi.
SHRC246=Priklju\u010Den trajni predpomnilnik razredov v skupni rabi %1$s
SHRC247=Napaka\: prepoznano zaporedje bajtov v oglavju datoteke predpomnilnika razredov v skupni rabi ni veljavno.
SHRC240=Napaka\: pisalne klju\u010Davnice pripenjanja datoteke predpomnilnika razredov v skupni rabi ni mogo\u010De pridobiti.
SHRC241=Napaka\: datoteke predpomnilnika razredov v skupni rabi ni mogo\u010De izbrisati.
SHRC242=Napaka pri posodabljanju \u010Dasa zadnjega odpenjanja datoteke predpomnilnika razredov v skupni rabi.
SHRC243=Napaka pri spro\u0161\u010Danju bralne klju\u010Davnice pripenjanja datoteke predpomnilnika razredov v skupni rabi.
SHRC248=Napaka\: razli\u010Dica glave datoteke predpomnilnika razredov v skupni rabi ni veljavna.
SHRC249=Napaka\: raven popravkov glave datoteke predpomnilnika razredov v skupni rabi ni veljavna.
SHRC233=Napaka pri izdelavi glave datoteke predpomnilnika razredov v skupni rabi.
SHRC234=Napaka pri pridobivanju bralne klju\u010Davnice pripenjanja datoteke predpomnilnika razredov v skupni rabi.
SHRC235=Napaka pri spro\u0161\u010Danju bralne klju\u010Davnice pripenjanja datoteke predpomnilnika razredov v skupni rabi.
SHRC236=Izdelan trajni predpomnilnik razredov v skupni rabi %1$s
SHRC230=Med inicializiranjem oglavja podatkov predpomnilnika v skupni rabi je pri\u0161lo do napake
SHRC231=Napaka pri nastavljanju dol\u017Eine datoteke predpomnilnika razreda v skupni rabi.
SHRC232=Predpomnilnika v na\u010Dinu samo za branje ni mogo\u010De izdelati.
SHRC237=Odprti trajni predpomnilnik razredov v skupni rabi %1$s
SHRC238=Napaka\: predpomnilnik razredov v skupni rabi ni pripet.
SHRC239=Napaka\: pisalne klju\u010Davnice glave datoteke predpomnilnika razredov v skupni rabi ni mogo\u010De pridobiti.
SHRC260=Izdelava podro\u010Dja v ByteDataManager ni uspela.
SHRC261=Omogo\u010Di izhodne podatke z razlago za niz intern
SHRC266=[Predpomnjenje za -Xshareclasses znova prenesenih razredov je omogo\u010Deno]
SHRC267=Onemogo\u010Di predpomnjenje razredov iz poti bootclasspath
SHRC268=[Predpomnjenje za -Xshareclasses vnosov bootclasspath je onemogo\u010Deno]
SHRC269=Sistem ne podpira za\u0161\u010Dite pomnilni\u0161ke strani.
SHRC262=Podatkovni bajti \= %d
SHRC263=Omogo\u010Di strani CompositeCache z razlago
SHRC264=Ne zaokro\u017Ei podro\u010Dij predpomnilnika na meje strani
SHRC265=Razredi predpomnilnika, ki so znova preneseni prek JVMTI
EXEL013=\  -Xmn<x>         nastavi velikost novega prostora na <x>
EXEL014=\  -Xmn<x>         nastavi za\u010Detno/maksimalno velikost novega prostora na <x>
EXEL015=\  -Xmns<x>        nastavi za\u010Detno velikost novega prostora na <x>
EXEL016=\  -Xmnx<x>        nastavi maksimalno velikost novega prostora na <x>
EXEL017=\  -Xmo<x>         nastavi velikost starega prostora na <x>
EXEL018=\  -Xmo<x>         nastavi za\u010Detno/maksimalno velikost starega prostora na <x>
EXEL019=\  -Xmos<x>        nastavi za\u010Detno velikost starega prostora na <x>
EXEL010=Vrednosti dodane h "k" (kilo) ali "m" (mega) bodo ustrezno mno\u017Eene.\n
EXEL011=\  -Xmca<x>        nastavi prirastek odseka razreda RAM na <x>
EXEL012=\  -Xmco<x>        nastavi prirastek odseka razreda ROM na <x>
SHRC250=Predpomnilnika ni mogo\u010De odpreti samo za branje, ker \u0161e ni bil inicializiran.
SHRC255=Napaka pri posodabljanju \u010Dasa zadnjega odpenjanja datoteke predpomnilnika v skupni rabi v izhodu JVM
SHRC256=Trajni predpomnilnik v skupni rabi "%1$s" je bil uni\u010Den.
SHRC257=Pomnilnika za postavko povezanega seznama v upravljalniku ni mogo\u010De dodeliti.
SHRC258=Pomnilnika za postavko razpr\u0161ilne tabele v upravljalniku ni mogo\u010De dodeliti.
SHRC251=Predpomnilnikov ne bri\u0161i samodejno iz razli\u010Dnih buildIDs
SHRC252=Napaka pri iskanju datoteke predpomnilnika razredov v skupni rabi.
SHRC253=Napaka pri pisanju v datoteko predpomnilnika razredov v skupni rabi.
SHRC254=Napaka pri nastavljanju dol\u017Eine datoteke predpomnilnika razredov v skupni rabi.
EXEL002=\  -Xbootclasspath/p\:<path>  dodaj <path> pred spremenljivko classpath za\u010Detnega nalaganja
EXEL003=\  -Xbootclasspath/a\:<path>  dodaj <path> spremenljivki classpath za\u010Detnega nalaganja
EXEL004=\n  -Xrun<library>[\:options]  nalo\u017Ei izvirno knji\u017Enico agentov\n                            (opu\u0161\u010Deno zaradi -agentlib)\n
EXEL005=\  -Xint           za\u017Eeni le interpretirane (enakovredno -Xnojit -Xnoaot)
SHRC259=Mutexa razpr\u0161ilne tabele upravljalnika ni mogo\u010De vnesti.
EXEL006=\  -Xnojit         onemogo\u010Di JIT
EXEL007=\  -Xnoaot         ne za\u017Eeni vnaprej zbrane kode
EXEL008=\  -Xfuture        omogo\u010Di najstro\u017Eja preverjanja, s pri\u010Dakovanjem prihodnjih okvar
EXEL009=\nArgumenti k naslednjim mo\u017Enostim so izra\u017Eeni v bajtih.
EXEL000=Naslednje mo\u017Enosti so nestandardne in jih lahko spremenimo brez predhodnega obvestila.\n
EXEL001=\  -Xbootclasspath\:<path>    nastavi za\u010Detno nalaganje spremenljivke classpath na <path>
SHRC280=Izpis vseh predpomnilnikov v cacheDir %s
SHRC281=Poskus uni\u010Denja vseh predpomnilnikov v cacheDir %s
SHRC282=Velikost strani operacijskega sistema ni zdru\u017Eljiva s tem predpomnilnikom. Poteka poskus ponovne izdelave predpomnilnika.
SHRC283=Odpri predpomnilnik z dovoljenji samo za branje
SHRC288=ID pomnilnika v skupni rabi   \= %d
SHRC289=Ne zaznaj, ko se predpomnilnik nahaja na oddaljenem omre\u017Enem datote\u010Dnem sistemu
SHRC284=Predpomnilnika v na\u010Dinu samo za branje ni mogo\u010De izdelati.
SHRC285=Odprt trajen predpomnilnik razredov v skupni rabi %1$s samo za branje
SHRC286=Odprt predpomnilnik razredov v skupni rabi %1$s samo za branje
SHRC287=V omre\u017Enem datote\u010Dnem sistemu ni mogo\u010De najti trajnega predpomnilnika. Izberite mo\u017Enost "netrajen" ali izberite drug imenik predpomnilnika (cacheDir).
EXEL035=\  -Xminf<x>       minimalni odstotek proste kopice po GC
EXEL036=\  -Xmaxf<x>       maksimalni odstotek proste kopice po GC
EXEL037=\nArgumenti za naslednje mo\u017Enosti so izra\u017Eeni kot decimalna \u0161tevila.\n
EXEL038=\  -Xgcthreads<x>                nastavi \u0161tevilo niti GC
EXEL039=\  -Xnoclassgc                   onemogo\u010Di dinami\u010Dno odstranjevanje razredov
EXEL030=\  -Xss<x>         nastavi velikost nitnega sklada na <x>
EXEL031=\  -Xmine<x>       nastavi minimalno velikost za raz\u0161iritev kopice na <x>
EXEL032=\  -Xmaxe<x>       nastavi maksimalno velikost za raz\u0161iritev kopice na <x>
EXEL033=\nArgumenti k naslednjim mo\u017Enostim so izra\u017Eeni kot decimalke od 0 do 1.
EXEL034=Vrednost 0,3 predstavlja zahtevo 30%%\n
SHRC270=Konfiguriraj za\u0161\u010Dito pomnilni\u0161ke strani predpomnilnika
SHRC271=Neprepoznana podmo\u017Enost za mo\u017Enost mprotect\=
SHRC272=Celotna za\u0161\u010Dita pomnilni\u0161ke strani je bila uspe\u0161no omogo\u010Dena za predpomnilnik.
SHRC277=\u010Ce \u017Eelite zagnati pripomo\u010Dek "%s" v netrajnem predpomnilniku v skupni rabi "%s", morate uporabiti podmo\u017Enost "nonpersistent"
SHRC278=Ne spreglejte, da pripomo\u010Dek "%s" ne more delovati v nezdru\u017Eljivem predpomnilniku razredov. "%s". Prosimo, uporabite JVM pravilne ravni.
SHRC279=Ob zagonu znova izdelaj predpomnilnik v skupni rabi
SHRC273=Privzeta za\u0161\u010Dita pomnilni\u0161ke strani je bila uspe\u0161no omogo\u010Dena za predpomnilnik.
SHRC274=Za\u0161\u010Dita pomnilni\u0161ke strani je bila onemogo\u010Dena za predpomnilnik.
SHRC275=Nastavi lokacijo datotek predpomnilnika JVM
SHRC276=Za izvajanje pripomo\u010Dka "%s" v trajnem predpomnilniku razredov "%s" ne uporabite podmo\u017Enosti "nonpersistent".
EXEL024=\  -Xmx<x>         nastavi maksimalni pomnilnik na <x>
EXEL025=\  -Xmr<x>         nastavi zapomnjeno nastavitev na <x>
EXEL026=\  -Xmrx<x>        nastavi maksimalno velikost zapomnjene nastavitve na <x>
EXEL027=\  -Xmso<x>        nastavi velikost nitnega sklada OS na <x>
EXEL028=\  -Xiss<x>        nastavi za\u010Detno velikost javanskega nitnega sklada na <x>
EXEL029=\  -Xss<x>         nastavi maksimalno velikost javanskega nitnega sklada na <x>
EXEL020=\  -Xmox<x>        nastavi maksimalno velikost starega prostora na <x>
EXEL021=\  -Xmoi<x>        nastavi prirastek starega prostora na <x>
EXEL022=\  -Xms<x>         nastavi velikost starega prostora na <x>
EXEL023=\  -Xms<x>         nastavi velikost za\u010Detnega pomnilnika na <x>
EXEL057=
EXEL058=Notranja napaka VM\: Zmanjkalo je pomnilnika
EXEL059=Notranja napaka VM\: Iskanje razreda java/lang/String ni uspelo
EXEL050=\  -Xrdbginfo\:<gostitelj>\:<vrata>  omogo\u010Dite oddaljeni informacijski stre\u017Enik razhro\u0161\u010Devanja
EXEL051=\nOPOZORILO\: Argument "%s" ukazne vrstice je odklonjen.\nOPOZORILO\: Uporabite "-classpath <path>" ali "-cp <path>".
EXEL052=\nOPOZORILO\: Argument "%s" ukazne vrstice je odklonjen.\nOPOZORILO\: Uporabite enakovredni -X.
EXEL053=
EXEL054=
EXEL055=Cilj\: %s
EXEL056=
SHRC291=Za vnos razpr\u0161ilne tabele v ROMClassResourceManager ni mogo\u010De dodeliti pomnilnika
SHRC292=Mutexa razpr\u0161ilne tabele ROMClassResourceManager ni mogo\u010De vnesti
SHRC293=Za podro\u010Dje postavke razpr\u0161ilne tabele v ROMClassResourceManager ni mogo\u010De dodeliti pomnilnika
SHRC294=%1$d\: 0x%2$p CHARARRAY\: na 0x%3$p.
SHRC290=Izdelava nove postavke razpr\u0161ilne tabele v ROMClassResourceManager ni uspela
SHRC299=Predpomnilnik razredov v skupni rabi "%s" ni bil izdelan z ugnezdeno mo\u017Enostjo, zato rast predpomnilnika ni mogo\u010Da
SHRC295=Izklopi odvisnost CORE_MMAP na sistemu AIX
SHRC296=Izvajanje z mo\u017Enostjo "noCoreMmap" bo pomenilo, da vam IBM verjetno ne bo mogel pomagati pri sesutjih, saj bodo v izpisih pomnilnika sistema manjkali podatki razredov
SHRC297=\u010Ce \u017Eelite trajne predpomnilnike razredov v skupni rabi uporabljati v sistemu AIX, mora biti spremenljivka okolja CORE_MMAP nastavljena na "yes"
SHRC298=\u010Ce \u017Eelite pripomo\u010Dek "%s" zagnati na trajnem predpomnilniku razredov "%s", uporabite podmo\u017Enost "persistent"
EXEL046=\  -Xlp                          omogo\u010Di podporo velikih strani
EXEL047=\n  -Xdbg\:<options>               omogo\u010Di odpravljanje napak, mo\u017Enosti standarda JDWP
EXEL048=\  -Xrunjdwp\:<options>          omogo\u010Di odpravljanje napak, mo\u017Enosti standarda JDWP
EXEL049=\  -Xdbginfo\:<symbol file path>  omogo\u010Di odpravljanje napak informacijskega stre\u017Enika
EXEL040=\  -Xclassgc                     omogo\u010Di dinami\u010Dno odstranjevanje razredov
EXEL041=\  -Xalwaysclassgc               omogo\u010Di dinami\u010Dno odstranjevanje razredov na vsakem GC
EXEL042=\  -Xnocompactexplicitgc         onemogo\u010Di strnitev na sistemskem GC
EXEL043=\  -Xcompactexplicitgc           omogo\u010Di strnitev na vsakem sistemskem GC
EXEL044=\  -Xcompactgc                   omogo\u010Di strnitev
EXEL045=\  -Xnocompactgc                 onemogo\u010Di strnitev
SHRC192=Vrednost -Xscmaxaot presega vrednost -Xscmx, zato je bila nastavljena na neomejeno vrednost.
SHRC193=%1$d\: 0x%2$p AOT\: %4$.*3$s
SHRC194=\tza ROMClass %2$.*1$s na 0x%3$p.
SHRC195=Omogo\u010Di izhodne podatke AOT z razlago
SHRC190=Vrednost za -Xscminaot ne sme presegati vrednosti -Xscmaxaot
SHRC191=Vrednost -Xscminaot presega vrednost -Xscmx, zato je bila nastavljena tako, da je enaka vrednosti -Xscmx.
SHRC196=[omogo\u010Deni izhodni podatki z razlago za AOT -Xshareclasses]
SHRC197=Iskanje kode AOT za ROMMethod 0x%1$p v predpomnilniku v skupni rabi...
SHRC198=Shranjevanje kode AOT za ROMMethod 0x%1$p v predpomnilniku v skupni rabi ...
SHRC199=\ %2$.*1$s je bil uspe\u0161no shranjen.
TRCE020=Med prekinitvijo motorja sledenja je pri\u0161lo do \u010Dasovne omejitve
JNCK097=\tadvice         prika\u017Ei nasvet
JNCK098=Napaka JNI v %1$s\: argument \#%2$d pri\u010Dakuje %3$s %4$s, dejanski argument je %5$s %6$s
JNCK095=Napaka JNI v vrnjeni vrednosti \: vrnitveni tip je sklic, vendar vrednost (0x%1$p) ni veljaven sklic na objekt. Njegov tip je\: %2$s
JNCK096=\twarn           prika\u017Ei opozorila
JNCK099=Napaka JNI v %1$s\: argument \#%2$d zahteva vrsto, ki ni metrika
JNCK090=V okviru nadzornika dogodka JVMPI ali JVMTI je bila zaznano opozorilo\n
JNCK093=Napaka JNI v %s\: metoda ni konstruktor
JNCK094=Napaka JNI v %1$s\: podatki, na katere ka\u017Ee argument \#%2$d, so bili spremenjeni med izvajanjem %3$s. Podatke je lahko spremenila druga nit ali ugnezden klic. Rezultat za %4$s je lahko nepravilen, navidezni ra\u010Dunalnik pa lahko postane nestabilen
JNCK091=V okviru nadzornika dogodka JVMPI ali JVMTI je bila zaznan nasvet\n
JNCK092=\tvalist         preveri vnovi\u010Dno uporabo za va_list
JNCK086=Opozorilo JNI v %1$s\: Argument \#%2$d ni java/nio/Buffer. %3$s bo vrnil kodo napake
JNCK087=Napaka JNI v %1$s\: argument \#%2$d ni java/lang/reflect/Method ali java/lang/reflect/Constructor
JNCK084=Opozorilo je zaznano v JNI_OnLoad knji\u017Enice %.*s\n
JNCK085=Nasvet je zaznan v JNI_OnLoad knji\u017Enice %.*s\n
JNCK088=Opozorilo JNI v %1$s\: argument \#%2$d je \u0161ibek sklic. \u0160ibek sklic lahko kadarkoli postane NULL. Sklic mora biti povi\u0161an s pomo\u010Djo NewLocalRef ali NewGlobalRef in nato primerjan z NULL pred klicem %3$s
JNCK089=V okviru nadzornika dogodka JVMPI ali JVMTI je bila zaznana napaka\n
CFRE020=za\u010Detni PC nadzornika izjemnih stanj ni veljaven
CFRE021=podvojeno polje
CFRE022=thisClass mora biti razred
CFRE023=stalno podro\u010Dje je prazno
CFRE024=ime razreda mora biti niz
CFRE025=polje ima dva atributa ConstantValue
CFRE026=neprepoznan tip kode newarray
CFRE027=bitna koda multianewarray se mora sklicevati na razred matrike
CFRE017=ve\u010D atributov StackMap/StackMapTable
CFRE018=notranji razred mora biti razred
CFRE019=za\u010Detek PC-ja lokalne spremenljivke ni veljaven
CFRE031=vrnjeno izjemno stanje mora biti razred
CFRE032=nadrazred vmesnika mora biti java.lang.Object
CFRE033=obseg nadzornika izjemnih stanj je prazen
CFRE034=nedokon\u010Dana bitna koda
CFRE035=nova bitna koda se mora sklicevati na razred
CFRE036=cilj ni navodilo v bitni kodi za skok
CFRE037=temp vsebuje napa\u010Den tip
CFRE038=metoda ima dva atributa izjemnega stanja (Exceptions)
CFRE030=ni\u010Deln nadrazred
CFRE028=bitna koda ldc* se mora sklicevati na konstanto
CFRE029=bitna koda multianewarray se mora sklicevati na razred
CFRE000=%1$s; razred\=%3$.*2$s, metoda\=%5$.*4$s%7$.*6$s, pc\=%8$u
CFRE001=%1$s; razred\=%3$.*2$s, odmik\=%4$u
CFRE002=ime metode ni veljavno
CFRE003=neveljavna glavna razli\u010Dica
CFRE004=neznana bitna koda
CFRE005=podvojen vmesnik
CFRE010=negativen \u0161tevec za pare ujemanja in odmika v bitni kodi lookupswitch
CFRE011=bitna koda anewarray se mora sklicevati na razred
CFRE012=vrednost konstante mora biti vrednost
CFRE013=dol\u017Eina PC-ja lokalne spremenljivke ni veljavna
CFRE014=Atribut Code, podan za izvirno ali abstraktno metodo
CFRE015=vmesniki morajo biti razredi
CFRE016=indeks lokalne spremenljivke je izven dovoljenega obmo\u010Dja v prirastku
CFRE006=neveljaven atribut StackMap/StackMapTable
CFRE007=podpis polja ni veljaven
CFRE008=visoko < nizko v bitni kodi preklopni tabeli
CFRE009=polje vmesnika mora biti javno stati\u010Dno in kon\u010Dno
CFRE064=deskriptor mora biti niz UTF8
CFRE065=ve\u010D atributov metode ograjevanja
CFRE066=ve\u010D atributov InnerClasses
CFRE067=neznana oznaka vnosa v podro\u010Dje konstante
CFRE068=ime razreda ni veljavno
CFRE069=dol\u017Eina atributa je ve\u010Dja od podatkov atributa
CFRE060=kon\u010Dni PC nadzornika izjemnih stanj ni navodilo ali konec matrike bitne kode
CFRE061=ime mora biti niz UTF8
CFRE062=najve\u010Dje podro\u010Dne nastavitve so manj\u0161e od velikosti argumentov
CFRE063=neveljavna metoda klicanja bitne kode invoke
JNCK039=Napaka JNI v %1$s\: argument \#%2$d je NULL (ni\u010Deln)
JNCK037=Napaka JNI v %1$s\: argument \#%2$d (0x%3$p) ni lokalni sklic. Tip argumenta je\: %4$s
JNCK038=Napaka JNI v %1$s\: argument \#%2$d (0x%3$p) ni veljaven sklic na objekt. Tip argumenta je %4$s\n
JNCK031=Napaka JNI v %1$s\: argument \#%2$d je NULL (ni\u010Deln)
JNCK032=Napaka JNI v %1$s\: argument \#%2$d ni jobjectArray
JNCK030=Napaka JNI v %s\: te funkcije ni mogo\u010De klicati, \u010De je GC onemogo\u010Den (funkcija je bila verjetno klicana iz dogodka JVMPI ali JVMTI)
JNCK035=Napaka JNI v %1$s\: argument \#%2$d (0x%3$p) ni globalni sklic. Tip argumenta je\: %4$s
JNCK036=Napaka JNI v %1$s\: argument \#%2$d (0x%3$p) ni \u0161ibek globalni sklic. Tip argumenta je\: %4$s
JNCK033=Napaka JNI v %1$s\: argument \#%2$d ni jarray
JNCK034=Napaka JNI v %1$s\: argument \#%2$d ni %3$s
CFRE075=podpis lokalne spremenljivke ni veljaven
CFRE076=neveljavno magi\u010Dno \u0161tevilo
CFRE077=vmesniki morajo biti abstraktni
CFRE078=indeks razreda ograditvene metode se mora sklicevati na razred
CFRE079=PC nadzornika izjemnih stanj ni veljaven
CFRE070=PC \u0161tevila vrstic ni veljaven
CFRE071=matrika bitne kode je prazna
CFRE072=vnosi niso razvr\u0161\u010Deni v bitni kodi lookupswitch
CFRE073=atribut StackMap/StackMapTable je bil najden izven atributa Code
CFRE074=podan ni bil noben atribut Code
JNCK028=Napaka JNI v %s\: te funkcije ne morete klicati, ko je izjema na \u010Dakanju
JNCK029=Napaka JNI v %s\: te funkcije ne morete klicati znotraj kriti\u010Dnega odseka
JNCK026=Napaka JNI v %s\: za JNIEnv se zdi, da ni veljavna nit, ali je pri\u0161lo do okvare pomnilnika ali pa to ni navidezni ra\u010Dunalnik J9.
JNCK027=Napaka JNI v %s\: JNIEnv ni JNIEnv za aktivno nit.
JNCK020=sklic odpravljanja napak
JNCK021=lokalni sklic v drugem nitenju
JNCK024=Zaznana je napaka JNI. Prekinjanje.
JNCK025=Uporabite -Xcheck\:jni\:nonfatal za nadaljevanje izvajanja, ko so zaznane napake.
JNCK022=spro\u0161\u010Den lokalni sklic
JNCK023=Zaznana je napaka JNI. Nadaljevanje...
CFRE042=velikost matrike bitne kode > 65535
CFRE043=bitne kode ni mogo\u010De raz\u0161iriti
CFRE044=bitna koda invokeinterface je rezervirala re\u017Eo, ki ni ni\u010D
CFRE045=indeks stalnega podro\u010Dja je izven dovoljenega izven dovoljenega obmo\u010Dja
CFRE046=polnjenje bitne kode za preklop ni pravilno
CFRE047=razred vmesnika je lahko samo javen, abstrakten ali zaznamek
CFRE048=indeks lokalne spremenljivke je izven dovoljenega obmo\u010Dja shrambe
CFRE049=bitna koda checkcast se mora sklicevati na razred
CFRE040=dol\u017Eina atributa je manj\u0161a od podatkov atributa
CFRE041=neveljavna vmesna razli\u010Dica
JNCK017=lokalni sklic
JNCK018=globalni sklic
JNCK015=\thelp         natisni ta zaslon
JNCK016=NULL
JNCK019=\u0161ibek globalni sklic
CFRE039=indeks lokalne spremenljivke je izven dovoljenega obmo\u010Dja nalaganja
JNCK010=\tnonfatal       brez izhoda, \u010De so odkrite napake
JNCK013=\tnovalist       ne preveri vnovi\u010Dne uporabe va_list
JNCK014=\tpedantic    izvedi natan\u010Dnej\u0161a, a po\u010Dasnej\u0161a preverjanja
JNCK011=\tnowarn         ne prika\u017Ei opozoril
JNCK012=\tnoadvice       ne prika\u017Ei nasveta
CFRE053=metoda ima ve\u010D kot 255 re\u017E argumentov
CFRE054=bitna koda field se mora sklicevati na Fieldref
CFRE055=kon\u010Dni PC nadzornika izjemnih stanj ni veljaven
CFRE056=napa\u010Den \u0161tevec argumentov bitne kode invokeinterface
CFRE057=tip nadzornika izjemnih stanj mora biti razred
CFRE058=indeks lokalne spremenljivke je izven dovoljenega obmo\u010Dja v vrnitvi pomo\u017Enega programa
CFRE059=PC nadzornika izjemnih stanj ni navodilo
CFRE050=metoda vmesnika mora biti javna in abstraktna
CFRE051=konstanta niza mora biti niz
CFRE052=zunanji razred mora biti razred
JNCK006=\tall            preveri razrede aplikacij in sistema
JNCK007=\tverbose       sledi dolo\u010Dene funkcije in aktivnosti JNI
JNCK004=jnichk \u2013 Pripomo\u010Dek za preverjanje JNI za J9, razli\u010Dica %s
JNCK005=Uporaba\: -Xcheck\:jni\:[option[,option[,...]]]
JNCK008=\ttrace          sledi vse funkcije JNI
JNCK009=\tnobounds       ne izvajajte preverjanja mej v nizih in matrikah
JNCK002=Pripomo\u010Dek za preverjanje JNI\: dogodka ni mogo\u010De priklju\u010Diti
JNCK003=Pripomo\u010Dek za preverjanje JNI\: lokalne shrambe VM ni mogo\u010De dodeliti
JNCK000=-Xcheck\:jni\: neprepoznana mo\u017Enost --> '%s'
JNCK001=Pripomo\u010Dek za preverjanje JNI je name\u0161\u010Den. Uporabite -Xcheck\:jni\:help za uporabo
JNCK082=Nasvet je zaznan v najbolj zunanjem okvirju pripete niti\n
JNCK083=Napaka je zaznana v JNI_OnLoad knji\u017Enice %.*s\n
JNCK080=Napaka je zaznana v najbolj zunanjem okvirju pripete niti\n
JNCK081=Opozorilo je zaznano v najbolj zunanjem okvirju pripete niti\n
SHRC604=Zaloga\: <size> bajtov prostora predpomnilnika za neobdelane podatke razreda
TRCE009=Napaka pri pisanju v posnetkovno datoteko
SHRC605=Velikost pomnilnika za "%s" je prevelika ali dolo\u010Da enote, ki niso 'K','M' ali 'G'.
TRCE008=Napaka pri izvajanju iskanja v datoteki sledenja\: %s
SHRC606=Dodajte nefunkcionalne namige JIT metodam za testiranje; uporabite z -Xint in predhodno zapolnjenim predpomnilnikom.
SHRC607=Shranjenih je bilo %1$s pripetih podatkov %2$s za %8$.*7$s.%4$.*3$s%6$.*5$s
SHRC600=Podro\u010Dje neobdelanih podatkov razreda je po\u0161kodovano, ker velikost %u bajtov pri shranjevanju presega razpolo\u017Eljiv nezasedeni prostor podro\u010Dja ('za\u010Detek nezasedenega prostora'\=%p, 'konec nezasedenega prostora'\=%p).
SHRC601=Velikost podro\u010Dja neobdelanih podatkov razreda            %*c\= %lu
SHRC602=Uporabljeno podro\u010Dje neobdelanih podatkov razreda %%          %*c\= %lu%%
SHRC603=Bajti uporabljenih neobdelanih podatkov razreda           %*c\= %lu
JNCK075=Notranja napaka jnichk v %1$s\: neprepoznan deskriptor 0x%2$x
TRCE001=Napaka pri obdelavi mo\u017Enosti sledenja\: -Xtrace\:%s
JNCK076=Notranja napaka jnichk v %s\: zmanjkalo je pomnilnika
TRCE000=Neprepoznana mo\u017Enost sledenja\: -Xtrace\:%s
JNCK073=Nasvet JNI v %1$s\: podan je bil ukaz JNI_ABORT, vendar ne bo upo\u0161tevan, ker so bili podatki spremenjeni. \n(Izvirni CRC\=0x%2$x, novi CRC\=0x%3$x).\nKer je %4$s vrnil dejansko vsebino matrike, spremembe ne bodo zavr\u017Eene. To morda ne bo tisto, kar ste \u017Eeleli.
TRCE003=Napaka pri obdelavi mo\u017Enosti sledenja, podrobnost\: %s
JNCK074=Nasvet JNI v %s\: medpomnilnik ni spremenjen. Premislite o uporabi JNI_ABORT namesto na\u010Dina 0.
TRCE002=Napaka pri obdelavi mo\u017Enosti sledenja\: -Xtrace\:%s\=%s
TRCE005=Napaka pri pisanju glave v datoteko sledenja\: %s
SHRC608=Najdenih je bilo %1$s pripetih podatkov %2$s za %8$.*7$s.%4$.*3$s%6$.*5$s
JNCK079=V %2$.*1$s.%4$.*3$s%6$.*5$s je bil zaznan nasvet\n
TRCE004=Napaka pri odpiranju datoteke sledenja\: %s
SHRC609=Posodobljenih je bilo %1$s pripetih podatkov %2$s za %8$.*7$s.%4$.*3$s%6$.*5$s
TRCE007=Napaka pri odpiranju generiranja naslednje datoteke sledenja\: %s
JNCK077=V %2$.*1$s.%4$.*3$s%6$.*5$s je bila zaznana napaka\n
TRCE006=Napaka pri pisanju %d bajtov v datoteko sledenja\: %s povratna koda\: %d
JNCK078=V %2$.*1$s.%4$.*3$s%6$.*5$s je bilo zaznano opozorilo\n
JNCK071=Opozorilo JNI\: pomnilnik na 0x%1$p, ki ga je pridobil %2$s, ni bil spro\u0161\u010Den pred vrnitvijo iz izvirnega pomnilnika. To je verjetno pu\u0161\u010Danje pomnilnika.
JNCK072=Nasvet JNI v %1$s\: podan je bil ukaz JNI_COMMIT, vendar bo prezrt.\nKer je %2$s vrnil dejansko vsebino matrice, bo za tem klicem medpomnilnik neveljaven. To morda ne bo tisto, kar ste \u017Eeleli.
TRCE010=Napaka dodelitve izvirnega pomnilnika, vrnitev na nedinami\u010Dne nastavitve sledenja.
JNCK070=Opozorilo JNI v %1$s\: izvirni podatki matrice so bili spremenjeni med %2$s in %3$s.\n(Izvirni CRC\=0x%4$x, novi CRC\=0x%5$x).\nKer je %6$s vrnil kopijo vsebine matrike, bodo nove vsebine izgubljene.
TRCE019=Motor sledenja se ni pravilno inicializiral, RC \= %d
JNCK064=Opozorilo JNI v %1$s\: pri\u0161lo je do samodejne raz\u0161iritve zmogljivosti globalnega \u0161ibkega referen\u010Dnega podro\u010Dja iz %2$d v %3$d.\nTo je lahko pokazatelj pu\u0161\u010Danja pomnilnika.
TRCE012=Ni mogo\u010De odpreti datoteke s \u0161tevcem sledenja %s, \u0161tevci so preusmerjeni na stderr.
JNCK065=Opozorilo JNI v %1$s\: pri\u0161lo je do samodejne raz\u0161iritve zmogljivosti lokalnega referen\u010Dnega okvirja iz %2$d v %3$d. Sklici %4$d so v uporabi.\nZa izrecno rast okvirja uporabite EnsureLocalCapacity ali PushLocalFrame.
TRCE011=Modul ni konfiguriran za sledenje\: %s
JNCK062=Opozorilo JNI v %s\: te funkcije ne smete klicati znotraj kriti\u010Dnega odseka
TRCE014=Inicializacija motorja sledenja ni uspela, sledenje ni omogo\u010Deno
JNCK063=Opozorilo JNI v %1$s\: pri\u0161lo je do samodejne raz\u0161iritve zmogljivosti referen\u010Dnega podro\u010Dja iz %2$d v %3$d.\nTo je lahko pokazatelj pu\u0161\u010Danja pomnilnika.
TRCE013=Zapisovanje informacij o \u0161tevcu sledenja v %s
TRCE016=Shramba za RasGlobalStorage ni na voljo, sledenje ni omogo\u010Deno
JNCK068=Opozorilo JNI v %1$s\: za\u010Detek ali indeks je izven dovoljenega obmo\u010Dja (%2$d >\= %3$d)
JNCK069=Opozorilo JNI v %1$s\: konec je izven dovoljenega obmo\u010Dja (%2$d + %3$d > %4$d)
TRCE015=Napaka pri registraciji naro\u010Dnika za zapisovanje sledenja
TRCE018=Ni mogo\u010De dodeliti klju\u010Da lokalnega pomnilnika niti UTE
JNCK066=Opozorilo JNI v %1$s\: podan je negativen za\u010Detek ali indeks (%2$d)
TRCE017=Ni mogo\u010De dodeliti klju\u010Da lokalnega pomnilnika niti RAS
JNCK067=Opozorilo JNI v %1$s\: podana je negativna dol\u017Eina podro\u010Dja (%2$d)
CFRE086=metoda vsebuje dva atributa Code
CFRE087=bitna koda metode vmesnika se mora sklicevati na InterfaceMethodref
CFRE088=lokalna spremenljivka mora biti niz
CFRE089=pri\u010Dakuje se ime in tip
JNCK060=Opozorilo JNI v %1$s\: argument \#%2$d je nepravilno oblikovan podpis metode ("%3$s")
JNCK061=Opozorilo JNI v %1$s\: argument \#%2$d je nepravilno oblikovan podpis polja ("%3$s")
SHRC620=Napaka pri odpiranju podro\u010Dja skupnega pomnilnika. Sistem je zaznal, da je krmilna datoteka po\u0161kodovana.
CFRE080=podpis metode ni veljaven
SHRC621=Napaka pri odpiranju podro\u010Dja skupnega pomnilnika. ID skupnega pomnilnika se ne ujema.
CFRE081=izvorna datoteka mora biti UTF8
CFRE082=metoda <init> ne sme biti stati\u010Dna, kon\u010Dna, sinhronizirana, izvirna ali abstraktna
CFRE083=razred je hkrati abstrakten in kon\u010Den
CFRE084=brez napak
CFRE085=notranje ime mora biti niz
SHRC626=Statistike o predpomnilniku v skupni rabi ni mogo\u010De pridobiti, ker veljavni predpomnilnik v skupni rabi ne obstaja.
SHRC627=Ponovna izdelava krmilne datoteke skupnega pomnilnika med uporabo na\u010Dina samo za branje ni dovoljena.
SHRC628=Krmilne datoteke skupnega pomnilnika ni mogo\u010De brati.
JNCK059=Opozorilo JNI v %1$s\: argument \#%2$d je nepravilno oblikovan identifikator ("%3$s")
SHRC629=Krmilna datoteka skupnega pomnilnika je samo za branje.
SHRC622=Napaka pri odpiranju podro\u010Dja skupnega pomnilnika. Klju\u010D skupnega pomnilnika se ne ujema.
SHRC623=Napaka pri odpiranju podro\u010Dja skupnega pomnilnika. Preizkus za ID skupine ni uspel.
SHRC624=Napaka pri odpiranju podro\u010Dja skupnega pomnilnika. Preizkus za ID uporabnika ni uspel.
SHRC625=Napaka pri odpiranju podro\u010Dja skupnega pomnilnika. Preizkus za velikost skupnega pomnilnika ni uspel.
JNCK053=Napaka JNI\: kriti\u010Dni odsek mora biti spro\u0161\u010Den preden se funkcija vrne
JNCK054=Napaka JNI v %1$s\: neprepoznana mo\u017Enost na\u010Dina %2$d
JNCK051=Notranja napaka VM v %1$s\: %2$p potisnjenih bajtov je manj\u0161i od %3$p referen\u010Dnih bajtov JNI.
JNCK052=Napaka JNI v %1$s\: razred %3$.*2$s je zastarel
JNCK057=Napaka JNI v %1$s\: z %2$s ne smete sprostiti pomnilnika 0x%3$p, pridobljenega z %4$s
JNCK058=Opozorilo JNI v %1$s\: po klicu %2$s morate s pomo\u010Djo ukazov ExceptionCheck, ExceptionClear ali ExceptionOccurred preveriti, ali je pri\u0161lo do izjemnih stanj, preden kli\u010Dete %3$s
JNCK055=Napaka JNI v %1$s\: kazalca 0x%2$p ni vrnila nobena funkcija JNI oz. je bil kazalec \u017Ee izdan
JNCK056=Napaka JNI v %1$s\: pomnilnik 0x%2$p je bil pridobljen iz objekta 0x%3$p, spro\u0161\u010Den iz 0x%4$p
CFRE097=podvojen vnos notranjega razreda v atributu InnerClasses
CFRE098=podpis lokalne spremenljivke mora biti niz
CFRE099=neveljavni modifikatorji metode
JNCK050=Napaka JNI v %s\: PopLocalFrame je klical brez lokalnega okvirja na skladu
CFRE090=nova bitna koda ne mora izdelovati matrik
CFRE091=za\u010Detni PC nadzornika izjemnih stanj ni navodilo
SHRC610=Onemogo\u010Dite podporo za instrumentacijo bajtne kode.
CFRE092=neveljaven podpis
CFRE093=metoda je lahko javna, zasebna ali za\u0161\u010Ditena
CFRE094=bitna koda instanceof se mora sklicevati na razred
CFRE095=zaznamki morajo biti vmesniki
CFRE096=cilj ni navodilo v bitni kodi za preklop
SHRC615=Med odpiranjem semaforja je pri\u0161lo do napake. Klju\u010D semaforja se ne ujema.
SHRC616=Med odpiranjem semaforja je pri\u0161lo do napake. \u0160tevilo semaforjev v naboru semaforjev se ne ujema.
SHRC617=Med odpiranjem semaforja je pri\u0161lo do napake. Ozna\u010Devalnik semaforjev ni bil najden v naboru semaforjev.
JNCK048=Napaka JNI v %s\: neprimeren prejemnik
SHRC618=Krmilne datoteke semaforja ni mogo\u010De brati.
JNCK049=Napaka JNI v %s\: zaznana ponovna uporaba va_list
SHRC611=Podana je podmo\u017Enost "disableBCI", vendar je bil obstoje\u010Di predpomnilnik ustvarjen s podmo\u017Enostjo "enableBCI".
SHRC612=Umetno nastavite klju\u010D shrambe (0\u201315) v sistemu z/OS za testiranje.
SHRC613=Med odpiranjem semaforja je pri\u0161lo do napake. Sistem je zaznal, da je krmilna datoteka po\u0161kodovana.
SHRC614=Med odpiranjem semaforja je pri\u0161lo do napake. ID semaforja se ne ujema.
JNCK042=Napaka JNI v %1$s\: argument \#%2$d ni podrazred %3$s
JNCK043=Napaka JNI v %1$s\: argument \#%2$d; %3$s ni mogo\u010De najti
JNCK040=Napaka JNI v %1$s\: argument \#%2$d je izven dovoljenega obmo\u010Dja za %3$s (0x%4$x < 0x%5$x)
JNCK041=Napaka JNI v %1$s\: argument \#%2$d je izven dovoljenega obmo\u010Dja za %3$s (0x%4$x > 0x%5$x)
SHRC619=Krmilna datoteka semaforja je samo za branje.
JNCK046=Napaka JNI v %1$s\: metoda vsebuje napa\u010Den vrnitveni tip ('%2$c')
JNCK047=Napaka JNI v %s\: nepravilen argument clazz
JNCK044=Napaka JNI v %s\: metoda je stati\u010Dna
JNCK045=Napaka JNI v %s\: metoda ni stati\u010Dna
SHRC520=\t classpath   Izpi\u0161e samo tipe razredov poti v predpomnilniku v skupni rabi.
SHRC521=\t url               Izpi\u0161e samo tipe URL-jev v predpomnilniku v skupni rabi.
SHRC522=\t token           Izpi\u0161e samo tipe \u017Eetonov v predpomnilniku v skupni rabi.
SHRC527=\t zipcache     Izpi\u0161e samo tipe zipcache v predpomnilniku v skupni rabi.
SHRC528=\t extra           Izpi\u0161e vse naslednje zasebne tipe v predpomnilniku v skupni rabi.
SHRC529=\t orphan         Izpi\u0161e samo osamele tipe (orphan types) v predpomnilniku v skupni rabi.
SHRC523=\t romclass     Izpi\u0161e samo tipe romclass v predpomnilniku v skupni rabi.
SHRC524=\t rommethod   Izpi\u0161e samo tipe rommethod v predpomnilniku v skupni rabi.
SHRC525=\t aot               Izpi\u0161e samo tipe aot v predpomnilniku v skupni rabi.
SHRC526=\t jitprofile Izpi\u0161e samo tipe jitprofile v predpomnilniku v skupni rabi.
SHRC510=Onemogo\u010Di ustvarjanje izpisov pomnilnika v pokvarjenih predpomnilnikih
SHRC511=Sestavljen predpomnilnik ima okvarjeno vrednost zastavice za inicializacijo. Vrednost ccInitComplete je %lu
SHRC516=Privzeto navede vse elemente v predpomnilniku. Razpolo\u017Eljive mo\u017Enosti si oglejte z ukazom printallstats\=help.
SHRC517=Neprepoznana podmo\u017Enost za mo\u017Enost printallstats\= . Razpolo\u017Eljive mo\u017Enosti si oglejte z ukazom printallstats\=help.
SHRC518=Razpolo\u017Eljive mo\u017Enosti za -Xshareclasses\:printAllStats\=<options>. Z znakom '+' podate ve\u010D mo\u017Enosti. \u010Ce je printallstats\=aot+url \n
SHRC519=\t all               Izpi\u0161e vse naslednje tipe v predpomnilniku v skupni rabi.
SHRC512=v predpomnilniku ni podatkov
SHRC513=Dovoljenja za ustvarjanje imenikov predpomnilnikov nastavi v slogu unix
SHRC514=Neveljavna nastavitev za mo\u017Enost cacheDirPerm. To mora biti datoteka dovoljenja v slogu unix, z obsegom 0700\u20130777 ali 1700\u20131777 (osmi\u0161ko predstavljeno).
SHRC515=Privzetega imenika predpomnilnika ni mogo\u010De pridobiti.
SHRC541=%1$d\: 0x%2$p HELPER\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC542=%1$d\: 0x%2$p POOL\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC543=%1$d\: 0x%2$p AOTDATA\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC544=%1$d\: 0x%2$p VM\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC540=%1$d\: 0x%2$p UNKNOWN\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC549=-Xshareclasses\:checkStringTableReset lahko spodleti. Nizovna tabela ni dovolj velika. Biti mora ve\u010Dja od velikosti strani operacijskega sistema. Velikost tabele \= %d, Velikost strani \= %d
SHRC545=%1$d\: 0x%2$p ROMSTRING\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC546=%1$d\: 0x%2$p UNUSED1\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC547=Pomnilnika za matriko znakov v shrinit ni mogo\u010De dodeliti
SHRC548=Uveljavite preverjanje za ponastavitev tabele nizov, ko je ozna\u010Den kot okvarjen.
SHRC530=\t jithint       Izpi\u0161e samo tipe jithint v predpomnilniku v skupni rabi.
SHRC531=\t aotch           Izpi\u0161e samo tipe aotch v predpomnilniku v skupni rabi.
SHRC532=\t aotthunk     Izpi\u0161e samo tipe aotthunk v predpomnilniku v skupni rabi.
SHRC533=\t aotdata       Izpi\u0161e samo tipe aotdata v predpomnilniku v skupni rabi.
SHRC538=%1$d\: 0x%2$p AOTCH\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC539=%1$d\: 0x%2$p AOTTHUNK\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC534=\t jcl               Izpi\u0161e samo tipe jcl v predpomnilniku v skupni rabi.
SHRC535=\t bytedata     Izpi\u0161e vse druge tipe bytedata v predpomnilniku v skupni rabi.
SHRC536=%1$d\: 0x%2$p JITHINT\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC537=%1$d\: 0x%2$p JCL\: %4$.*3$s Naslov\: 0x%5$p Velikost\: %6$d
SHRC563=Odpiranje predpomnilnika Realtime, ki ni zdru\u017Eljiv s tem navideznim strojem Java. Za dostop do tega predpomnilnika uporabite mo\u017Enost -Xrealtime JVM
SHRC564=[predpomnilnik, ki ga ima v skupni rabi ve\u010D gostov, -Xshareclasses je omogo\u010Den]
SHRC565=Ustvari predpomnilnik, ki ga ima v skupni rabi ve\u010D gostov
SHRC566=Vpadljivo zaporedje znakov glave predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov, ni veljavno
SHRC560=Notranje ime predpomnilnika ni ustrezno.
SHRC561=Inicializacija predpomnilnika razredov v skupni rabi ni uspela, ker datote\u010Dnem sistemu ni dovolj prostora. Razpolo\u017Eljivi prosti bajti diskovnega prostora \= %lld, zahtevani bajti \= %lld.
SHRC562=Bere po\u0161kodovane podatke za glavo vnosa v predpomnilnik 0x%p (neveljavna dol\u017Eina postavke z velikostjo %u bajtov)
SHRC567=Predpomnilnik razredov, ki ga ima v skupni rabi ve\u010D gostov, je samo za branje\: %1$s
SHRC568=Odprt je predpomnilnik razredov, ki ga ima v skupni rabi ve\u010D gostov, %1$s
SHRC569=Ustvarjen je predpomnilnik razredov, ki ga ima v skupni rabi ve\u010D gostov, %1$s
SHRC552=Za predpomnilnik "%s" ni mogo\u010De dodeliti zahtevane velikosti bloka. Razpolo\u017Eljivi bajti \= %d, Zahtevani bajti \= %d
SHRC553=Predpomnilnik vsebuje samo razrede s \u0161tevilkami vrstic
SHRC554=Predpomnilnik vsebuje samo razrede brez \u0161tevilk vrstic
SHRC555=Predpomnilnik vsebuje razrede s \u0161tevilkami vrstic in razrede brez \u0161tevilk vrstic
SHRC550=Manjka oznaka izvajalnega okolja ROUND_TO_PAGE_SIZE. -Xshareclasses\:checkStringTableReset zahteva zaokro\u017Eitev znakovne tabele na velikost strani.
SHRC551=Predpomnilnik "%s" je ozna\u010Den kot poln. Dodelitev velikosti bloka \= %d ni uspela.
SHRC556=Izpi\u0161e povzetek statisti\u010Dnih podatkov o predpomnilniku. Razpolo\u017Eljive mo\u017Enosti si oglejte z ukazom printstats\=help.
SHRC557=Neprepoznana podmo\u017Enost za mo\u017Enost printstats\= . Razpolo\u017Eljive mo\u017Enosti si oglejte z ukazom printstats\=help.
SHRC558=Razpolo\u017Eljive mo\u017Enosti za -Xshareclasses\:printStats\=<options>. Z znakom '+' podate ve\u010D mo\u017Enosti. \u010Ce je printstats\=aot+url \n
SHRC559=Ni mogo\u010De izdelati imenika "%s" za predpomnilnik razredov v skupni rabi
SHRC580=Napaka pri sprostitvi zaklepa branja pripenjanja predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov
SHRC101=\tIndeks %1$d v razredni poti 0x%2$p
SHRC585=Napaka pri pridobivanju zaklepa branja glave predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov
SHRC102=\tURL 0x%p
SHRC586=Napaka\: predpomnilnik razredov, ki ga ima v skupni rabi ve\u010D gostov, ima neveljavno glavo
SHRC103=\t\u017Deton 0x%p
SHRC587=Napaka pri posodabljanju \u010Dasa zadnjega pripenjanja predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov
SHRC104=%1$d\: RAZREDNA POT 0x%2$p
SHRC588=Napaka pri sprostitvi zaklepa branja glave predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov
SHRC581=Napaka pri preslikavi objekta, ki ga ima v skupni rabi ve\u010D gostov
SHRC582=Napaka\: predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov, ni mogo\u010De izbrisati
SHRC583=Napaka pri posodabljanju \u010Dasa oddelitve "last detached" za predpomnilnik razredov, ki ga ima v skupni rabi ve\u010D gostov
SHRC100=%1$d\: 0x%2$p ROMCLASS\: %4$.*3$s na 0x%5$p.
SHRC584=Napaka pri pridobivanju zaklepa branja pripenjanja predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov
SHRC109=\!ZASTARANO\!
SHRC105=%1$d\: URL 0x%2$p
SHRC589=Ustvarite predpomnilnik s podporo za instrumentacijo bajtne kode.
SHRC106=%1$d\: \u017DETON 0x%2$p
SHRC107=\t%.*s
SHRC108=\t%.*s
SHRC574=Predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov, ni mogo\u010De poiskati v omre\u017Enem datote\u010Dnem sistemu. Izberite mo\u017Enost "netrajen" ali izberite drug imenik predpomnilnika (cacheDir).
SHRC575=Napaka pri pridobivanju zaklepa pisanja za glavo v predpomnilniku razredov, ki ga ima v skupni rabi ve\u010D gostov
SHRC576=Predpomnilnika, ki ga ima v skupni rabi ve\u010D gostov, ni mogo\u010De odpreti samo za branje, ker \u0161e ni bil uvodno nastavljen
SHRC577=Predpomnilnika, ki ga ima v skupni rabi ve\u010D gostov, ni mogo\u010De ustvariti v na\u010Dinu samo za branje
SHRC570=Predpomnilnik, ki ga ima v skupni rabi ve\u010D gostov, "%1$s" je bil uni\u010Den
SHRC571=Predpomnilnik razredov, ki ga ima v skupni rabi ve\u010D gostov, je pripet\: %1$s
SHRC572=Najdena je bila nepravilna specifikacija cilja. Cilj, dolo\u010Den v glavi predpomnilnika, je %s, a pri\u010Dakovan je bil %s.
SHRC573=Mo\u017Enost ukazne vrstice "-Xshareclasses\:%s" zahteva "-Xvirt"
SHRC578=Napaka pri izdelavi glave predpomnilnika razredov, ki ga ima v skupni rabi ve\u010D gostov
SHRC579=Med inicializiranjem glave podatkov predpomnilnika, ki ga ima v skupni rabi ve\u010D gostov, je pri\u0161lo do napake
SHRC123=%% Zastareli razredi \= %1$d%%\n
SHRC124=Predpomnilnik je %1$d%% poln\n
SHRC125=Pomnilnika za nizovni medpomnilnik v SH_CacheMap ni bilo mogo\u010De dodeliti.
SHRC126=Izdana je bila zahteva za dodajanje preve\u010D postavk v ClasspathItem.
SHRC120=\# URL-jev           \= %d
SHRC121=\# \u017Detonov         \= %d
SHRC122=\# Zastaranih razredov  \= %d
SHRC127=SH_CompositeCache\:\:enterMutex ni uspela s povratno kodo %d. Opozorilo\: va\u0161 predpomnilnik je lahko pokvarjen.
SHRC128=SH_CompositeCache\:\:exitMutex ni uspela s povratno kodo %d. Opozorilo\: va\u0161 predpomnilnik je lahko pokvarjen.
SHRC129=Poskus nastavitve readerCount na -1.
SHRC590=Podmo\u017Enost "enableBCI" je bila podana, vendar obstoje\u010Di predpomnilnik ni bil ustvarjen s podmo\u017Enostjo "enableBCI".
SHRC591=%1$d\: 0x%2$p JITHINT\: %4$.*3$s
SHRC112=dodelitvena kazalka \= 0x%p\n
SHRC596=Pri shranjevanju in dodeljevanju zunaj vrsti\u010Dnih podatkov razreda izvedite dodatne preizkuse.
SHRC113=velikost predpomnilnika       \= %d
SHRC597=\u0160tevilo bajtov -Xshareclasses\:rcdSize\=%u presega %u bajtov razpolo\u017Eljivega nezasedenega prostora, namesto tega bo uporabljeno -Xshareclasses\:rcdSize\=%u.
SHRC114=prosti bajti       \= %d
SHRC598=Podro\u010Dje neobdelanih podatkov razreda je po\u0161kodovano, ker je velikost elementa %lu ve\u010Dja od skupne velikosti predpomnilnika elementa %lu.
SHRC115=bajti ROM razreda  \= %d
SHRC599=Nezasedeni prostor podro\u010Dja neobdelanih podatkov razreda je po\u0161kodovan ('za\u010Detek nezasedenega prostora'\=%p, 'konec nezasedenega prostora'\=%p, 'velikost razpolo\u017Eljivega prostora'\=%lu bajtov)
SHRC592=Omogo\u010Den BCI       \= true
SHRC593=Omogo\u010Den BCI       \= false
SHRC110=\nosnovni naslov       \= 0x%p
SHRC594=Podmo\u017Enost -Xshareclasses\:cacheRetransformed ni zdru\u017Eljiva s pomnilnikom v skupni rabi, ustvarjenim s podmo\u017Enostjo enableBCI
SHRC111=kon\u010Dni naslov        \= 0x%p
SHRC595=Mo\u017Enosti ukazne vrstice "%s" in "%s" sta nezdru\u017Eljivi
SHRC116=bajti metapodatkov   \= %d
SHRC117=Uporabljenih %% metapodatkov    \= %1$d%%\n
SHRC118=\# ROM razredov (ROMClasses)     \= %d
SHRC119=\# poti razredov     \= %d
J9TI006=Opusti raz\u0161irjene zmogljivosti iz capabilities_ptr.
J9TI007=Pridobi trenutni niz raz\u0161irjenih zmogljivosti prek capabilities_ptr.
J9TI004=Se vrne prek capabilities_ptr, raz\u0161irjenih zmogljivostih, ki so trenutno na voljo.
SHRC140=velikost\:\t%1$d\t\t\t%2$d\n
J9TI005=Dodaj nove raz\u0161irjene zmogljivosti iz capabilities_ptr.
J9TI008=Poka\u017Ee za\u010Detek faze prevajanja JIT. (Ni varno pred povratnim klicem)
J9TI009=Poka\u017Ee konec faze prevajanja JIT. (Ni varno pred povratnim klicem)
SHRC145=Iskanje razreda %1$s v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d z URL-jem %4$.*3$s...
SHRC146=Iskanje razreda %1$s v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d z \u017Eetonom %4$.*3$s...
VMUT001=(neimenovana nit)
SHRC147=Znak %.*s ni veljaven za ime predpomnilnika
VMUT000=(zmanjkalo je pomnilnika)
SHRC148=Dovoli skupinski dostop do predpomnilnika (uporabnik je privzet)
VMUT003=Datoteke mo\u017Enosti ni mogo\u010De najti
SHRC141=neujemajo\u010Di se bajti\:
VMUT002=(napaka med dostopom)
SHRC142=\tpri 0x%1$p\t\t%2$x \!\= %3$x
VMUT005=Prevelika mo\u017Enost\: '%s'
SHRC143=Shranjevanje razreda %2$.*1$s v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z URL-jem %5$.*4$s...
VMUT004=Nepravilno oblikovana mo\u017Enost\: '%s'
SHRC144=Shranjevanje razreda %2$.*1$s v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z \u017Eetonom %5$.*4$s...
SHRC149=Omogo\u010Di izhodne podatke za iskanje/shranjevanje z razlago
J9TI002=Agent_OnLoad ni mogo\u010De najti v knji\u017Enici %s
J9TI003=Agent_OnLoad ni uspel za knji\u017Enico %s
J9TI000=Pri poskusu nalaganja knji\u017Enice agentov %s je zmanjkalo pomnilnika
J9TI001=Knji\u017Enice agentov %1$s ni bilo mogo\u010De odpreti (%2$s)
J9TI017=Nadzoruje razli\u010Dne navidezne ra\u010Dunalnike in mo\u017Enosti prevajanja.
J9TI018=Nastavi metodo za izbirno obve\u0161\u010Danje o vhodu in izhodu.
J9TI015=Zahteva izpis pomnilnika za Java Lock Monitor (JLM).
J9TI016=Omogo\u010Di optimizacijo prevajalnika v prisotnosti dogodkov vhoda in izhoda metod (ki lahko povzro\u010Dijo napa\u010Dno sporo\u010Danje vhoda in izhoda)
J9TI019=Nastavi na\u010Din obve\u0161\u010Danja za raz\u0161irjene dogodke in dopu\u0161\u010Da izbiranje na ravni niti
SHRC134=Izdelava podro\u010Dja v SH_ROMClassManagerImpl ni uspela.
VMUT010=Nepravilno oblikovana vrednost mo\u017Enosti, mo\u017Enost "%1$s%3$.*2$s" vsebuje zaklju\u010Dne znake "%4$s", ki so bili prezrti
SHRC135=Izdelava razpr\u0161ilne tabele v SH_ROMClassManagerImpl ni uspela.
SHRC136=Nadzornika v SH_ROMClassManagerImpl ni mogo\u010De izdelati.
VMUT012=%2$.*1$s ni neposredno nadrejen vmesnik %4$.*3$s.
VMUT011=Pomnilnika za polje mo\u017Enosti ukazne vrstice ni mogo\u010De dodeliti
SHRC137=VARNI NA\u010CIN\: Opozorilo\: ROM razred %.*s se ne ujema z ROM razredom v predpomnilniku
SHRC130=Poskus dodelitve, ko je odobritev \u0161e vedno v teku.
VMUT014=Prejemni\u0161ki razred %2$.*1$s mora biti trenutni razred ali podtip vmesnika %4$.*3$s
SHRC131=Pomnilnika za postavko povezanega seznama v ROMClassManagerImpl ni mogo\u010De dodeliti.
VMUT013=Datoteka mo\u017Enosti %s je neveljavna
SHRC132=Pomnilnika za postavko razpr\u0161ilne tabele v ROMClassManagerImpl ni mogo\u010De dodeliti.
SHRC133=Mutexa razpr\u0161ilne tabele ROMClassManager ni mogo\u010De vnesti.
VMUT007=Nepravilno oblikovana vrednost za JAVA_TOOL_OPTIONS
VMUT006=V -Xoptionsfile je bila najdena nepravilno oblikovana mo\u017Enost %s
VMUT009=Nepravilno oblikovana vrednost za -Xservice
VMUT008=Nepravilno oblikovana vrednost za IBM_JAVA_OPTIONS
SHRC138=Najden je bil ve\u010D kot en osamel element ROMClass za %.*s.
SHRC139=\n\tROMClass je shranjen\tROMClass v predpomnilniku
J9TI010=Vnos metode z raz\u0161irjenimi informacijami o tipu metode.
J9TI013=Dovoli povratne klice za pomo\u017Ene dodelitve (tiste, o katerih ne poro\u010Da VMObjectAlloc).
J9TI014=Nadzoruje nadzornika Java Lock Monitor (JLM) (COM_IBM_JLM_START, COM_IBM_JLM_START_TIME_STAMP, COM_IBM_JLM_STOP, COM_IBM_JLM_STOP_TIME_STAMP).
J9TI011=Dodaj dinami\u010Dno mo\u017Enost -Xtrace
J9TI012=Dodaj dinami\u010Dno mo\u017Enost -Xdump
SHRC160=\u010Cakanje na izdelovalni mutex med odpiranjem semaforja je poteklo
SHRC161=\u010Cakanje na izdelovalni mutex med izdelovanjem pomnilnika v skupni rabi je poteklo
SHRC162=\u010Cakanje na izdelovalni mutex med odpiranjem pomnilnika v skupni rabi je poteklo
SHRC167=Onemogo\u010Di skupno rabo razredov
SHRC168=Skupaj prebranih bajtov razreda v skupni rabi\=%1$lld. Skupaj shranjenih bajtov\=%2$d
SHRC169=Odkrita sprememba v %2$.*1$s...\n \t... %3$d predpomnjenih razredov je bilo ozna\u010Deno kot zastarelih
SHRC163=[omogo\u010Den izpis z razlago -Xshareclasses]
SHRC164=[omogo\u010Den V/I izpis z razlago -Xshareclasses]
SHRC165=[omogo\u010Den izpis z razlago API-ja pomo\u010Dnika -Xshareclasses]
SHRC166=Priklju\u010Den v predpomnilnik "%1$s", velikost\=%2$d bajtov
SHRC150=Omogo\u010Di izpis API-ja pomo\u010Dnika z razlago
SHRC151=Zadr\u017Ei vsa sporo\u010Dila
SHRC156=Napaka pri kopiranju imena skupine v ime pomnilnika
SHRC157=Zahtevanih %1$d bajtov pomnilnika v skupni rabi ni mogo\u010De dodeliti \n  \tNajve\u010Dja dovoljena velikost pomnilnika v skupni rabi (%2$d bitov) je bila uspe\u0161no dodeljena \n  \t(\u010Ce \u017Eelite pove\u010Dati pomnilnik v skupni rabi, ki je na voljo, spremenite vrednost sistema SHMMAX)
SHRC158=Izdelan je bil predpomnilnik razredov v skupni rabi "%1$s".
SHRC159=Odprt je bil predpomnilnik razredov v skupni rabi "%1$s".
SHRC152=Vedno za\u017Eeni JVM, ne glede na napake/opozorila
SHRC153=Podajte ime predpomnilnika v skupni rabi\n \t(Za zamenjavo imena skupine uporabite %%g, za uporabni\u0161ko ime pa %%u)
SHRC154=Ube\u017Eni znak %.*s ni veljaven za ime predpomnilnika
SHRC155=Napaka pri kopiranju uporabni\u0161kega imena v ime predpomnilnika
SHRC181=Mutexa razpr\u0161ilne tabele ScopeManagerImpl ni mogo\u010De vnesti.
SHRC182=Nadzornika v ScopeManagerImpl ni mogo\u010De izdelati.
SHRC183=Razpr\u0161ilne tabele v ScopeManagerImpl ni mogo\u010De izdelati.
SHRC184=\tParticija %.*s
SHRC180=Pomnilnika za postavko razpr\u0161ilne tabele v ScopeManagerImpl ni mogo\u010De dodeliti.
SHRC189=\# Metode AOT       \= %d
SHRC185=\tModContext %.*s
SHRC186=\tParticija %.*s v ModContext %.*s
SHRC187=Onemogo\u010Di shranjevanje podatkov AOT v predpomnilniku v skupni rabi
SHRC188=Bajti AOT           \= %d
SHRC170=Podajte ime predpomnilnika v skupni rabi\n \t(Za zamenjavo uporabni\u0161kega imena uporabite %%u)
SHRC171=z/OS ne more izdelati predpomnilnika zahtevane velikosti\: Preverite nastavitve BPXPRMxx v sistemu z/OS
SHRC172=Zaradi omejitev operacijskega sistema ni mogo\u010De izdelati predpomnilnika zahtevane velikosti.
SHRC173=Nastavite imenik za krmilne datoteke JVM (napredno)
SHRC178=Prezrtje mo\u017Enosti noIncrementalUpdates zaradi uporabe mo\u017Enosti singleJVM
SHRC179=Segment ROMClass je okvarjen. Med branjem ROMClass v 0x%p je pri\u0161lo do napake.
SHRC174=Omogo\u010Di optimizacije za uporabo posameznega JVM-ja
SHRC175=Pomnilnik naj se ohrani po vnovi\u010Dnih zagonih (samo Windows)
SHRC176=Omogo\u010Dena relokacija invariante niza
SHRC177=Izvajanje v varnem na\u010Dinu ni mogo\u010De zaradi uporabe mo\u017Enosti singleJVM
SHRC082=identifiedMutex v SH_ClasspathManagerImpl2 ni mogo\u010De izdelati.
J9VM039=-Xscmx se prezre, \u010De -Xshareclasses ni podan
SHRC083=Pomnilnika za matriko identifiedClasspaths v SH_ClasspathManagerImpl2 ni mogo\u010De dodeliti.
SHRC084=Pomnilnika za postavko povezanega seznama ni mogo\u010De dodeliti.
SHRC085=Pomnilnika za glavo postavke povezanega seznama ni mogo\u010De dodeliti.
SHRC080=Pomnilnika za vnos razpr\u0161ilne tabele ni mogo\u010De dodeliti.
SHRC081=cpeTableMutex v SH_ClasspathManagerImpl2 ni mogo\u010De izdelati.
SHRC086=Mutexa razpr\u0161ilne tabele ClasspathManager ni mogo\u010De vnesti.
SHRC087=MarkStale ni uspel med ClasspathManager\:\:update().
SHRC088=Izdelava predpomnilnika kot cache ROMImageSegment v SH_CacheMap ni uspela.
SHRC089=Mutexa osve\u017Eitve v SH_CacheMap ni mogo\u010De izdelati.
J9TI060=Ustvari naro\u010Dnino na zapise GC z razlago
J9TI061=Prekli\u010De naro\u010Dnino na zapise GC z razlago
J9VM030=Neveljaven UTF8 uporabljen v funkciji JNI
J9VM031=Zahtevani razred %2$.*1$s mora biti v zagonski razredni poti, vendar je bil najden v razredni poti aplikacije v %4$.*3$s
J9TI064=Funkcija inicializacije agenta %s ni uspela za knji\u017Enico %s, povratna koda %d
CDRT000=Zemljevida skladov JIT ni mogo\u010De najti \u2013 prekinjanje VM
J9VM032=Nepopravljiva napaka\: ni mogo\u010De nalo\u017Eiti %1$s\: %2$s
J9TI065=Funkcija inicializacije agenta %s ni najdena v knji\u017Enici %s
J9VM033=Nepopravljiva napaka\: uvodna nastavitev %s ni uspela
J9TI062=Pridobi kazalec J9VMThread iz jthread
CDRT002=Neuspevanje osebnega ra\u010Dunalnika\: %1$p (offset %2$p), metaData \= %3$p
J9VM034=JVMRI zahteva motor sledenja; za\u017Eenite z oznako -Xtrace.
J9TI063=Pridobi kazalec J9Method iz JMethodID
CDRT001=Metoda\: %2$.*1$s.%4$.*3$s%6$.*5$s (%7$p)
J9VM035=Ni mogo\u010De dodeliti OutOfMemoryError
J9VM036=deljen z ni\u010D
J9VM037=Nadzora ni mogo\u010De dodeliti
J9TI066=Ustvarite naro\u010Dnino za sledilne to\u010Dke VM
J9VM038=-Xthr\: neprepoznana mo\u017Enost --> '%s'
J9TI067=Prekli\u010Dite naro\u010Dnino za sledilne to\u010Dke VM
SHRC071=Mo\u017Enost ukazne vrstice "%s" zahteva podmo\u017Enost.
J9VM028=\tat %2$.*1$s.%4$.*3$s (%6$.*5$s\:%7$u)
SHRC072=Neprepoznana mo\u017Enost ukazne vrstice "%s".
J9VM029=\tpri (neznana metoda)
SHRC073=Shranjevanje razreda %2$.*1$s v predpomnilnik v skupni rabi za ID nalagalnika razredov %3$d z URL-jem %5$.*4$s (indeks %6$d)...
SHRC074=\ Uspelo.
SHRC070=Prirastne posodobitve so onemogo\u010Dene.
SHRC079=Razpr\u0161ilne tabele v SH_ClasspathManagerImpl2 ni mogo\u010De izdelati.
SHRC075=\ Ni uspelo.
SHRC076=Iskanje razreda %1$s in v predpomnilniku v skupni rabi za ID nalagalnika razredov %2$d ...
SHRC077=Izdelava podro\u010Dja linkedListImpl v SH_ClasspathManagerImpl2 ni uspela.
SHRC078=Izdelava podro\u010Dja linkedListHdr v SH_ClasspathManagerImpl2 ni uspela.
J9VM020=Iskano v %.*s
J9VM021=Zmanjkalo je pomnilnika za preslikavo skladov interpreterja \u2013 VM prekinjen
J9VM022=Zemljevid skladov ni uspel, rezultat \= %p \u2013 VM prekinjen
J9VM023=To nakazuje neveljavno JAVA_HOME ali pa razredne knji\u017Enice niso name\u0161\u010Dene
J9VM024=Izjemno stanje v niti "%.*s"\# START NON-TRANSLATABLE
J9VM025=\tat %2$.*1$s.%4$.*3$s (Izvirna metoda)
J9VM026=\tat %2$.*1$s.%4$.*3$s (Neznan vir)
J9VM027=\tat %2$.*1$s.%4$.*3$s (%6$.*5$s)
J9VM050=-Xjni\: neprepoznana mo\u017Enost --> '%s'
J9VM051=Uporaba\:\n
J9VM052=\ Nastavljena najve\u010Dja velikost -Xjni\:arrayCacheMax\=[<x>|unlimited] predpomnjene matrike JNI\n
J9VM053=V -Xoptionsfile je bila najdena nepravilno oblikovana mo\u017Enost %s
J9VM054=Izdelava niti ni uspela\: retVal %1$zd, errno %2$zd
J9VM055=Nepopravljiva napaka\: razli\u010Dica JXE Major je druga\u010Dna od %d
J9VM056=Glavna razli\u010Dica
J9VM057=Omejitev predpomnilnika nadzornika je prese\u017Eena
J9VM058=-Xscminaot se prezre, \u010De -Xshareclasses ni podan
J9VM059=-Xscmaxaot se prezre, \u010De -Xshareclasses ni podan
SHRC093=Med posodabljanjem je bila odkrita nepri\u010Dakovana zaklju\u010Ditev drugega JVM.
SHRC094=Najden je bil osirotel element, vendar je bil lokalni ROMClass posredovan v addROMClassToCache.
SHRC095=Poskusi klicanja markStale za postavke predpomnilnika v skupni rabi niso uspeli.
SHRC096=Predpomnilnik v skupni rabi "%s" je poln. Za nastavitev velikosti predpomnilnika uporabite -Xscmx.
SHRC090=Pridobitev mutexa predpomnilnika v zagonu SH_CacheMap ni uspela.
SHRC091=Branje okvarjenih podatkov za postavko 0x%p (neveljaven dataType).
SHRC092=Napaka ADD pri branju predpomnilnika.
SHRC097=Predpomnilnik v skupni rabi "%s" je okvarjen. Novi JVM-ji ne bodo dovoljeni za povezavo s predpomnilnikom.\n \tObstoje\u010Di JVM-ji lahko \u0161e vedno delujejo, vendar ne morejo posodabljati predpomnilnika.
SHRC098=\nTrenutni statisti\u010Dni podatki za predpomnilnik "%s"\: \n
SHRC099=%1$d\: 0x%2$p OSAMEL\: %4$.*3$s pri 0x%5$p.
JITM031=Vrednost za '%s' ni pravilna
JITM032=Mo\u017Enost '%1$s' ni popolna, podajte parameter '%2$s'.
J9VM040=zgornja prekora\u010Ditev sklada operacijskega sistema
JITM030=vrednost %s je prevelika
J9VM041=napa\u010Dno \u0161tevilo argumentov
JITM035=Velika velikost strani %1$zu%2$s ni podprta velikost strani za kodni predpomnilnik JIT; namesto tega bo uporabljeno %3$zu%4$s %5$s
J9VM042=Konfiguracija niti
JITM036=Velika velikost strani %1$zu%2$s %3$s ni podprta velikost strani za kodni predpomnilnik JIT; namesto tega bo uporabljeno %4$zu%5$s
J9VM043=-----------------------
JITM033=V mo\u017Enosti '-Xlp' so odkrite dodatne vejice \u2013 prezrto
J9VM044=Troslojni sistemski nadzorniki so podprti
JITM034=Velika velikost strani %1$zu%2$s ni podprta velikost strani za kodni predpomnilnik JIT; namesto tega bo uporabljeno %3$zu%4$s
J9VM045=Troslojni sistemski nadzorniki niso podprti
J9VM046=JLM je podprt
J9VM047=JLM ni podprt
JITM037=Velika velikost strani %1$zu%2$s %3$s ni podprta velikost strani za kodni predpomnilnik JIT; namesto tega bo uporabljeno %4$zu%5$s %6$s
J9VM048=\u010Casi zadr\u017Eanja JLM so podprti
J9VM049=\u010Casi zadr\u017Eanja JLM niso podprti
J9TI028=Poro\u010Da o koncu izpisa pomnilnika RAS.
J9TI029=Izvede poizvedbo o konfiguraciji agenta izpisa pomnilnika RAS.
JITM019=Neujemanje funkcij so\u010Dasnega brskanja. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI026=Spro\u017Ei izpis pomnilnika s pomo\u010Djo podane konfiguracije RAS.
J9TI027=Poro\u010Da o za\u010Detku izpisa pomnilnika RAS.
J9RI019=jvmri->InjectOutOfMemory ni podprt.
J9RI017=Ni mogo\u010De dodeliti agenta izpisa v jvmri->SetOutOfMemoryHook, funkcija ni registrirana.
J9RI018=jvmri->NotifySignal vi\u0161anje signala %d.
JITM020=Neujemanje funkcij pregrade branja programske opreme. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
JITM021=Neujemanje funkcij TM. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
JITM024=Neujemanje premika stisnjenih sklicev (compressedrefs). Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI020=Pridobi ID niti OS iz jthread
J9RI015=jvmri->RunDumpRoutine\: ID komponente je zunaj meja.
JITM025=SCC je prevelik, da bi JIT lahko ustrezno zakodiral odmike. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI021=Pridobi raz\u0161irjene informacije okvirja
J9RI016=jvmri->SetOutOfMemoryHook je klical z ni\u010Delnim povratnim klicem, funkcija ni registrirana.
JITM022=Neujemanje Lockword. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9RI013=jvmri->ReleaseRasInfo\: struktura ima polje nepodprtega tipa.
JITM023=Neujemanje velikosti podmatrik (arraylet). Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9RI014=jvmri->RunDumpRoutine\: ni mogo\u010De pridobiti podatkov o komponentah.
JITM028=Sistemska konfiguracija ne podpira parametra '%.*s' v mo\u017Enosti '-Xlp'
J9TI024=Izhod iz metode brez vrnjene vrednosti.
J9RI011=Struktura RasInfo ima polje nepodprtega tipa.
JITM029=%s mora slediti \u0161tevilo
J9TI025=Omogo\u010Di neposredni JNI v prisotnosti dogodkov vhoda in izhoda metode (kar lahko povzro\u010Di napa\u010Dno sporo\u010Danje vhoda in izhoda)
J9RI012=jvmri->ReleaseRasInfo je klical z ni\u010Delno strukturo RasInfo.
JITM026=Neznana te\u017Eava. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI022=Pridobi raz\u0161irjene informacije okvirja za vse sledi sklada.
JITM027=JIT-u dodeljevanje pomnilnika ni uspelo
J9TI023=Pridobi raz\u0161irjene informacije okvirja za seznam niti.
J9RI010=jvmri->GetRasInfo ne more dodeliti pomnilnika.
J9TI039=Uni\u010Di imenovan predpomnilnik v skupni rabi.
JITM008=Preverjanje glave AOT ni uspelo. Del, ki preverja zdravje za\u010Detka oznake funkcije, je popa\u010Den. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI037=Pridobi skupen pomnilnik kopice.
JITM009=Preverjanje glave AOT ni uspelo. Del, ki preverja zdravje konca oznake funkcije, je popa\u010Den. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI038=Ponavlja prek predpomnilnikov v skupni rabi.
J9RI008=jvmri->GetRasInfo ne more dobiti komponent.
J9RI009=jvmri->GetRasInfo ne more dodeliti pomnilnika.
J9RI006=jvmri->GetRasInfo je klical z ni\u010Delno strukturo RasInfo.
J9RI007=jvmri->GetRasInfo ne more dodeliti pomnilnika.
JITM010=Neujemanje funkcij SMP. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
JITM013=Neujemanje funkcij onemogo\u010Danja pasti. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI031=Prekli\u010De asinhroni dogodek na posamezni niti ali na vseh nitih
J9RI004=jvmri->DynamicVerbosegc ni podprt.
JITM014=Neujemanje funkcij predhodnega pridobivanja TLH. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI032=Nakazuje, ali je bila nit obdelana v asinhronem dogodku
J9RI005=jvmri->GetComponentDataArea komponenta %s nima podro\u010Dja podatkov pod tem VM.
JITM011=Neujemanje funkcij stisnjenih sklicev. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9RI002=jvmri->DumpRegister je klical z ni\u010Delnim povratnim klicem, funkcija ni registrirana.
JITM012=Neujemanje funkcij DFP. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI030=Signalizira asinhroni dogodek na posamezni niti ali na vseh nitih
J9RI003=Ni mogo\u010De dodeliti agenta izpisa v jvmri->DumpRegister, funkcija ni registrirana.
JITM017=Neujemanje funkcij omogo\u010Denega SIMD. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI035=Cikel zbiranja odve\u010Dnih podatkov se je kon\u010Dal.
J9RI000=jvmri->CreateThread ne more dodeliti pomnilnika argumentov nitenja
JITM018=Neujemanje funkcij asinhrone kompilacije. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI036=Pridobi prosti pomnilnik trenutne kopice.
J9RI001=Notranja napaka pri odstranjevanju agenta izpisa v jvmri->DumpDeregister, funkciji morda ni preklicana registracija.
JITM015=Neujemanje funkcij trampolina metode. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI033=Ponastavi mo\u017Enosti izpisa pomnilnika NR.
JITM016=Neujemanje funkcij omogo\u010Denega HCR. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI034=Cikel zbiranja odve\u010Dnih podatkov se je za\u010Del.
J9VM017=Pomnilnika za polje mo\u017Enosti ukazne vrstice ni mogo\u010De dodeliti
J9VM018=Pomnilnika za podro\u010Dje nalagalne tabele knji\u017Enice v skupni rabi ni mogo\u010De dodeliti.
J9VM019=Nepopravljiva napaka\: ni mogo\u010De najti in uvodno nastaviti zahtevanega razreda %.*s
J9TI048=Dobi metapodatke sledenja, ki jih je z oblikovalnikom mogo\u010De uporabiti za obdelavo medpomnilnikov sledenja.
J9TI049=Vrne imena razreda, metode in paketa za nabor kazalk metode RAM
JITM002=Shranjevanje kode AOT v predpomnilnik razredov v skupni rabi ni uspelo. Predpomnilnik razredov v skupni rabi je morda pokvarjen. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9TI042=Samodejnim oznakam signalizira za novo dodeljeni objekt in njegove razrede.
JITM003=Inicializacija izvajalnega okolja AOT ni uspela. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9VM010=Inicializacija %s ni uspela
J9TI043=Nalaganje razreda signalizira samo za razrede matrik.
JITM000=Nepodprta strojna oprema [%d].
J9VM011=Ni mogo\u010De nalo\u017Eiti %1$s\: %2$s
J9TI040=Doda raz\u0161irjeno zmo\u017Enost can_autotag_objects.
JITM001=V predpomnilniku razreda v skupni rabi ni prostora za kodo AOT. Generirana bo nova koda AOT.
J9VM012=Ni mogo\u010De odstraniti %1$s\: %2$s
J9TI041=Signalizira preimenovani mo\u017Enosti (prestavljeni ali izbrisani) objekta (objektov).
JITM006=Koda AOT v predpomnilniku razreda v skupni rabi se ne more izvajati s trenutnim na\u010Delom za zbiranje odve\u010Dnih podatkov. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9VM013=V funkciji %1$s(%2$d)\: %3$s je pri\u0161lo do napake inicializacije
J9TI046=Prekli\u010De naro\u010Dnino na zunanje zapise sledenja
JITM007=Koda AOT v predpomnilniku razreda v skupni rabi se ne more izvajati s trenutnimi nastavitvami JVMPI ali JVMTI. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9VM014=V funkciji %1$s(%2$d)\: %3$s je pri\u0161lo do napake zaustavitve
J9TI047=Vsi zapisi sledenja v uporabi se odklopijo in so posredovani naro\u010Dnikom sledenja
JITM004=Koda AOT v predpomnilniku razreda v skupni rabi se ne more izvr\u0161iti na trenutnem procesorju. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9VM015=V knji\u017Enici %1$s(%2$d)\: %3$s je pri\u0161lo do napake inicializacije
J9TI044=Izbri\u0161e vse oznake objekta.
JITM005=Koda AOT v predpomnilniku razreda v skupni rabi se ne more izvajati v trenutni izdaji JVM. Prezrtje kode AOT v predpomnilniku razreda v skupni rabi.
J9VM016=V knji\u017Enici %1$s(%2$d)\: %3$s je pri\u0161lo do napake zaustavitve
J9TI045=Ustvari naro\u010Dnino na zunanje zapise sledenja
MECK001=Neprepoznana mo\u017Enost -Xcheck\:memory\: %s
J9VM006=Neveljavna mo\u017Enost ukazne vrstice\: %s
MECK000=Med inicializiranjem pripomo\u010Dka -Xcheck\:memory je pri\u0161lo do napake.
J9VM007=Neprepoznana mo\u017Enost ukazne vrstice\: %s
J9VM008=J9VMDllMain ni mogo\u010De najti
J9TI059=Pridobite koli\u010Dino izvirnega pomnilnika, ki ga uporablja JVM in ki je lo\u010Den po kategorijah pomnilnika.
MECK002=Med izdelovanjem podatkovne strukture klicnega spletnega mesta je pri\u0161lo do napake. Informacije klicnega spletnega mesta ne bodo prikazane.
J9VM009=J9VMDllMain ni uspel
J9TI050=Dobi razpr\u0161ilno kodo za nadzornika objekta.
J9TI053=Nastavi mo\u017Enosti dnevnika VM.
J9TI054=Zahteva izpis pomnilnika za Java Lock Monitor (JLM) z ozna\u010Devalcem oblike.
J9VM000=Nepravilno oblikovana vrednost za IBM_JAVA_OPTIONS
J9TI051=Po\u010Disti zastavico "na metodo" za selektivni izbor in obvestilo ob izhodu.
J9VM001=Nepravilno oblikovana vrednost za -Xservice
J9TI052=Izvede poizvedbo trenutnih mo\u017Enosti dnevnika VM.
J9VM002=Datoteke mo\u017Enosti ni mogo\u010De najti
J9TI057=Mo\u017Enosti izvirnega niza mo\u017Enosti dnevnika JVM ni mogo\u010De pretvoriti.
J9VM003=Prevajalnika JIT "%s" ni mogo\u010De najti. Uporabljen bo interpreter.
J9TI058=Mo\u017Enosti dnevnika JVM ni mogo\u010De nastaviti.
J9VM004=Ni mogo\u010De nalo\u017Eiti knji\u017Enice, ki jo zahteva\: %s
J9TI055=Medpomnilnika za mo\u017Enosti dnevnika JVM ni mogo\u010De dodeliti.
J9VM005=Neveljavna vrednost za spremenljivko okolja\: %s
J9TI056=Poizvedbe mo\u017Enosti dnevnika JVM ni mogo\u010De izvesti.
PORT033=Podprtega hipervizorja ni bilo mogo\u010De zaznati.
PORT032=Operacija, povezana s hipervizorjem, ni uspela.
PORT031=Pogoj LE %s%i, ki ustreza signalu POSIX, zagnanemu s strani programske opreme, je bil prejet
PORT030=Nastavitev %s "%s" podaja, da bo izpis jedra preto\u010Den v zunanji program.  Poskus preimenovanja jedra ali jedra.%d.\n
PORT037=Se ne izvaja na hipervizorju.
PORT036=Nepri\u010Dakovana povratna koda iz storitve CSRSI v sistemu z/OS
PORT035=__malloc31 ni uspel dodeliti medpomnilnika v sistemu z/OS
PORT034=Poskus priklju\u010Ditve pomnilnika v skupni rabi, ustvarjenega v klju\u010Du za za\u0161\u010Dito shrambe %lu, vendar se trenutno izvaja v klju\u010Du %lu.
PORT039=Posodobitev HYPFS ni uspela
PORT038=Nepravilno oblikovana vrednost za IBM_JAVA_HYPERVISOR_SETTINGS
PORT022=Pripenjanje .X&DS k uporabni\u0161ko podani predlogi izpisa pomnilnika za omogo\u010Danje izpisov pomnilnika v ve\u010D delih.
PORT021=Odprli ste zastaran semafor v skupni rabi za sistem System V\: datoteka\:%1$s semid\:%2$d
PORT020=Odprli ste zastaran pomnilnik v skupni rabi za sistem System V \: datoteka\:%1$s shmid\:%2$d
PORT026=Podana datoteka je imenik
PORT025=Neveljaven tip zaklepa za operacijo zaklepa datoteke. lockFlags\: %1$d
PORT024=IEATDUMP ni uspel, ker ni bilo mogo\u010De dodeliti podatkovne mno\u017Eice izpisa pomnilnika (preverite prostor na disku in dovoljenja polj).
PORT023=IEATDUMP ni uspel, ker je bila predloga izpisa pomnilnika, ki jo je podal uporabnik, predolga. Vnovi\u010Den poskus izpisa pomnilnika s privzeto predlogo.
PORT029=Neveljavna ro\u010Dka. ro\u010Dka datoteke\: %1$d.
PORT028=Operacija mmap ni uspela zaradi neveljavnih mo\u017Enosti preslikave.
PORT027=Operacija mmap ni uspela zaradi neveljavnega parametra za\u0161\u010Dite pomnilnika.
PORT011=Med poskusom nalaganja knji\u017Enice v skupni rabi ni bilo mogo\u010De dodeliti pomnilnika
PORT010=Dovoljenje za nalaganje knji\u017Enice v skupni rabi ni bilo odobreno
PORT015=Sklica na knji\u017Enico v skupni rabi ni mogo\u010De razre\u0161iti \u2013 mo\u017Eno je, da predpogojna knji\u017Enica v skupni rabi manjka
PORT014=Datoteke dll ni mogo\u010De nalo\u017Eiti, ker ni bila najdena
PORT013=Napaka pri nalaganju knji\u017Enice v skupni rabi \u2013 tabele dll ni mogo\u010De najti
PORT012=Napaka pri nalaganju knji\u017Enice v skupni rabi, ker je nastavljen bit PACE
PORT019=Imenika %s ni mogo\u010De izdelati.  Razredi v skupni rabi so onemogo\u010Deni, dokler ni imenik izdelan.
PORT018=Operacija ni uspela\: %1$d (%2$s ni uspel\: %3$d)
PORT017=Operacija ni uspela\: %d
PORT016=Notranja napaka %i
PORT000=
ZIPS000=Ni mogo\u010De odpreti %1$s (%2$s)
ZIPS001=Ni mogo\u010De odpreti %s (manjkajo\u010Di izvoz)
PORT009=Podana knji\u017Enica v skupni rabi ni bila najdena
PORT004=Napaka pri razre\u0161itvi simbola
PORT003=Odvisnega modula %s ni mogo\u010De nalo\u017Eiti
PORT002=Neznana napaka pri nalaganju knji\u017Enice v skupni rabi
PORT001=Med pisanjem v datoteko ni bilo mogo\u010De dodeliti pomnilnika.
PORT008=Modul nima pravilne arhitekture
J9RI022=Inicializacija JVMRI ne more dodeliti nadzornika izpisa pomnilnika jvmri
PORT007=Podan modul ni modul
J9RI023=jvmri->TraceRegister, jvmri->TraceDeregister in TraceListener niso ve\u010D podprti, uporabite nove razli\u010Dice v JVMRAS_VERSION_1_5
PORT006=Oblika modula ni pravilna
J9RI020=jvmri->CreateThread ne more dodeliti zasebnega nadzora
PORT005=Knji\u017Enice v skupni rabi ni mogo\u010De nalo\u017Eiti
J9RI021=jvmri->RunDumpRoutine ni podprt.
J9VM070=izvirni pomnilnik je bil iz\u010Drpan med vezavo izvirne metode %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM071=poskus rekurzivne vezave izvirne metode %2$.*1$s.%4$.*3$s%6$.*5$s
J9VM072=izvirni pomnilnik je iz\u010Drpan
J9VM073=Razred %2$.*1$s neveljavno dostopa do \u010Dlana %3$s razreda %5$.*4$s
J9VM074=Razred %2$.*1$s neveljavno dostopa do razreda %3$s %5$.*4$s
J9VM075=neveljavna operacija na niti eventron
J9VM076=izvirni pomnilnik je bil iz\u010Drpan med dodeljevanjem vnosa seznama za finaliziranja zmo\u017Een ali referen\u010Dni objekt
J9VM077=Opomba\: -Xdfpbd v tej izdaji Jave nima u\u010Dinka
J9VM078=Nepravilno oblikovana vrednost za JAVA_TOOL_OPTIONS
J9VM079=triggerOneOffDump(%1$s) zahteva %2$s
J9VM060=runNamedDump(%1$s) zahteva %2$s
J9VM061=insertDumpAgent zahteva %s
J9VM062=removeDumpAgent zahteva %s
J9VM063=seekDumpAgent zahteva %s
J9VM064=setDumpOption zahteva %s
J9VM065=Objekt ni primerek razreda, ki deklarira
J9VM066=Neujemanje tipa argumenta
J9VM067=-Xshareclasses ni omogo\u010Den, mo\u017Enost -Xzero\:sharezip je bila prezrta
J9VM068=-Xshareclasses ni omogo\u010Den, mo\u017Enost -Xzero\:sharestring je bila prezrta
J9VM069=kr\u0161itev omejitve nalaganja\: nalagalnik "%2$.*1$s@%3$x" je predhodno za\u010Del nalaganje za druga\u010Den tip z imenom "%5$.*4$s", ki ga definira nalagalnik "%7$.*6$s@%8$x"
SHRC500=Podro\u010Dje za razhro\u0161\u010Devanje je pokvarjeno, ker je nizki naslov za razpolo\u017Eljiv prostor %p ve\u010Dji od visokega naslova za razpolo\u017Eljiv prostor %p
SHRC505=Podro\u010Dje za razhro\u0161\u010Devanje je pokvarjeno, ker razlika med visokim naslovom razpolo\u017Eljivega prostora %p in nizkim naslovom razpolo\u017Eljivega prostora %p presega velikost podro\u010Dja razhro\u0161\u010Devanja, ki je %lu bajtov
SHRC506=Podro\u010Dje za razhro\u0161\u010Devanje je pokvarjeno, ker je njegova velikost, %lu, ve\u010Dja od skupne velikosti predpomnilnika, %u, shranjene v glavi predpomnilnika
J9VM090=Po\u010Dasen odziv na poizvedbo omre\u017Eja (%d sek), preverite nastavitve IP DNS
SHRC507=Med shranjevanjem in dodeljevanjem podatkov za razhro\u0161\u010Devanje razredov opravi dodatne preglede
J9VM091=Prilagodljivo vrtenje je podprto
SHRC508=Pridobljen je bil druga\u010Den semafor od tistega, ki je bil predhodno uporabljen s tem predpomnilnikom. stari id semaforja\=%d, novi id semaforja\=%d
J9VM092=Prilagodljivo vrtenje ni podprto
SHRC501=Podro\u010Dje za razhro\u0161\u010Devanje je pokvarjeno, ker je nizki naslov za 'podatke tabele \u0161tevila vrstic' %p ve\u010Dji od visokega naslova za 'podatke tabele \u0161tevila vrstic' %p
J9VM093=Ta razli\u010Dica Jave zahteva CPE, ki podpira SSE2 ali novej\u0161e pripone.  Za ve\u010D podrobnosti si oglejte informacije o podprtih okoljih, ki se nahajajo v IBM-ovem vodi\u010Du za uporabnika Jave.
SHRC502=Podro\u010Dje za razhro\u0161\u010Devanje je pokvarjeno, ker je nizki naslov za 'podatke tabele lokalnih spremenljivk' %p ve\u010Dji od visokega naslova za 'podatke tabele lokalnih spremenljivk' %p
J9VM094=Nit "%s" je po izvedbi zaustavitvenih trnkov \u0161e vedno v izvajanju.
SHRC503=Podro\u010Dje za razhro\u0161\u010Devanje je pokvarjeno, ker bo shranjevanje 'tabele \u0161tevila vrstice' %d bajtov in 'tabele lokalnih spremenljivk' %d bajtov povzro\u010Dilo visoki naslov za 'podatke tabele \u0161tevila vrstice' %p, ki bo ve\u010Dji od novega nizkega naslova 'podatkov tabele lokalnih spremenljivk' %p
J9VM095=kr\u0161itev omejitve nalaganja pri razre\u0161evanju metode "%2$.*1$s.%4$.*3$s%6$.*5$s" \: nalagalnik "%8$.*7$s@%9$x" razreda "%11$.*10$s" in nalagalnik "%13$.*12$s@%14$x" razreda "%16$.*15$s" imata za podpis metode razli\u010Dna tipa
SHRC504=Podatki predpomnilnika so ni\u010Delni. za\u010Detek podatkov\: %p
J9VM096=-Xscdmx se prezre, \u010De -Xshareclasses ni podan
J9VM097=\nUporaba\:\n
J9VM098=-Xsyslog\:help              Natisne pomo\u010D JVM -Xsyslog.
J9VM099=-Xsyslog\:none              Onemogo\u010Di predhodno podane mo\u017Enosti dnevnika JVM, vklju\u010Dno s privzetki.
SHRC509=Ustvari predpomnilnik, ki je od trenutne generacije starej\u0161i za eno generacijo.
PORT040=Branje HYPFS ni uspelo
PORT044=Dodelitev pomnilnika med pridobivanjem informacij hipervizorja ni uspela.
PORT043=%1$d\: pridobivanje informacij %2$s ni uspelo.
PORT042=Ni mogo\u010De brati /proc/sysinfo
PORT041=HYPFS trenutno ni razpolo\u017Eljiv
J9VM080=queryVmDump zahteva %s
J9VM081=Nepravilno oblikovana vrednost mo\u017Enosti, mo\u017Enost "%1$s%3$.*2$s" vsebuje zaklju\u010Dne znake "%4$s", ki so bili prezrti
J9VM082=Ni bilo mogo\u010De preklopiti na procesor IFA \u2013 te\u017Eava "extattr +a lib%s.so"
J9VM083=Napaka pri preklapljanju na rc procesorja IFA\: %08x
J9VM084=Napaka IFA\: nepri\u010Dakovana povratna koda %08x iz storitve preklopa IFA
J9VM085=Nepravilno oblikovana mo\u017Enost\: '%s'
PORT048=Izpisa pomnilnika sistema ni bilo mogo\u010De ustvariti, ker obstaja neobi\u010Dajna datoteka "%s" z enakim imenom kot pri\u010Dakovana datoteka izpisa pomnilnika sistema
J9VM086=Prevelika mo\u017Enost\: '%s'
PORT047=Pri nalaganju knji\u017Enice v skupni rabi ni dovolj prostora v medpomnilniku
J9VM087=resetDumpOption zahteva %s
PORT046=Izvr\u0161ilne datoteke ni bilo mogo\u010De odpreti
J9VM088=Opozorilo\: syscorepath ni bil konfiguriran, kar lahko prepre\u010Di izdelavo datoteke sistemskega jedra (\u010De je potrebna).\n\t\tZa ustrezne konfiguracijske nastavitve syscorepath si oglejte navodila za namestitev izdelka WebSphere Real Time.\n\t\tOPOMBA\: syscorepath je treba konfigurirati po vsakem vnovi\u010Dnem zagonu ra\u010Dunalnika.
PORT045=Dodelitev pomnilnika med pridobivanjem informacij o sistemu ni uspela.
J9VM089=Opozorilo\: s sysconfig ni bili mogo\u010De preveriti nastavitev syscorepath\: %s.
SHRC400=Bajti predpomnilnika Zip                      %*c\= %d
SHRC401=\# predpomnilnikov Zip                         %*c\= %d
SHRC406=za\u010Detni naslov metapodatkov               %*c\= 0x%p
SHRC407=zastavice izvajalnega okolja                       %*.c\= 0x%.16llX
SHRC408=izdelava predpomnilnika                    %*.c\= %d\n
SHRC409=bajti kode AOT                       %*c\= %d
SHRC402=podatkovni bajti JIT                       %*c\= %d
SHRC403=Uporabljeni bajti podro\u010Dja za razhro\u0161\u010Devanje razredov          %*c\= %u
SHRC404=Pridobitev imenika za predpomnilnik ni uspela
SHRC405=Izdelava imenika za predpomnilnik ni uspela
SHRC420=\# vnosov podatkov AOT                  %*c\= %d
SHRC421=\# hierarhij razreda AOT                %*c\= %d
SHRC422=\# prevednih podprogramov AOT                         %*c\= %d
SHRC423=\# namigov JIT                         %*c\= %d
SHRC428=Starej\u0161a generacija predpomnilnika razreda v skupni rabi "%s" je bila odstranjena
SHRC429=Starej\u0161e generacije predpomnilnika razreda v skupni rabi "%s" ni bilo mogo\u010De odstraniti
SHRC424=\# profilov JIT                       %*c\= %d
SHRC425=\# objektov Java                       %*c\= %d
SHRC426=\# vnosov JCL                        %*c\= %d
SHRC427=Modifikator, uporabljen za tiskanje podrobnih statisti\u010Dnih podatkov o predpomnilniku
SHRC410=podatkovni bajti AOT                       %*c\= %d
SHRC411=bajti hierarhije razreda AOT            %*c\= %d
SHRC412=bajti prevednih podprogramov AOT                      %*c\= %d
SHRC417=podatkovni bajti JCL                       %*c\= %d
SHRC418=podatkovni bajti bajtov                       %*c\= %d
SHRC419=bajti razreda LocalVariableTable      %*c\= %u
SHRC413=bajti namigov JIT                       %*c\= %d
SHRC414=bajti profilov JIT                    %*c\= %d
SHRC415=bajti objektov Java                    %*c\= %d
SHRC416=bajti ReadWrite                      %*c\= %d
SHRC442=Predpomnilnik v skupni rabi "%s" je okvarjen. Koda okvare je %d. Po\u0161kodovana vrednost je 0x%p. Novi JVM-ji ne bodo dovoljeni za povezavo s predpomnilnikom.\n \tObstoje\u010Di JVM-ji lahko \u0161e vedno delujejo, vendar ne morejo posodabljati predpomnilnika.
SHRC443=CRC predpomnilnika je nepravilen, kar nakazuje okvaro predpomnilnika. Nepravilen CRC predpomnilnika\: 0x%x.
SHRC444=Prebrani okvarjeni podatki za glavo 0x%p vnosa v predpomnilniku (neveljavna dol\u017Eina postavke)
SHRC445=Velikost predpomnilnika je premajhna, da bi bila uporabna. Neveljavna velikost predpomnilnika\: 0x%x.
SHRC440=Vrednost -XscminJIT presega vrednost -Xscmx, zato je bila nastavljena tako, da je enaka vrednosti -Xscmx
SHRC441=Vrednost -XscmaxJIT presega vrednost -Xscmx, zato je bila nastavljena na neomejeno vrednost
SHRC446=Pridobivanje klju\u010Davnice za zaklepanje glave pisanja med zagonom predpomnilnika ni uspelo s kodo napake\: %d.
SHRC447=Prepoznano zaporedje bajtov v glavi predpomnilnika ni veljavno. Naslov niza prepoznanega zaporedja bajtov v glavi predpomnilnika\: 0x%p.
SHRC448=Polje velikosti predpomnilnika v glavi predpomnilnika ni veljavno. Velikost predpomnilnika v glavi predpomnilnika je\: 0x%x.
SHRC449=Polnjenje ni ni\u010D. Polnjenje bajtov v glavi predpomnilnika je\: %u.
SHRC431=%1$d\: 0x%2$p JITPROFILE\: %4$.*3$s
SHRC432=\ Podpis\: %2$.*1$s Naslov\: 0x%3$p
SHRC433=\tza ROMClass %2$.*1$s na 0x%3$p.
SHRC434=Value\=%d, ki jo je posredovala mo\u017Enost -Xitsn, je zunaj obsega vrednosti pra\u0161tevil, ki ga podpira VM. Podprt obseg \= 0 \u2013 %u
SHRC430=Trenutne generacije predpomnilnika razreda v skupni rabi "%s" ni bilo mogo\u010De odstraniti
SHRC439=Vrednost za -XscminJIT ne sme presegati vrednosti -XscmaxJIT
SHRC435=-Xitsn%2$u uporablja %1$u bajtov pomnilnika, kar je ve\u010Dje kot velikost pomnilnika razredov v skupni rabi, ki je %3$u bajtov
SHRC436=Napaka pri pridobivanju klju\u010Davnice za zaklepanje glave datoteke predpomnilnika razredov v skupni rabi.
SHRC437=Napaka pri spro\u0161\u010Danju bralne klju\u010Davnice glave datoteke predpomnilnika razredov v skupni rabi.
SHRC438=Onemogo\u010Di shranjevanje podatkov JIT v predpomnilniku v skupni rabi
JNCK101=Napaka JNI v %1$s\: argument \#%2$d bi moral biti stati\u010Den, vendar je v JNI posredovan ID nestati\u010Dnega polja
JNCK102=Napaka JNI v %1$s\: argument \#%2$d bi moral biti nestati\u010Den, vendar je v JNI posredovan ID stati\u010Dnega polja
JNCK100=Nasvet JNI v %1$s\: te funkcije ni mogo\u010De uporabiti z objekti v paketu. Namesto tega uporabite %2$s
SHRC464=Omogo\u010Di izhodne podatke JIT z razlago
SHRC465=[omogo\u010Deni izhodni podatki z razlago podatke JIT -Xshareclasses]
SHRC466=Najdenih je bilo %1$s pripetih podatkov za %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC467=Iskanje %1$s pripetih podatkov za %8$.*7$s.%4$.*3$s.%6$.*5$s ni uspelo, razlog\:%2$s
SHRC460=Onemogo\u010Di shranjevanje podatkov JIT v predpomnilniku v skupni rabi
SHRC461=Vrednost -Xscminjitdata ne sme presegati vrednosti -Xscmaxjitdata
SHRC462=Vrednost -Xscminjitdata presega vrednost -Xscmx, zato je bila nastavljena tako, da je enaka vrednosti -Xscmx.
SHRC463=Vrednost -Xscmaxjitdata presega vrednost -Xscmx, zato je bila nastavljena na neomejeno vrednost.
SHRC468=Shranjenih je bilo %1$s pripetih podatkov za %7$.*6$s.%3$.*2$s%5$.*4$s
SHRC469=Shranjevanje 1$s pripetih podatkov za %8$.*7$s.%4$.*3$s%6$.*5$s ni uspelo, razlog\:%2$s
J9GC084=Razre\u0161itev \u010Dasa operacijskega sistema trdi, da ne podpira zahtevanega ciljnega \u010Dasa premora.  Preglasitev zaradi mo\u017Enosti ukazne vrstice -Xgc\:overrideHiresTimerCheck
J9GC083=Inicializacija ni uspela, mo\u017Enost ve\u010D imetnikov podpira samo -Xgcpolicy\:balanced
J9GC086=Izdelava primerka stisnjenih metapodatkov za sklice ni bila uspe\u0161na; zahtevano je %1$zu%2$s
J9GC085=stisnjena za\u010Detna velikost metapodatkov referenc
J9GC088=Zahtevane velikosti strani kopice objektov %1$zu%2$s ni mogo\u010De zadovoljiti; namesto tega se uporablja %3$zu%4$s
J9GC087=Velikosti kopice %1$zu%2$s ni mogo\u010De zadovoljiti z velikostjo strani %3$zu%4$s. Velikost kopice je mogo\u010De dolo\u010Diti z -Xmx
J9GC089=Mo\u017Enost -Xgc\:preferredHeapBase ni podprta na operacijskem sistemu z/OS.
SHRC453=Navede vse elemente v predpomnilniku, vklju\u010Dno z osamelimi razredi
SHRC454=Onemogo\u010Di preverjanje, \u010De je trenutni id semaforja SysV enak kot predpomnjen id semaforja SysV
SHRC455=Uveljavi preverjanje nizovne table ob zagonu
SHRC456=Uveljavi odkrivanje spremembe na id-ju gradnje VM
SHRC450=Polje dol\u017Eine podatkov v glavi predpomnilnika ni veljavno. Dol\u017Eina podatkov v glavi predpomnilnika je\: %u.
SHRC451=Polje za\u010Detka podatkov v glavi predpomnilnika ni veljavno. Naslov za\u010Detka podatkov v glavi predpomnilnika je\: 0x%p.
SHRC452=Onemogo\u010Di za\u0161\u010Dito pomnilnika podro\u010Dja za branje/pisanje (nizovna tabela)
SHRC457=Neveljavno ime predpomnilnika, ime predpomnilnika "%.*s" vsebuje samo presledke ali pa je prazno
SHRC458=Onemogo\u010Di skupno rabo razredov brez omogo\u010Danja API-jev pripomo\u010Dkov
SHRC459=Onemogo\u010Di skupno rabo in API-je pripomo\u010Dkov
SHRC480=preve\u010D posodobitev med branjem
SHRC481=predpomnilnik je pokvarjen
J9GC071=Vrednost za '%s' ni pravilna
J9GC070=Zbiralnika odve\u010Dnih podatkov ni bilo mogo\u010De zagnati
SHRC002=v uporabi
SHRC486=Rezerviran prostor za podatkovne bajte JIT        %*c\= %d
SHRC003=\u010Das zadnje prekinitve
SHRC487=Najve\u010Dji prostor za podatkovne bajte JIT        %*c\= %d
SHRC004=Ni mogo\u010De uni\u010Diti predpomnilnika "%s"
SHRC488=Skupna vrednost -Xscminaot in -Xscminjitdata ne sme presegati razpolo\u017Eljive velikosti predpomnilnika
SHRC005=Na voljo ni nobenih predpomnilnikov razredov v skupni rabi
SHRC489=\u010Ce je odprt predpomnilnik ozna\u010Den kot pokvarjen, spro\u017Ei dogodek izpisa pomnilnika
SHRC482=naslov ni v predpomnilniku
SHRC483=osve\u017Eitev predpomnilnika ni uspela
SHRC000=Predpomnilnik v skupni rabi
SHRC484=Rezerviran prostor za bajte AOT        %*c\= %d
SHRC001=OS shmid
SHRC485=Najve\u010Dji prostor za bajte AOT        %*c\= %d
J9GC069=Inicializacija dokon\u010Danja niti ni uspela
SHRC006=\u0160tevilo predpomnilnikov, ki so potekli v zadnjih %1$d minutah je %2$d
SHRC007=Ni bilo mogo\u010De odstraniti predpomnilnika razreda v skupni rabi "%s"
SHRC008=Izdelan je bil predpomnilnik v skupni rabi\: velikost %1$s\: %2$d bajtov.
SHRC009=Odprt je bil predpomnilnik v skupni rabi\: velikost %1$s\: %2$d bajtov.
J9GC062=Vrednost %s mora biti druga potenca
J9GC061=najve\u010Dja velikost pomnilni\u0161kega prostora z dolo\u010Denim dosegom
J9GC064=Dodeljevanje starega prostora ni uspelo
J9GC063=Datoteke '%s' ni mogo\u010De odpreti za pisanje
J9GC066=Zahtevane geometrije razdeljenega pomnilnika kopice ni bilo mogo\u010De dodeliti
J9GC065=Dodeljevanje novega prostora ni uspelo
J9GC068=ScopedMemory.join/joinAndEnter je bil prekinjen
J9GC067=Primerka razdeljene kopice ni bilo mogo\u010De izdelati\: %1$s (nova velikost %2$zu%3$s, stara velikost %4$zu%5$s)
SHRC470=Posodobljenih je bilo %1$s pripetih podatkov za %7$.*6$s.%3$.*2$s%5$.*4$s
J9GC080=Sistemska konfiguracija ne podpira parametra '%.*s' v mo\u017Enosti '-Xlp'
J9GC082=Zahtevano za %1$s velikost strani %2$zu%3$s%4$s ni podprta velikost strani; namesto tega bo uporabljeno %5$zu%6$s%7$s
J9GC081=V mo\u017Enosti '-Xlp' so odkrite dodatne vejice \u2013 prezrto
SHRC475=nobeni podatki ne obstajajo
SHRC476=podatki \u017Ee obstajajo
SHRC477=v predpomnilniku ni prostora za %d bajtov
SHRC478=velikost podatkov %d je ve\u010Dja od razpolo\u017Eljive %d
SHRC471=Posodobitev %1$s pripetih podatkov za %8$.*7$s.%4$.*3$s.%6$.*5$s ni uspelo, razlog\: %2$s
SHRC472=ni dostopa no vira
SHRC473=enterWriteMutex ni uspel
SHRC474=enterReadMutex ni uspel
SHRC479=dodelitev pomnilnika velikosti %d bajtov ni uspela
J9GC073=Velika velikost strani %1$zu%2$s %3$s ni podprta velikost strani; namesto tega bo uporabljeno %4$zu%5$s
J9GC072=Velika velikost strani %1$zu%2$s ni podprta velikost strani; namesto tega bo uporabljeno %3$zu%4$s %5$s
J9GC075=Pri raz\u010Dlenjevanju mo\u017Enosti '-Xlp' je pri\u0161lo do napake
J9GC074=Velika velikost strani %1$zu%2$s %3$s ni podprta velikost strani; namesto tega bo uporabljeno %4$zu%5$s %6$s
J9GC077=Sistemska konfiguracija ne podpira zahtevane velike velikosti strani %1$zu%2$s %3$s
J9GC076=Sistemska konfiguracija ne podpira zahtevane velike velikosti strani %1$zu%2$s
J9GC079=Mo\u017Enost '%1$s' ni popolna, podajte parameter '%2$s'.
J9GC078='%1$s' ni podan kot prvi parameter v mo\u017Enosti '%2$s'
SHRC024=napaka prekinitve pomnilnika v skupni rabi
SHRC025=napaka pripenjanja pomnilnika v skupni rabi
SHRC026=Predpomnilnika zahtevane velikosti ni mogo\u010De izdelati\: Preverite nastavitve SHMMAX in SHMMIN
SHRC027=Ime predpomnilnika v skupni rabi je predolgo
SHRC020=Med odpiranjem semaforja je pri\u0161lo do napake
SHRC021=Vrnjena je neznana koda napake
SHRC022=Napaka pri ustvarjanju podro\u010Dja pomnilnika v skupni rabi
SHRC023=Predpomnilnik ne obstaja
J9GC048=prirastek starega prostora
J9GC047=najve\u010Dja velikost starega prostora
J9GC049=zapomnjena velikost niza
SHRC028=Dovoljenje zavrnjeno
SHRC029=V sistemu ni dovolj pomnilnika
J9GC040=Neznana mo\u017Enost\: %s
J9GC042=Vsota %1$s in %2$s je premajhna za %3$s
J9GC041=Neznan tip fvtest\: %s
J9GC044=najve\u010Dja velikost novega prostora
J9GC043=za\u010Detna velikost novega prostora
J9GC046=za\u010Detna velikost starega prostora
J9GC045=za\u010Detna velikost pomnilnika
SHRC490=Uveljavi odkrivanje pokvarjenega predpomnilnika razredov v skupni rabi
SHRC491=Shranjevanje %1$s pripetih podatkov za %8$.*7$s.%4$.*3$s%6$.*5$s ni uspelo, razlog\: %2$s
SHRC492=Posodobitev %1$s pripetih podatkov za %8$.*7$s.%4$.*3$s.%6$.*5$s ni uspelo, razlog\: %2$s
J9GC060=velikost prostora trajnega pomnilnika
SHRC013=Odstranitev pomnilnika za predpomnilnik v skupni rabi "%s" ni uspela
SHRC497=Placeholder, not used
SHRC014=Odstranitev semaforja za predpomnilnik v skupni rabi "%s" ni uspela
SHRC498=Placeholder, not used
SHRC015=Napaka predpomnilnika razreda v skupni rabi\: Neveljaven znak
SHRC499=Placeholder, not used
SHRC016=Napaka predpomnilnika razreda v skupni rabi\:
SHRC493=Iskanje %1$s pripetih podatkov za %8$.*7$s.%4$.*3$s%6$.*5$s ni uspelo, razlog\: %2$s
SHRC010=Predpomnilnik v skupni rabi "%s" je uni\u010Den.
SHRC494=%1$s priklju\u010Denih podatkov za naslov 0x%2$p ni bilo mogo\u010De najti, vzrok\: %3$s
SHRC011=Napaka\: Predpomnilnika razreda v skupni rabi ni mogo\u010De odpreti
SHRC495=%1$s priklju\u010Denih podatkov za naslov 0x%2$p ni bilo mogo\u010De shraniti, vzrok\: %3$s
SHRC012=Ni mogo\u010De odstraniti predpomnilnika v skupni rabi "%s", ker obstajajo JVM-ji, ki so \u0161e vedno priklju\u010Deni na predpomnilnik
SHRC496=%1$s priklju\u010Denih podatkov za naslov 0x%2$p ni bilo mogo\u010De posodobiti, vzrok\: %3$s
J9GC059=-Xgcpolicy\:metronome ni dovoljeno brez -Xrealtime
J9GC058=Dodelitev trajnega pomnilni\u0161kega prostora ni uspela
SHRC017=Koda napake\: %d
SHRC018=pomnilnika ni mogo\u010De dodeliti
SHRC019=zahtevana dol\u017Eina je prekratka
J9GC051=prirastek segmentov razreda RAM
J9GC050=mehki maksimum pomnilnika
J9GC053=maksimum pomnilnika
J9GC052=prirastek segmentov razreda ROM
J9GC055=velika velikost strani
J9GC054=Velika velikost strani %1$zu%2$s ni podprta velikost strani; namesto tega bo uporabljeno %3$zu%4$s
J9GC057=%1$s ne sme biti ve\u010Dji kot %2$s.
J9GC056=Razpolo\u017Eljive velike velikosti strani\:
SHRC040=Navedi ime predpomnilnika v skupni rabi
SHRC041=Uni\u010Di predpomnilnik v skupni rabi (uporabi parameter imena ali privzeto vrednost)
SHRC046=Prika\u017Ee vse predpomnilnike v skupni rabi in njihove statistike
SHRC047=Izpi\u0161e povzetek statisti\u010Dnih podatkov o predpomnilniku
SHRC048=Navede vse elemente v predpomnilniku
SHRC049=Na\u010Din odpravljanja napak, ki preverja vse prihajajo\u010De kode bajtov
SHRC042=Uni\u010Di vse predpomnilnike v skupni rabi
SHRC043=Omogo\u010Di skupno rabo spremenjene kode bajtov\n \t<modContext> je uporabni\u0161ko-deskriptorni tip opisa spremembe\n \tJVMs z uporabo istega <modContext> mora uporabiti iste spremembe
SHRC044=OPTION_MODIFIED_EQUALS"<modContext>"
SHRC045=Uni\u010Di predpomnilnike, ki so neuporabljeni <t> minut
J9GC026=-Xverbosegclog ni uspel dodeliti notranjih struktur
J9GC025=Vsota %1$s in %2$s
J9GC028=Prevelika mo\u017Enost\: '%s'
J9GC027=Nepravilno oblikovana mo\u017Enost\: '%s'
J9GC029=Napaka mo\u017Enosti\: '%s'
J9GC020=%s preveliko za kopico
J9GC022=Vsota %1$s in %2$s je prevelika za %3$s
J9GC021=%1$s mora biti enako %2$s
J9GC024=Vsota %1$s in %2$s je prevelika za kopico
J9GC023=Vsota %1$s in %2$s mora biti enaka %3$s
SHRC030=Predpomnilnik razredov v skupni rabi, ki ga priklju\u010Dujete, ima neveljavno glavo.
SHRC035=Lokalno predpomnjenje razrednih poti je onemogo\u010Deno.
SHRC036=Zmanj\u0161evanje spora trenutne shrambe je onemogo\u010Deno.
SHRC037=Prirastne posodobitve so onemogo\u010Dene.
SHRC038=Uporaba\:\n\njava -Xshareclasses[\:option,...]\n\n Veljavne prilo\u017Eene mo\u017Enosti (s kratkim povzetkom) so\:\n\n
SHRC031=Predpomnilnik razredov v skupni rabi, ki ga pripenjate, ima nezdru\u017Eljivo razli\u010Dico JVM.
SHRC032=Predpomnilnik razredov v skupni rabi, ki ga pripenjate, ima napa\u010Dno raven spreminjanja.
SHRC033=Zaklepanje lokalnih razpr\u0161ilnih tabel je onemogo\u010Deno.
SHRC034=Preverjanje \u010Dasovnega \u017Eiga je onemogo\u010Deno.
J9GC037=%1$s ni podprt z vrednostmi, ki niso %2$zu
J9GC036=vrednost %1$s mora biti nad %2$zu
J9GC039=%1$s je opu\u0161\u010Dena, namesto tega uporabite %2$s
J9GC038=vrednost %s je prevelika
SHRC039=Natisne pomo\u010D splo\u0161ne skupne rabe
J9GC031=%1$s in %2$s ne moreta biti dolo\u010Deni hkrati
J9GC030=Vrednost %1$s za %2$.2f mora biti najmanj %3$s manj\u0161a kot vrednost %4$s za %5$.2f
J9GC033=Vrednost %1$s mora biti med %2$.2f in %3$.2f (vklju\u010Dno)
J9GC032=Sistemska konfiguracija ne podpira mo\u017Enosti '%s'
J9GC035=%s mora slediti \u0161tevilo
J9GC034=Vrednost %1$s mora biti med %2$zu in %3$zu (vklju\u010Dno)
SHRC060=Pomnilnika za nizovni medpomnilnik v shrinit\:\:hookFindSharedClass ni mogo\u010De dodeliti.
SHRC061=Ime predpomnilnika ne sme biti dalj\u0161e od 64 znakov. Predpomnilnik ni izdelan.
SHRC062=Napaka pri kopiranju uporabni\u0161kega imena v privzeto ime predpomnilnika
SHRC063=Pomnilnika za sharedClassConfig v shrinit ni mogo\u010De dodeliti.
SHRC068=Lokalno predpomnjenje razrednih poti je onemogo\u010Deno.
SHRC069=Zmanj\u0161evanje spora trenutne shrambe je onemogo\u010Deno.
SHRC064=Izdelava configMonitor v shrinit ni uspela.
SHRC065=Podro\u010Dja v shrinit ni mogo\u010De dodeliti.
SHRC066=Zaklepanje lokalnih razpr\u0161ilnih tabel je onemogo\u010Deno.
SHRC067=Preverjanje \u010Dasovnega \u017Eiga je onemogo\u010Deno.
J9GC004=Globalnega zbiralnika odve\u010Dnih podatkov ni bilo mogo\u010De izdelati
J9GC003=Odpremnika nalog ni bilo mogo\u010De izdelati
J9GC006=Inicializacija ni uspela, zmanjkalo je pomnilnika
J9GC005=Inicializacija ni uspela
J9GC008=Inicializacija pripon modula ni uspela
J9GC007=Inicializacija ni uspela, ukazne vrstice ni bilo mogo\u010De raz\u010Dleniti
J9GC009=Inicializacija predmeta mutex za statistike GC ni uspela
J9GC000=Notranja napaka, zmanjkalo je pomnilnika
J9GC002=Primerka kopice ni bilo mogo\u010De izdelati. Zahtevan %1$zu%2$s
J9GC001=Primerka kopice ni bilo mogo\u010De izdelati
SHRC050=Omogo\u010Di izpis z razlago
SHRC051=Izklopi dinami\u010Dne posodobitve
SHRC052=Onemogo\u010Di predpomnjenje lokalnih razrednih poti
SHRC057=Napa\u010Dni parametri za mo\u017Enost poteka
SHRC058=Pomnilnika za ClasspathItem v shrinit\:\:hookStoreSharedClass ni mogo\u010De dodeliti.
SHRC059=Pomnilnika za ClasspathItem v shrinit\:\:hookFindSharedClass ni mogo\u010De dodeliti.
SHRC053=Onemogo\u010Di zaklepanje lokalnih razpr\u0161itvenih tabel
SHRC054=Onemogo\u010Di algoritem za zmanj\u0161anje sporov shrambe
SHRC055=Onemogo\u010Di prirastne posodobitve predpomnilnika
SHRC056=Neprepoznana mo\u017Enost ukazne vrstice "%s".
J9GC015=Dodelitev privzetega pomnilni\u0161kega prostora ni uspela
J9GC014=Dodelitev odsekov pomnilni\u0161kega razreda VM ni uspela
J9GC017=%1$s premajhno, biti mora najmanj %2$zu %3$s bajtov
J9GC016=Dodelitev pre\u017Eivelega odseka v privzeti pomnilni\u0161ki prostor ni uspela
J9GC019=%1$s preveliko za %2$s
J9GC018=%1$s premajhno za %2$s
J9GC011=Inicializacija podro\u010Dja pomnilni\u0161kih prostorov ni uspela
J9GC010=Inicializacija upravljanja finalizacije ni uspela
J9GC013=Dodelitev predmetnih pomnilni\u0161kih odsekov VM ni uspela
J9GC012=Dodelitev pomnilni\u0161kih odsekov VM ni uspela
